{
    "posts": [
        {
            "category": "HOT",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 13093,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c309/live/60583a00-fec2-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                ">Marco Rubio is asked if they are accepting any good-will gestures from Russia or if there is a deadline.\n\n\n>Rubio says \"Ukraine is ready to stop shooting and start talking.\"\n\n\n>He reiterates that he hopes Russia will say yes to the ceasefire, but if they say no \"then we'll unfortunately know what the impediment is to peace here\".\n\n\nIf you didn't already know that the impediment to peace is the guy who started the invasion............",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "Now that intelligence from Ukraine goes straight to Russia during trump’s daily kneel and swallow Putin meetings.",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I feel like Trump is running this country like a 13 yr old. He hates you today and likes you the next. Nobody signed up for this shitty roller coaster ride.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "I would not be trusting any US intel if I was Ukraine ",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "You know what would be nice. If he didint waste eastern european lives for some petty politics.  This guy America elected is just a damn scumbag that needs to be gone asap. He wont stop with seeing as foreigners as currency. Sooner or later he will sacrifice democrats to feel good about himself."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Trump has instructed to raise Canadian tariffs on aluminum and steel to 50%",
            "external_url": "https://www.theguardian.com/us-news/live/2025/mar/11/donald-trump-latest-us-politics-news-live?CMP=share_btn_url&page=with%3Ablock-67d042cb8f087aea3a248e0d#block-67d042cb8f087aea3a248e0d",
            "upvotes": 33433,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b232c427105b597c81b293a786f41bedfdb240c8/0_366_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=ad0556ad29952b884781265f9df84cd9",
            "top_comments": [
                "Sounds like it gonna be another great day on the Stock Market!!!",
                "I like how he keeps bringing up the dairy one. Negotiated BY HIM, and it only kicks in at a level that has NEVER been met. Those tariffs have never been charged.",
                "\"Trump said he would “permanently shut down the automobile manufacturing business in Canada” if the country did not end unspecified tariffs it had placed on US goods:\"\n\nEverything in thr market could be appeased if this moron backs down. \n\nAnd yet, he continues to double down on tariffs. \n\nThis is madness",
                "Apparently Trump wanted more chaos and uncertainty today. He and his administration have been trying to do at least one ill intentioned thing per day so far.",
                "It's wild. We were so scared of the first set of tariffs, now I'm just like \"I'm tired boss\" and keep scrolling. Honestly his inability to take a measured approach to anything makes me think it'll sputter out quickly, he'll claim victory and forget tariffs are a thing by summer. Wishful thinking, I know.",
                "“He would see the entire world burn just to be the king of ashes”",
                "Last time he did this, during Trump 1.0, aluminum plants in Kentucky closed, leading to higher unemployment. That county was devastated. Congratulations, Trump, and Trump voters!!!",
                "Maybe instead of tariffs, we could properly tax billionaires 🤷🏻‍♂️",
                "My MAGA buddy who owns a metal building construction business is about to find out",
                "Trump recession is self inflicted. Trump must be rejected."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Fear of flying is pushing ticket sales down in the wake of multiple crashes, airlines say",
            "external_url": "https://www.cnn.com/2025/03/11/business/passengers-air-travel-crashes-fear/index.html",
            "upvotes": 5694,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199796404.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Let's offset this by charging for luggage.\n\n \\- Southwest Airlines",
                "Misleading headlines it's not so much \"fear of flying\" as it is \"safety concerns after whistleblowers and deregulation and several accidents\"",
                " Without proper oversight, it is not the Fear of flying but the fear of crashing. Why would people travel with all the fear and uncertainty in the Russian Vassal State of the USA.",
                "Elon Musk only flies on Air Force 1 lately.  Must be a sign.",
                "Yup, I canceled a flight this month after my brother's girlfriend almost died in that recent near miss where Southwest pilot pulled up just in time to avoid a taxiing idiot. Not gonna be a statistic for these assholes.",
                "With the government cutting a large amount of the people who service the air traffic equipment and knowing the fact that they were already pretty thin in that area, I'm probably not going to fly for a long while myself.",
                "make trains great again :) i seriously wish USA would build a massive highspeed rail system",
                "It seems completely rational with the dangerous cuts to the FAA.",
                "I think it's more people not traveling because of economic reasons...",
                "fear of flying, cost of flying, getting disease while flying (measles in Washington Dulles airport now)\n\nI can either drive 15 hrs to a destination or fly (2.5hrs, ~900$)... hmmmmm..... Yes I know that statistically flying is safer.  But, I know I won't get a contagious disease alone in my car too, and I can sanitize my hands after the gaspump."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 6907,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "Well that's enough reddit for today. ",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "How do all these sick fucks manage to find and enable each other? Death feels like too easy of a punishment for these degenerates.",
                "this is making me so distraught. like holy fuck i am heartbroken and angered for the victims. they’re just children, and their “fathers”, that are supposed to support and protect them, took so much away from them for the “fathers’” own benefits.",
                "I lived in Japan over a decade and I tell people it's awesome, unless you're a girl / woman / female. Then I get down voted. \n\nI'm a guy who heard from every female friend that they've been groped on trains, including foreign friends who have barely been living there. \n\nKind of like TV shows have that cliche episode every year, having a coworker come into work crying from being groped became normal with every new coworker. \n\n\nThis is evil as fuck, and it's just a bit of the iceburg tip surfacing. ",
                "\"Seven men arrested in Japan for raping daughters, sharing footage in chat group\nThe seven were in the same chat group for incest and paedophilia.\nThe seven were in the same chat group for incest and paedophilia.PHOTO: LIANHE ZAOBAO\nUPDATED Mar 11, 2025, 08:21 PM\n\n\nPolice from Aichi Prefecture in Japan have arrested seven men as of March 11 on suspicion of raping their daughters or stepdaughters and sharing footage of the abuse on social media, reported the Mainichi Shimbun.\n\n\nThe men are in their 30s to 50s.\n\n\nThey are accused of penetrative sexual assault, and violations of anti-child prostitution and anti-child pornography laws, reported the Japanese newspaper.\n\n\n\n\nFour of the men allegedly violated their biological or foster daughters and sent videos of the abuse in a social media group.\n\n\nThe victims were between six and 14 years old at the time.\n\n\nThe other three men allegedly owned obscene images of minors.\n\n\n\n\nThe seven were in the same chat group for incest and paedophilia, and the Aichi police believe they sexually abused their daughters and other children regularly.\n\n\nThey were discovered after one of the men was arrested in November 2024 for suspected penetrative sexual assault of a minor, and a probe of his mobile phone revealed the group were sharing explicit videos.\n\n\nThe group is thought to have started exchanging information around December 2023, reported Mainichi Shimbun.\""
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Texas measles cases grow to 223, mostly among children and teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-cases-latest/story?id=119663844",
            "upvotes": 3411,
            "date": "03/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/aebbd8d7-5e11-4f76-ba61-175fae71c515/measles-lubbock-01-gty-jef-250311_1741706139050_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Can you imagine how PISSED these kids are going to be at their parents when they grow old enough to recognize that a terrible childhood illness was completely avoidable?",
                "Goddamn I hate the anti vaccine cult.",
                "Child abuse in the land of \"pro life\"...",
                "Im sorry to the children caught in this stupidity. \n\nYou deserve better",
                "Because the adults are all vaccinated as they grew up in the U.S. when we still generally agreed it was a good idea. Because it is.",
                "Thankfully this is what convinced my wife's ex to finally give permission to vaccinate their kids (since in our state both parties have to sign off on it). \n\nMy heart goes out the kids who suffer and face a lifetime of potential health issues from this disease - but fuck the parents, fuck RFK Jr, fuck that \"Autism is caused by vaccines\" British asshole (who was running a grift to get people to pay for **his** vaccines), and anyone else who puts their high school graduation \"research\" against a proven history of vaccines saving millions of lives.",
                "This is because they aren't vaccinated. Poor children have to face this for no good",
                "Oh well.  At least eggs are chea... Or my retirement is grea... I mean we are in good standing world wid... \n\nAt least they will die for freedom.",
                "Red state oWniNg tHe LiBs!!. Ok well, have fun with your new little hobby I guess.",
                "That's way more than the number of trans athletes supposedly playing the \"wrong\" sport."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ontario’s Ford suspends U.S. electric surcharge, says Lutnick agrees to trade talks",
            "external_url": "https://www.cnbc.com/2025/03/11/ontarios-ford-suspends-us-electric-surcharge-says-lutnick-agrees-to-trade-talks.html",
            "upvotes": 1516,
            "date": "03/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108096026-17385018682025-01-31t194302z_882276599_rc25lca555hn_rtrmadp_0_usa-trump-canada-tariffs.jpeg?v=1741720657&w=1920&h=1080",
            "top_comments": [
                "Does anyone else have a headache?",
                "I seen swings sets with less back and forth",
                "I still think it's time to invest in solar and batteries for my house.",
                "I'm seeing some very interesting headlines and reports from Americans to try and control the narrative like this from NBC - [Canada backs down from 25% electricity surcharge after Trump threats](https://www.nbcnews.com/business/economy/trump-canada-doubles-tariffs-national-emergency-electricity-rcna195810)\n\n As a Canadian, let's set the record straight.\n\nWhat really happened was that Canada made Trump blink first. Premier Ford and other Canadian leaders from coast to coast to coast have always asserted that they're willing to negotiate with America. It was America that continued to refuse to negotiate until Canada finally placed reciprocal tariffs and export taxes. \n\nTrump blinked. But American media would have you believe that Canada capitulated. Elbows up! 🇨🇦",
                "I’m so tired of this shit show. Everyone who voted for Trump for economic reasons look real stupid right now",
                "We don't want a trade war, as nice as it would be to stick it to him. If they're willing to negotiate then we should try to avoid this as much as possible.\n\nBut our electricity surcharge can be reinstated at any time. If they try and do what they did to Zelenskyy, don't be surprised to see the surcharge back.",
                "Go Canada go from an American 😭❤️",
                "This kind of pisses me off. This is going to give Trump what he considers a \"win\".",
                "Did he not just say on TV all over the place that the tariffs would stay until the US removes its tariffs on Canadian products period.\nFord just did the same thing President Krasnov has been doing 😵‍💫",
                "I’m fucking tired of all the big talk and no one actually having the balls to do anything. Fucking EXHAUSTED "
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Southwest Airlines shifts to paid baggage policy to lift earnings",
            "external_url": "https://www.reuters.com/business/aerospace-defense/southwest-airlines-shifts-paid-baggage-policy-lift-earnings-2025-03-11/",
            "upvotes": 3791,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "To lift earnings we are eliminating the competitive advantage that brings people to our airline.",
                "As someone who has flown Southwest many times, I’ll repeat a comment I made in an earlier thread: Herb Kelleher is twirling in his grave with how this investment group is destroying his airline. Fuck these people.",
                "Southwest Fares for me were usually around the same price or slightly more expensive than Delta/United/American etc.. but when you added in a free checked bag for a round trip flight they often ended up cheaper. \n\nIf they go to a $35+ baggage fee I will have zero reason to fly on Southwest ever again unless their flight prices come down (which I doubt).",
                "> The policy shift suggests a growing influence of activist investor Elliott Investment Management at the airline. The hedge fund, whose nominees hold five of 15 board seats, had criticized Southwest's leadership for not charging a fee for checking bags like other airlines to boost its revenue.\n\nMotherfucking hedge funds, leeching off of society while generating nothing of real value for us.",
                "In the email they sent announcing this, they rolled out multiple anti-passenger changes at the same time:\n\n* Paid checked bags\n* Flight credit expiration\n* Lower earn ratio on rapid reward points\n* No more free changes on Basic (though oddly you can still cancel and get a flight credit, so the key difference here is inconvenience)\n\nI'm going to bet the checked bags portion of this was the preplanned \"we heard you\" piece that can be easily carved out while they keep all the rest of the changes. Then they'll reintroduce the checked bag change later and there won't be nearly as much furor as the outrage was already spent once on this issue.\n\nMy company flies exclusively Southwest. I've taken hundreds of legs with them. I suspect that will change now.",
                "SW will file bankruptcy and/or be acquired within the next 10 years.",
                "As an employee this makes me incredibly sad",
                "“Last year, it said while charging for bags could bring in $1.5 billion in additional revenue every year, it would cost the airline $1.8 billion in lost market share.” lmao they already did the homework and determined this will hurt them more than help them, and yet they’re doing it anyway. The enshittification is inevitable.",
                "The whole reason I flew SW was because of that free bag policy. Made going to and from conventions easier, even if it meant having to do layovers.\n\nNow if costs are going to be about the same, no point in going SW if it means I can just do direct flights from the competition.",
                "Time to cancel that Southwest Rapid Rewards VISA"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Ukraine agrees to accept US 30-day ceasefire proposal",
            "external_url": "https://www.reuters.com/world/europe/moscow-drone-attack-latest-russian-capital-targeted-by-ukraine-2025-03-11/",
            "upvotes": 1389,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia to break it and blame Ukraine. And trump to agree....",
                "\"return of forcibly transferred Ukrainian children\"\nYeah no way Russia is accepting this",
                "Russia either won't accept, or will break it. And Trump is in for a reality check. Betting 1 Tesla stock",
                "Ukraine will do whatever is best for them, but any ultimate peace treaty that doesn't include security guarantees for Ukraine is just a pause button to give Russia a few years to rebuild their military before launching a third invasion.",
                "Governing 30 days at a time",
                "I suspect that Ukraine only agreed to this because they knew Russia wouldn't.",
                "Russia will literally break this on day 28",
                "Russian Ceasefire, take 25: and, action.",
                "Russia will break it, say Ukraine broke it, then Trump will use the accusation as a reason to hurt Ukraine.",
                "The only ceasefire will be Ukraine ceasing to fire on the Russian troops still shooting them. But another example of who is the bad guy can't hurt I guess. Not like the orange idiot will accept it even if he sees it with his own eyes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "USDA cuts more than $1bn in local food purchases for schools, food banks",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/usda-cuts-food-banks-schools",
            "upvotes": 1062,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7d65400d1ba74235801ee05719cb624494f599d/0_433_7726_4638/master/7726.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ffb661736c0d25470ff69c089150c88",
            "top_comments": [
                "Because the kids aren't the priority anymore. Duh!",
                "What's that quote I see going around, \"Republicans will deny food for 100 people out of concern 1 may not actually need it.\"",
                "From the article:\n\n\nMillions of children could lose free school meals as food costs rise, warns School Nutrition Association president\n\n\nAbout $660m of those funds were contained in the Local Food for Schools Cooperative Agreement Program, which provided funds to schools and child care facilities but is now being eliminated.\n\n\nMeanwhile, short-staffed school nutrition teams, striving to improve menus and expand scratch-cooking, would be saddled with time-consuming and costly paperwork created by new government inefficiencies.”",
                "Every day I am more horrified than the day before. Half of me wants to stop being on the Internet outright, and the other half wants to keep reading to know what hell I need to prepare for.",
                "I just saw this. Feeding kids is \"woke\" now\n\n\nhttps://www.reddit.com/r/facepalm/comments/1i88jud/woke_is_giving_food_to_low_income_people/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                "And that money is going back to tax payers?\n\nOh wait, the GOP plans on adding $4 trillion more to the debt to pay for tax cuts for those making over $350K a year. \n\nWhy do millionaires and billionaires need these handouts, but school kids do not??",
                "So, it’s now “Farmers, nevermind…we were kidding. No fun for you” or anyone else. ",
                "When you're so evil you let your own people starve.  Nice job republicans.  Are the right people being hurt yet?",
                "Are we great again yet?",
                "Republicans are pure evil, nothing less. These are children ffs."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 15299,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "[removed]",
                "[removed]",
                "Jamie Whites murder was a hoax by the deep state. He, his family and the other people involved are just crisis actors. Let's make a buncha podcasts making millions off arguing this and just insist Alex Jones is crazy.\n\nGive him a taste of his own.",
                "[removed]",
                "the very first line under the title\n\n\"Police have not yet confirmed the identity of the victim fatally shot late Sunday night\"",
                "I am fortunate enough to never have heard of this person.",
                "[removed]",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Ukraine-Russia latest: Ukraine ready to accept 30-day ceasefire, as US resumes military assistance",
            "external_url": "https://www.bbc.co.uk/news/live/c51ypekv9xwt",
            "upvotes": 35,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c309/live/60583a00-fec2-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                "Ukraine 🇺🇦 is cowards . They need the keep fighting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Scholars stranded in America and abroad amid funding freeze of State Department programs",
            "external_url": "https://apnews.com/article/fulbright-scholars-stipends-frozen-indefinitely-9da042b5e0bda70fb1c76105564c71f4",
            "upvotes": 66,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In less than eight-weeks, Trump has destroyed everything we've fought and died for since the founding of our nation. It's never going to be the same again.",
                "Why would any country trust us ever again? All that's left to use us, manipulate us. But never trust."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Trump backs off doubling Canadian steel and aluminum tariffs after Ontario suspends electricity surcharge",
            "external_url": "https://www.cbsnews.com/news/trump-tariffs-canada-steel-aluminum/",
            "upvotes": 512,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/d3dc91bb-a425-42cb-9d30-0ff10eafaa14/thumbnail/1200x630g2/b57462378b668dd5d145a85b2e321fc0/gettyimages-2203227046.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "This is the most farcical trade war ever.",
                "So he's not running America so much like ***a*** business, as he is running America like [*his* business](https://www.americanbanker.com/news/banking-on-the-donald).",
                "They suspended the surcharge as good faith for the meeting this Thursday. That was not a win for the orange bastard.",
                "His decision making is child-like. Impulsive, personal, ad hoc, transactional. He is a bully who has been handed the reigns of government.",
                "Consistently inconsistent",
                "I swear to God this is exhausting. It makes me wish we were back in the pandemic years so I can just make sourdough and not have to hear the word tariff 50x a day.",
                "\"Speak loudly and carry a small dick.\" --The Trump Doctrine ",
                "It's a shame. It would have been interesting if they left it on and stood up to the schoolyard bully rather than giving in. The announcement that he could \"make a different decision\" just continues his bullying tactics.",
                "He is the one who blinked.",
                "In his disease addled brain he thinks this is a win."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Ontario’s Ford suspends U.S. electric surcharge, says Lutnick agrees to trade talks",
            "external_url": "https://www.cnbc.com/2025/03/11/ontarios-ford-suspends-us-electric-surcharge-says-lutnick-agrees-to-trade-talks.html",
            "upvotes": 1516,
            "date": "03/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108096026-17385018682025-01-31t194302z_882276599_rc25lca555hn_rtrmadp_0_usa-trump-canada-tariffs.jpeg?v=1741720657&w=1920&h=1080",
            "top_comments": [
                "Does anyone else have a headache?",
                "I seen swings sets with less back and forth",
                "I still think it's time to invest in solar and batteries for my house.",
                "I'm seeing some very interesting headlines and reports from Americans to try and control the narrative like this from NBC - [Canada backs down from 25% electricity surcharge after Trump threats](https://www.nbcnews.com/business/economy/trump-canada-doubles-tariffs-national-emergency-electricity-rcna195810)\n\n As a Canadian, let's set the record straight.\n\nWhat really happened was that Canada made Trump blink first. Premier Ford and other Canadian leaders from coast to coast to coast have always asserted that they're willing to negotiate with America. It was America that continued to refuse to negotiate until Canada finally placed reciprocal tariffs and export taxes. \n\nTrump blinked. But American media would have you believe that Canada capitulated. Elbows up! 🇨🇦",
                "I’m so tired of this shit show. Everyone who voted for Trump for economic reasons look real stupid right now",
                "We don't want a trade war, as nice as it would be to stick it to him. If they're willing to negotiate then we should try to avoid this as much as possible.\n\nBut our electricity surcharge can be reinstated at any time. If they try and do what they did to Zelenskyy, don't be surprised to see the surcharge back.",
                "Go Canada go from an American 😭❤️",
                "This kind of pisses me off. This is going to give Trump what he considers a \"win\".",
                "Did he not just say on TV all over the place that the tariffs would stay until the US removes its tariffs on Canadian products period.\nFord just did the same thing President Krasnov has been doing 😵‍💫",
                "I’m fucking tired of all the big talk and no one actually having the balls to do anything. Fucking EXHAUSTED "
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "DOJ official says she was fired after opposing the restoration of Mel Gibson's gun rights",
            "external_url": "https://www.nbcnews.com/politics/justice-department/doj-official-says-was-fired-opposing-restoration-mel-gibsons-gun-right-rcna195287",
            "upvotes": 518,
            "date": "03/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250310-mel-gibson-2017-ac-1159p-48e9a8.jpg",
            "top_comments": [
                "Mel Gibson ruined Mel Gibson movies for me, the cunt",
                "This is also the administration that is going after colleges for supposed anti-semitism",
                "Trump is weaponizing government power and having a persons livelihood taken away to give guns back to a piece of shit that committed domestic violence…\n\nMel Gibson beat the shit out of his ex and her young daughter. There are photos, voice recordings, broken teeth, and massive bruises to prove it.",
                "Is Mel Gibson going to kill somebody?",
                "Mel Gibson is a fucking whacko. ",
                "Having a personal relationship with a 34 times convicted criminal, who defrauded a childrens cancer charity and brags about sexually assaulting women should be a sufficient basis to deny the recommendation "
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "USDA cuts more than $1bn in local food purchases for schools, food banks",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/usda-cuts-food-banks-schools",
            "upvotes": 1067,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7d65400d1ba74235801ee05719cb624494f599d/0_433_7726_4638/master/7726.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ffb661736c0d25470ff69c089150c88",
            "top_comments": [
                "Because the kids aren't the priority anymore. Duh!",
                "What's that quote I see going around, \"Republicans will deny food for 100 people out of concern 1 may not actually need it.\"",
                "From the article:\n\n\nMillions of children could lose free school meals as food costs rise, warns School Nutrition Association president\n\n\nAbout $660m of those funds were contained in the Local Food for Schools Cooperative Agreement Program, which provided funds to schools and child care facilities but is now being eliminated.\n\n\nMeanwhile, short-staffed school nutrition teams, striving to improve menus and expand scratch-cooking, would be saddled with time-consuming and costly paperwork created by new government inefficiencies.”",
                "Every day I am more horrified than the day before. Half of me wants to stop being on the Internet outright, and the other half wants to keep reading to know what hell I need to prepare for.",
                "I just saw this. Feeding kids is \"woke\" now\n\n\nhttps://www.reddit.com/r/facepalm/comments/1i88jud/woke_is_giving_food_to_low_income_people/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                "And that money is going back to tax payers?\n\nOh wait, the GOP plans on adding $4 trillion more to the debt to pay for tax cuts for those making over $350K a year. \n\nWhy do millionaires and billionaires need these handouts, but school kids do not??",
                "So, it’s now “Farmers, nevermind…we were kidding. No fun for you” or anyone else. ",
                "When you're so evil you let your own people starve.  Nice job republicans.  Are the right people being hurt yet?",
                "Are we great again yet?",
                "Republicans are pure evil, nothing less. These are children ffs."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Tornado crosses over local TV station in Central Florida during a live broadcast",
            "external_url": "https://www.denver7.com/weather/tornado-crosses-over-local-tv-station-in-central-florida-during-a-live-broadcast",
            "upvotes": 61,
            "date": "03/11/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/61ce8ca/2147483647/strip/true/crop/2098x1101+0+165/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fbe%2F59%2Febdd8e534cbaa4c2341fb24dc9d5%2Fscreenshot-2025-03-11-at-9-07-17-am.png",
            "top_comments": [
                "EF2 hit Orlando. No injuries were reported at the station. Some nearby homes were damaged.",
                "How perfect that it's a Fox affiliate. \n\nI grew up in tornado country, and to this day I remember one of the tornado safety videos they made us watch in grade school. Some guy has a camcorder and is filming as his entire family stands in front of a glass sliding door looking out onto a lake. You can see the tornado only a few houses down, and the guy just calmly says, \"There goes Bob's boat!\" Still cracks me up all these years later.",
                "Even the weather hates florida's guts."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "US should restart shuttered coal units, Interior Secretary tells Bloomberg",
            "external_url": "https://www.reuters.com/business/energy/us-should-restart-shuttered-coal-units-interior-secretary-tells-bloomberg-2025-03-10/",
            "upvotes": 241,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Of course. Why not restart outdated tech that is more expensive, causes more pollution, and requires us to import the necessary resource from Canada, a country we just started a trade war with.\n\nThats a master plan.",
                "Heard him talking on CNBC, going on about how we can still enjoy “95%” of our federally protected land. \n\nWhat a piece of shit.",
                "\"We can stop death by regulation\" \n\nand, presumably, restart death by black lung, toxic chemical exposure, and more-frequent climate-related disasters.",
                "Utilities don't want to restart coal. Many are decommissioned and cannot be recovered.",
                "The children yearn for the mines",
                "I just watched a youtube video that depicted coal when it was carted to every home with coal fired boilers.\n\nI realized that this drove the demand back then. A lot of people used coal to heat their homes. Now, we have electricity and gas heat.\n\nHow can they justify opening coal mines without new coal demand?\n\nBy creating demand themselves.\n\nSoviet Trump demands more coal to be used. Better start a coal demand quota.",
                "Socialized Coal by people who think socialism is the devil",
                "Im glad my city blew up our last remaining coal plant recently. ",
                "We should also bring back the pony express.",
                "It's just a coal plant, Michael. How hard is it to start up again?"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Poland arrests Ukrainian woman convicted of selling 56 human kidneys",
            "external_url": "https://www.reuters.com/world/europe/poland-arrests-ukrainian-woman-convicted-selling-56-human-kidneys-2025-03-11/",
            "upvotes": 271,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "God forbid women have a hobby",
                "She was already on Interpol's list since 2020",
                "Don’t sell any kidneys on the way to the parking lot!",
                "I bet she is a non-donor.",
                "I knew this urban myth was real...",
                "thats at least 28 crimes.",
                "They were just lying around.",
                "Give away one kidney, you're selfless.\nGive away two kidneys, you're a hero.\nGive away three kidneys, you're put on a list",
                "*The woman was convicted for participation in an international organised criminal group that illegally collected tissues and organs from people from 2017 to 2019 and sold them on the black market, Petkowska added.*\n\nOne further reminder of de-humainzation. More and more we are bits and pieces and not revered whole beings with body and perhaps soul. What's worse is that there's a set price on each part of us.",
                "that one person in example in math class"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Ukraine agrees to accept US 30-day ceasefire proposal",
            "external_url": "https://www.reuters.com/world/europe/moscow-drone-attack-latest-russian-capital-targeted-by-ukraine-2025-03-11/",
            "upvotes": 1390,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia to break it and blame Ukraine. And trump to agree....",
                "\"return of forcibly transferred Ukrainian children\"\nYeah no way Russia is accepting this",
                "Russia either won't accept, or will break it. And Trump is in for a reality check. Betting 1 Tesla stock",
                "Ukraine will do whatever is best for them, but any ultimate peace treaty that doesn't include security guarantees for Ukraine is just a pause button to give Russia a few years to rebuild their military before launching a third invasion.",
                "Governing 30 days at a time",
                "I suspect that Ukraine only agreed to this because they knew Russia wouldn't.",
                "Russia will literally break this on day 28",
                "Russian Ceasefire, take 25: and, action.",
                "Russia will break it, say Ukraine broke it, then Trump will use the accusation as a reason to hurt Ukraine.",
                "The only ceasefire will be Ukraine ceasing to fire on the Russian troops still shooting them. But another example of who is the bad guy can't hurt I guess. Not like the orange idiot will accept it even if he sees it with his own eyes."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump backs off doubling Canadian steel and aluminum tariffs after Ontario suspends electricity surcharge",
            "external_url": "https://www.cbsnews.com/news/trump-tariffs-canada-steel-aluminum/",
            "upvotes": 510,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/d3dc91bb-a425-42cb-9d30-0ff10eafaa14/thumbnail/1200x630g2/b57462378b668dd5d145a85b2e321fc0/gettyimages-2203227046.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "This is the most farcical trade war ever.",
                "So he's not running America so much like ***a*** business, as he is running America like [*his* business](https://www.americanbanker.com/news/banking-on-the-donald).",
                "They suspended the surcharge as good faith for the meeting this Thursday. That was not a win for the orange bastard.",
                "His decision making is child-like. Impulsive, personal, ad hoc, transactional. He is a bully who has been handed the reigns of government.",
                "Consistently inconsistent",
                "I swear to God this is exhausting. It makes me wish we were back in the pandemic years so I can just make sourdough and not have to hear the word tariff 50x a day.",
                "\"Speak loudly and carry a small dick.\" --The Trump Doctrine ",
                "It's a shame. It would have been interesting if they left it on and stood up to the schoolyard bully rather than giving in. The announcement that he could \"make a different decision\" just continues his bullying tactics.",
                "He is the one who blinked.",
                "In his disease addled brain he thinks this is a win."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "DOJ official says she was fired after opposing the restoration of Mel Gibson's gun rights",
            "external_url": "https://www.nbcnews.com/politics/justice-department/doj-official-says-was-fired-opposing-restoration-mel-gibsons-gun-right-rcna195287",
            "upvotes": 514,
            "date": "03/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250310-mel-gibson-2017-ac-1159p-48e9a8.jpg",
            "top_comments": [
                "Mel Gibson ruined Mel Gibson movies for me, the cunt",
                "This is also the administration that is going after colleges for supposed anti-semitism",
                "Trump is weaponizing government power and having a persons livelihood taken away to give guns back to a piece of shit that committed domestic violence…\n\nMel Gibson beat the shit out of his ex and her young daughter. There are photos, voice recordings, broken teeth, and massive bruises to prove it.",
                "Is Mel Gibson going to kill somebody?",
                "Mel Gibson is a fucking whacko. ",
                "Having a personal relationship with a 34 times convicted criminal, who defrauded a childrens cancer charity and brags about sexually assaulting women should be a sufficient basis to deny the recommendation "
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "USDA cuts more than $1bn in local food purchases for schools, food banks",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/usda-cuts-food-banks-schools",
            "upvotes": 1067,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7d65400d1ba74235801ee05719cb624494f599d/0_433_7726_4638/master/7726.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ffb661736c0d25470ff69c089150c88",
            "top_comments": [
                "Because the kids aren't the priority anymore. Duh!",
                "What's that quote I see going around, \"Republicans will deny food for 100 people out of concern 1 may not actually need it.\"",
                "From the article:\n\n\nMillions of children could lose free school meals as food costs rise, warns School Nutrition Association president\n\n\nAbout $660m of those funds were contained in the Local Food for Schools Cooperative Agreement Program, which provided funds to schools and child care facilities but is now being eliminated.\n\n\nMeanwhile, short-staffed school nutrition teams, striving to improve menus and expand scratch-cooking, would be saddled with time-consuming and costly paperwork created by new government inefficiencies.”",
                "Every day I am more horrified than the day before. Half of me wants to stop being on the Internet outright, and the other half wants to keep reading to know what hell I need to prepare for.",
                "I just saw this. Feeding kids is \"woke\" now\n\n\nhttps://www.reddit.com/r/facepalm/comments/1i88jud/woke_is_giving_food_to_low_income_people/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                "And that money is going back to tax payers?\n\nOh wait, the GOP plans on adding $4 trillion more to the debt to pay for tax cuts for those making over $350K a year. \n\nWhy do millionaires and billionaires need these handouts, but school kids do not??",
                "So, it’s now “Farmers, nevermind…we were kidding. No fun for you” or anyone else. ",
                "When you're so evil you let your own people starve.  Nice job republicans.  Are the right people being hurt yet?",
                "Are we great again yet?",
                "Republicans are pure evil, nothing less. These are children ffs."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Fear of flying is pushing ticket sales down in the wake of multiple crashes, airlines say",
            "external_url": "https://www.cnn.com/2025/03/11/business/passengers-air-travel-crashes-fear/index.html",
            "upvotes": 5691,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199796404.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Let's offset this by charging for luggage.\n\n \\- Southwest Airlines",
                "Misleading headlines it's not so much \"fear of flying\" as it is \"safety concerns after whistleblowers and deregulation and several accidents\"",
                " Without proper oversight, it is not the Fear of flying but the fear of crashing. Why would people travel with all the fear and uncertainty in the Russian Vassal State of the USA.",
                "Elon Musk only flies on Air Force 1 lately.  Must be a sign.",
                "Yup, I canceled a flight this month after my brother's girlfriend almost died in that recent near miss where Southwest pilot pulled up just in time to avoid a taxiing idiot. Not gonna be a statistic for these assholes.",
                "With the government cutting a large amount of the people who service the air traffic equipment and knowing the fact that they were already pretty thin in that area, I'm probably not going to fly for a long while myself.",
                "make trains great again :) i seriously wish USA would build a massive highspeed rail system",
                "It seems completely rational with the dangerous cuts to the FAA.",
                "I think it's more people not traveling because of economic reasons...",
                "fear of flying, cost of flying, getting disease while flying (measles in Washington Dulles airport now)\n\nI can either drive 15 hrs to a destination or fly (2.5hrs, ~900$)... hmmmmm..... Yes I know that statistically flying is safer.  But, I know I won't get a contagious disease alone in my car too, and I can sanitize my hands after the gaspump."
            ],
            "aggregate_sentiment": 87.0
        },
        {
            "category": "RISING",
            "title": "Texas measles cases grow to 223, mostly among children and teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-cases-latest/story?id=119663844",
            "upvotes": 3402,
            "date": "03/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/aebbd8d7-5e11-4f76-ba61-175fae71c515/measles-lubbock-01-gty-jef-250311_1741706139050_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Can you imagine how PISSED these kids are going to be at their parents when they grow old enough to recognize that a terrible childhood illness was completely avoidable?",
                "Goddamn I hate the anti vaccine cult.",
                "Child abuse in the land of \"pro life\"...",
                "Im sorry to the children caught in this stupidity. \n\nYou deserve better",
                "Because the adults are all vaccinated as they grew up in the U.S. when we still generally agreed it was a good idea. Because it is.",
                "Thankfully this is what convinced my wife's ex to finally give permission to vaccinate their kids (since in our state both parties have to sign off on it). \n\nMy heart goes out the kids who suffer and face a lifetime of potential health issues from this disease - but fuck the parents, fuck RFK Jr, fuck that \"Autism is caused by vaccines\" British asshole (who was running a grift to get people to pay for **his** vaccines), and anyone else who puts their high school graduation \"research\" against a proven history of vaccines saving millions of lives.",
                "This is because they aren't vaccinated. Poor children have to face this for no good",
                "Oh well.  At least eggs are chea... Or my retirement is grea... I mean we are in good standing world wid... \n\nAt least they will die for freedom.",
                "Red state oWniNg tHe LiBs!!. Ok well, have fun with your new little hobby I guess.",
                "That's way more than the number of trans athletes supposedly playing the \"wrong\" sport."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 13111,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c309/live/60583a00-fec2-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                ">Marco Rubio is asked if they are accepting any good-will gestures from Russia or if there is a deadline.\n\n\n>Rubio says \"Ukraine is ready to stop shooting and start talking.\"\n\n\n>He reiterates that he hopes Russia will say yes to the ceasefire, but if they say no \"then we'll unfortunately know what the impediment is to peace here\".\n\n\nIf you didn't already know that the impediment to peace is the guy who started the invasion............",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "Now that intelligence from Ukraine goes straight to Russia during trump’s daily kneel and swallow Putin meetings.",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I feel like Trump is running this country like a 13 yr old. He hates you today and likes you the next. Nobody signed up for this shitty roller coaster ride.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "I would not be trusting any US intel if I was Ukraine ",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "You know what would be nice. If he didint waste eastern european lives for some petty politics.  This guy America elected is just a damn scumbag that needs to be gone asap. He wont stop with seeing as foreigners as currency. Sooner or later he will sacrifice democrats to feel good about himself."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Ontario’s Ford suspends U.S. electric surcharge, says Lutnick agrees to trade talks",
            "external_url": "https://www.cnbc.com/2025/03/11/ontarios-ford-suspends-us-electric-surcharge-says-lutnick-agrees-to-trade-talks.html",
            "upvotes": 1523,
            "date": "03/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108096026-17385018682025-01-31t194302z_882276599_rc25lca555hn_rtrmadp_0_usa-trump-canada-tariffs.jpeg?v=1741720657&w=1920&h=1080",
            "top_comments": [
                "Does anyone else have a headache?",
                "I seen swings sets with less back and forth",
                "I still think it's time to invest in solar and batteries for my house.",
                "I'm seeing some very interesting headlines and reports from Americans to try and control the narrative like this from NBC - [Canada backs down from 25% electricity surcharge after Trump threats](https://www.nbcnews.com/business/economy/trump-canada-doubles-tariffs-national-emergency-electricity-rcna195810)\n\n As a Canadian, let's set the record straight.\n\nWhat really happened was that Canada made Trump blink first. Premier Ford and other Canadian leaders from coast to coast to coast have always asserted that they're willing to negotiate with America. It was America that continued to refuse to negotiate until Canada finally placed reciprocal tariffs and export taxes. \n\nTrump blinked. But American media would have you believe that Canada capitulated. Elbows up! 🇨🇦",
                "I’m so tired of this shit show. Everyone who voted for Trump for economic reasons look real stupid right now",
                "We don't want a trade war, as nice as it would be to stick it to him. If they're willing to negotiate then we should try to avoid this as much as possible.\n\nBut our electricity surcharge can be reinstated at any time. If they try and do what they did to Zelenskyy, don't be surprised to see the surcharge back.",
                "Go Canada go from an American 😭❤️",
                "This kind of pisses me off. This is going to give Trump what he considers a \"win\".",
                "Did he not just say on TV all over the place that the tariffs would stay until the US removes its tariffs on Canadian products period.\nFord just did the same thing President Krasnov has been doing 😵‍💫",
                "I’m fucking tired of all the big talk and no one actually having the balls to do anything. Fucking EXHAUSTED "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Jury awards $120 million to two men wrongfully convicted of 2003 murder",
            "external_url": "https://www.cbsnews.com/chicago/news/wrongful-conviction-verdict-jury-120-million-john-fulton-anthony-mitchell/",
            "upvotes": 674,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/73a21bee-9577-4457-8634-883a83f21fbd/thumbnail/1200x630/bc133372ad8a38311f08b0446e79eacb/screenshot-2025-03-11-095924.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "thats paid for with tax dollars. when civilians get sued, their own wages and/or property(s) are subject to  payment. why do civilians also have to pay for police fuck ups?",
                "Statement that supposedly pro law and order people love to make mockly: \"There are no guilty people in prison\".\n\n\nSo much of the Innocence Projects has shown that there are a lot of innocent people in prison. ",
                "They really need to start connecting these payments to the pension funds of both police and local prosecutions: Perhaps there'd be far less coercion and tampering with evidence if there actually existed some consequences for doing so.",
                "*John Fulton and Anthony Mitchell both spent more than 16 years in prison before their convictions were overturned in 2019, and prosecutors wound up dropping all charges against them in the murder of 18-year-old Christopher Collazo.*\n\nWhat happened in 2003 was not racist enough; now the city of Chicago is appealing the Federal Courts finding of 120m award for the mistaken convictions/imprisonment",
                "If y’all are interested, a person who was on the jury for this case did an AMA a little while ago on r/ama",
                "Dont spend it all in one place",
                "Tbh for that amount in 20 years, lock me up please "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Girl Scouts sued over alleged heavy metals, pesticides in cookies",
            "external_url": "https://www.reuters.com/legal/girl-scouts-sued-over-alleged-heavy-metals-pesticides-cookies-2025-03-11/",
            "upvotes": 957,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Since girl scouts are making the claim that these are normal things to find or at normal levels, id be curious to see how the other big cookie brands compare when tested \n\nAlso they mention other lawsuits of a similar nature in the past but don’t mention the outcome of those lawsuits in this article. Which seems relevant",
                "Oh please, not the thin mints...\n\n[Clicks Article]\n\nI need to see a doctor.",
                "I've long suspected Girl Scout cookies were a one-way ticket to midnight.",
                ">She said she would not have bought the cookies or \"would have paid substantially less\" had Girl Scouts disclosed the presence of \"dangerous toxins.\"\n\nIt's okay to poison me, but you have to give me a discount if you do?",
                "I guess the Thin Mints can be renamed Heavy Mints. Or maybe Quicksilver Mints? 🤔 ",
                "“It said heavy metals occur naturally in soil, with trace amounts not a safety issue, while glyphosate is found “nearly everywhere” in the food chain. Girl Scouts also said its bakers are committed to complying with all food safety standards.”\n\nWhich is true …  don’t want heavy metals in the food supply , maybe it’s time to do something about pollution.. As for glyphosate, maybe sue Bayer ,since they are the manufacturer..   \n\nsomebody must have not gotten the cookies they ordered",
                "Should I be scared about the empty package in my trash from last night? Or about the 2 unopened packages on my counter?",
                "It’s worth anything they want to put in it for the peanut butter ones",
                "I didn't dig real deep, but the initial info I find from the referenced study is... vague. Gives a low end of mercury of .02ppb (the limit is 2ppb) but then an amount of lead that is double the limit with no low range. Are there typos, is it a bad study, what's the deal here?",
                "Well, fuck.  I 100% threw myself a \"cookie party\" on Saturday and had a whole box of Thin Mints instead of real food that day...\n\nAt least it was a delicious death."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "U.S. Department of Education’s Office for Civil Rights Sends Letters to 60 Universities Under Investigation for Antisemitic Discrimination and Harassment",
            "external_url": "https://www.cnn.com/2025/03/10/us/department-of-education-warning-universities-title-vi-antisemitism/index.html",
            "upvotes": 618,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap24341776031813.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There is some irony that this is being done via the DEpartment of Education, which they want to shut down, and under the auspices of Title VI of the Civil Rights Act, which they want to get rid of.",
                "Oh, good! They’re gonna go after Nazis too, right?\n\nRight?",
                "\"wtf we hate antisemitism now!\" -dude who handed the country over to someone who gave a sieg heil on national television",
                "Full list of colleges:\n\nAmerican University \nArizona State University \nBoston University \nBrown University \nCalifornia State University, Sacramento \nChapman University \nColumbia University \nCornell University \nDrexel University \nEastern Washington University \nEmerson College \nGeorge Mason University \nHarvard University \nIllinois Wesleyan University \nIndiana University, Bloomington \nJohns Hopkins University \nLafayette College \nLehigh University \nMiddlebury College \nMuhlenberg College \nNorthwestern University \nOhio State University \nPacific Lutheran University     \nPomona College \nPortland State University \nPrinceton University \nRutgers University \nRutgers University-Newark\nSanta Monica College \nSarah Lawrence College \nStanford University \nState University of New York Binghamton \nState University of New York Rockland \nState University of New York, Purchase \nSwarthmore College \nTemple University \nThe New School \nTufts University \nTulane University \nUnion College \nUniversity of California Davis \nUniversity of California San Diego \nUniversity of California Santa Barbara \nUniversity of California, Berkeley\nUniversity of Cincinnati \nUniversity of Hawaii at Manoa \nUniversity of Massachusetts Amherst \nUniversity of Michigan \nUniversity of Minnesota, Twin Cities \nUniversity of North Carolina \nUniversity of South Florida \nUniversity of Southern California \nUniversity of Tampa \nUniversity of Tennessee \nUniversity of Virginia \nUniversity of Washington-Seattle \nUniversity of Wisconsin, Madison \nWellesley College \nWhitman College \nYale University",
                "I remember complaints from the felon about how dems weaponize the govt. Now we have the DOE weapon in place intent on threatening education.",
                "Reminder that the executive order that Trump signed “combating antisemitism” was EO 14188. I am sure that’s just a coincidence.",
                "Protesting the actions of the Israeli government is not anti-semitic.",
                "Super credible that Nazis are making accusations about antisemitism. \n\nConservatives think us Jews are their tools to exploit to push their degenerate fascist agenda.",
                "Damn...USF made the list.  Yikes.",
                "Nice. Under Trump’s direction the department of education is kicking off a new DEI initiative.\n\nWhose bingo card was this on?"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/11/2025 22:20:27 UTC"
}