{
    "posts": [
        {
            "category": "HOT",
            "title": "U.K. Top Court Says Trans Women Are Not Legally Women Under Equality Act",
            "external_url": "https://www.nytimes.com/2025/04/16/world/europe/uk-supreme-court-woman-definition-trans.html?unlocked_article_code=1.AE8.cfzk.pIrpb0-Czz4_&smid=url-share",
            "upvotes": 5428,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” He said the ruling “does not cause disadvantage to trans people” because they have protections under anti-discrimination and equality laws.\n\n>Lord Hodge began his remarks by acknowledging the national conversation about transgender rights and protections, and described trans people as a “vulnerable and often harassed minority,” while noting that women had fought for centuries for equal rights.\n\n>He added: “It is not the task of this court to make policy on how the interests of these groups should be protected” but “to ascertain the meaning of the legislation which Parliament has enacted.”\n\n  \n   \n   \nSo yeah they’re just interpreting something, it doesn’t mean the Act can’t be changed.",
                "I find it interesting and revealing that the debate is *always* over the definition of \"woman\" and never the definition of \"man\".",
                "For the Americans: Watch how many anti-trans comments pop up, then remember:  \n\n- A teacher in Florida was fired for using a 17 year olds preferred name.\n- Republican lawmakers in Arkansas want to ban children from getting haircuts that “don’t match their gender”\n- A cis woman was fired from her job at Walmart because a male customer followed her into the bathroom and accused her of being trans, all because she happed to be tall for a woman. \n\nAll of this has happened in the last month in America. Normalizing trans hatred will lead to a destruction of all our civil rights. People should be free to dress how they please without fear of being targeted by our government.",
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” \n\nTOO LATE, it is already here. \n\nWe will be flooded with \"the great vitory of the common sense\" from thousands and thousands of news site, propagandas, and pundits. \n\nAnd there will be counter fire from opposite position.",
                "This will age as well as what the UK did to Alan Turing.",
                "Someone once said. \"Let it be\". Nowadays some people just won't let it be. Sad times.",
                "Massive blow to feminism. This ruling will be used to persecute women of all presentations and genders. Cisgendered women who don’t fit into the narrow box of “woman” will be harassed and oppressed double fold.",
                "When are we going to properly talk about sex v gender.   They are being exchanged so readily with little understanding. I recall a man on LBC happily declaring there are only two genders because you are born that way. 🤔",
                "[removed]",
                "The uk taking a page out of the USA book?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Protester tased by police at Marjorie Taylor Greene's Georgia town hall",
            "external_url": "https://apnews.com/video/demonstrator-apprehended-during-congresswoman-marjorie-taylor-greenes-georgia-town-hall-34521ef711774381acc3e94863a6d371",
            "upvotes": 1963,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My favorite part is that she reportedly said something along the lines that she doesn't tolerate heckling at her town halls.\n\nThis is after all she has ever done is heckle, scream, and rant conspiracy theories for the last 4 years during Biden's administration. The hypocrisy is palpable.",
                "I take it she should have been tased at Biden’s SotU address? 🤔",
                "\"sit and listen\"  \nLady, this is a town hall, not a re-education camp.",
                "So she was removing anybody who stood up and disagreed with her? And they'd get tased if they didn't listen? Party of free speech, everybody.",
                "Of course it would be at a MTG event...",
                "MtG and Boebert screeched like howler monkeys and heckled Biden during his state of the union address. This is rich coming from this hypocritical cu*t. ",
                "I guess she didn’t want to listen to her constituents concerns.  And this coming from one the best hecklers in the party.",
                "Two people were tased, three arrested and at least 6 were escorted out. \n\nAnd if it turns out that all of them were white except the two that were tased, would any of us be remotely surprised?",
                "Now we tase US CITIZENS from town halls, because they disagree? \n\nA taser can kill a human, just as easy as any other weapon. All those “officials” should be in jail for doing this to an AMERICAN.",
                "The party of free speech sure doesn't like when you exercise it"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 1584,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "Check Fraud. They committed check fraud.",
                "Fraud not Glitch but what do I know.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "I still think it’s dumb that the people that did this refer to it as a “glitch”. \n\nBut what else to expect from these people when they use the funds to buy something stupid like a Gucci wallet. It gives me strong PPP loan without a business vibes. ",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "“Infinite money glitch” aka fraud",
                "Of all the institutions to mess with, these bozos chose JP Morgan Chase. Zero sympathies."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Students at Pentagon schools sue Hegseth over book bans on race and gender",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/15/pentagon-school-students-sue-hegseth-book-bans",
            "upvotes": 11213,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/caaae65eb27630f687c14b7d9959ff71cd2535b1/0_132_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4d47af90949621427408888e44f34624",
            "top_comments": [
                "\"We do not want someone who does not know how to read books to tell us what we can and can not read. \"\n\n  \nA solid moral argument.",
                "This administration has important things to do, like repealing the definition of \"Showerhead\" (see [section 2](https://www.whitehouse.gov/presidential-actions/2025/04/maintaining-acceptable-water-pressure-in-showerheads/)) presumably because the current definition of a showerhead is too woke for Republicans.",
                "I spent most of my young life in these schools and graduated at one.  It takes big balls to do what they're doing because in our (the students/military dependents) lives, our actions reflect on our military sponsor (mom or dad in service)  In that community, you don't rock the boat because it could impact your parent/s career.  It shouldn't, but especially under this administration you can bet that Trump will end the military family member's career over this.",
                "Hegseth wanted to do a book burn, but they were to scared of his flammability to proceed. From the liquor. Because he’s a white nationalist alcoholic. And a rapist. ",
                "There are schools at the pentagon?",
                "Hegseth responded \"Something, something, lethality, something something War fighters, something, something mission...\" Then smiled, flexed, and pretended to do really bad pushups.",
                "The last book Hegseth finished, he failed to color inside the lines.",
                "Kids going in the DoDDS (sorry, I know they've changed the name since the 80s) system are exposed to more of the world and culture than their counterparts in the normal US school system. These schools are by nature as diverse as the military that their parents serve in and tend to produce excellent students. \n\nAlthough, their hiring practices in the 80s left alot to be desired. I don't think they're hiring teachers with super obvious personality disorders like they were in then. I'm looking at you, Ms. Hilton and Ms Rector.",
                "*There's more than one way to burn a book. -Ray Bradbury*",
                "Keep the pressure up! No rest till 2029!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Marshall man claims ICE detained him for protests over police killings",
            "external_url": "https://www.mprnews.org/story/2025/04/15/marshall-man-claims-ice-detained-him-for-protests-over-police-killings",
            "upvotes": 2643,
            "date": "04/16/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Well, the gestapo is alive and well and it’s in the form of ice.",
                "Incredibly Corrupt and Evil",
                "I have decided that henceforth I shall call them the Gicetapo.",
                "Police killings, you say? Didn't trump just pardon a whole bunch of police killers?",
                "Welcome to the Fourth Reich everyone.",
                "I wouldn't be surprised if he gets sent to el Salvador instead of Indonesia...",
                "I am not religious but they probably are. On judgement day, they will go straight to hell",
                "Bunch of human traffickers",
                "Estimates are that by 2035 the US will be a net negative in population growth - there will be more people dying than being born. Any guesses as to what that means when you need to call a plumber, a doctor, a mechanic? I  won't live that long to see it, but I know for a fact the day will come when our country will be begging for the hardworking, contributing, positive citizens that we're now booting from the country. This thuggery from our pseudo-president is Un-American and Un-Constitutional. I pray there will be trials, someday, for the perpetrators of these criminal acts and neglect for law and order.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Ice deports Venezuelan teen despite reportedly knowing he was not a target",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/15/merwil-gutierrez-venezuelan-teen-deported-el-salvador",
            "upvotes": 46493,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ee360365a30b84e756e6cd505a06b458cdacf009/0_61_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be7ae080843db1eb7019eb2e247be2f1",
            "top_comments": [
                "From The Guardian:\n\n>A 19-year-old Venezuelan in New York City reportedly was apprehended by Trump administration immigration authorities and deported to El Salvador despite agents’ realizing he was not whom they meant to arrest in a targeted operation.\n\n>Merwil Gutiérrez, whose family opened an asylum case after arriving in the US, was deported from the Bronx to the notorious Cecot prison in El Salvador despite his relatives’ insistence that he has no gang ties or criminal history, according to Documented, a newsroom dedicated to telling the stories of immigrants in New York City. The Gutiérrez family says it has been left without information or answers.\n\n>The teen was detained alongside 237 other Venezuelans on 24 February by US Immigration and Customs Enforcement (Ice). His father, Wilmer Gutiérrez, told Documented: “I feel like my son was kidnapped.\n\n>“I’ve spent countless hours searching for him, going from one precinct to another, speaking with numerous people who kept referring me elsewhere. Yet, after all this, no one has given me any information or provided a single document about his case.”\n\n>The elder Gutiérrez reportedly said he overheard Ice agents saying that his son had not been the person they had come to get.\n\n>**The officers grabbed him and two other boys right at the entrance to our building. One said: ‘No, he’s not the one,’ like they were looking for someone else. But the other said: ‘Take him anyway,’” he recalled.**\n\n>**Gutiérrez has no criminal record either in Venezuela or the US, his family said. He also did not have any tattoos** which is a feature that US law enforcement often use to link people to the Tren de Aragua gang – a transnational criminal organization from Venezuela – and to justify their expulsions from the country.\n\n>**Despite this, Gutiérrez was arrested and later deported to El Salvador, to which he has no ties.**\n\n>Wilmer Gutiérrez says he discovered through a news report that his son had been deported to El Salvador under the Alien Enemies Act of 1798. He watched videos on social media that showed detainees facing harsh conditions, such as having their heads shaved by authorities and being marched to their prison cells.\n\n>”I could have understood if he’d been sent back to Venezuela,” he said. “But why to a foreign country he’s never even been to?”\n\n>The Gutiérrez family’s reported ordeal comes after the Trump administration admitted to wrongly deporting a Maryland man, Kilmar Abrego García, to the same Cecot facility.\n\n>The president of El Salvador said in a meeting with Trump on Monday that the Salvadoran government would not order the return of Abrego García to the US.\n\n>Monday’s meeting at the White House came amid a broader push by the Trump administration to remove noncitizens from the US, including people who are here legally and have not been charged with crimes.\n\n>Trump has also openly stated that he would like to remove US citizens who commit unspecified violent crimes and send them to the same Salvadoran prison as Abrego García and Gutiérrez.",
                "\"Deported\" is such a sanitized term for the horrors they're committing.",
                "It's not deportation when you send them to prison in a country they have no ties to. That's called kidnapping someone and sending them to a concentration camp.",
                "We should prosecute the people who are actually doing these things. Make them afraid to follow illegal orders. It's pretty clear the people in charge are not going to stop or fix their mistakes.",
                "As things stand now, anyone deported is as good as dead. We should absolutely fight to get them back but the disgusting reality is that at present, there is very little motivating the president/admin of either the US or El Salvador to return these people. The US government is sending INNOCENT people including LEGAL migrants to DIE in a maximum security concrete box and Congress and the Judiciary are just watching and wringing their hands. This is all such a horrific, despicable nightmare.",
                "Trump has, in only a few months, flew beyond two legal instruments once used by England that the founding fathers found so despotic they outright prohibited them in the constitution and gave them as reason for the revolution - Transportation for trial and bills of attainder. \n\nExcept if you were transported for trial, you'd still get a trial, and a bill of attainder requires the legislature to vote to condemn someone. With Trump, theres no trial, and its just the whim of one man.\n\nWhat Trump is doing flies directly in the face of the Revolution and Constitution. He openly plots to extend this treatment to citizens. He is a tyrant and all means of resistance to him and his lackeys is justified.",
                "This is what fascism looks like and is the exact reason why we need due process. US citizens are next up. Trump said he would love to send home grown terrorists to El Salvador. ",
                "Someone please explain how this is different than German SS raids, because I see quite literally no distinguishing features",
                "I can't stand this. What can I do? I feel powerless. I tried calling my representative, but I don't feel like that does anything. I feel so helpless.",
                "If someone had told Americans that Trump would be defying court orders, picking up brown teenagers off the street, and sending them to an Salvadoran concentration camp run by his dictator buddy, they'd have been accused of fearmongering. The dark irony in all of this is that the most alarmist resist libs were literally right about everything.\n\nFuck the animals who are participating in these orders. The next time a Democrat takes office, there needs to be mass trials for all of them. Hell send them over to the ICC. Shit like this cannot be allowed to fly."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "PennLive: Suspect in arson at Pennsylvania governor’s home targeted the governor for his views on war in Gaza, warrant says | CNN",
            "external_url": "https://www.cnn.com/2025/04/16/us/cody-balmer-search-warrant-shapiro-arson-motive/index.html",
            "upvotes": 299,
            "date": "04/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25104822596678.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He called and told them why he did it an hour after the arson. They knew at the time. They knew he did it because of Palestine and Shapiro's religion and they waited until the story died out to give us that info. Expect this story to disappear now",
                "Hes a Nazi associated with a Nazi death magic incel cult, how are the still considering if antisemitism is a factor????",
                "i am confused. is this dude a neo-nazi or a hamas supporter?",
                "What did you guys think \"Globalize the Intifada\" meant?",
                "So... Trump and his regime are going to announce intents for terrorism charges, right? They were so quick to do that for tesla or the pharma ceo.\n\nI mean trump and his regime, specifically. The prosecutor announced a plan for terrorism charges. But with how vocal trump was about punishing people for tesla attacks, did TRUMP himself actually say anything about terrorism charges. Last i saw he just gave a brush off answer and called the guy a whackjob. But he didn't go on a big tirade about punishing the person like he has for people going after tesla.",
                "\\*Crickets\\*\n\nWell Reddit, you got your Intifada. You got your \"justified resistance\" against the evil Zionists.\n\nDoes it feel yucky or does seeing Jews attacked for existing not really bother you?",
                "a nazi caring about Palestanians? Yeah sure buddy"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Whistleblower org says DOGE may have caused ‘significant cyber breach’ at US labor watchdog",
            "external_url": "https://www.reuters.com/technology/cybersecurity/whistleblower-org-says-doge-may-have-caused-significant-cyber-breach-us-labor-2025-04-15/",
            "upvotes": 23954,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just imagine the damage we won't find out about until years later",
                "This story is getting lost in the sauce, but outside of the current disappearing of non-native citizens, this is probably the largest \"wtf omg bbq\" scandal of the administration. DOGE staffers stole 10 gigabytes worth of data from NLRB's network, and then attempted to hide their trail so no one would find out. They're stealing information on almost all americans, but also sensitive information on unions, ongoing legal cases and corporate secrets, including cases involving Musk's companies. It's a long read, but the source is from NPR.  \"https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security",
                "DOGE is the cyber breach...",
                "> The NLRB, a New Deal-era agency that is tasked with protecting workers' rights to organize and join unions, has for years been a target of America's corporate titans, including Musk, some of whom are now seeking to have the agency's powers declared unconstitutional.\n\n>In an affidavit, Berulis said he had evidence that DOGE staffers were given extraordinarily sweeping access to the NLRB's systems, including to sensitive case files. He said that beginning in early March, logging protocols created to audit users appeared to have been tampered with, and that he had detected the removal of about 10 gigabytes worth of data from NLRB's network sometime thereafter.\n\n> That kind of spike is extremely unusual because data almost never directly leaves NLRB's databases,\" Berulis said in his affidavit.\nA spokesperson for Musk's team - officially known as U.S. DOGE Service - didn't immediately return a message seeking comment. A message left with the NLRB also wasn't immediately returned, although NPR, which first reported the story, opens new tab, quoted an NLRB spokesperson as disputing Berulis' claims and saying there had been no breach. Cotton and Warner didn't immediately return messages seeking comment.\n\n> NPR, which said it interviewed 30 sources in government, law enforcement, the cybersecurity industry, and the labor movement about the complaint, said that the disabling of logging software was reminiscent of cybercriminal behavior.\n\n>Berulis' affidavit said that an effort by him and his colleague to formally investigate and alert the Cybersecurity and Infrastructure Security Agency (CISA) was disrupted by higher-ups without explanation. A message left with CISA wasn't immediately returned.",
                "I heard about this on NPR. What NPR reported but is not included in this article, is that they detected remote logins using legitimate usernames and passwords, but originating from a Russian IP address. So not only is DOGE removing information, but they’ve given remote access to Russia. 99.9999999% chance this isn’t the only agency they now have access to.\n\nEdit:  it is in the article. I missed it.",
                "Quote from the legal document presented by the NLRB's lawyers\n\n\n>This declaration details DOGE activity within NLRB, the exfiltration of data fromNLRB systems, and – concerningly – near real-time access by users in Russia. \n\n\n>Notably,within minutes of DOGE personnel creating user accounts in NLRB systems, onmultiple occasions someone or something within Russia attempted to login using all ofthe valid credentials (eg. Usernames/Passwords).\n\n\nHoly fuck. Sends chills down my spine. They are really russian assests that have infilitrated the highest levels of The U.S. government.\n\n\nBlood will spill over all of this shit",
                "Whichever departments are still untouched should probably get going on independent backups of their data.",
                "I can only imagine what DOGE would be doing at the NLRB… oh wait, targeting union organizers. \n\nIt is happening.",
                "Yeah, everyone in tech knew this was a disaster both happening and in the making.\n\nWhat can you do though, when the population elects a disaster?\n\nYou just have to wait for it to play out, while knowing their denial means they'll never even accept they created the disaster.",
                "DOGE itself is the cyber breach. Anything else is just additional damage."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Funeral to be held for Idaho teen with autism shot 9 times by police in his yard",
            "external_url": "https://www.nbcnews.com/news/us-news/funeral-held-idaho-teen-autism-shot-9-police-yard-rcna201360",
            "upvotes": 15420,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-victor-perez-mn-1305-dda988.jpg",
            "top_comments": [
                "As a parent to a son with autism this story scares the shit out of me.",
                "Here is the number for the Pocatello Mayor’s office if you’d like to voice your dismay over this murder:\n\n208-234-6163",
                "they'll try to justify this moment to themselves for the rest of their lives, and the law may address it one way or the other, but every one of them who fired their gun just *murdered* this kid.",
                "These fucking pigs had a goddamn fence between them and the kid that looked like he couldn’t even walk and unloaded on him in less than 15 seconds from the time they arrived. Fuck all of them.",
                "We have the video. The kid could barely stand up, was 6 feet behind a fence, and the cops started shooting almost immediately after getting out of their cars. This was a straight up murder. \n\nI have autism and mental illness and spend a lot of time with people who could easily become this boy. It's really scary.",
                "Shithole country. Anywhere else, no less than the president or prime minister would be addressing the entire nation.",
                "Crazy that a disabled child scared these officers enough that they immediately drew service weapons and didn't even consider less lethal means. Really speaks poorly of their character and courage.",
                "I've watched several videos of teens with autism getting man-handled or straight up physically abused by cops because of spasms or whatever else. It's pretty horrifying to think about. This is the worst case I think i've heard about. Just absolutely mind boggling. So much wrong..",
                "\\> \"In this case, two individuals were within a few feet of an armed, non-compliant individual,\" Schei [said at a news conference on Monday](https://www.youtube.com/watch?v=BDrQT0TkNGo). \"The risk was immediate, and the situation rapidly evolving.\"\n\n  \nOh fuck ALL the way off. I'm so tired of this.",
                "They went and executed this kid. Fuck those pigs. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Indiana mom brought gun to grade school and threatened lesbian teacher, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/mom-arrested-bringing-gun-indiana-elementary-school-harassing-teacher-rcna201316",
            "upvotes": 13288,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-wthr-mom-gun-3-ew-1120a-033dc9.jpg",
            "top_comments": [
                "> Police let Rivers go, but then she sent a threatening message to her daughter's teacher 25 minutes later, the affidavit states.\nRivers told the teacher that \"god will condemn you to hell\" and that \"your (sic) a child predator,\" the affidavit states.\nRivers allegedly told the teacher to \"say ur prayers and kiss ur kids goodbye and goodnight u never know when god says its (sic) our time so be prepared.\"\n\nThis person plans to homeschool their child? Maybe they can take lessons in spelling together. Sadly, the thing they're most likely to teach their child is hatred.",
                "Carrying a gun on a school campus and threatening a teacher cause they used a pride flag that said “be kind” on it as one of her several examples. I don’t know God, but I have a hard time they would want this person speaking for them. \n\nAlso, I feel horrible for that kid. Their parents are beyond psycho and now they’ll be “homeschooled” away from any protection. ",
                ">The teacher, who keeps a picture of her wife and daughter on her desk, told police that she \"gave an assignment to the whole class with the subject matter of flags.\" When she was giving examples of country flags, she also referenced the rainbow flag in the classroom with the words \"be kind\" on it, the affidavit said.\n\n>Rivers told the teacher she disagreed with an assignment, accusing the educator of \"trying to push her personal agenda in regard to sexuality on her daughter,\" the affidavit said. The teacher said she allowed Rivers' daughter to skip the assignment.\n\nRemember that time Jesus said fuck being kind to people?\n\n  \nAlso just imagine living in so much fear that you feel the need to bring a gun to drop off your kid. That level of paranoia is just unfathomable to me.",
                "Hilarious that her excuse as a responsible gun owner was that she \"didn't even realize she had it on\" and has committed the same crime of bringing it to a school multiple times in the past",
                "When \"Be Kind\" is enough to provoke people to threats and violence, maybe it's time to take a deeper look at where these people are getting indoctrinated.",
                "Them Christian values. I doubt any of them actually reads the Bible. Just a club to hate on people.\nLol",
                "Why does this Indiana family feel the need to be armed constantly?  The armed and abusive mother seems to have paranoia and an anger issue.  She was a threat to everyone on campus at the time she massively acted out.  If she was so upset about her child’s teacher’s sexuality, she should have requested a class transfer, changed schools or home-schooled.  She should start with gun safety rules & regulations.",
                "They didn't even arrest her for the gun initially. All this was swept away with a warning but then ole girl doubles down and makes more threats 25 minutes later. Somebody tell her white privilege has a 30 minute cool down before it can be used for the same thing again.",
                "Will POTUS say “whack job” as he did regarding the arsonist who attacked the Pennsylvania’s Governor’s Mansion???",
                "I wonder what would happen if a gay person showed up to a school with a gun and threatened to shoot a straight teacher for having a picture of their family on their desk 🧐"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "EU tightens asylum rules with list of 7 safe countries",
            "external_url": "https://dw.com/en/eu-tightens-asylum-rules-with-list-of-7-safe-countries/a-72261352",
            "upvotes": 3,
            "date": "04/16/2025",
            "thumbnail": "https://static.dw.com/image/68608932_6.jpg",
            "top_comments": [
                "ARTICLE:\n\nThe European Union on Wednesday published a list of seven countries that it considers “safe,” as member states seek to speed up migrant returns.\n\nThe list includes Kosovo, Bangladesh, Colombia, Egypt, India, Morocco and Tunisia.\n\nWHAT DOES THIS MEAN FOR ASYLUM CLAIMS?\n\nThe expanded list means EU member states will process applications from the countries deemed safe using an accelerated procedure because they have a low chance of success.\n\n“Many member states are facing a significant backlog of asylum applications, so anything we can do now to support faster asylum decisions is essential,” said Magnus Brunner, the EU’s commissioner for migration.\n\nAlthough the EU presented a similar list in 2015, the plan was abandoned due to heated debates over whether or not to include Turkey.\n\nWHY IS THE CHANGE BEING MADE NOW?\n\nBrussels is under mounting pressure to crack down on irregular arrivals and ramp up deportations, as hard-right parties ride a wave of anti-migrant sentiment across Europe.\n\nHawks including Sweden, Italy, Denmark and the Netherlands in October demanded fast-tracked legislation to boost returns — and urged the Commission to act swiftly.\n\nItalian Interior Minister Matteo Piantedosi said the change “constitutes a success for the Italian government, which has always worked both at a bilateral and multilateral level to obtain the revision of the regulation.”"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Rapper Lil Nas X hospitalized after experiencing partial facial paralysis",
            "external_url": "https://www.denver7.com/entertainment/celebrity/rapper-lil-nas-x-hospitalized-after-experiencing-partial-facial-paralysis",
            "upvotes": 191,
            "date": "04/16/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3be5c82/2147483647/strip/true/crop/3371x1770+0+235/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9c%2F21%2F2645e6684de2b4cc55920fb0d407%2Fap24173716356680.jpg",
            "top_comments": [
                "> The video shows him in a hospital bed, attempting to smile. \"This is me doing a full smile right now by the way,\" he said, as only half his face can be seen smiling.\n\"I can't even laugh right,\" he added.\n\nI hope he makes a full recovery. Suddenly experiencing paralysis in any part of your body has to be deeply frightening.",
                "Can be any number of issues.  Hopefully something easily treatable and resolved.  Facial paralysis is absolutely frightening though.",
                "I had partial facial paralysis last year, turned out it was lyme disease. Check for ticks y'all, it's no joke",
                "Hope he recovers",
                "Maybe he caught it from Justin Bieber",
                "That’s what you get for making a pact with the devil over some Nikes.",
                "Might be a palsy or something. It's scary when your body suddenly goes haywire for no clear reason.",
                "Bells palsey is surprisingly common. Most often caused due to stress. I had it happen to me in my early 20s.  Had to take steroids for about a month and everything was fine. ",
                "(Medical) Industry, baby"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Colossal squid filmed by scientists for first time in ocean",
            "external_url": "https://www.bbc.com/news/articles/c99pg13yv32o",
            "upvotes": 127,
            "date": "04/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2bb2/live/f2155750-1ad0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "Excerpt from Lewis Adams, BBC News - Essex:\n\nA colossal squid has been filmed in its natural environment for the first time since the species was discovered 100 years ago.\n\nThe 30cm-long (11.8in) juvenile was caught on camera at a depth of 600m (1,968ft), near the South Sandwich Islands in the south Atlantic Ocean.\n\nA team of scientists, led by a University of Essex academic, recorded the footage in March during a 35-day quest to find new marine life.\n\nExperts believe colossal squid can grow up to 7m (23ft) in length and weigh up to 500kg (1,100lb) - making them the heaviest invertebrate on the planet.\n\nThe mollusc was discovered on the 100-year anniversary of it first being identified and named.",
                "Colossal squid filmed for the first time.\n\n*Actually read the article*, the 30cm squid.\n\n*deception*",
                "I thought for sure this AI at first, because of the previously undescribed ability for the biggest squid in the ocean to turn invisible",
                "Too bad they got a small baby one",
                "What a wee little sea monster. This is actually really amazing footage.",
                "Can grow up to 23 feet and weigh as much as 1,100 pounds. Jesus. lol.",
                "There was an Aquaman run where the sea had portals to alien planets.  I'm starting to think it was onto something.",
                "I hate this article so much. It’s a baby that isn’t even a foot long."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Tuvalu unveils first cash machines in 'momentous' ceremony",
            "external_url": "https://www.bbc.co.uk/news/articles/ce3vyvdz1pko",
            "upvotes": 19,
            "date": "04/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/761d/live/aec3c9a0-1aa8-11f0-b2d9-cd64aa030d1c.jpg",
            "top_comments": [
                "\"Country that may be completely underwater in fifty years gains access to world economic system that makes their doom possible\".",
                "There are places in the world where people still use cash? Crazy! ",
                "That must have been a nightmare to have to go to a bank each time you need money."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "PennLive: Suspect in arson at Pennsylvania governor’s home targeted the governor for his views on war in Gaza, warrant says | CNN",
            "external_url": "https://www.cnn.com/2025/04/16/us/cody-balmer-search-warrant-shapiro-arson-motive/index.html",
            "upvotes": 294,
            "date": "04/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25104822596678.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He called and told them why he did it an hour after the arson. They knew at the time. They knew he did it because of Palestine and Shapiro's religion and they waited until the story died out to give us that info. Expect this story to disappear now",
                "Hes a Nazi associated with a Nazi death magic incel cult, how are the still considering if antisemitism is a factor????",
                "i am confused. is this dude a neo-nazi or a hamas supporter?",
                "What did you guys think \"Globalize the Intifada\" meant?",
                "So... Trump and his regime are going to announce intents for terrorism charges, right? They were so quick to do that for tesla or the pharma ceo.\n\nI mean trump and his regime, specifically. The prosecutor announced a plan for terrorism charges. But with how vocal trump was about punishing people for tesla attacks, did TRUMP himself actually say anything about terrorism charges. Last i saw he just gave a brush off answer and called the guy a whackjob. But he didn't go on a big tirade about punishing the person like he has for people going after tesla.",
                "\\*Crickets\\*\n\nWell Reddit, you got your Intifada. You got your \"justified resistance\" against the evil Zionists.\n\nDoes it feel yucky or does seeing Jews attacked for existing not really bother you?",
                "a nazi caring about Palestanians? Yeah sure buddy"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 1576,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "Check Fraud. They committed check fraud.",
                "Fraud not Glitch but what do I know.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "I still think it’s dumb that the people that did this refer to it as a “glitch”. \n\nBut what else to expect from these people when they use the funds to buy something stupid like a Gucci wallet. It gives me strong PPP loan without a business vibes. ",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "“Infinite money glitch” aka fraud",
                "Of all the institutions to mess with, these bozos chose JP Morgan Chase. Zero sympathies."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "2 service members killed at US-Mexico border area in vehicle accident: NORTHCOM",
            "external_url": "https://abcnews.go.com/US/2-service-members-killed-us-mexico-border-vehicle/story?id=120847917",
            "upvotes": 53,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/72caa813-3780-4c3c-96a0-00cbdebd068b/mexico-border-troops-rt-jt-250415_1744751253599_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Edit your headline:\n\n\"Two Service Members Lives Wasted on Needless Political Spectacle\"\n\n  \nAccidents happen. Accidents happen all too often when you place young men & women in situations where they are tasked with operating heavy equipment and machinery while overburdened, fatigued, in austere conditions. A military life is not always a safe life. They weren't drafted, they volunteered, but that's no reason to exploit their commitment to service by placing them in an environment that makes accidents like this more likely. \n\nMake no mistake, the entire Border mission is a political show to appease the current administration. The US Army is not trained to conduct these operations, nor is it part of their roles as defined in current military doctrine. Border security is the responsibility of Customs and Border Patrol - something this government continues to fail to remember. If CBP is unable to perform their duties, it should NOT fall upon the Armed Forces to pick up their slack. A Stryker (like the one depicted in the photo attached to this article) is overkill and wasteful for the role assigned, which would be under normal circumstances be performed by a CBP officer in a CBP Ford Expedition or similar SUV. Which perfectly encapsulates the overwrought optics of this whole sideshow.\n\nTwo Americans died, needlessly, in a situation they should never have been in. Contact your Representatives.\n\n\\- A Retired Officer",
                "One time, I was camping near the border, driving along a two track road that was frequented by military and border patrol agents. I saw a truck approach from the opposite direction, and pulled as far to the side as I could to let them pass. \n\nThey proceeded to run full speed into an ironwood tree, completely wrecking their nice, new truck. I pulled past them, and, kind of in disbelief, asked the driver if they were okay. A man in military fatigues, who looked like he had been up for days on Bang! Energy or experimental military-grade amphetamines, said to me, “that’ll buff right out”. \n\nI wonder if this accident was something like that. "
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Trump signs healthcare executive order that includes a win for pharma companies",
            "external_url": "https://www.reuters.com/world/us/trump-signs-healthcare-executive-order-that-includes-win-pharma-companies-2025-04-15/",
            "upvotes": 195,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> The wide-ranging executive order signed by Trump aims to reduce healthcare costs.\n\nNo, it doesn't. It doesn't do that and that's not the intention. Also, one of this first executive orders was to cancel a limit on medication prices.",
                "Once again Trump does something that literally only benefits his wealthy friends and donors, but will somehow still be defended as a champion of the common man by the GOP.",
                "He finally revealed his healthcare plan I see",
                "best part of the whole article was Phatm companies arguing medicade price negotiations early stifle innovation.\n\n\nThey are literally saying they are more motivated by money than actually curing diseases and stopping people from dieing. without the finacial incentive to gouge people your honor who would create new drugs to save lives. \n\n\nIm pretty sure most of those scientist that work relentlessly to find cures did it because they hate seeing people suffer not because they wanted to get rich",
                "How many executive orders is this now?",
                "Trump hurts his main base and his main base loves him for it. Again.",
                "What about for the American people?",
                "Is he just signing EO after EO, with Congress not bothering with bills or anything else now?",
                "Okay I read the article twice and I still don't understand. Is the key thing here that it's going to mean that Medicare can't negotiate prices until they've been on the market for an extended period of time? I read the title I an assume bad, but the article itself doesn't seem to make it 'bad', but I'm making an assumption that it isn't all rainbows and unicorn farts.",
                "Of course he did. The problem with healthcare clearly is that the rich don't make enough money gouging people. So we need to make sure they get to garnish your paychecks if you're unlucky enough to need their medicines in order to live."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Judge temporarily blocks Trump's order targeting law firm: 'Shocking abuse of power'",
            "external_url": "https://abcnews.go.com/US/judge-blocking-trumps-order-targeting-dominion-voting-systems/story?id=120836536",
            "upvotes": 653,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f5cc51ca-7f0a-4200-af07-cf3130d53df4/donald-trump-20-gty-gmh-250414_1744648216764_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"Personal vendetta,\" and \"Executuve Order,\" should never be in the same sentence.",
                "Are you telling me that the petty orange man who is officially above the law is acting petty?",
                "Yes, it is an abuse of power.\n\nIs it really still shocking that the pathetic tantruming toddler is going after people who were tewwibly mean to him?",
                "No one should be ‘shocked’ by his abuse of power. He has abused power nearly every single day he has blighted the office. Both terms. And ‘nearly’ is almost certainly being laughably generous.",
                "[removed]",
                ">Since Trump began targeting law firms, nine of the country's largest law firms -- including Paul Weiss, Kirkland & Ellis, Willkie Farr and Latham & Watkins -- have agreed to provide a combined $940 million in legal services to promote causes supported by the president.\n\nIt didn't help that so many law firms instantly caved and gave Trump free services. It was pure extortion. I realize they did the math and made a business decision, but you can't trust Trump to honor his word. And do they even know what \"causes supported by the president\" means?\n\nThe same thing is going to ultimately screw us on trade. How do you make a deal when you can't trust the other party and they also won't follow decisions by the courts? What recourse do you have when the market changes and Trump says the deal needs to be renegotiated 3 months from now?",
                "Between using the Presidency to play out vendettas against personal enemies (real and imagined), defaming the people \"accidentally\" sent to prison in El Salvador, trying to control the press, the tariff mess, and decorating the White House (and his golf club) with art based on his odd assassination attempt, there has to be grounds to impeach Trump simply based on his incompetency and obvious insanity.\n\nMaybe I'm just wishful thinking, but if  there isn't a dumb motherfucker clause somewhere in the Constitution, we should start working on an amendment ASAP."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Protester tased by police at Marjorie Taylor Greene's Georgia town hall",
            "external_url": "https://apnews.com/video/demonstrator-apprehended-during-congresswoman-marjorie-taylor-greenes-georgia-town-hall-34521ef711774381acc3e94863a6d371",
            "upvotes": 1964,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My favorite part is that she reportedly said something along the lines that she doesn't tolerate heckling at her town halls.\n\nThis is after all she has ever done is heckle, scream, and rant conspiracy theories for the last 4 years during Biden's administration. The hypocrisy is palpable.",
                "I take it she should have been tased at Biden’s SotU address? 🤔",
                "\"sit and listen\"  \nLady, this is a town hall, not a re-education camp.",
                "So she was removing anybody who stood up and disagreed with her? And they'd get tased if they didn't listen? Party of free speech, everybody.",
                "Of course it would be at a MTG event...",
                "MtG and Boebert screeched like howler monkeys and heckled Biden during his state of the union address. This is rich coming from this hypocritical cu*t. ",
                "I guess she didn’t want to listen to her constituents concerns.  And this coming from one the best hecklers in the party.",
                "Two people were tased, three arrested and at least 6 were escorted out. \n\nAnd if it turns out that all of them were white except the two that were tased, would any of us be remotely surprised?",
                "Now we tase US CITIZENS from town halls, because they disagree? \n\nA taser can kill a human, just as easy as any other weapon. All those “officials” should be in jail for doing this to an AMERICAN.",
                "The party of free speech sure doesn't like when you exercise it"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "PennLive: Suspect in arson at Pennsylvania governor’s home targeted the governor for his views on war in Gaza, warrant says | CNN",
            "external_url": "https://www.cnn.com/2025/04/16/us/cody-balmer-search-warrant-shapiro-arson-motive/index.html",
            "upvotes": 300,
            "date": "04/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25104822596678.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He called and told them why he did it an hour after the arson. They knew at the time. They knew he did it because of Palestine and Shapiro's religion and they waited until the story died out to give us that info. Expect this story to disappear now",
                "Hes a Nazi associated with a Nazi death magic incel cult, how are the still considering if antisemitism is a factor????",
                "i am confused. is this dude a neo-nazi or a hamas supporter?",
                "What did you guys think \"Globalize the Intifada\" meant?",
                "So... Trump and his regime are going to announce intents for terrorism charges, right? They were so quick to do that for tesla or the pharma ceo.\n\nI mean trump and his regime, specifically. The prosecutor announced a plan for terrorism charges. But with how vocal trump was about punishing people for tesla attacks, did TRUMP himself actually say anything about terrorism charges. Last i saw he just gave a brush off answer and called the guy a whackjob. But he didn't go on a big tirade about punishing the person like he has for people going after tesla.",
                "\\*Crickets\\*\n\nWell Reddit, you got your Intifada. You got your \"justified resistance\" against the evil Zionists.\n\nDoes it feel yucky or does seeing Jews attacked for existing not really bother you?",
                "a nazi caring about Palestanians? Yeah sure buddy"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 1578,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "Check Fraud. They committed check fraud.",
                "Fraud not Glitch but what do I know.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "I still think it’s dumb that the people that did this refer to it as a “glitch”. \n\nBut what else to expect from these people when they use the funds to buy something stupid like a Gucci wallet. It gives me strong PPP loan without a business vibes. ",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "“Infinite money glitch” aka fraud",
                "Of all the institutions to mess with, these bozos chose JP Morgan Chase. Zero sympathies."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Protester tased by police at Marjorie Taylor Greene's Georgia town hall",
            "external_url": "https://apnews.com/video/demonstrator-apprehended-during-congresswoman-marjorie-taylor-greenes-georgia-town-hall-34521ef711774381acc3e94863a6d371",
            "upvotes": 1961,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My favorite part is that she reportedly said something along the lines that she doesn't tolerate heckling at her town halls.\n\nThis is after all she has ever done is heckle, scream, and rant conspiracy theories for the last 4 years during Biden's administration. The hypocrisy is palpable.",
                "I take it she should have been tased at Biden’s SotU address? 🤔",
                "\"sit and listen\"  \nLady, this is a town hall, not a re-education camp.",
                "So she was removing anybody who stood up and disagreed with her? And they'd get tased if they didn't listen? Party of free speech, everybody.",
                "Of course it would be at a MTG event...",
                "MtG and Boebert screeched like howler monkeys and heckled Biden during his state of the union address. This is rich coming from this hypocritical cu*t. ",
                "I guess she didn’t want to listen to her constituents concerns.  And this coming from one the best hecklers in the party.",
                "Two people were tased, three arrested and at least 6 were escorted out. \n\nAnd if it turns out that all of them were white except the two that were tased, would any of us be remotely surprised?",
                "Now we tase US CITIZENS from town halls, because they disagree? \n\nA taser can kill a human, just as easy as any other weapon. All those “officials” should be in jail for doing this to an AMERICAN.",
                "The party of free speech sure doesn't like when you exercise it"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Rapper Lil Nas X hospitalized after experiencing partial facial paralysis",
            "external_url": "https://www.denver7.com/entertainment/celebrity/rapper-lil-nas-x-hospitalized-after-experiencing-partial-facial-paralysis",
            "upvotes": 191,
            "date": "04/16/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3be5c82/2147483647/strip/true/crop/3371x1770+0+235/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9c%2F21%2F2645e6684de2b4cc55920fb0d407%2Fap24173716356680.jpg",
            "top_comments": [
                "> The video shows him in a hospital bed, attempting to smile. \"This is me doing a full smile right now by the way,\" he said, as only half his face can be seen smiling.\n\"I can't even laugh right,\" he added.\n\nI hope he makes a full recovery. Suddenly experiencing paralysis in any part of your body has to be deeply frightening.",
                "Can be any number of issues.  Hopefully something easily treatable and resolved.  Facial paralysis is absolutely frightening though.",
                "I had partial facial paralysis last year, turned out it was lyme disease. Check for ticks y'all, it's no joke",
                "Hope he recovers",
                "Maybe he caught it from Justin Bieber",
                "That’s what you get for making a pact with the devil over some Nikes.",
                "Might be a palsy or something. It's scary when your body suddenly goes haywire for no clear reason.",
                "Bells palsey is surprisingly common. Most often caused due to stress. I had it happen to me in my early 20s.  Had to take steroids for about a month and everything was fine. ",
                "(Medical) Industry, baby"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Google sued for £5bn in UK over allegations of shutting out rivals",
            "external_url": "https://www.theguardian.com/technology/2025/apr/16/google-sued-for-5bn-in-uk-over-allegations-of-shutting-out-rivals",
            "upvotes": 341,
            "date": "04/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/892020dae5da3666bf6ee7a6e7c3cdb4d6b310ba/0_0_2124_1274/master/2124.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a43d6e9310c555b9c85327be466bab79",
            "top_comments": [
                "Google anti-competitive!?  Say it ain't so!!!"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "RISING",
            "title": "U.K. Top Court Says Trans Women Are Not Legally Women Under Equality Act",
            "external_url": "https://www.nytimes.com/2025/04/16/world/europe/uk-supreme-court-woman-definition-trans.html?unlocked_article_code=1.AE8.cfzk.pIrpb0-Czz4_&smid=url-share",
            "upvotes": 5437,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” He said the ruling “does not cause disadvantage to trans people” because they have protections under anti-discrimination and equality laws.\n\n>Lord Hodge began his remarks by acknowledging the national conversation about transgender rights and protections, and described trans people as a “vulnerable and often harassed minority,” while noting that women had fought for centuries for equal rights.\n\n>He added: “It is not the task of this court to make policy on how the interests of these groups should be protected” but “to ascertain the meaning of the legislation which Parliament has enacted.”\n\n  \n   \n   \nSo yeah they’re just interpreting something, it doesn’t mean the Act can’t be changed.",
                "I find it interesting and revealing that the debate is *always* over the definition of \"woman\" and never the definition of \"man\".",
                "For the Americans: Watch how many anti-trans comments pop up, then remember:  \n\n- A teacher in Florida was fired for using a 17 year olds preferred name.\n- Republican lawmakers in Arkansas want to ban children from getting haircuts that “don’t match their gender”\n- A cis woman was fired from her job at Walmart because a male customer followed her into the bathroom and accused her of being trans, all because she happed to be tall for a woman. \n\nAll of this has happened in the last month in America. Normalizing trans hatred will lead to a destruction of all our civil rights. People should be free to dress how they please without fear of being targeted by our government.",
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” \n\nTOO LATE, it is already here. \n\nWe will be flooded with \"the great vitory of the common sense\" from thousands and thousands of news site, propagandas, and pundits. \n\nAnd there will be counter fire from opposite position.",
                "This will age as well as what the UK did to Alan Turing.",
                "Someone once said. \"Let it be\". Nowadays some people just won't let it be. Sad times.",
                "Massive blow to feminism. This ruling will be used to persecute women of all presentations and genders. Cisgendered women who don’t fit into the narrow box of “woman” will be harassed and oppressed double fold.",
                "When are we going to properly talk about sex v gender.   They are being exchanged so readily with little understanding. I recall a man on LBC happily declaring there are only two genders because you are born that way. 🤔",
                "[removed]",
                "The uk taking a page out of the USA book?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Judge temporarily blocks Trump's order targeting law firm: 'Shocking abuse of power'",
            "external_url": "https://abcnews.go.com/US/judge-blocking-trumps-order-targeting-dominion-voting-systems/story?id=120836536",
            "upvotes": 649,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f5cc51ca-7f0a-4200-af07-cf3130d53df4/donald-trump-20-gty-gmh-250414_1744648216764_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"Personal vendetta,\" and \"Executuve Order,\" should never be in the same sentence.",
                "Are you telling me that the petty orange man who is officially above the law is acting petty?",
                "Yes, it is an abuse of power.\n\nIs it really still shocking that the pathetic tantruming toddler is going after people who were tewwibly mean to him?",
                "No one should be ‘shocked’ by his abuse of power. He has abused power nearly every single day he has blighted the office. Both terms. And ‘nearly’ is almost certainly being laughably generous.",
                "[removed]",
                ">Since Trump began targeting law firms, nine of the country's largest law firms -- including Paul Weiss, Kirkland & Ellis, Willkie Farr and Latham & Watkins -- have agreed to provide a combined $940 million in legal services to promote causes supported by the president.\n\nIt didn't help that so many law firms instantly caved and gave Trump free services. It was pure extortion. I realize they did the math and made a business decision, but you can't trust Trump to honor his word. And do they even know what \"causes supported by the president\" means?\n\nThe same thing is going to ultimately screw us on trade. How do you make a deal when you can't trust the other party and they also won't follow decisions by the courts? What recourse do you have when the market changes and Trump says the deal needs to be renegotiated 3 months from now?",
                "Between using the Presidency to play out vendettas against personal enemies (real and imagined), defaming the people \"accidentally\" sent to prison in El Salvador, trying to control the press, the tariff mess, and decorating the White House (and his golf club) with art based on his odd assassination attempt, there has to be grounds to impeach Trump simply based on his incompetency and obvious insanity.\n\nMaybe I'm just wishful thinking, but if  there isn't a dumb motherfucker clause somewhere in the Constitution, we should start working on an amendment ASAP."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "China appoints new trade envoy in face of tariff turmoil",
            "external_url": "https://www.bbc.com/news/articles/c8jem097l4do",
            "upvotes": 263,
            "date": "04/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2588/live/bb2b9410-1a95-11f0-849e-f3d9ffdf9a20.jpg",
            "top_comments": [
                "Man cannot be happy about this \"promotion\", Xi's so fed up dealing with one mans bullshit that he found a poor soul to take the weight of his shoulders.\n\nThat's a man who knows life is going to be shit with a lot of being woken up in the middle of the night for the next dumpster fire.\n\nEdit: Should've read the article first, my bad \"veteran trade negotiator Vice Commerce Minister Wang Shouwen.\" was not dealing with this shit."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Students at Pentagon schools sue Hegseth over book bans on race and gender",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/15/pentagon-school-students-sue-hegseth-book-bans",
            "upvotes": 11216,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/caaae65eb27630f687c14b7d9959ff71cd2535b1/0_132_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4d47af90949621427408888e44f34624",
            "top_comments": [
                "\"We do not want someone who does not know how to read books to tell us what we can and can not read. \"\n\n  \nA solid moral argument.",
                "This administration has important things to do, like repealing the definition of \"Showerhead\" (see [section 2](https://www.whitehouse.gov/presidential-actions/2025/04/maintaining-acceptable-water-pressure-in-showerheads/)) presumably because the current definition of a showerhead is too woke for Republicans.",
                "I spent most of my young life in these schools and graduated at one.  It takes big balls to do what they're doing because in our (the students/military dependents) lives, our actions reflect on our military sponsor (mom or dad in service)  In that community, you don't rock the boat because it could impact your parent/s career.  It shouldn't, but especially under this administration you can bet that Trump will end the military family member's career over this.",
                "Hegseth wanted to do a book burn, but they were to scared of his flammability to proceed. From the liquor. Because he’s a white nationalist alcoholic. And a rapist. ",
                "There are schools at the pentagon?",
                "Hegseth responded \"Something, something, lethality, something something War fighters, something, something mission...\" Then smiled, flexed, and pretended to do really bad pushups.",
                "The last book Hegseth finished, he failed to color inside the lines.",
                "Kids going in the DoDDS (sorry, I know they've changed the name since the 80s) system are exposed to more of the world and culture than their counterparts in the normal US school system. These schools are by nature as diverse as the military that their parents serve in and tend to produce excellent students. \n\nAlthough, their hiring practices in the 80s left alot to be desired. I don't think they're hiring teachers with super obvious personality disorders like they were in then. I'm looking at you, Ms. Hilton and Ms Rector.",
                "*There's more than one way to burn a book. -Ray Bradbury*",
                "Keep the pressure up! No rest till 2029!"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Marshall man claims ICE detained him for protests over police killings",
            "external_url": "https://www.mprnews.org/story/2025/04/15/marshall-man-claims-ice-detained-him-for-protests-over-police-killings",
            "upvotes": 2641,
            "date": "04/16/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Well, the gestapo is alive and well and it’s in the form of ice.",
                "Incredibly Corrupt and Evil",
                "I have decided that henceforth I shall call them the Gicetapo.",
                "Police killings, you say? Didn't trump just pardon a whole bunch of police killers?",
                "Welcome to the Fourth Reich everyone.",
                "I wouldn't be surprised if he gets sent to el Salvador instead of Indonesia...",
                "I am not religious but they probably are. On judgement day, they will go straight to hell",
                "Bunch of human traffickers",
                "Estimates are that by 2035 the US will be a net negative in population growth - there will be more people dying than being born. Any guesses as to what that means when you need to call a plumber, a doctor, a mechanic? I  won't live that long to see it, but I know for a fact the day will come when our country will be begging for the hardworking, contributing, positive citizens that we're now booting from the country. This thuggery from our pseudo-president is Un-American and Un-Constitutional. I pray there will be trials, someday, for the perpetrators of these criminal acts and neglect for law and order.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/16/2025 16:11:17 UTC"
}