{
    "posts": [
        {
            "category": "HOT",
            "title": "2 shot, 1 fatally, in Washington DC; Israeli embassy staffer believed to be among victims: police",
            "external_url": "https://abc7.com/post/2-shot-1-fatally-outside-capital-jewish-museum-washington-dc-israeli-embassy-staff-among-victims-police-say/16500500/",
            "upvotes": 4191,
            "date": "05/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16500912_052125-wabc-dc-shooting-img.jpg?w=1600",
            "top_comments": [
                "Two embassy staffers are dead. A man and a woman. Shooter apprehended.\n\nhttps://www.cnn.com/2025/05/21/politics/individuals-connected-to-israeli-embassy-shot-in-dc-sources-says",
                "This is gonna be a world class shitshow.",
                "Ahh shit this won’t be good",
                "[\"Suspect chanted 'Free-Free Palestine' while in custody.\" ](https://www.youtube.com/live/nGVVRy0vimE?t=1113s) - Seems like a political motive is confirmed.",
                "Suspect identified as Elias Rodrigues from Chicago IL.",
                "*”The shooting happened outside of an event at the Capital Jewish Museum, law enforcement sources said.”*\n\n*”One man and one woman -- both staff members at the Israeli Embassy -- were shot and killed as they exited an event on Wednesday night, officials said”*\n\n*”The suspect [in custody] in the shooting has been identified as a 30-year-old man from Chicago, Washington, D.C. Police Chief Pam Smith said.”*\n\n*”She also said the suspect shouted \"free, free Palestine\" after his arrest.”*\n\nWhatever “justice” the perpetrator thought they were achieving is only going to make things worse for everybody. Way to go dipshit",
                "regardless of the debate of judaism vs zionism, this is going escalate things in a nerve wracking way.\n\nand with palestine as well as other things trump is doing, this is gonna be an interesting summer.",
                "Listen to the suspect chant the mantra, \"Free, free Palestine\"\n\nhttps://x.com/YuvalDavid/status/1925408541042446484?t=Mw13Tpo992p-p5yISts-4g&s=19",
                "It would be nice if just one day this year could not be a shit show",
                "The male victim, Yaron, was a classmate of mine. May his memory be a blessing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 7928,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "Always wear your seatbelt",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "In separate crashes, what are the odds of that? Poor kid.",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH.",
                "That stretch of LA 67 has a long history of high‑severity crashes—especially in low‑light or early‑morning conditions. In 2022 they found that 47 crashes happened over just three years at the LA 67/72nd Avenue intersection—roughly 16 crashes per year. [Source](https://movebr.brla.gov/assets/documents/final-plans/Plank-Road%20-Design-Study%20-Report_02-28-2022-web.pdf?utm_source=chatgpt.com)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 27568,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                "Maybe they will hire AI agents/bots to restock shelves and ai registers.  And maybe they can sell their goods exclusively to AI families.",
                "Maybe they should not have bent over for one group and their king?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "\"Go woke go broke, am I right?\" LMAO. It's hilarious to me these big corporations took the the threat of....broke ass people who don't spend any money in their stores anyway....seriously. Instead they decide to piss off the people who have money and \\*used\\* to shop there. \n\nKeep soaring, Costco!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "'Serious' accident at North Korea warship launch ceremony",
            "external_url": "https://www.channelnewsasia.com/east-asia/north-korea-warship-launch-serious-accident-5145951?cid=internal_sharetool_iphone_22052025_cna",
            "upvotes": 1988,
            "date": "05/22/2025",
            "thumbnail": "https://dam.mediacorp.sg/image/upload/s--grLCuTo7--/c_crop,h_450,w_800,x_0,y_61/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-05-22t011638z_3_lynxmpel4l00t_rtroptp_3_northkorea-navy.jpg?itok=IBofV_y-",
            "top_comments": [
                "The long and short of it is somebody fucked up and it messed up the bottom of the boat so it no longer was balanced correctly. Kim Jong-un said that it was basically a criminal act of carelessness and that shit is gonna be done about it.",
                "Someone is about to get killed by cannon fire again.",
                "This is their brand new ship they've been bragging about. You've got to wonder if there was sabotage involved.",
                "A good steering wheel that doesn’t fly out of your hand while you’re sailing",
                "They should've slapped it and say, \"that will hold.\"",
                "Did the front fall off?",
                "Someone is going to be artillery’d to death.",
                "Maybe Dennis Rodman can go over there and give him a pep talk",
                "Do you think he’s just in a constant state of embarrassment?",
                "No worry. This Korean nesting ship design. We open broken ship and slightly smaller not broken ship inside"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge finds police acted reasonably in shooting New Mexico man while at wrong address",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-finds-police-acted-reasonably-shooting-new-mexico-man-wrong-addr-rcna208157",
            "upvotes": 726,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Farmington-police-shooting-RS-791813.jpg",
            "top_comments": [
                "Isn't that amazing? They can start a conflict, and when someone has a natural reaction to said conflict and exercises their supposed 2nd Amendment right, you can legally be killed.",
                "This stuff is so weird being on the outside looking in.\n\nLike, so much American insistence of having firearms to defend yourself and your property, but like then this shit happens all the time where the cops shoot the wrong person just cause they had a firearm to defend themselves because no one will know if the person bashing on their door in the middle of night screaming police is actually police or if its intruders. \n\nLike what is the play here as a citizen.",
                "The 2nd amendment is equal for all Americans, except some Americans are more equal than others…",
                "I remember saying this was going to be the outcome and all kinds of people were angry that I said that.",
                "So, you \\*don't\\* actually have a right to defend your own home, or even have a gun in your hand, if it happens to be incompetent cops trying to break in.\n\nReally seems like the only sane response is to act like cops - shoot first and ask questions never. At least that might make them hesitate.",
                "They don't value life at all",
                "If the situation had ended differently and the homeowner killed the police and then called 911, would the homeowner have 'acted responsibly'?",
                "Would the law have gone both ways? As in, if he shot and killed the cops because he thought they were intruders, would the court decide he “acted reasonably”?",
                "More proof there is no true law or justice.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 8722,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is a gaudy, flying palace? That one?",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Obligatory if Obama or Biden had done this……",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "I fucking hate this timeline",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Nike will raise prices on a wide range of products as soon as this week",
            "external_url": "https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html",
            "upvotes": 2968,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126111-17437060642025-04-03t182948z_1680382369_rc2iqdauinqb_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743706095&w=1920&h=1080",
            "top_comments": [
                "Their quality has gone way down and the price keeps going up.",
                "“The footwear giant said it regularly evaluates pricing, and did not say the changes were related to tariffs.”\n\n*insert “sure Jan” gif here*",
                "I was a huge Nike guy until a couple of years ago when I ventured into other brands like Asics, Saucony and New Balance. Not looking back, especially since the quality has gone to shite!",
                "Shit looks like I will have to continue not buying nike now!",
                "These prices are never coming back down. Even if tariffs are lifted, if consumers keep buying these products, Nike will keep the prices elevated.",
                "Guys it's only until we get the sweat shops built at home then prices will come back down. Don't worry. This isn't exactly what everyone said would happen.",
                "right when my need to buy things for no reason ends. cool!",
                "Nike will raise prices on a wide range of footwear, apparel and equipment as soon as this week as the retail industry braces for tariffs to hit its profits, CNBC has learned.\n\nPrices for Nike apparel and equipment for adults will increase between $2 and $10, a person familiar with the matter said. Footwear priced between $100 and $150 will see a hike of $5, while sneakers priced above $150 will see a $10 increase, the person said.\n\nThe price hikes will be in effect by June 1, but could be seen on shelves as soon as this week, the person said. The increases cover a large portion of Nike’s assortment, but many products will remain the same price.\n\nThe prices of children’s products will not increase, nor will items priced under $100, according to the person. The company is trying to be cognizant of the financial challenges families are facing and doesn’t want parents to see higher prices when shopping for their children during the back to school season.\n\nFurther, Nike’s Air Force 1 shoe will remain $115, the person said.\n\n“It’s a shoe that people in the workplace wear,” the person said. “It’s comfortable, accessible.”\n\nJordan brand apparel and accessories also won’t see increases, but Jordan sneakers will.\n\nNike said in a statement that “we regularly evaluate our business and make pricing adjustments as part of our seasonal planning.” The company did not say the decision was related to tariffs.\n\nWhile it is common for retailers to regularly adjust their pricing structure, the footwear industry has been particularly hard hit by President Donald Trump’s new tariffs.\n\nCurrently, Nike manufacturers about half of its footwear in China and Vietnam, which Trump has hit with his new levies. Chinese goods face a new 30% tariff, while imports from Vietnam are currently subject to a 10% duty. Trump cut the tariff rate on Vietnamese goods from 46% for 90 days in early April.\n\nTariffs are expected to hit Nike’s profit margin and it can offset the effect through price increases, especially as the sneaker giant works through a turnaround that’s taking longer than expected. Nike’s profits were already under pressure before tariffs took effect because it has needed to rely on discounting to move product.\n\nThe price hikes will be the MSRP rate that consumers see at Nike stores and on its website. It has sent a note out to wholesale partners about the price increases, but how they’ll show up at places like Dick’s Sporting Goodsand Foot Locker isn’t immediately clear.",
                "They already did. I use to buy Nike SB dunk lows for like $80, now they are $130.",
                "They charge the highest prices for shoes that are lower quality and not keeping up with competitor improvements with their shoes. Now they want to raise prices aGAIN? Good luck"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Colts owner Jim Irsay dead at 65",
            "external_url": "https://www.wishtv.com/sports/indianapolis-colts/colts-owner-jim-irsay-dead-at-65/",
            "upvotes": 1669,
            "date": "05/21/2025",
            "thumbnail": "https://www.wishtv.com/wp-content/uploads/2024/01/09/Jim-Irsay_AP22312064831966-scaled.jpg",
            "top_comments": [
                "65?? Thought the dude was in his 80s....",
                "Dude was a party animal and it eventually caught up with him.",
                "Man, y'all may not know this but he was an absolute amazing person in my interactions\n\nI used to work at the local humane society out of HS.  We had a dog there that had somehow ended up there all the way from SC.  Because no one adopted the dog, it ended up on the news and the family from SC saw the dog and said it was there's.  They didn't have the money to come get the dog, and Irsay heard about it and flew the dog down himself on his private jet.  He sent a picture to us of the dog eating steak on the jet\n\nNothing but good things to say about Mr Irsay\n\nRIP",
                "There was a rumor he OD’d in Miami and was flown back to Indy and he wasn’t doing good.",
                "He was here for a good time not a long time",
                "Dibs on the Black Strat",
                "Addiction is a disease, not a moral failure and I wish our society made that distinction.",
                "# Bill Belichick's girlfriend kicking herself right now. Wrong 1st round pick.",
                "Curious what happens with his insane guitar collection and other oddities.",
                "Man voted to ban the “Tush Push” and then dipped"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 19384,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "Six House Democrats have died in office in the past 13 months. Donald Payne Jr., Sheila Jackson Lee, Bill Pascrell, Sylvester Turner, Rayl Grijalva,  and now Gerry Connolly.",
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "[removed]",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israeli troops fire 'warning shots' at diplomats in West Bank",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250522_N02/",
            "upvotes": 1288,
            "date": "05/22/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250522_N02_1528389_L.jpg",
            "top_comments": [
                "Call it what you want, but shooting near a delegation from 20 countries is a guaranteed way to damage international credibility",
                "I have never seen a country try so hard to be hated",
                ">Israeli troops fired what they say were \"warning shots\" at a group of diplomats in the city of Jenin in the West Bank on Wednesday. The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\n\nSo the IDF has to make sure that roving gangs of *<checks notes>* diplomats don't start going to sensitive areas and chatting up the locals. So they fire some warning shots to show those diplomats who the tough guys are.",
                "Israel is just intent on isolating itself, isn't it?",
                "Everytime that I thought that this country’s brand can’t go any lower, I get surprised",
                "\"The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\"\n\nSo their solution to address who they knew were unarmed diplomats was to fire live rounds at them?\n\nThat's their preferred approach and there's no better alternatives?",
                "Hey you! Stop all the diplomacy!",
                "Every day I wake up, something makes me hate Israel more and more. \n\nAbsolutely FUCK Israel.",
                "Good Lord. Destroyed all goodwill left for them. \"Never again\".....right. ",
                "This could all stop today if Hamas would just release the hostages. -- r/worldnews probably"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge finds police acted reasonably in shooting New Mexico man while at wrong address",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-finds-police-acted-reasonably-shooting-new-mexico-man-wrong-addr-rcna208157",
            "upvotes": 730,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Farmington-police-shooting-RS-791813.jpg",
            "top_comments": [
                "Isn't that amazing? They can start a conflict, and when someone has a natural reaction to said conflict and exercises their supposed 2nd Amendment right, you can legally be killed.",
                "This stuff is so weird being on the outside looking in.\n\nLike, so much American insistence of having firearms to defend yourself and your property, but like then this shit happens all the time where the cops shoot the wrong person just cause they had a firearm to defend themselves because no one will know if the person bashing on their door in the middle of night screaming police is actually police or if its intruders. \n\nLike what is the play here as a citizen.",
                "The 2nd amendment is equal for all Americans, except some Americans are more equal than others…",
                "I remember saying this was going to be the outcome and all kinds of people were angry that I said that.",
                "So, you \\*don't\\* actually have a right to defend your own home, or even have a gun in your hand, if it happens to be incompetent cops trying to break in.\n\nReally seems like the only sane response is to act like cops - shoot first and ask questions never. At least that might make them hesitate.",
                "They don't value life at all",
                "If the situation had ended differently and the homeowner killed the police and then called 911, would the homeowner have 'acted responsibly'?",
                "Would the law have gone both ways? As in, if he shot and killed the cops because he thought they were intruders, would the court decide he “acted reasonably”?",
                "More proof there is no true law or justice.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "2 shot, 1 fatally, in Washington DC; Israeli embassy staffer believed to be among victims: police",
            "external_url": "https://abc7.com/post/2-shot-1-fatally-outside-capital-jewish-museum-washington-dc-israeli-embassy-staff-among-victims-police-say/16500500/",
            "upvotes": 4193,
            "date": "05/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16500912_052125-wabc-dc-shooting-img.jpg?w=1600",
            "top_comments": [
                "Two embassy staffers are dead. A man and a woman. Shooter apprehended.\n\nhttps://www.cnn.com/2025/05/21/politics/individuals-connected-to-israeli-embassy-shot-in-dc-sources-says",
                "This is gonna be a world class shitshow.",
                "Ahh shit this won’t be good",
                "[\"Suspect chanted 'Free-Free Palestine' while in custody.\" ](https://www.youtube.com/live/nGVVRy0vimE?t=1113s) - Seems like a political motive is confirmed.",
                "Suspect identified as Elias Rodrigues from Chicago IL.",
                "*”The shooting happened outside of an event at the Capital Jewish Museum, law enforcement sources said.”*\n\n*”One man and one woman -- both staff members at the Israeli Embassy -- were shot and killed as they exited an event on Wednesday night, officials said”*\n\n*”The suspect [in custody] in the shooting has been identified as a 30-year-old man from Chicago, Washington, D.C. Police Chief Pam Smith said.”*\n\n*”She also said the suspect shouted \"free, free Palestine\" after his arrest.”*\n\nWhatever “justice” the perpetrator thought they were achieving is only going to make things worse for everybody. Way to go dipshit",
                "regardless of the debate of judaism vs zionism, this is going escalate things in a nerve wracking way.\n\nand with palestine as well as other things trump is doing, this is gonna be an interesting summer.",
                "Listen to the suspect chant the mantra, \"Free, free Palestine\"\n\nhttps://x.com/YuvalDavid/status/1925408541042446484?t=Mw13Tpo992p-p5yISts-4g&s=19",
                "It would be nice if just one day this year could not be a shit show",
                "The male victim, Yaron, was a classmate of mine. May his memory be a blessing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'Serious' accident at North Korea warship launch ceremony",
            "external_url": "https://www.channelnewsasia.com/east-asia/north-korea-warship-launch-serious-accident-5145951?cid=internal_sharetool_iphone_22052025_cna",
            "upvotes": 1981,
            "date": "05/22/2025",
            "thumbnail": "https://dam.mediacorp.sg/image/upload/s--grLCuTo7--/c_crop,h_450,w_800,x_0,y_61/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-05-22t011638z_3_lynxmpel4l00t_rtroptp_3_northkorea-navy.jpg?itok=IBofV_y-",
            "top_comments": [
                "The long and short of it is somebody fucked up and it messed up the bottom of the boat so it no longer was balanced correctly. Kim Jong-un said that it was basically a criminal act of carelessness and that shit is gonna be done about it.",
                "Someone is about to get killed by cannon fire again.",
                "This is their brand new ship they've been bragging about. You've got to wonder if there was sabotage involved.",
                "A good steering wheel that doesn’t fly out of your hand while you’re sailing",
                "They should've slapped it and say, \"that will hold.\"",
                "Did the front fall off?",
                "Someone is going to be artillery’d to death.",
                "Maybe Dennis Rodman can go over there and give him a pep talk",
                "Do you think he’s just in a constant state of embarrassment?",
                "No worry. This Korean nesting ship design. We open broken ship and slightly smaller not broken ship inside"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli troops fire 'warning shots' at diplomats in West Bank",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250522_N02/",
            "upvotes": 1287,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Call it what you want, but shooting near a delegation from 20 countries is a guaranteed way to damage international credibility",
                "I have never seen a country try so hard to be hated",
                ">Israeli troops fired what they say were \"warning shots\" at a group of diplomats in the city of Jenin in the West Bank on Wednesday. The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\n\nSo the IDF has to make sure that roving gangs of *<checks notes>* diplomats don't start going to sensitive areas and chatting up the locals. So they fire some warning shots to show those diplomats who the tough guys are.",
                "Israel is just intent on isolating itself, isn't it?",
                "Everytime that I thought that this country’s brand can’t go any lower, I get surprised",
                "\"The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\"\n\nSo their solution to address who they knew were unarmed diplomats was to fire live rounds at them?\n\nThat's their preferred approach and there's no better alternatives?",
                "Hey you! Stop all the diplomacy!",
                "Every day I wake up, something makes me hate Israel more and more. \n\nAbsolutely FUCK Israel.",
                "Good Lord. Destroyed all goodwill left for them. \"Never again\".....right. ",
                "This could all stop today if Hamas would just release the hostages. -- r/worldnews probably"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Colts owner Jim Irsay dead at 65",
            "external_url": "https://www.wishtv.com/sports/indianapolis-colts/colts-owner-jim-irsay-dead-at-65/",
            "upvotes": 1662,
            "date": "05/21/2025",
            "thumbnail": "https://www.wishtv.com/wp-content/uploads/2024/01/09/Jim-Irsay_AP22312064831966-scaled.jpg",
            "top_comments": [
                "65?? Thought the dude was in his 80s....",
                "Dude was a party animal and it eventually caught up with him.",
                "Man, y'all may not know this but he was an absolute amazing person in my interactions\n\nI used to work at the local humane society out of HS.  We had a dog there that had somehow ended up there all the way from SC.  Because no one adopted the dog, it ended up on the news and the family from SC saw the dog and said it was there's.  They didn't have the money to come get the dog, and Irsay heard about it and flew the dog down himself on his private jet.  He sent a picture to us of the dog eating steak on the jet\n\nNothing but good things to say about Mr Irsay\n\nRIP",
                "There was a rumor he OD’d in Miami and was flown back to Indy and he wasn’t doing good.",
                "He was here for a good time not a long time",
                "Dibs on the Black Strat",
                "Addiction is a disease, not a moral failure and I wish our society made that distinction.",
                "# Bill Belichick's girlfriend kicking herself right now. Wrong 1st round pick.",
                "Curious what happens with his insane guitar collection and other oddities.",
                "Man voted to ban the “Tush Push” and then dipped"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 7927,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "Always wear your seatbelt",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "In separate crashes, what are the odds of that? Poor kid.",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH.",
                "That stretch of LA 67 has a long history of high‑severity crashes—especially in low‑light or early‑morning conditions. In 2022 they found that 47 crashes happened over just three years at the LA 67/72nd Avenue intersection—roughly 16 crashes per year. [Source](https://movebr.brla.gov/assets/documents/final-plans/Plank-Road%20-Design-Study%20-Report_02-28-2022-web.pdf?utm_source=chatgpt.com)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Nike will raise prices on a wide range of products as soon as this week",
            "external_url": "https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html",
            "upvotes": 2967,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126111-17437060642025-04-03t182948z_1680382369_rc2iqdauinqb_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743706095&w=1920&h=1080",
            "top_comments": [
                "Their quality has gone way down and the price keeps going up.",
                "“The footwear giant said it regularly evaluates pricing, and did not say the changes were related to tariffs.”\n\n*insert “sure Jan” gif here*",
                "I was a huge Nike guy until a couple of years ago when I ventured into other brands like Asics, Saucony and New Balance. Not looking back, especially since the quality has gone to shite!",
                "Shit looks like I will have to continue not buying nike now!",
                "These prices are never coming back down. Even if tariffs are lifted, if consumers keep buying these products, Nike will keep the prices elevated.",
                "Guys it's only until we get the sweat shops built at home then prices will come back down. Don't worry. This isn't exactly what everyone said would happen.",
                "right when my need to buy things for no reason ends. cool!",
                "Nike will raise prices on a wide range of footwear, apparel and equipment as soon as this week as the retail industry braces for tariffs to hit its profits, CNBC has learned.\n\nPrices for Nike apparel and equipment for adults will increase between $2 and $10, a person familiar with the matter said. Footwear priced between $100 and $150 will see a hike of $5, while sneakers priced above $150 will see a $10 increase, the person said.\n\nThe price hikes will be in effect by June 1, but could be seen on shelves as soon as this week, the person said. The increases cover a large portion of Nike’s assortment, but many products will remain the same price.\n\nThe prices of children’s products will not increase, nor will items priced under $100, according to the person. The company is trying to be cognizant of the financial challenges families are facing and doesn’t want parents to see higher prices when shopping for their children during the back to school season.\n\nFurther, Nike’s Air Force 1 shoe will remain $115, the person said.\n\n“It’s a shoe that people in the workplace wear,” the person said. “It’s comfortable, accessible.”\n\nJordan brand apparel and accessories also won’t see increases, but Jordan sneakers will.\n\nNike said in a statement that “we regularly evaluate our business and make pricing adjustments as part of our seasonal planning.” The company did not say the decision was related to tariffs.\n\nWhile it is common for retailers to regularly adjust their pricing structure, the footwear industry has been particularly hard hit by President Donald Trump’s new tariffs.\n\nCurrently, Nike manufacturers about half of its footwear in China and Vietnam, which Trump has hit with his new levies. Chinese goods face a new 30% tariff, while imports from Vietnam are currently subject to a 10% duty. Trump cut the tariff rate on Vietnamese goods from 46% for 90 days in early April.\n\nTariffs are expected to hit Nike’s profit margin and it can offset the effect through price increases, especially as the sneaker giant works through a turnaround that’s taking longer than expected. Nike’s profits were already under pressure before tariffs took effect because it has needed to rely on discounting to move product.\n\nThe price hikes will be the MSRP rate that consumers see at Nike stores and on its website. It has sent a note out to wholesale partners about the price increases, but how they’ll show up at places like Dick’s Sporting Goodsand Foot Locker isn’t immediately clear.",
                "They already did. I use to buy Nike SB dunk lows for like $80, now they are $130.",
                "They charge the highest prices for shoes that are lower quality and not keeping up with competitor improvements with their shoes. Now they want to raise prices aGAIN? Good luck"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former New York state trooper pleads guilty to faking his own shooting",
            "external_url": "https://apnews.com/article/new-york-trooper-shot-guilty-plea-5b822d3e3da0d51978637fff6eb6e2ff",
            "upvotes": 629,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Donnelly said the ruse was an apparent bid to gain sympathy from a former girlfriend\n\nWell she dodged a bullet.",
                ">Instead, prosecutors say, he staged the scene of the alleged shooting by scattering shell casings, then shot himself at a park, stashed the .22-caliber rifle, drove back to the highway and called for backup.\n\n>Nassau County District Attorney Anne Donnelly said after Wednesday’s hearing that “one of the most disturbing parts” of the case was that he intentionally set in motion a potentially dangerous search.\n\n>Mascia described the fictitious driver as a “dark-skinned” man wearing a balaclava that exposed only his eyes. He also claimed the suspect fled in a car bearing temporary New Jersey plates heading toward New York City.\n\n\nDisturbing is putting it mildly. He used the familiar “dark-skinned man” trope to shift blame, and risked the lives of anyone in the area fitting the description. The cops would be far more trigger-happy if they thought another cop had been shot.",
                "> “If someone had been stopped that fit the description? Who knows what would have happened?” the district attorney said. “It’s just a frightening thought.”\n\nYeah, maybe if cops were actually held to standards it would be less terrifying.",
                "The best nickname i can come up with is Justice Smollett, but I think we can do better.",
                "Could have at least paid Bobby Baccala to do the deed",
                "Real life Prez Pryzbylewski.",
                "NOPE....The community needs to remember he is a liar",
                "From the original incident:\n\n>Major Stephen Udice, commander of Troop L, said authorities are offering a $5,000 reward for anyone with information about the shooting, which he called a “cowardly act.”\n\nDoes he still get the $5K for being the coward?",
                "The only thing worse then standing in a cop's way is making a cop look like a fool.  Now this guy has made an entire department look like idiots.  I...REALLY wouldn't want to be him right now."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hundreds of rural hospitals are at risk of closing, threatening critical care",
            "external_url": "https://www.cbsnews.com/news/rural-hospitals-closing-reimbursements/",
            "upvotes": 2017,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/19/b7876bca-14e8-4562-8a64-913cf72d88e6/thumbnail/1200x630/12e3219795938931a95e64a4953c7bbe/b5-shamlian-rural-hospitals-051925-en-copy-02-frame-163.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "One of the things I also wonder about with these cuts is how many of these rural families have elderly family members in nursing homes that are about to lose coverage that pays for their care?",
                "We the people who voted against this shit storm are stuck fighting to protect the opther people from the people they voted in.  I am pretty sure we are not going to be able to apply any brakes until november 2026",
                "*The Center for Healthcare Quality and Payment Reform's report* *found that 742 rural hospitals are at risk of closing, with over 300 of those being classified as being at \"immediate risk.*\n\nMedicare and Medicaid payments decrease every year, and with the Medicaid cuts about to hit, this will cut the number of paying patients which will be another heavy load on these hospitals.",
                "Rural communities voted for this.",
                "Rural hospitals are being squeezed from both directions. Revenue is low because they see especially high numbers of Medicaid/Medicare patients. These programs which pay significantly less than private insurance for the same care -- a [review of the literature](https://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/) found private insurance pays, on average, almost double the Medicare rate for comparable procedures. In some cases, the Medicare/Medicaid payment falls below the actual cost of delivering care. Rural hospitals are also more often located in states that refused Medicaid expansion through Obamacare, which means patients who carry no insurance whatsoever.\n\nAt the same time, these hospitals have higher expenses. Rural hospitals struggle to recruit and retain staff, leading to higher labor costs per-patient. Increasingly, they rely on travel nurses or contract physicians to fill the gaps, both of which are more expensive than their traditional staffing counterparts. They also suffer from higher debt loads, costs from deferred maintenance, and antiquated equipment, all of which raise costs.\n\nNaturally, the planned cuts to government healthcare will exacerbate these problems. But the system was crumbling long before Trump came into office, and will eventually collapse completely without major structural reforms.",
                "if only there was some way to prevent this type of stuff",
                "Low reimbursement rates while Unitedhealth alone made a $90 billion gross profit last year. Single payer is the only fix.",
                "It saddens me that non-maga people are getting hurt by this. The cynical part of me feels that rural communities brought this on themselves, and that nothing will change until the situation affects them. My only solace is the hope that through all of this, maybe, just maybe, they'll wake the f up. It's an awful part of human nature. My intuition says things will change as a result, but will go right back to \"own the libs\" as soon as it's over.",
                "Trump doesn't care, he just got a new airplane.",
                "MAGA voted to close their own hospitals."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 27556,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                "Maybe they will hire AI agents/bots to restock shelves and ai registers.  And maybe they can sell their goods exclusively to AI families.",
                "Maybe they should not have bent over for one group and their king?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "\"Go woke go broke, am I right?\" LMAO. It's hilarious to me these big corporations took the the threat of....broke ass people who don't spend any money in their stores anyway....seriously. Instead they decide to piss off the people who have money and \\*used\\* to shop there. \n\nKeep soaring, Costco!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge finds police acted reasonably in shooting New Mexico man while at wrong address",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-finds-police-acted-reasonably-shooting-new-mexico-man-wrong-addr-rcna208157",
            "upvotes": 723,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Farmington-police-shooting-RS-791813.jpg",
            "top_comments": [
                "Isn't that amazing? They can start a conflict, and when someone has a natural reaction to said conflict and exercises their supposed 2nd Amendment right, you can legally be killed.",
                "This stuff is so weird being on the outside looking in.\n\nLike, so much American insistence of having firearms to defend yourself and your property, but like then this shit happens all the time where the cops shoot the wrong person just cause they had a firearm to defend themselves because no one will know if the person bashing on their door in the middle of night screaming police is actually police or if its intruders. \n\nLike what is the play here as a citizen.",
                "The 2nd amendment is equal for all Americans, except some Americans are more equal than others…",
                "I remember saying this was going to be the outcome and all kinds of people were angry that I said that.",
                "So, you \\*don't\\* actually have a right to defend your own home, or even have a gun in your hand, if it happens to be incompetent cops trying to break in.\n\nReally seems like the only sane response is to act like cops - shoot first and ask questions never. At least that might make them hesitate.",
                "They don't value life at all",
                "If the situation had ended differently and the homeowner killed the police and then called 911, would the homeowner have 'acted responsibly'?",
                "Would the law have gone both ways? As in, if he shot and killed the cops because he thought they were intruders, would the court decide he “acted reasonably”?",
                "More proof there is no true law or justice.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "2 shot, 1 fatally, in Washington DC; Israeli embassy staffer believed to be among victims: police",
            "external_url": "https://abc7.com/post/2-shot-1-fatally-outside-capital-jewish-museum-washington-dc-israeli-embassy-staff-among-victims-police-say/16500500/",
            "upvotes": 4198,
            "date": "05/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16500912_052125-wabc-dc-shooting-img.jpg?w=1600",
            "top_comments": [
                "Two embassy staffers are dead. A man and a woman. Shooter apprehended.\n\nhttps://www.cnn.com/2025/05/21/politics/individuals-connected-to-israeli-embassy-shot-in-dc-sources-says",
                "This is gonna be a world class shitshow.",
                "Ahh shit this won’t be good",
                "[\"Suspect chanted 'Free-Free Palestine' while in custody.\" ](https://www.youtube.com/live/nGVVRy0vimE?t=1113s) - Seems like a political motive is confirmed.",
                "Suspect identified as Elias Rodrigues from Chicago IL.",
                "*”The shooting happened outside of an event at the Capital Jewish Museum, law enforcement sources said.”*\n\n*”One man and one woman -- both staff members at the Israeli Embassy -- were shot and killed as they exited an event on Wednesday night, officials said”*\n\n*”The suspect [in custody] in the shooting has been identified as a 30-year-old man from Chicago, Washington, D.C. Police Chief Pam Smith said.”*\n\n*”She also said the suspect shouted \"free, free Palestine\" after his arrest.”*\n\nWhatever “justice” the perpetrator thought they were achieving is only going to make things worse for everybody. Way to go dipshit",
                "regardless of the debate of judaism vs zionism, this is going escalate things in a nerve wracking way.\n\nand with palestine as well as other things trump is doing, this is gonna be an interesting summer.",
                "Listen to the suspect chant the mantra, \"Free, free Palestine\"\n\nhttps://x.com/YuvalDavid/status/1925408541042446484?t=Mw13Tpo992p-p5yISts-4g&s=19",
                "It would be nice if just one day this year could not be a shit show",
                "The male victim, Yaron, was a classmate of mine. May his memory be a blessing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli troops fire 'warning shots' at diplomats in West Bank",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250522_N02/",
            "upvotes": 1286,
            "date": "05/22/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250522_N02_1528389_L.jpg",
            "top_comments": [
                "Call it what you want, but shooting near a delegation from 20 countries is a guaranteed way to damage international credibility",
                "I have never seen a country try so hard to be hated",
                ">Israeli troops fired what they say were \"warning shots\" at a group of diplomats in the city of Jenin in the West Bank on Wednesday. The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\n\nSo the IDF has to make sure that roving gangs of *<checks notes>* diplomats don't start going to sensitive areas and chatting up the locals. So they fire some warning shots to show those diplomats who the tough guys are.",
                "Israel is just intent on isolating itself, isn't it?",
                "Everytime that I thought that this country’s brand can’t go any lower, I get surprised",
                "\"The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\"\n\nSo their solution to address who they knew were unarmed diplomats was to fire live rounds at them?\n\nThat's their preferred approach and there's no better alternatives?",
                "Hey you! Stop all the diplomacy!",
                "Every day I wake up, something makes me hate Israel more and more. \n\nAbsolutely FUCK Israel.",
                "Good Lord. Destroyed all goodwill left for them. \"Never again\".....right. ",
                "This could all stop today if Hamas would just release the hostages. -- r/worldnews probably"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "'Serious' accident at North Korea warship launch ceremony",
            "external_url": "https://www.channelnewsasia.com/east-asia/north-korea-warship-launch-serious-accident-5145951?cid=internal_sharetool_iphone_22052025_cna",
            "upvotes": 1987,
            "date": "05/22/2025",
            "thumbnail": "https://dam.mediacorp.sg/image/upload/s--grLCuTo7--/c_crop,h_450,w_800,x_0,y_61/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-05-22t011638z_3_lynxmpel4l00t_rtroptp_3_northkorea-navy.jpg?itok=IBofV_y-",
            "top_comments": [
                "The long and short of it is somebody fucked up and it messed up the bottom of the boat so it no longer was balanced correctly. Kim Jong-un said that it was basically a criminal act of carelessness and that shit is gonna be done about it.",
                "Someone is about to get killed by cannon fire again.",
                "This is their brand new ship they've been bragging about. You've got to wonder if there was sabotage involved.",
                "A good steering wheel that doesn’t fly out of your hand while you’re sailing",
                "They should've slapped it and say, \"that will hold.\"",
                "Did the front fall off?",
                "Someone is going to be artillery’d to death.",
                "Maybe Dennis Rodman can go over there and give him a pep talk",
                "Do you think he’s just in a constant state of embarrassment?",
                "No worry. This Korean nesting ship design. We open broken ship and slightly smaller not broken ship inside"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 7937,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "Always wear your seatbelt",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "In separate crashes, what are the odds of that? Poor kid.",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH.",
                "That stretch of LA 67 has a long history of high‑severity crashes—especially in low‑light or early‑morning conditions. In 2022 they found that 47 crashes happened over just three years at the LA 67/72nd Avenue intersection—roughly 16 crashes per year. [Source](https://movebr.brla.gov/assets/documents/final-plans/Plank-Road%20-Design-Study%20-Report_02-28-2022-web.pdf?utm_source=chatgpt.com)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Nike will raise prices on a wide range of products as soon as this week",
            "external_url": "https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html",
            "upvotes": 2961,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126111-17437060642025-04-03t182948z_1680382369_rc2iqdauinqb_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743706095&w=1920&h=1080",
            "top_comments": [
                "Their quality has gone way down and the price keeps going up.",
                "“The footwear giant said it regularly evaluates pricing, and did not say the changes were related to tariffs.”\n\n*insert “sure Jan” gif here*",
                "I was a huge Nike guy until a couple of years ago when I ventured into other brands like Asics, Saucony and New Balance. Not looking back, especially since the quality has gone to shite!",
                "Shit looks like I will have to continue not buying nike now!",
                "These prices are never coming back down. Even if tariffs are lifted, if consumers keep buying these products, Nike will keep the prices elevated.",
                "Guys it's only until we get the sweat shops built at home then prices will come back down. Don't worry. This isn't exactly what everyone said would happen.",
                "right when my need to buy things for no reason ends. cool!",
                "Nike will raise prices on a wide range of footwear, apparel and equipment as soon as this week as the retail industry braces for tariffs to hit its profits, CNBC has learned.\n\nPrices for Nike apparel and equipment for adults will increase between $2 and $10, a person familiar with the matter said. Footwear priced between $100 and $150 will see a hike of $5, while sneakers priced above $150 will see a $10 increase, the person said.\n\nThe price hikes will be in effect by June 1, but could be seen on shelves as soon as this week, the person said. The increases cover a large portion of Nike’s assortment, but many products will remain the same price.\n\nThe prices of children’s products will not increase, nor will items priced under $100, according to the person. The company is trying to be cognizant of the financial challenges families are facing and doesn’t want parents to see higher prices when shopping for their children during the back to school season.\n\nFurther, Nike’s Air Force 1 shoe will remain $115, the person said.\n\n“It’s a shoe that people in the workplace wear,” the person said. “It’s comfortable, accessible.”\n\nJordan brand apparel and accessories also won’t see increases, but Jordan sneakers will.\n\nNike said in a statement that “we regularly evaluate our business and make pricing adjustments as part of our seasonal planning.” The company did not say the decision was related to tariffs.\n\nWhile it is common for retailers to regularly adjust their pricing structure, the footwear industry has been particularly hard hit by President Donald Trump’s new tariffs.\n\nCurrently, Nike manufacturers about half of its footwear in China and Vietnam, which Trump has hit with his new levies. Chinese goods face a new 30% tariff, while imports from Vietnam are currently subject to a 10% duty. Trump cut the tariff rate on Vietnamese goods from 46% for 90 days in early April.\n\nTariffs are expected to hit Nike’s profit margin and it can offset the effect through price increases, especially as the sneaker giant works through a turnaround that’s taking longer than expected. Nike’s profits were already under pressure before tariffs took effect because it has needed to rely on discounting to move product.\n\nThe price hikes will be the MSRP rate that consumers see at Nike stores and on its website. It has sent a note out to wholesale partners about the price increases, but how they’ll show up at places like Dick’s Sporting Goodsand Foot Locker isn’t immediately clear.",
                "They already did. I use to buy Nike SB dunk lows for like $80, now they are $130.",
                "They charge the highest prices for shoes that are lower quality and not keeping up with competitor improvements with their shoes. Now they want to raise prices aGAIN? Good luck"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Colts owner Jim Irsay dead at 65",
            "external_url": "https://www.wishtv.com/sports/indianapolis-colts/colts-owner-jim-irsay-dead-at-65/",
            "upvotes": 1672,
            "date": "05/21/2025",
            "thumbnail": "https://www.wishtv.com/wp-content/uploads/2024/01/09/Jim-Irsay_AP22312064831966-scaled.jpg",
            "top_comments": [
                "65?? Thought the dude was in his 80s....",
                "Dude was a party animal and it eventually caught up with him.",
                "Man, y'all may not know this but he was an absolute amazing person in my interactions\n\nI used to work at the local humane society out of HS.  We had a dog there that had somehow ended up there all the way from SC.  Because no one adopted the dog, it ended up on the news and the family from SC saw the dog and said it was there's.  They didn't have the money to come get the dog, and Irsay heard about it and flew the dog down himself on his private jet.  He sent a picture to us of the dog eating steak on the jet\n\nNothing but good things to say about Mr Irsay\n\nRIP",
                "There was a rumor he OD’d in Miami and was flown back to Indy and he wasn’t doing good.",
                "He was here for a good time not a long time",
                "Dibs on the Black Strat",
                "Addiction is a disease, not a moral failure and I wish our society made that distinction.",
                "# Bill Belichick's girlfriend kicking herself right now. Wrong 1st round pick.",
                "Curious what happens with his insane guitar collection and other oddities.",
                "Man voted to ban the “Tush Push” and then dipped"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 27564,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                "Maybe they will hire AI agents/bots to restock shelves and ai registers.  And maybe they can sell their goods exclusively to AI families.",
                "Maybe they should not have bent over for one group and their king?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "\"Go woke go broke, am I right?\" LMAO. It's hilarious to me these big corporations took the the threat of....broke ass people who don't spend any money in their stores anyway....seriously. Instead they decide to piss off the people who have money and \\*used\\* to shop there. \n\nKeep soaring, Costco!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 8711,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is a gaudy, flying palace? That one?",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Obligatory if Obama or Biden had done this……",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "I fucking hate this timeline",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 19382,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "Six House Democrats have died in office in the past 13 months. Donald Payne Jr., Sheila Jackson Lee, Bill Pascrell, Sylvester Turner, Rayl Grijalva,  and now Gerry Connolly.",
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "[removed]",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/22/2025 08:13:10 UTC"
}