{
    "posts": [
        {
            "category": "HOT",
            "title": "Mortgage rates surge over 7% as tariffs hit bond market",
            "external_url": "https://www.cnbc.com/2025/04/11/mortgage-rates-surge-tariffs-bond-market.html",
            "upvotes": 6271,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107400195-1712872692895-gettyimages-2148323929-rent403111_2ppre7by.jpeg?v=1744392745&w=1920&h=1080",
            "top_comments": [
                "Are we in the golden age yet?",
                "Who could have guessed that daily chaos and incompetence would yield such results?",
                "So everything is going up contrary to what Trump had promised.\n\nThis is just the first 3 months of Trump's presidency.",
                "I'll remember to say thank you I guess. /s",
                "Higher rates are MANLY. Just like the TARIFFS.",
                "Financial stress seems to be a speciality of new Oval Office .",
                "Well at least the 3 trans athletes in the U.S. are banned from women’s sports and that one innocent dad got sent to the Kessel Spice mines.",
                "How exactly is the market rising today?  I'm baffled by the move higher.  Is this just a move to provide liquidity for the market to short?",
                "Housing becomes even more expensive now eh?\n\nRemember when one of the candidates presented a plan to build millions of homes and reduce demand for housing thereby reducing costs? \n\nBut she laughed funny and she's a black woman.",
                "I have no clue how anyone can afford to buy a house with rates this high. We got our house 9 years ago and rates were around 4%. People told us, just wait, the rates will go lower and you can refinance. I highly doubt rates ever go near 4% again unless we go into a great depression."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US fires Greenland military base chief for 'undermining' JD Vance",
            "external_url": "https://bbc.com/news/articles/creq99l218do",
            "upvotes": 38518,
            "date": "04/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bfc8/live/a395f500-16b9-11f0-a455-cf1d5f751d2f.jpg",
            "top_comments": [
                "This is the statement she was fired for: \"I do not presume to understand current politics, but what I do know is the concerns of the US administration discussed by Vice-President Vance on Friday are not reflective of Pituffik Space Base.\"\"",
                "Slapped arse VP basically says that having an opinion that differs from the party line is misconduct. Welcome to the 'land of the free'.",
                "Integrity will not be tolerated.",
                "Is this the same JD Vance who likes to lecture Europe on freedom of speech?",
                "They know she wouldn't obey the order if they ask them to take over the island.",
                "It’s funny that they say it is because she was undermining the chain of command by insulting Vance, when Vance isn’t in her chain of command.",
                "I’m not sure how one would Undermine Vance more than Vance.\n\nMotherfucker dragged a whole camera crew to show off how he doesn’t know how to order donuts and then released that video.\n\nGuy stands next to his Indian wife talking about how immigrants are destroying the nation.\n\nThe whole Admin’s a clown show, but JD’s the smaller, even stupider clown that can’t get out of the car without falling head first into an open sewer.",
                "There has never been a worse administration in the history of our country.",
                "Oh for fuck's sake.\n\nHello Americans. I am from Turkey. Everything that has been happening so far feels so familiar it is painful. It is almost like you lot just elected Erdoğan. The only difference is that your idiots are pretty much speedrunning this bullshit instead of spreading it over 20 or so years.\n\nAlmost like they are sharing notes. Fucking hell...",
                "The VP isn't even in the military chain of command lmao"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man has sex with corpse on NYC subway, sources say",
            "external_url": "https://www.nbcnewyork.com/new-york-city/man-sex-corpse-nyc-subway-video-r-train-body/6220060/",
            "upvotes": 3966,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/r-train-body.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Wait... so it sounds like this guy didn't bring the corpse there. Like, someone died on the subway, and someone decided to sexually assault the body.",
                "Well that's a new thought I should've never had \n\n\"Boy I sure hope I don't die on a train in New York.Wont even be able to rest peacefully.\"",
                "I wonder what the possible range of sentences in NYC for public necrophilia is.\n\nI also wonder what led us to the point in society where I can use 'public necrophilia' in a sentence and have it be 100% serious (and relevant).",
                "\"Investigators believe the body may have been on the train for hours...\"\n\nWhy are there so many NYPD cops down there then? Couldn't stop a shooting, a woman being burned alive, a dead person being violated sexually, etc. Literally what the fuck do they actually do besides play games on their phones like the adult versions of iPad babies?",
                "How does this decision process even work? You're in New York, for whatever reason you're a necrophiliac....You're out shopping, because I imagine necrophiliacs still need certain essentials, you take the Subway..\n\n\"Dear diary...JACKPOT.\"",
                "[removed]",
                "JFC...what a terrible day to be literate",
                ">“It's believed the entire assault... took several minutes.”\n\nGoodness... it's truly shocking to think about how long this went on, and I can't even fathom the level of depravity required to commit such an act, it's absolutely sickening, and I just hope that whoever did this is caught and brought to justice quickly, seriously, what kind of person does something like that?",
                "I pine for the days of Kraft Punk on NYC Subways.",
                "Can you imagine being the cops watching the surveillance video to see what happened to the dead guy and then seeing this whole sordid tale play out? "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Australian with working visa detained and deported on returning to US from sister’s memorial",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/11/australian-with-us-working-visa-detained-insulted-deported",
            "upvotes": 5735,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dfacc465ba70e74361c230b86c4a98b4172337c6/0_0_2500_1500/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=18eb35833620d4bb4642ca8225a920dd",
            "top_comments": [
                "I mean there's no better advertisement to never go to the US or work with them anymore. \nAs time passes, extreme behavior by US borders agents will be normalised and even encouraged. The few non cultist members will leave the job and all that will remain is horrible people banning people from the US for whatever reason they wish.",
                "> Guardian Australia asked “what grounds would be reasonable for someone to be denied entry to the US when they have a valid work visa” and whether it was “considered acceptable for any traveller to be called a ‘r-t--d’ by US border officials”.\n\n> A Department of Homeland Security media representative replied that the department “cannot answer questions on something we cannot verify the veracity of”.\n\n> “Just like I cannot confirm the existence of big foot.”\n\nWhat a horrible official response.\n\nJoking around while they're actively tearing apart the lives of innocent people. And they're living off of a salary paid for by my tax dollars.\n\nMakes me ashamed to be American.",
                "What surprises me (although I don't know why it should) is just how quickly all of these TSA, Border Patrol, ICE,  Homeland Security, etc. people turned into TOTAL FUCKING ASSHOLES the minute they got given the green light.\n\nIt's like they were all just biding their time, then BAM!, Nazis.",
                "These border and immigration people sound like they've been champing at the bit to be as cruel and arbitrary as possible. I'm waiting for stories of Sophie's Choice again.\n\nBy the way, I am referring both to the Meryl Streep movie and this case from Trump's first term:\n\n>At a Border Patrol holding facility in El Paso, Texas, an agent told a Honduran family that one parent would be sent to Mexico while the other parent and their three children could stay in the United States, according to the family. The agent turned to the couple's youngest daughter — 3-year-old Sofia, whom they call Sofi — and asked her to make a choice.\n\n>\"The agent asked her who she wanted to go with, mom or dad,\" her mother, Tania, told NPR through an interpreter. \"And the girl, because she is more attached to me, she said mom. But when they started to take [my husband] away, the girl started to cry. The officer said, 'You said [you want to go] with mom.' \"\n\nhttps://www.npr.org/2019/07/15/741721660/follow-up-what-happened-after-a-border-agent-asked-toddler-to-pick-a-parent",
                "visit the US?….straight to jail\n\nLeave the US and come back? Also straight to jail",
                "Vote for a clown and you get a circus.",
                "U.S. ICE agents are fancying themselves to be paramilitarians who just do whatever they want now.\n\nThese deportees are undoubtedly forced to leave behind valuables in the U.S. so I also have to wonder if there will be (or already is) a transition to a theft racket by ICE agents or those connected with them.",
                "A family friend of mine has a similar experience. He has a green card and has lived in the US for 20 years. His wife is American, his kids are American. The family went to the US Virgin Islands for vacation, and on the way back he was detained in Miami for having a green card. Then he was sent to Peurto Rico to be held for a few days. Then he was flown back to Miami. Then he was given a choice of being sent to jail to await his court date, or be flown to Canada.",
                "Yeah don't go to the US...",
                "Everything Trump touches turns to shit. Behold: the Shitty States of Moronistan, formerly known as the USA."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Rep. Marjorie Taylor Greene bought stocks hit hard by Trump tariffs during the market meltdown",
            "external_url": "https://apnews.com/article/greene-stocks-conflicts-interest-restoration-hardware-tariffs-trump-f9922a970c837cb76dd8ddc01f20f51d",
            "upvotes": 5222,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s called insider trading.",
                "It's amusing her defense for buying the stocks hit hard by tariffs is ... \"tariffs are good\".",
                "Would any sane person just decide to purchase hundreds of thousands of dollars in stocks in the deep red during historic market uncertainty?  No, not unless they knew it was going to pay off 30 minutes later.  It’s so fucking blatant. ",
                "Maybe her son's GoFundMe got her in the mood to fleece people?",
                "That's about what I'd expect from the Majorly Traitorous Goblin",
                "Of course she did. She has the ethics and spine of a slug.",
                "Of course she did. She’s as crooked as all the rest of the GQP creepers.",
                "Jon Ossoff should be loud and clear if he was part of the insider trading. MTG is vying for his senator seat and he needs to be clear.",
                "Insider Trading. If Dems get back in power. They better not be nerdy and wimpy and fight just as dirty as MAGA. Trump has immunity not the rest of them. Not sure what they thought he wanted immunity for in the first place. This seems like it was all planned.",
                "Absolute corruption. This treasonous POS had clear insider knowledge that prompted her actions which is a felony punishable by time in prison. Martha Stewart did far less and yet was convicted and imprisoned so this scumbag serial adulteress needs to suffer the consequences of her illegal actions"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "US egg prices increase to record high, dashing hopes of cheap eggs by Easter",
            "external_url": "https://apnews.com/article/egg-prices-bird-flu-cpi-b0ded420e9f7c0a707277c9c63396a76",
            "upvotes": 5427,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Time to dye those potatoes 🥔.",
                "Wait, I thought fuckface said egg prices went down, even though I grocery shop and see egg prices every day? Fuckin liars.",
                "Honestly this is what you get for electing a fucking moron. You wanted cheap egg prices - you should have elected the decent human instead of the fascist.",
                "This just gave me a flashback to 2020 when covid would be over by Easter lmao I forgot about that",
                "I mean eggs went down $5 per 3 dozen for me, but they were probably the highest in cali.  $23.99 -> $18.99 for 36 eggs....",
                "The prices are not going to come back down, not as low as they were anyway. Profits are going to be higher than ever this year.",
                "Upon whose face doth the egg lie?",
                "There’s a white house news post bragging of dropping egg price, so it was a lie?!",
                "We are going to paint rocks & potatoes this year. \n\nHonestly whenever my children want to paint something, I tell them to go find a rock anyways and they go wild for it.",
                "Dang, so we're still not to \"day one\"?\n\nColor me surprised!"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Montana farmers see Canadian trade dry up due to tariffs",
            "external_url": "https://nbcmontana.com/news/local/montana-farmers-see-canadian-trade-dry-up-due-to-tariffs",
            "upvotes": 4432,
            "date": "04/11/2025",
            "thumbnail": "https://nbcmontana.com/resources/media2/16x9/414/986/0x5/90/e9768de1-abd5-433a-85d3-ba6b88681cde-farmer.JPG",
            "top_comments": [
                "Well they can just pull themselves up by their bootstraps/find a new job/move somewhere else/pray to Jesus about it.",
                "Promises Made, Promises kept ❤️. Getting exactly what they voted for! Not many presidents follow through! Trump went above and beyond right MAGA farmers? 🙌🙏🦅",
                "Montana had the best representation in the Senate with John Tester, who was ACTUALLY a Montana Farmer, but they voted in a Minnesota Trust Fund Baby who has rubber stamped the destruction of the State.  This was a decent purple state before MAGA.",
                "There's a loooot of assholes in this world that really think you can just do what you want and be a massive prick and its fine because you're American",
                "The find out stage better humble these fuckers.",
                "And how many of the affected farmers blame Trump?",
                "Maybe Montana farmers shouldn’t have overwhelmingly voted for an orange fascist..? 🤷 \n\nUs Canadians don’t look kindly on that. 🇨🇦✊",
                "Cue the corporate agriculture companies ready to swoop in when the farms go bankrupt. Not so sure Trump will be in the mood for subsidies this time around.",
                "Oh well... Enjoy your winning and being Great Again Montana.",
                "Hey Montana, you voted for this! Enjoy the consequences of your actions.  Even if tariffs are removed, please understand that Canada has no interest whatsoever in doing business with you anymore."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "China strikes back with 125% tariffs on U.S. goods, starting April 12",
            "external_url": "https://www.cnbc.com/2025/04/11/china-strikes-back-with-125percent-tariffs-on-us-goods-starting-april-12.html",
            "upvotes": 5682,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130446-17443187092025-04-10t205242z_1564031578_rc28vdaqwvty_rtrmadp_0_usa-trump-tariffs.jpeg?v=1744318760&w=1920&h=1080",
            "top_comments": [
                "> “Even if the U.S. continues to impose higher tariffs, it will no longer make economic sense and will become a joke in the history of world economy,” the statement said, according to a CNBC translation.\n\n\nThat statement is going to cause a major tantrum in the administration.",
                ">“With tariff rates at the current level, there is no longer a market for U.S. goods imported into China,” the statement noted, adding that “if the U.S. government continues to increase tariffs on China, Beijing will ignore.”\n\nThey preemptively boxed Trump into a corner, lol.",
                "Well, congratulations are in order, US.\n\n\nYou made China, South Korea and Japan sit at the table and start to negotiate a trade deal between them.\n\n\nNot bad. 😁🫢",
                "It doesn't even matter what the tariff % raises to, they're already high enough that trade has ceased. They're always going to stay just lower than the US tariffs to make clear they are not the aggressor here. But Trump will keep raising them as long as he doesn't have the last word. Someone needs to call his bluff, and I'm glad China has the balls and poker hand to do it. It's not even a matter of who blinks first, because it's 100% going to be Trump, it's just a matter of how much damage he does for how long.",
                "It's an effective trade halt between China and the US. \n\nIn 2024, the US exported $143.5 billion in goods to China and imported $438 billion from China.\n\nRecession is basically guaranteed at this point. We'll be lucky if it's not a depression.",
                "You know who I actually feel sorry for, the low level trade officials that have to communicate and enforce these changing by the hour rules, must be absolute chaos.",
                "The America led clownshow continues.\n\nGood job, idiots.",
                "Yay, can't wait to pay $100 for something that costs $1 to produce. Proud to be American.",
                "Future comedians will use 21th century history as research material.",
                "That fucking clown in the whitehouse is going to bankrupt us like one of his casinos."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Ghislaine Maxwell, jailed Epstein accomplice, appeals case to US Supreme Court",
            "external_url": "https://abcnews.go.com/US/ghislaine-maxwell-jailed-epstein-accomplice-appeals-case-us/story?id=120714835",
            "upvotes": 802,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6aff8375-2c34-49f9-8e94-4a18fb2c6d39/ghislaine-maxwell-gty-jef-250411_1744379276507_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Not been pardoned yet?",
                "she allegedly told a news producer in 2016 that epstein had tapes of both trump and clinton",
                "How many of the justices did she fuck or hook up?\n\nYou can't tell me that nasty motherfucker Thomas hasn't been to a party.",
                ">“Despite the existence of a non-prosecution agreement promising in plain language that the United States would not prosecute any co-conspirator of Jeffrey Epstein, the United States in fact prosecuted Ghislaine Maxwell as a co-conspirator of Jeffrey Epstein,” her attorneys wrote in their petition.\n\n[Cosby's case](https://www.nbcnews.com/news/us-news/agreement-not-prosecute-cosby-leads-his-freedom-exposes-prosecution-s-n1272859) was overturned for the same reason. Same with French actor [Jussie Smollett](https://capitolnewsillinois.com/news/supreme-court-dismisses-jussie-smollett-convictions-allows-trump-tower-defamation-suit-to-continue/) and his overturned conviction. Both were state level, however.",
                "The pedopublicans will let her go.",
                "Of course she is doing this.  There is no better time than the present to explore the court's blind loyalty to Trump and all his friends.",
                "I saw her face before the headline and really hoped it was about her dying in prison",
                "She has all the information about Trump. She could use it as a leverage just like What Russia did.",
                "Tbf she has every qualification for a high ranking position in the trump government … other than being a woman, obviously",
                "Let me guess Cheeto pardon incoming."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US consumer sentiment, inflation expectations deteriorate sharply in April",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-inflation-expectations-deteriorate-sharply-april-2025-04-11/",
            "upvotes": 924,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "People can see the way Trump+cronies are utterly destroying, embezzling, manipulating the government and market right now. The uncertainties over tariffs are as bad as the tariffs themselves. We sense something is fake, scammy, a cheat.\n\nPeople do lose faith in systems.",
                "wdym mass government layoffs and a stock market crash might make people uncertain about the economy?\n\nAs someone who relies on government funding for his job in medical research, all of my non-essential expenditures are on hold indefinitely. Lots of money not going into my local economy hiring people to do things like remodeling my bathroom or doing landscaping projects.",
                "From the \"envy of the world\" to the \"collapse of empire\" in 3 months",
                "The country is being looted by the wealthy and conservatives are cheering for it.",
                "> The University of Michigan Surveys of Consumers on Friday said its Consumer Sentiment Index dropped to 50.8 this month from a final reading of 57.0 in March. Economists polled by Reuters had forecast the index falling to 54.5.\n\nThis is still the initial shock, wait until we see the ripples. The impact of federal layoffs, halted funding, rising prices, and an erratic administration is going to continue to tank consumer confidence. It's also going to tank the spending power of the average household.",
                "It's only going to be a lot worse next month. ",
                "My family and I are remaining in a strict unnecessary spending freeze and will likely stay that way for about 4 years. We’re going to do our best to weather this chaos.",
                "Is this what MAGA looks like?",
                "It’s almost like the president put blanket tariffs on everyone and more than doubled the price of importing goods from one of our biggest trade partners or something.",
                "I think the phrase you're looking for is \"utter hopelessness\"."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 3,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK woman says she was arrested after confiscating her daughters’ iPads",
            "external_url": "https://www.theguardian.com/uk-news/2025/apr/11/uk-woman-says-she-was-arrested-after-confiscating-her-daughters-ipads",
            "upvotes": 1,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b02f078ee63a46e141cef9ff5cdf1984d58b18e7/523_249_3865_2319/master/3865.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1f486a6a629fa704900a1022fe19a26",
            "top_comments": [
                "Guessing something like:\n\n- mum and dad are no longer together\n\n- dad gives ipads to daughters\n\n- mum confiscates ipads\n\n- daughters tell dad (possibly with some exaggeration)\n\n- dad calls police because ipads stolen (possibly with more exaggeration)\n\n- ipads are tracked down with some version of \"find my device\"\n\n- mum denies having them, despite police know they're there\n\n- police get more suspicious\n\n- police confirm she has the ipads\n\n- police arrest mum\n\nShe didn't do herself any favours by denying having them, when she did indeed have them.",
                "I'm very confused. They were reported stolen by a man in his 40s who lived nearby. Was it the father??",
                "A history teacher has said she was arrested and blocked from seeing her daughters after she confiscated their iPads.\n\nVanessa Brown, 50, described her “unspeakable devastation and trauma” after spending seven-and-a-half hours in a cell on 26 March after a claim that she had stolen two iPads.\n\nShe was later released with bail conditions that barred her from speaking to anyone connected to the investigation – including her children – until the case was dropped.\n\nBrown told LBC she had taken the iPads to encourage her daughters to focus on their schoolwork. Surrey police tracked the devices to Brown’s mother’s house in Cobham, Surrey, and later accepted the devices belonged to her children and she was “entitled” to confiscate them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 79,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "I'd publicly ask for a pardon while I was at it. Just to get it on record."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Idaho passed bill limiting flags governments could fly. Boise keeps flying Pride flag, adds another - BoiseDev",
            "external_url": "https://boisedev.com/news/2025/04/11/boise-pride-flag/",
            "upvotes": 104,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gotta love spite.\n\n\nMakes the world go 'round",
                "I used to live in around Boise while serving in the AF and they've always been mostly cool.",
                "*The flag legislation,*[ *as BoiseDev reported*](https://boisedev.com/news/2025/04/07/flags-legislature-urban-renewal/)*, defined what flags could be flown... the United State flag, the official flag of a government entity, official flags of any other state, flags for the military branches, the POW/MIA flag, flags of Indian tribes, flags of other countries for special occasions, and the flags of Idaho colleges, universities and public schools.*\n\nApart from the Indian tribes flag, all others are institutional/patriotic.  So, I guess that leaves Blacks, browns, gays, and lesbians out on grounds of their low patriotic rating.",
                "Outstanding! Go Boise!"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Trump orders probes of two former officials who defied him",
            "external_url": "https://www.nbcnews.com/politics/national-security/trump-orders-probes-two-former-officials-defied-rcna200523?utm_source=NBC&utm_medium=iframely",
            "upvotes": 328,
            "date": "04/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-05/230531-Christopher-Krebs-mjf-1024-27e3cc.jpg",
            "top_comments": [
                "Here it is from the horse’s mouth: https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/\n\nOfficial white house communication is starting to read like a ”conservative” news outlet.\n\n“Unite America” my ass.",
                "Dolores Trumpbridge : I am **a** tolerant man, but the **one thing** I will not **stand** for is **disloyalty!**",
                "Trump, you stupid, fat, dumb, fat idiot, why don’t you do something to help this country? Like stuffing your fat fucking face with Big Macs till the cholesterol tipping point hits. ",
                "Dictator doing Dictator things ",
                "Petty vindictive behavior like this looks like weakness. People with confidence and strength don’t need to lash out at others.",
                "Kim Jong Trump on duty.\n\nThe USA is the most ludicrous country in existence. Becoming a dictatorship by founding a cult around one of the shittiest people you can find on earth and then elect this person twice.",
                "What, no people thrown out of windows? Yet.",
                "If I recall \"Just following orders\" is not a valid defense.",
                "Less \"defied\" and more \"disagreed with\" but there's no difference to chump",
                "What did Putin do? Oh wait, you said Trump."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Measles update: State of Texas reports 36 more cases",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-11/measles-update-state-of-texas-reports-36-more-cases",
            "upvotes": 404,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/2a7ecaf/2147483647/strip/true/crop/8474x4449+0+601/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2F19%2Fc2a32f2c4132aa32f1b91ebfe709%2F25052653529724-1.jpg",
            "top_comments": [
                "Owning the Libs one dead child at a time.",
                "According to today's update, New Mexico case numbers have increased to 58 from 56. They have reported one death that is suspected to be from measles but the official cause of death is still under investigation.\n\nOklahoma only updates on Tuesdays. They reported no new cases on Tuesday. Their reported case total is 10. \n\nKansas updates on Wednesdays. Their case total went to 32 from 24. They reported one hospitalization.",
                "If only there was a way to prevent measles.",
                "You know the real number is way higher",
                "I've truly lost hope for this outbreak improving any time soon. Especially after the father of one of the dead children said this. Apparently death doesn't count as \"way worse\". The ignorance is extreme, and children will die or suffer lifelong health issues from measles. \n\n> “I know it’s not effective because some family members ended up getting the vaccine, and they got the measles way worse than some of my kids,” said Hildebrand, who is raising two other children with his wife, Eva. “The vaccine was not effective.”",
                "Let's work to keep it in the Pray it Away states.",
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 24 cases. Last Friday's update added 59 cases. Last Tuesday's update added 22 cases. The previous Friday’s update added 78 cases.\n\nDon't know if it's an error, but the number of hospitalized reported by Texas went down from 57 to 56. Texas has reported two deaths associated with this outbreak.",
                "“Friday's update came soon after the San Antonio Metropolitan Health District reported that it will end some vaccinations for children because a grant funding those vaccines lost some of its federal financial support.\n\nThe Federal Immunization Vaccines for Children Grant was reduced from $3 million to $2.5 million, according to a memo from City Manager Erik Walsh. He said the grant will not be able to cover the vaccine clinical operations.”\n\nGreat timing, eh?",
                "We need to build a wall around Texas.",
                "If we stop reporting cases it’ll just go away /s"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Ghislaine Maxwell, jailed Epstein accomplice, appeals case to US Supreme Court",
            "external_url": "https://abcnews.go.com/US/ghislaine-maxwell-jailed-epstein-accomplice-appeals-case-us/story?id=120714835",
            "upvotes": 803,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6aff8375-2c34-49f9-8e94-4a18fb2c6d39/ghislaine-maxwell-gty-jef-250411_1744379276507_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Not been pardoned yet?",
                "she allegedly told a news producer in 2016 that epstein had tapes of both trump and clinton",
                "How many of the justices did she fuck or hook up?\n\nYou can't tell me that nasty motherfucker Thomas hasn't been to a party.",
                ">“Despite the existence of a non-prosecution agreement promising in plain language that the United States would not prosecute any co-conspirator of Jeffrey Epstein, the United States in fact prosecuted Ghislaine Maxwell as a co-conspirator of Jeffrey Epstein,” her attorneys wrote in their petition.\n\n[Cosby's case](https://www.nbcnews.com/news/us-news/agreement-not-prosecute-cosby-leads-his-freedom-exposes-prosecution-s-n1272859) was overturned for the same reason. Same with French actor [Jussie Smollett](https://capitolnewsillinois.com/news/supreme-court-dismisses-jussie-smollett-convictions-allows-trump-tower-defamation-suit-to-continue/) and his overturned conviction. Both were state level, however.",
                "The pedopublicans will let her go.",
                "Of course she is doing this.  There is no better time than the present to explore the court's blind loyalty to Trump and all his friends.",
                "I saw her face before the headline and really hoped it was about her dying in prison",
                "She has all the information about Trump. She could use it as a leverage just like What Russia did.",
                "Tbf she has every qualification for a high ranking position in the trump government … other than being a woman, obviously",
                "Let me guess Cheeto pardon incoming."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Mortgage rates surge over 7% as tariffs hit bond market",
            "external_url": "https://www.cnbc.com/2025/04/11/mortgage-rates-surge-tariffs-bond-market.html",
            "upvotes": 6257,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107400195-1712872692895-gettyimages-2148323929-rent403111_2ppre7by.jpeg?v=1744392745&w=1920&h=1080",
            "top_comments": [
                "Are we in the golden age yet?",
                "Who could have guessed that daily chaos and incompetence would yield such results?",
                "So everything is going up contrary to what Trump had promised.\n\nThis is just the first 3 months of Trump's presidency.",
                "I'll remember to say thank you I guess. /s",
                "Higher rates are MANLY. Just like the TARIFFS.",
                "Financial stress seems to be a speciality of new Oval Office .",
                "Well at least the 3 trans athletes in the U.S. are banned from women’s sports and that one innocent dad got sent to the Kessel Spice mines.",
                "How exactly is the market rising today?  I'm baffled by the move higher.  Is this just a move to provide liquidity for the market to short?",
                "Housing becomes even more expensive now eh?\n\nRemember when one of the candidates presented a plan to build millions of homes and reduce demand for housing thereby reducing costs? \n\nBut she laughed funny and she's a black woman.",
                "I have no clue how anyone can afford to buy a house with rates this high. We got our house 9 years ago and rates were around 4%. People told us, just wait, the rates will go lower and you can refinance. I highly doubt rates ever go near 4% again unless we go into a great depression."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Trump tariff collection for freight shipments delayed due to Customs ‘glitch’",
            "external_url": "https://www.cnbc.com/2025/04/11/customs-reports-glitch-in-system-used-by-freight-for-tariff-exemptions.html",
            "upvotes": 135,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108073450-1733781632119-gettyimages-2189087122-dji_20241209113800_0589_d_bs8zapr8.jpeg?v=1733839030&w=1920&h=1080",
            "top_comments": [
                "> Social media posts are not law on the pause and increase in tariffs. With the constant changes to the regulations, all customs brokers in our industry have a difficult task ahead of them,” one logistics executive tells CNBC.\n\nBut he can totally mentally declassify things on a whim /s",
                "Who would have thought radically changing the rules on things multiple times every week with no prior warning might lead to issues in processes and systems?!",
                "It’s amateur hour. Every hour. Of every fucking day.",
                "I thought they were making 2 billion a day…",
                "Customs agents hate this one trick!",
                "I suspect the system wasn't designed for hourly changes to the tariffs, and I can certainly see Mr Trump and Musk trying to rewrite the entire codebase to allow for \"whim pricing\".",
                "Who could have predicted this."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Young mother traveled to Miami for plastic surgery. She died hours later while at recovery house",
            "external_url": "https://www.nbcmiami.com/investigations/womans-death-post-surgery-recovery-house/3586743/",
            "upvotes": 395,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/04/Ahmonique-Miller-recovery-house-death-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Hopefully these stories are a reminder that plastic surgeries are no joke. Not something to try on a whim at a discount",
                "It's not actually clear that a license is required for a \"recovery house\" for plastic surgery patients in Florida. The only info I can find refers to \"sober living homes,\" halfway houses, or debt recovery businesses. Even the 2024 Florida Statutes governing \"recovery residences\" refers to substance abuse and addiction and says nothing about procedures such plastic surgery.\n\nOne would think something like this would be covered by licensing requirements, but we are talking Florida here after all.",
                "I’d love to know if complication from the surgery is what caused her death, or if she was killed by the medication provided to her at the recovery home.",
                "Even worse, it was not a licensed surgery recovery place. “Instead, according to a Miami Police incident report, officers and fire rescue crews responded to the house the night of March 7, which they say was “operating as an illegal post-plastic surgery recovery home.” Inside, they found Ahmonique already dead, and showing signs of rigor mortis, an indication she had likely been dead for hours. They described finding her as heavily bandaged, face down on a bed.” how awful.",
                "Everyone is focused on the plastic surgery aspect and not that this was a “Recovery House” which generally advertise caring for patients post-op. \n\nYou’d be surprised at the number of people who use these services for non-elective procedures as well. Not everyone who has surgery has a support network to care for them and hospitals will not perform surgery unless you can be discharged into someone’s care. So while it is true these “recovery houses” often care for plastic surgery patients, I’ve seen them used by folks who needed non-elective surgeries. And no, you can’t just call an uber driver to take you home because you have to be discharged with someone who can actually take care of you post-op. \n\nThere’s minimal regulations and this is going to be another case where the new regulations are written in blood.",
                "I am hoping to have weight loss surgery and if successful, I will need skin removal. But stories like this scare the hell out of me. This isn’t some cheap surgery in a foreign country, this is America. It happens here too like Joan Rivers and Kanye’s mom.",
                "Extreme Vanity can be deadly.",
                "It's not limited to Miami... but I've been around *a bit*, and even since the 80s, I've heard about plastic surgery horror stories specifically from Miami.",
                "When they say “all surgeries pose risks,” they are not kidding. Pay attention. You can die from plastic surgery, and from many, many other surgeries as well.  Surgery is not a recreational activity.",
                "The amount of younger gals with clear signs of surgery at the gym and younger guys with clear signs of steroids is growing like crazy . Most don't even make any significant gains ."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Trump orders probes of two former officials who defied him",
            "external_url": "https://www.nbcnews.com/politics/national-security/trump-orders-probes-two-former-officials-defied-rcna200523?utm_source=NBC&utm_medium=iframely",
            "upvotes": 328,
            "date": "04/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-05/230531-Christopher-Krebs-mjf-1024-27e3cc.jpg",
            "top_comments": [
                "Here it is from the horse’s mouth: https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/\n\nOfficial white house communication is starting to read like a ”conservative” news outlet.\n\n“Unite America” my ass.",
                "Dolores Trumpbridge : I am **a** tolerant man, but the **one thing** I will not **stand** for is **disloyalty!**",
                "Trump, you stupid, fat, dumb, fat idiot, why don’t you do something to help this country? Like stuffing your fat fucking face with Big Macs till the cholesterol tipping point hits. ",
                "Dictator doing Dictator things ",
                "Petty vindictive behavior like this looks like weakness. People with confidence and strength don’t need to lash out at others.",
                "Kim Jong Trump on duty.\n\nThe USA is the most ludicrous country in existence. Becoming a dictatorship by founding a cult around one of the shittiest people you can find on earth and then elect this person twice.",
                "What, no people thrown out of windows? Yet.",
                "If I recall \"Just following orders\" is not a valid defense.",
                "Less \"defied\" and more \"disagreed with\" but there's no difference to chump",
                "What did Putin do? Oh wait, you said Trump."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Mortgage rates surge over 7% as tariffs hit bond market",
            "external_url": "https://www.cnbc.com/2025/04/11/mortgage-rates-surge-tariffs-bond-market.html",
            "upvotes": 6274,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107400195-1712872692895-gettyimages-2148323929-rent403111_2ppre7by.jpeg?v=1744392745&w=1920&h=1080",
            "top_comments": [
                "Are we in the golden age yet?",
                "Who could have guessed that daily chaos and incompetence would yield such results?",
                "So everything is going up contrary to what Trump had promised.\n\nThis is just the first 3 months of Trump's presidency.",
                "I'll remember to say thank you I guess. /s",
                "Higher rates are MANLY. Just like the TARIFFS.",
                "Financial stress seems to be a speciality of new Oval Office .",
                "Well at least the 3 trans athletes in the U.S. are banned from women’s sports and that one innocent dad got sent to the Kessel Spice mines.",
                "How exactly is the market rising today?  I'm baffled by the move higher.  Is this just a move to provide liquidity for the market to short?",
                "Housing becomes even more expensive now eh?\n\nRemember when one of the candidates presented a plan to build millions of homes and reduce demand for housing thereby reducing costs? \n\nBut she laughed funny and she's a black woman.",
                "I have no clue how anyone can afford to buy a house with rates this high. We got our house 9 years ago and rates were around 4%. People told us, just wait, the rates will go lower and you can refinance. I highly doubt rates ever go near 4% again unless we go into a great depression."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Measles update: State of Texas reports 36 more cases",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-11/measles-update-state-of-texas-reports-36-more-cases",
            "upvotes": 406,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/2a7ecaf/2147483647/strip/true/crop/8474x4449+0+601/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2F19%2Fc2a32f2c4132aa32f1b91ebfe709%2F25052653529724-1.jpg",
            "top_comments": [
                "Owning the Libs one dead child at a time.",
                "According to today's update, New Mexico case numbers have increased to 58 from 56. They have reported one death that is suspected to be from measles but the official cause of death is still under investigation.\n\nOklahoma only updates on Tuesdays. They reported no new cases on Tuesday. Their reported case total is 10. \n\nKansas updates on Wednesdays. Their case total went to 32 from 24. They reported one hospitalization.",
                "If only there was a way to prevent measles.",
                "You know the real number is way higher",
                "I've truly lost hope for this outbreak improving any time soon. Especially after the father of one of the dead children said this. Apparently death doesn't count as \"way worse\". The ignorance is extreme, and children will die or suffer lifelong health issues from measles. \n\n> “I know it’s not effective because some family members ended up getting the vaccine, and they got the measles way worse than some of my kids,” said Hildebrand, who is raising two other children with his wife, Eva. “The vaccine was not effective.”",
                "Let's work to keep it in the Pray it Away states.",
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 24 cases. Last Friday's update added 59 cases. Last Tuesday's update added 22 cases. The previous Friday’s update added 78 cases.\n\nDon't know if it's an error, but the number of hospitalized reported by Texas went down from 57 to 56. Texas has reported two deaths associated with this outbreak.",
                "“Friday's update came soon after the San Antonio Metropolitan Health District reported that it will end some vaccinations for children because a grant funding those vaccines lost some of its federal financial support.\n\nThe Federal Immunization Vaccines for Children Grant was reduced from $3 million to $2.5 million, according to a memo from City Manager Erik Walsh. He said the grant will not be able to cover the vaccine clinical operations.”\n\nGreat timing, eh?",
                "We need to build a wall around Texas.",
                "If we stop reporting cases it’ll just go away /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ghislaine Maxwell, jailed Epstein accomplice, appeals case to US Supreme Court",
            "external_url": "https://abcnews.go.com/US/ghislaine-maxwell-jailed-epstein-accomplice-appeals-case-us/story?id=120714835",
            "upvotes": 800,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6aff8375-2c34-49f9-8e94-4a18fb2c6d39/ghislaine-maxwell-gty-jef-250411_1744379276507_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Not been pardoned yet?",
                "she allegedly told a news producer in 2016 that epstein had tapes of both trump and clinton",
                "How many of the justices did she fuck or hook up?\n\nYou can't tell me that nasty motherfucker Thomas hasn't been to a party.",
                ">“Despite the existence of a non-prosecution agreement promising in plain language that the United States would not prosecute any co-conspirator of Jeffrey Epstein, the United States in fact prosecuted Ghislaine Maxwell as a co-conspirator of Jeffrey Epstein,” her attorneys wrote in their petition.\n\n[Cosby's case](https://www.nbcnews.com/news/us-news/agreement-not-prosecute-cosby-leads-his-freedom-exposes-prosecution-s-n1272859) was overturned for the same reason. Same with French actor [Jussie Smollett](https://capitolnewsillinois.com/news/supreme-court-dismisses-jussie-smollett-convictions-allows-trump-tower-defamation-suit-to-continue/) and his overturned conviction. Both were state level, however.",
                "The pedopublicans will let her go.",
                "Of course she is doing this.  There is no better time than the present to explore the court's blind loyalty to Trump and all his friends.",
                "I saw her face before the headline and really hoped it was about her dying in prison",
                "She has all the information about Trump. She could use it as a leverage just like What Russia did.",
                "Tbf she has every qualification for a high ranking position in the trump government … other than being a woman, obviously",
                "Let me guess Cheeto pardon incoming."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Pressed for evidence against Mahmoud Khalil, government cites its power to deport people for beliefs",
            "external_url": "https://apnews.com/article/mahmoud-khalil-columbia-university-trump-c60738368171289ae43177660def8d34?utm_source=Rantt+Newsletter&utm_campaign=2441672fca-EMAIL_CAMPAIGN_2025_04_10_11_05&utm_medium=email&utm_term=0_-2441672fca-572095729",
            "upvotes": 919,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Keep in mind the Whitehouse has openly stated they are looking into being able to deport US citizens. Attach this to their \"supposed\" ability to deport people for their beliefs, and I'm sure you can do the math.",
                ">Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\n\nWhat power? There is no lawful means by which they may \"abridge the freedom of speech.\"",
                "If the White House is so concerned about anti-Semitism, they certainly would immediately deport any foreign national who made a Nazi salute at a very large public gathering, correct?",
                "So freedom of speech, but not thought",
                "Really wish people would stop crying \"antisemitism\" any time someone speaks out against Israel. Calling out a country for their blatant war crimes is not antisemitism 🤦🏿‍♂️ nor is advocating for the safety and rights of innocent people being victimized",
                "Is this the party of small government ?",
                "Their evidence amounts to Rubio saying this guy is bad; this should be thrown out of court with prejudice",
                "Holy shit!  Thought crimes now?!  Minority Report has finally become reality.",
                "# \"The illegal we do immediately. The unconstitutional takes a little longer.\"\n\n*- Henry Kissinger, currently burning in hell*",
                "American conservatives are fundamentally against the First amendment"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Rep. Marjorie Taylor Greene bought stocks hit hard by Trump tariffs during the market meltdown",
            "external_url": "https://apnews.com/article/greene-stocks-conflicts-interest-restoration-hardware-tariffs-trump-f9922a970c837cb76dd8ddc01f20f51d",
            "upvotes": 5225,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s called insider trading.",
                "It's amusing her defense for buying the stocks hit hard by tariffs is ... \"tariffs are good\".",
                "Would any sane person just decide to purchase hundreds of thousands of dollars in stocks in the deep red during historic market uncertainty?  No, not unless they knew it was going to pay off 30 minutes later.  It’s so fucking blatant. ",
                "Maybe her son's GoFundMe got her in the mood to fleece people?",
                "That's about what I'd expect from the Majorly Traitorous Goblin",
                "Of course she did. She has the ethics and spine of a slug.",
                "Of course she did. She’s as crooked as all the rest of the GQP creepers.",
                "Jon Ossoff should be loud and clear if he was part of the insider trading. MTG is vying for his senator seat and he needs to be clear.",
                "Insider Trading. If Dems get back in power. They better not be nerdy and wimpy and fight just as dirty as MAGA. Trump has immunity not the rest of them. Not sure what they thought he wanted immunity for in the first place. This seems like it was all planned.",
                "Absolute corruption. This treasonous POS had clear insider knowledge that prompted her actions which is a felony punishable by time in prison. Martha Stewart did far less and yet was convicted and imprisoned so this scumbag serial adulteress needs to suffer the consequences of her illegal actions"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US consumer sentiment, inflation expectations deteriorate sharply in April",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-inflation-expectations-deteriorate-sharply-april-2025-04-11/",
            "upvotes": 921,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "People can see the way Trump+cronies are utterly destroying, embezzling, manipulating the government and market right now. The uncertainties over tariffs are as bad as the tariffs themselves. We sense something is fake, scammy, a cheat.\n\nPeople do lose faith in systems.",
                "wdym mass government layoffs and a stock market crash might make people uncertain about the economy?\n\nAs someone who relies on government funding for his job in medical research, all of my non-essential expenditures are on hold indefinitely. Lots of money not going into my local economy hiring people to do things like remodeling my bathroom or doing landscaping projects.",
                "From the \"envy of the world\" to the \"collapse of empire\" in 3 months",
                "The country is being looted by the wealthy and conservatives are cheering for it.",
                "> The University of Michigan Surveys of Consumers on Friday said its Consumer Sentiment Index dropped to 50.8 this month from a final reading of 57.0 in March. Economists polled by Reuters had forecast the index falling to 54.5.\n\nThis is still the initial shock, wait until we see the ripples. The impact of federal layoffs, halted funding, rising prices, and an erratic administration is going to continue to tank consumer confidence. It's also going to tank the spending power of the average household.",
                "It's only going to be a lot worse next month. ",
                "My family and I are remaining in a strict unnecessary spending freeze and will likely stay that way for about 4 years. We’re going to do our best to weather this chaos.",
                "Is this what MAGA looks like?",
                "It’s almost like the president put blanket tariffs on everyone and more than doubled the price of importing goods from one of our biggest trade partners or something.",
                "I think the phrase you're looking for is \"utter hopelessness\"."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Man has sex with corpse on NYC subway, sources say",
            "external_url": "https://www.nbcnewyork.com/new-york-city/man-sex-corpse-nyc-subway-video-r-train-body/6220060/",
            "upvotes": 3974,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/r-train-body.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Wait... so it sounds like this guy didn't bring the corpse there. Like, someone died on the subway, and someone decided to sexually assault the body.",
                "Well that's a new thought I should've never had \n\n\"Boy I sure hope I don't die on a train in New York.Wont even be able to rest peacefully.\"",
                "I wonder what the possible range of sentences in NYC for public necrophilia is.\n\nI also wonder what led us to the point in society where I can use 'public necrophilia' in a sentence and have it be 100% serious (and relevant).",
                "\"Investigators believe the body may have been on the train for hours...\"\n\nWhy are there so many NYPD cops down there then? Couldn't stop a shooting, a woman being burned alive, a dead person being violated sexually, etc. Literally what the fuck do they actually do besides play games on their phones like the adult versions of iPad babies?",
                "How does this decision process even work? You're in New York, for whatever reason you're a necrophiliac....You're out shopping, because I imagine necrophiliacs still need certain essentials, you take the Subway..\n\n\"Dear diary...JACKPOT.\"",
                "[removed]",
                "JFC...what a terrible day to be literate",
                ">“It's believed the entire assault... took several minutes.”\n\nGoodness... it's truly shocking to think about how long this went on, and I can't even fathom the level of depravity required to commit such an act, it's absolutely sickening, and I just hope that whoever did this is caught and brought to justice quickly, seriously, what kind of person does something like that?",
                "I pine for the days of Kraft Punk on NYC Subways.",
                "Can you imagine being the cops watching the surveillance video to see what happened to the dead guy and then seeing this whole sordid tale play out? "
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Israeli military organises tourist tours of newly occupied Syrian territory",
            "external_url": "https://www.theguardian.com/world/2025/apr/11/israeli-military-organises-tourist-tours-of-newly-occupied-syrian-territory",
            "upvotes": 262,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e4f6302824bc1c9f72d2eecba91d7b5858529f3/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=debc208a7e25cdd0d0e95622faeaa7bc",
            "top_comments": [
                "Wasn't the whole alleged purpose of this supposed to be to create a larger buffer zone? What the hell are civilians doing in a buffer zone?",
                "You would think if there was any country in the world that might be a bit sensitive to using the Nazi playbook, it'd be Israel, but obviously you'd be wrong.",
                "Imagine the reaction in r/worldnews if Russia did this.",
                "There might be method behind it. They send civilians into disputed territory in hopes of them getting killed, thus constructing a raison d'être to attack Syria even more.",
                "\"We were invited! Punch was served!\"",
                "Yay, Safari! Do we get to shoot those \"wild beasts\" like them?\n\nPOS country being POS country.",
                "They really need a Disney over there or something else to do, yeah?",
                "future realtors/clients estimating the values of newly \"created\" \"real estate\".",
                "Did I miss something? When did Israel invade Syria?",
                "The headline doesn't match the text of the article.\n\nThey seem to be trying to conflate the Golan Heights with the territory occupied since the fall of the Assad regime.\n\nThe Golan Heights are contested, but even this article is saying that it's in the areas Israel Annexed in 1967 after Syria used the Golan Heights to bomb Israel."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Oklahoma woman stole $1.5 million from elderly women in romance scams, officials say",
            "external_url": "https://www.cbsnews.com/news/romance-scam-oklahoma-women-christine-joan-echohawk/",
            "upvotes": 256,
            "date": "04/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/977d6a49-93d7-44b9-b69e-cb4be2c3829b/thumbnail/1200x630/ce56598c74ec0d63b46410210d6602d4/gettyimages-1340975078.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "As someone who is getting older, though not elderly (yet), I think about this stuff. There is an army of people who make their living taking advantage of the elderly. I cringe at the stories my mother tells me about scam services she has purchased. People are constantly coming to her door to pressure her to let them do something to her house.\n\nAnd that is just in person. Don't get me started with online stuff she does. I told her if there is ANY doubt, assume it is a scam. Or check with one of us 'kids' first. Companies like Amazon and Microsoft don't give a shit about you and will not proactively contact you about any problem. And anytime you hear 'gift card', it is automatically a scam. Why would one of your friends want you to purchase a dozen gift cards, reveal the codes, take a picture and send it to them? It makes no sense. She was about 10 minutes away from doing it before her friend called her to say her email account was hacked.",
                "* calling herself \"Edward Lotts\" and saying the money was needed to pay off a debt that would allow \"Lotts\" to receive a $2 million payment... the victim sold her paid-off home to send Echohawk $600,000.\n* \"Jason Morris,\" ...needed money to buy supplies and fuel for an oil tanker in Turkey, the affidavit said. That victim allegedly sent over $100,000 in Apple gift cards, cash and money wires. \n* \"Glenn Goddard\" ...had known each other since college... The victim was convinced to pay $250,000 \"for expenses related to a financial portfolio he was sending her from Syria,\" ... The funds were sent via gift cards, cash and a cashier's check. \n* \"Jason Morris\" ...told the victim that the money would pay for an alleged oil vessel in Alaska that needed fuel to return to shore ...they could move in together once the payment was received and the ship was docked. That victim sent $40,000 in Apple gift cards and $170,000 in two wire transfers. ",
                "The most depressing part is the scammer seems to maybe have just been sending the money they made to yet another scammer.",
                "Scammers should get jail for life. No remorse from me. Right up there with pedophiles.",
                "This sounds like a man in my community who gave millions of dollars to romance scammers, lost his house. One of his relatives took him in and then he did something where he tried to use their money to a \"girlfriend\" so they kicked him out and he was living on the streets, panhandling for money to send to his \"girlfriend.\" For some reason the court wouldn't hear a conservatorship for him."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/11/2025 20:09:32 UTC"
}