{
    "posts": [
        {
            "category": "HOT",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 4731,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "How much money has this administration, Noem, wasted on this kind of horse shit..... Enough. tRumps band of idiots can't find the 11 million illegals he claimed were in the US illegally so they've been creating them. Revoking visas for bullshit traffic infractions is childish and a complete waste of tax dollars. tRumps administration has been a clusterfuck from day one!",
                "Revoked over…a 3-year old traffic stop. Wow.",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "Of course they tried to. They need to inflate those deportation numbers somehow, to make Mickey Orange look good... "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "NYU withholds diploma of student who condemned Israel in graduation speech",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/nyu-withholds-diploma-israel-gaza-speech",
            "upvotes": 13163,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/50a8b417bb29a67d134561adaf29dd02e7aca775/570_0_5700_4562/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c34e9eea0a814065090f92fa9f029a1",
            "top_comments": [
                "this will be an interesting one for the courts.\n\n\nfederal law [prevents colleges from withholding diplomas for disciplinary issues](https://registrar.lmu.edu/ferpa-rightsandprivacyact/#:~:text=FERPA%20requires%20that%20education%20records,on%20release%20of%20directory%20information.) to prevent this exact situation, a graduate isnt liked by someone on the schools board, so they choose to withhold their diploma. withholding one against federal law can lead to your school losing accreditation, which is a death sentence for a college because ALL diplomas issued by them become worthless in every career field.\n\n\nthey can only withhold it if you owe them money, or they believe you committed fraud to get your degree. the fraud claim requires an academic court ruling to withhold diplomas or honors",
                "The use of the term anti-governmental to describe the USAID speech a month ago was the sign of how fascist NYU already was. Anti-governmental is completely valid speech in the US. Just say Anti-regime you fucking cowards. I'm sure a lawyer will volunteer to inform NYU of their inability to withold the degree and this will be quietly resolved.",
                "Ah, this sounds like the free speech Musk and Vance have been ranting about.",
                "They are drawing so much more attention to this than they need to. Some textbook Streisand Effect going on.",
                "What's this American infatuation with Israel? I just don't seem to understand.",
                "What the hell kind of reality are we living in?!",
                "[removed]",
                "I feel like my whole country is built on lies.  Free speech first among them.",
                "Free speech? Ehhhhh.\n\nAcademic freedom? Ehhhhh.\n\nDetermining truth in a marketplace of ideas? Ehhhhh.\n\nThought police? Now you're talking!\n\nIt's just so *easy* to not have to debate and discuss!",
                ">Rozos went on to say: “The genocide currently occurring is supported politically and militarily by the United States, is paid for by our tax dollars and has been livestreamed to our phones for the past 18 months. And that I do not wish to speak only to my own politics today, but to speak for all people of conscience, and all people who feel the moral injury of this atrocity.”\n\n>\n\nThink about it.\n\nWhy is it so important to Democrats and Republicans that Americans or  foreigners in America support a Far Right Wing fascist foreign Government like Israel?  Free speech exists in America to support or condemn any country we want, to protect unpopular speech.   This is another person who was viewed as an \"Anti-semite\" for criticizing the Israel Government or Zionist that operate that government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Coinbase says hackers bribed staff to steal customer data and are demanding $20 million ransom",
            "external_url": "https://www.cnbc.com/2025/05/15/coinbase-says-hackers-bribed-staff-to-steal-customer-data-and-are-demanding-20-million-ransom.html",
            "upvotes": 702,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108146289-1747336602924-gettyimages-1312540542-_dsc9048.jpeg?v=1747390314&w=1920&h=1080",
            "top_comments": [
                "This is becoming increasingly common with overseas support companies where the agents are being offered over 1 month's worth of salary for inside knowledge on user accounts. They've also been targeting internal employees and offering significantly more due to their deeper access. \n\nAnd it's easy to do. The lower wages, the easy ability to get jobs, the lack of security to get in/out of buildings, and the constant rotation of new employees make it too easy to bribe these folks. They'll just go end up working for another company afterwards and do the same thing.",
                "\"All your coinbase are belong to us\"",
                "This would explain why I keep getting so many scam texts about my coinbase account",
                "S&P 500 company behavior.",
                "Coinbase sent out emails to anyone that had their data leaked.  It's a big deal because one of things that was leaked was images of people's ID's they used to verify their identity with Coinbase.",
                "This is what happens when you sublet large swaths of your company to India. Plenty of insurance companies are in the process of replacing their staff with remote Indian workers, this will only get worse and more common.",
                "Annnnd this is why INFOSEC and anything with database shouldn't be send oversea just because it is \"cheaper\".",
                "This is the kind of quality hiring and compliance that investors should expect with S&P 500 companies.",
                "I can't freaking wait for the crypto market to crash.",
                "Only personal info was taken, name, email, address and phone number. No passwords, SSN/TIN etc. \n\nDo no respond to ANY messages from coinbase, if contacted reach out to their team via their website only. \n\nCoinbase is FULLY REFUNDING anyone who was targeted and has reached out to many. \n\nThey’ve relocated entire support divisions due to this and are enhancing their security to make this much harder to do. \n\nAnd instead of paying the ransom, they’re offering the $20 million as a reward to the arrest of anyone involved in this. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Verizon ending DEI programs as it seeks US approval for Frontier deal",
            "external_url": "https://www.reuters.com/sustainability/society-equity/verizon-ending-dei-programs-it-seeks-us-approval-frontier-deal-2025-05-16/",
            "upvotes": 654,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Our government just engages in extortion now.  Really making America great again.",
                "“Verizon Communications said Friday it is ending diversity, equity and inclusion programs after the Trump administration opened a probe and as the U.S. telecom carrier seeks approval to purchase Frontier Communications”\n\nInteresting timing to say the least",
                "And another takes the knee and swears fealty to “The Party”. Sad, but it is the times we live in and the regime we live under.",
                "Time to switch carriers.",
                "And now I want to cancel my Verizon plan and go with someone else.  They want to kneel to fascists and racists?  Then they don't need my money.",
                "It's this why everyone's bill had to go up $5 last month, even though we got nothing new/better in return?",
                "If anyone is delusional enough to think corporations care more about morality rather than chasing the profit think again. It is another proof that those DEI policies were just for the show and PR.",
                "Tell me again how republicans are for small government and personal responsibility. Fucking hypocritical ghouls.",
                "DEI is just a way to make sure HR doesn't overlook more qualified minorities and women in favor of the usual, often less-experienced/qualified white guy..... It's just ridiculous that DEI has become an excuse for overt discrimination against people....firing people because they are a minority or female (as Trump seems to enjoy doing).  Many of those fired had to work twice as far, to get half as far....except of course Trump born with a silver spoon in his mouth.",
                "Happy I dropped Verizon a year ago at this point. Good riddance."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Georgia woman missing in California's Sierra Nevada for weeks found alive in snow-covered cabin",
            "external_url": "https://www.cbsnews.com/sacramento/news/georgia-woman-missing-in-california-sierra-nevada-found-alive/",
            "upvotes": 11645,
            "date": "05/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/15/3f856e8d-3539-478f-b0c8-c10e8393c354/thumbnail/1200x630/8643f51bc3c0fa17ad8816e9033898a1/slaton.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "> Gutierrez said he leaves a cabin unlocked for situations like this, allowing for an increased chance of survival.\n\nThe true hero of this story.",
                "The first thing she did was go to hug her rescuer, the first thing her dad did when she knew she was safe was to hug the nearest person to him. 🥲",
                "I remember this woman's brother posting in some of the local hiking subs asking for help searching etc. Astonishing she was found, I'm so glad.",
                "Good news feels rare these days. So happy she was found alive",
                "Driving the Alcan and took a wrong turn and ended up going a few hours out of our way which sucked. Pull over to a small cabin with a map board and confirm we were going the wrong way but man that cabin was soooo cool. It was a big out cabin hours from any civilization that had two bunk beds, basic canned food, firewood with a wood stove and other basics and an outhouse. There was a wonderful guest book and read through stories of people getting stuck in storms and finding the cabin and using it to survive the night or until the weather passed and they could get back on the road. Totally worth the detour, also saw my first and only white colored black bear.",
                "The cabin owner SAVED HER LIFE!\n\nHe admitted he only leaves one of his cabins unlocked and stocked with emergency supplies SPECIFICALLY for blizzard shelter in case of emergency like this.\n\nFucking saint.",
                "The BLM handles the upkeep on alot of little cabins on public land for just this reason",
                "This is wonderful news! So happy that she was fine and going home to her family. \n\nAlso, how wonderful sounding is that family? Tiffany is found and the first thing she does is hug her rescuer. Her mother is told she’s been found and all she wants is a hug from a stranger. \n\nSound like lovely people which makes me extra glad Tiffany was found alive and well.",
                "She was lost for THREE weeks?! Wow that’s miraculous",
                "Everyone please, buy an SOS device."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 32637,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "You can't donate the organs of someone who died without their consent but a braindead woman who does not consent to this (nor does her family) must remain an incubator. Corpses have more rights than women. This is fucking shameful. And when the baby is born, then what? The family takes the baby? And who has to pay for all these hospital bills to keep her alive? Like what if they were not in a place financially to do that? This is where the claim that this is \"pro life\" completely falls apart. These people do not give a fuck about anything except controlling the bodies of women. Some days it feels like my anger at this country is going to completely drive me insane.\n\nWomen are not state-sanctioned gestation tanks. Fuck anyone who voted for this administration.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs.",
                "How DARE they use that photo while reporting she was 9 weeks pregnant. They’re deliberately misleading the public into thinking this was a full term viable pregnancy rather than what it really is which is the same age most pregnancies fail. This is not only ghoulish on the people responsible but on NBC for this deliberately manipulative reporting. Shame on NBC and I hope you all will spread the word where you can. This has major implications.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "This is some genuine Handmaids Tale shit.",
                "It's even worse than what a lot of posters here are reacting to: there's a good chance that if it weren't for the risks to the pregnancy, the doctors could have intervened with the clots that rendered her braindead, because they mentioned that they had found it in time and were about to try to relieve pressure. She's braindead because of that. They aren't just keeping her on life support to incubate the fetus, they KILLED HER in order to incubate the fetus."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "James Comey investigated over seashell photo claimed to be ‘threat’ against Trump | James Comey",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/james-comey-instagram-trump",
            "upvotes": 2774,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7832fb1e817d30f8bd6f8e465fc9b6d9ade3a40c/290_0_2871_2297/master/2871.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d71f111554cc25fb4b0e0a44e155197",
            "top_comments": [
                "Bet he wouldn't have released that Hillary statement in 2016 if he had it to do over agin. Haha, fuck Comey.",
                "Nothing but a bunch of fucking children.",
                "What about Biden hogtied in those truck paintings?",
                "lol I remember when republicans put crosshairs over the profile pictures of all the dems they wanted to “eliminate” from their positions and then there was an assassination attempt on Gabby Giffords, who had been pictured.\n\nMidterms will shackle Trump. Hold strong everyone.",
                "I mean, when I think of seashells, I definitely think of Trump. Though only when it's 3 seashells, specifically.",
                "You'd think the right would be more grateful to the man who put his finger on the scale in 2016 to help put us where we are.",
                "Maybe he shouldn’t have, I dunno, not broken all previous FBI protocols to tip the scales towards Trump and help him win with announcing every detail about Clinton’s email investigation (while not disclosing a single thing about Trump’s collusion with RUSSIA investigation) then he wouldn’t be in this situation.  He should deal with the erosion of American democracy like every other citizen now - he enabled it.",
                "I'm sure the Maga crowd would have had no problem if it had said 88 47.",
                "LOL so Trump called for and successfully incited a riot against Mike Pence and the Capitol and then pardoned all of those who were punished, but Comey is the bad guy now for taking a photo of a few sea shells...",
                "86 means throw out, not kill.  They all know this, but if the outrage machine runs out of fuel it starts eating itself."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Federal judge orders Marshall man detained by ICE to be immediately released",
            "external_url": "https://www.mprnews.org/story/2025/05/14/federal-judge-orders-marshall-man-detained-by-ice-to-be-immediately-released",
            "upvotes": 5683,
            "date": "05/15/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Some band recently had to cancel their European tour because their Mexican drummer, who was *in the country legally*, got detained at the airport to *fly out of the country*.",
                ">…arrested Harsono in March at his job at a Marshall hospital, days after his student visa was revoked without his knowledge.\n\nThey revoked his visa without his knowledge! Setting him up for his arrest. Disgusting.",
                "Honestly, does anyone think he's actually going to be released?",
                "Send ICE Barbie to El Salvador in his stead, she's overdue for another fashion show - this time let her do it from the other side of the bars.",
                "\"lol, no. Get fucked.\"\n\n\\-ICE to Judge, 2025.",
                "Our Concentration Camps are getting outta hand. Are we the bad guys?",
                "Ice: just put him in a plane to New Mexico",
                "Why aren't there clashes between enforcing departments of government? Why aren't the US Marshalls going to ICE detention centers and trying to pull people out? I mean besides widespread institutional racism, nepotism, and cronyism at every level.",
                "Until the fascism stops, I’m not paying taxes. I refuse to fund this unconstitutional authoritarian clown show. We need a national tax strike.",
                "That baby is adorable"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Voyager 1 alive for another day with Hail Mary thruster fix",
            "external_url": "https://www.theregister.com/2025/05/15/voyager_1_survives_with_thruster_fix/",
            "upvotes": 2206,
            "date": "05/16/2025",
            "thumbnail": "https://regmedia.co.uk/2017/12/03/voyager_probe_shutterstock.jpg",
            "top_comments": [
                "Voyager has outlived nearly all the scientists and engineers that developed and launched her. Travel well, our pilgrim to infinity!",
                "Spirit of ingenuity under pressure still survive in NASA's Jet Propulsion Laboratory.  \n\nHat's off to engineers who thought of a solution and executed program that revived thruster that was thought to be irreparable.",
                "15.6 billion miles away.  And still not to the Oort Cloud.  Damn!",
                "Voyager has a special place in my heart.  When everything else eventually ends here in our solar system, Voyager will be all that's left saying we were ever here.  Godspeed, Voyager.",
                "A \"Hail Mary\" fix... did Rocky break out the xenonite?",
                "Pretty flipping cool.  I’d love to see some pics of us from that far out in the cosmos.",
                "I needed that. Godspeed Voyager!",
                "Godspeed … We carbon based life forms eagerly await your return V’ger",
                "Receives its update from the US, becomes aware of current news… thrusters magically roar back to life as Voyager 1 tries with all of its might to get further away",
                "Again, always amazing to me that voyager keeps orientation entirely  by chemical thrusters, not any form of reaction wheel. The precision involved in firing those thrusters must be incredible."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Rushdie attacker sentenced to 25 years in prison",
            "external_url": "https://www.bbc.com/news/articles/cp85kg527p9o",
            "upvotes": 230,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c827/live/438c76d0-3265-11f0-a80a-0d849379e1d9.jpg",
            "top_comments": [
                ">\"Salman Rushdie wants to disrespect other people,\" said Matar, clad in white-striped jail clothing and wearing handcuffs. \"He wants to be a bully, he wants to bully other people. I don't agree with that.\"\n\nSir, you *stabbed* people. You don't get to call anyone a bully.",
                "“Two nights before the attack, Salman Rushdie dreamed he was stabbed onstage. Today, his attacker has been sentenced to 25 years in prison.\n\nRead more: NPR Article”\n\nMan who stabbed Salman Rushdie convicted of attempted murder \n\nhttps://www.npr.org/2025/02/21/nx-s1-5305184/hadi-matar-salman-rushdie-stabbing-verdict\n\n> Speaking to NPR's Fresh Air about the book, Rushdie said he had a dream that he was publicly stabbed just two nights prior to the incident, and he almost cancelled the event where he was then attacked.",
                "We really need to get rid of religion, this dude gonna waste a third of his life in prison because he stabbed someone over his imaginary friend... that is legit insane.",
                "Proving once again how ridiculous religion is in a sane world.",
                "Send him to El Salvador",
                "Not the best way to go about but fuck Salman Rushdie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump agrees deal for UAE to build largest AI campus outside US",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/trump-artificial-intelligence-uae?utm_source=chatgpt.com",
            "upvotes": 5,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d366b3b21608957ff04add867d3343c8969fe6b/339_0_3331_2666/master/3331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10b67d750a6bab2874750f7a5e73a7e8",
            "top_comments": [
                "Bringing jobs back to . . . . Make Arabia Great Again?",
                "This entire trip so far has been such a disgrace to America and its people"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police investigate disappearance of Melania Trump's statue in her native Slovenia",
            "external_url": "https://apnews.com/article/melania-trump-statue-slovenia-9440b43a0a6771256522290fb219efce",
            "upvotes": 84,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The [life-size sculpture](https://apnews.com/general-news-fa29ec746c9200c33033177ac3a1d146) was unveiled in 2020 during President Donald Trump’s first term in office near Sevnica in central Slovenia, where Melanija Knavs was born in 1970. It replaced a wooden statue that had been set on fire earlier that year.\n\nI guess statues of Melania aren't too popular in Solvenia!",
                "I really don’t care. Do you?",
                "LOL. There’s a fucking statue of this woman that achieved absolutely nothing of significance whatsoever?\n\nSlovenia: “Hey, we’re commissioning you to make a sculpture for our town square”\n\nSculptor: “Wow! One our olympians perhaps? One of many scientists or scholars? Maybe Fritz Pregl, Nobel Prize winner?”\n\nSlovenia: “Mmmmm, not exactly, no”",
                "Just like the real Melania, the statue disappeared shortly after the election…",
                "Your home must be pretty sad if the big figure they build a statue in honor of is a foreigners mail order bride.",
                "\"And here's our statue of what we're told is a beautiful woman who spread her legs for the promise of a comfortable life!\"",
                "Have the police checked in the trash heap of history? Oh wait, that's a few years down the line.",
                "The guy who stole Jackie Robinson's statue got [15 years](https://apnews.com/article/jackie-robinson-statue-stolen-wichita-league-42-12a991dd637e54c8ee474ff1aa7bc914).",
                "She had a statue? Was it part of the \"I married a billionaire for his money\" exhibit?",
                "Cue the MAGAs whining about free speech lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Strike by New Jersey Transit train engineers leaves some 350,000 commuters in the lurch",
            "external_url": "https://apnews.com/article/new-jersey-transit-strike-train-engineers-nyc-08a230d45019fb96211c4b5710425cfc",
            "upvotes": 64,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "New Jersey's really getting hit with a real-life ['Planes](https://www.npr.org/2025/05/13/nx-s1-5396838/newark-airport-three-radar-controllers-monitored-airspace-faa), Trains and [Automobiles'](https://www.cbsnews.com/newyork/news/interstate-80-hole-rockaway-new-jersey/) scenario.",
                "Trouble brewing in Philly as well, SEPTA is cutting tons of lines and getting big schedule cuts starting late summer. Even if everyone affected drives a car, Philly cannot handle the cars in any way shape or form."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Rushdie attacker sentenced to 25 years in prison",
            "external_url": "https://www.bbc.com/news/articles/cp85kg527p9o",
            "upvotes": 230,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c827/live/438c76d0-3265-11f0-a80a-0d849379e1d9.jpg",
            "top_comments": [
                ">\"Salman Rushdie wants to disrespect other people,\" said Matar, clad in white-striped jail clothing and wearing handcuffs. \"He wants to be a bully, he wants to bully other people. I don't agree with that.\"\n\nSir, you *stabbed* people. You don't get to call anyone a bully.",
                "“Two nights before the attack, Salman Rushdie dreamed he was stabbed onstage. Today, his attacker has been sentenced to 25 years in prison.\n\nRead more: NPR Article”\n\nMan who stabbed Salman Rushdie convicted of attempted murder \n\nhttps://www.npr.org/2025/02/21/nx-s1-5305184/hadi-matar-salman-rushdie-stabbing-verdict\n\n> Speaking to NPR's Fresh Air about the book, Rushdie said he had a dream that he was publicly stabbed just two nights prior to the incident, and he almost cancelled the event where he was then attacked.",
                "We really need to get rid of religion, this dude gonna waste a third of his life in prison because he stabbed someone over his imaginary friend... that is legit insane.",
                "Proving once again how ridiculous religion is in a sane world.",
                "Send him to El Salvador",
                "Not the best way to go about but fuck Salman Rushdie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "‘Napalm Girl’ may be work of different photographer, World Press Photo says",
            "external_url": "https://www.theguardian.com/artanddesign/2025/may/16/napalm-girl-world-press-photo",
            "upvotes": 165,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3c5f3fde122170d313948508a8500bdf43c4b1a5/147_0_2748_2197/master/2748.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d13629473a6905c683b655f575cd3072",
            "top_comments": [
                "It's so difficult to read articles when the advertisements keep changing size when they load in, and scrolls the page from where I'm reading.",
                "From the article:\n\n>The resulting report revealed “inconsistencies on both sides” but concluded that buying Nghe’s story would “require several leaps of faith”, such as believing that the only time he sold photos to a western news agency, it turned out to be one of the most famous images of the 20th century.\n\nYeah smells fishy. Maybe he took the photo, but he sold it for $20 and then kept quiet once he saw the photo on tv every night? Waiting more than 50 years to reveal that it actually was him all along?",
                "Not really relevant, but I have met the girl in the photo. She came to my grade school to speak 30ish years ago.",
                "[removed]",
                "The picture won an award, but he didn't say anything until 50 years later.",
                "Pretty jarring to see people smiling while holding a photo like that",
                "i know whose \"work\" it is: the united states of america and their military industial complex who went as far as to assasinate a president to keep that illegal war going cause he wanted to stop funding it and pull the boys out.... not much changed since ... shit just got worse",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Verizon ending DEI programs as it seeks US approval for Frontier deal",
            "external_url": "https://www.reuters.com/sustainability/society-equity/verizon-ending-dei-programs-it-seeks-us-approval-frontier-deal-2025-05-16/",
            "upvotes": 655,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Our government just engages in extortion now.  Really making America great again.",
                "“Verizon Communications said Friday it is ending diversity, equity and inclusion programs after the Trump administration opened a probe and as the U.S. telecom carrier seeks approval to purchase Frontier Communications”\n\nInteresting timing to say the least",
                "And another takes the knee and swears fealty to “The Party”. Sad, but it is the times we live in and the regime we live under.",
                "Time to switch carriers.",
                "And now I want to cancel my Verizon plan and go with someone else.  They want to kneel to fascists and racists?  Then they don't need my money.",
                "It's this why everyone's bill had to go up $5 last month, even though we got nothing new/better in return?",
                "If anyone is delusional enough to think corporations care more about morality rather than chasing the profit think again. It is another proof that those DEI policies were just for the show and PR.",
                "Tell me again how republicans are for small government and personal responsibility. Fucking hypocritical ghouls.",
                "DEI is just a way to make sure HR doesn't overlook more qualified minorities and women in favor of the usual, often less-experienced/qualified white guy..... It's just ridiculous that DEI has become an excuse for overt discrimination against people....firing people because they are a minority or female (as Trump seems to enjoy doing).  Many of those fired had to work twice as far, to get half as far....except of course Trump born with a silver spoon in his mouth.",
                "Happy I dropped Verizon a year ago at this point. Good riddance."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Coinbase says hackers bribed staff to steal customer data and are demanding $20 million ransom",
            "external_url": "https://www.cnbc.com/2025/05/15/coinbase-says-hackers-bribed-staff-to-steal-customer-data-and-are-demanding-20-million-ransom.html",
            "upvotes": 706,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108146289-1747336602924-gettyimages-1312540542-_dsc9048.jpeg?v=1747390314&w=1920&h=1080",
            "top_comments": [
                "This is becoming increasingly common with overseas support companies where the agents are being offered over 1 month's worth of salary for inside knowledge on user accounts. They've also been targeting internal employees and offering significantly more due to their deeper access. \n\nAnd it's easy to do. The lower wages, the easy ability to get jobs, the lack of security to get in/out of buildings, and the constant rotation of new employees make it too easy to bribe these folks. They'll just go end up working for another company afterwards and do the same thing.",
                "\"All your coinbase are belong to us\"",
                "This would explain why I keep getting so many scam texts about my coinbase account",
                "S&P 500 company behavior.",
                "Coinbase sent out emails to anyone that had their data leaked.  It's a big deal because one of things that was leaked was images of people's ID's they used to verify their identity with Coinbase.",
                "This is what happens when you sublet large swaths of your company to India. Plenty of insurance companies are in the process of replacing their staff with remote Indian workers, this will only get worse and more common.",
                "Annnnd this is why INFOSEC and anything with database shouldn't be send oversea just because it is \"cheaper\".",
                "This is the kind of quality hiring and compliance that investors should expect with S&P 500 companies.",
                "I can't freaking wait for the crypto market to crash.",
                "Only personal info was taken, name, email, address and phone number. No passwords, SSN/TIN etc. \n\nDo no respond to ANY messages from coinbase, if contacted reach out to their team via their website only. \n\nCoinbase is FULLY REFUNDING anyone who was targeted and has reached out to many. \n\nThey’ve relocated entire support divisions due to this and are enhancing their security to make this much harder to do. \n\nAnd instead of paying the ransom, they’re offering the $20 million as a reward to the arrest of anyone involved in this. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cable companies Charter and Cox agree to merge",
            "external_url": "https://www.cnbc.com/2025/05/16/cable-rivals-charter-and-cox-to-merge.html",
            "upvotes": 134,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108033879-1726232234037-2022_11_08_2022_Leadership_Summit_Comms_BHonnold_.jpg?v=1726256348&w=1920&h=1080",
            "top_comments": [
                "That's awesome, now I can NEVER do business with one company vs. two.  Very efficient improvement for myself.",
                "So the new company will be headquartered out of Charters HQ and the new CEO will be Charter’s current CEO. Legally a merger sure but sounds more like an absorption.",
                "This should be pretty awesome for consumers.  s/",
                "Let the Coxter screw you harder!",
                "I didn't think Charter could get any worse but here we are.",
                "We've got Ma Bell at home?",
                "Waiter!  Bring me more enshitification!",
                "I thought Charter became Spectrum years ago.",
                "I used to think there couldn't be much worse than Comcast.  Then I had Cox, and wow, it's complete trash, and even more anti-consumer than I could have imagined.",
                "\"you get a data cap... you get a data cap... you get a data cap...\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Criminal investigation opened in rape and sexual assault allegations against Smokey Robinson",
            "external_url": "https://apnews.com/article/smokey-robinson-sexual-misconduct-investigation-la-72bebfd2659f2c8b324557395ceb37bc",
            "upvotes": 142,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The smoke man.. who san Tracks of my Tears\n\nI can’t believe it.",
                "Oh you liked him? That's nice. Did you like when he changed the course of American music like two or three times? Did you like that tracks of my tears is maybe the last true love song ever written? I'm glad you liked him. I am completely devastated right now.",
                "Now we know why all those clowns were crying…",
                "You ever notice that when successful Black men get into middle age and older there's always a huge law suit or criminal charges?? Maybe something to do with getting a hold of that huge music catolog??",
                "It took place from 2007.. when he was 72 years old? Come on. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 4744,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "How much money has this administration, Noem, wasted on this kind of horse shit..... Enough. tRumps band of idiots can't find the 11 million illegals he claimed were in the US illegally so they've been creating them. Revoking visas for bullshit traffic infractions is childish and a complete waste of tax dollars. tRumps administration has been a clusterfuck from day one!",
                "Revoked over…a 3-year old traffic stop. Wow.",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "Of course they tried to. They need to inflate those deportation numbers somehow, to make Mickey Orange look good... "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 4747,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "How much money has this administration, Noem, wasted on this kind of horse shit..... Enough. tRumps band of idiots can't find the 11 million illegals he claimed were in the US illegally so they've been creating them. Revoking visas for bullshit traffic infractions is childish and a complete waste of tax dollars. tRumps administration has been a clusterfuck from day one!",
                "Revoked over…a 3-year old traffic stop. Wow.",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "Of course they tried to. They need to inflate those deportation numbers somehow, to make Mickey Orange look good... "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Rushdie attacker sentenced to 25 years in prison",
            "external_url": "https://www.bbc.com/news/articles/cp85kg527p9o",
            "upvotes": 231,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c827/live/438c76d0-3265-11f0-a80a-0d849379e1d9.jpg",
            "top_comments": [
                ">\"Salman Rushdie wants to disrespect other people,\" said Matar, clad in white-striped jail clothing and wearing handcuffs. \"He wants to be a bully, he wants to bully other people. I don't agree with that.\"\n\nSir, you *stabbed* people. You don't get to call anyone a bully.",
                "“Two nights before the attack, Salman Rushdie dreamed he was stabbed onstage. Today, his attacker has been sentenced to 25 years in prison.\n\nRead more: NPR Article”\n\nMan who stabbed Salman Rushdie convicted of attempted murder \n\nhttps://www.npr.org/2025/02/21/nx-s1-5305184/hadi-matar-salman-rushdie-stabbing-verdict\n\n> Speaking to NPR's Fresh Air about the book, Rushdie said he had a dream that he was publicly stabbed just two nights prior to the incident, and he almost cancelled the event where he was then attacked.",
                "We really need to get rid of religion, this dude gonna waste a third of his life in prison because he stabbed someone over his imaginary friend... that is legit insane.",
                "Proving once again how ridiculous religion is in a sane world.",
                "Send him to El Salvador",
                "Not the best way to go about but fuck Salman Rushdie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Verizon ending DEI programs as it seeks US approval for Frontier deal",
            "external_url": "https://www.reuters.com/sustainability/society-equity/verizon-ending-dei-programs-it-seeks-us-approval-frontier-deal-2025-05-16/",
            "upvotes": 651,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Our government just engages in extortion now.  Really making America great again.",
                "“Verizon Communications said Friday it is ending diversity, equity and inclusion programs after the Trump administration opened a probe and as the U.S. telecom carrier seeks approval to purchase Frontier Communications”\n\nInteresting timing to say the least",
                "And another takes the knee and swears fealty to “The Party”. Sad, but it is the times we live in and the regime we live under.",
                "Time to switch carriers.",
                "And now I want to cancel my Verizon plan and go with someone else.  They want to kneel to fascists and racists?  Then they don't need my money.",
                "It's this why everyone's bill had to go up $5 last month, even though we got nothing new/better in return?",
                "If anyone is delusional enough to think corporations care more about morality rather than chasing the profit think again. It is another proof that those DEI policies were just for the show and PR.",
                "Tell me again how republicans are for small government and personal responsibility. Fucking hypocritical ghouls.",
                "DEI is just a way to make sure HR doesn't overlook more qualified minorities and women in favor of the usual, often less-experienced/qualified white guy..... It's just ridiculous that DEI has become an excuse for overt discrimination against people....firing people because they are a minority or female (as Trump seems to enjoy doing).  Many of those fired had to work twice as far, to get half as far....except of course Trump born with a silver spoon in his mouth.",
                "Happy I dropped Verizon a year ago at this point. Good riddance."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Coinbase says hackers bribed staff to steal customer data and are demanding $20 million ransom",
            "external_url": "https://www.cnbc.com/2025/05/15/coinbase-says-hackers-bribed-staff-to-steal-customer-data-and-are-demanding-20-million-ransom.html",
            "upvotes": 704,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108146289-1747336602924-gettyimages-1312540542-_dsc9048.jpeg?v=1747390314&w=1920&h=1080",
            "top_comments": [
                "This is becoming increasingly common with overseas support companies where the agents are being offered over 1 month's worth of salary for inside knowledge on user accounts. They've also been targeting internal employees and offering significantly more due to their deeper access. \n\nAnd it's easy to do. The lower wages, the easy ability to get jobs, the lack of security to get in/out of buildings, and the constant rotation of new employees make it too easy to bribe these folks. They'll just go end up working for another company afterwards and do the same thing.",
                "\"All your coinbase are belong to us\"",
                "This would explain why I keep getting so many scam texts about my coinbase account",
                "S&P 500 company behavior.",
                "Coinbase sent out emails to anyone that had their data leaked.  It's a big deal because one of things that was leaked was images of people's ID's they used to verify their identity with Coinbase.",
                "This is what happens when you sublet large swaths of your company to India. Plenty of insurance companies are in the process of replacing their staff with remote Indian workers, this will only get worse and more common.",
                "Annnnd this is why INFOSEC and anything with database shouldn't be send oversea just because it is \"cheaper\".",
                "This is the kind of quality hiring and compliance that investors should expect with S&P 500 companies.",
                "I can't freaking wait for the crypto market to crash.",
                "Only personal info was taken, name, email, address and phone number. No passwords, SSN/TIN etc. \n\nDo no respond to ANY messages from coinbase, if contacted reach out to their team via their website only. \n\nCoinbase is FULLY REFUNDING anyone who was targeted and has reached out to many. \n\nThey’ve relocated entire support divisions due to this and are enhancing their security to make this much harder to do. \n\nAnd instead of paying the ransom, they’re offering the $20 million as a reward to the arrest of anyone involved in this. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "‘Napalm Girl’ may be work of different photographer, World Press Photo says",
            "external_url": "https://www.theguardian.com/artanddesign/2025/may/16/napalm-girl-world-press-photo",
            "upvotes": 165,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3c5f3fde122170d313948508a8500bdf43c4b1a5/147_0_2748_2197/master/2748.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d13629473a6905c683b655f575cd3072",
            "top_comments": [
                "It's so difficult to read articles when the advertisements keep changing size when they load in, and scrolls the page from where I'm reading.",
                "From the article:\n\n>The resulting report revealed “inconsistencies on both sides” but concluded that buying Nghe’s story would “require several leaps of faith”, such as believing that the only time he sold photos to a western news agency, it turned out to be one of the most famous images of the 20th century.\n\nYeah smells fishy. Maybe he took the photo, but he sold it for $20 and then kept quiet once he saw the photo on tv every night? Waiting more than 50 years to reveal that it actually was him all along?",
                "Not really relevant, but I have met the girl in the photo. She came to my grade school to speak 30ish years ago.",
                "[removed]",
                "The picture won an award, but he didn't say anything until 50 years later.",
                "Pretty jarring to see people smiling while holding a photo like that",
                "i know whose \"work\" it is: the united states of america and their military industial complex who went as far as to assasinate a president to keep that illegal war going cause he wanted to stop funding it and pull the boys out.... not much changed since ... shit just got worse",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "NYU withholds diploma of student who condemned Israel in graduation speech",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/nyu-withholds-diploma-israel-gaza-speech",
            "upvotes": 13173,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/50a8b417bb29a67d134561adaf29dd02e7aca775/570_0_5700_4562/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c34e9eea0a814065090f92fa9f029a1",
            "top_comments": [
                "this will be an interesting one for the courts.\n\n\nfederal law [prevents colleges from withholding diplomas for disciplinary issues](https://registrar.lmu.edu/ferpa-rightsandprivacyact/#:~:text=FERPA%20requires%20that%20education%20records,on%20release%20of%20directory%20information.) to prevent this exact situation, a graduate isnt liked by someone on the schools board, so they choose to withhold their diploma. withholding one against federal law can lead to your school losing accreditation, which is a death sentence for a college because ALL diplomas issued by them become worthless in every career field.\n\n\nthey can only withhold it if you owe them money, or they believe you committed fraud to get your degree. the fraud claim requires an academic court ruling to withhold diplomas or honors",
                "The use of the term anti-governmental to describe the USAID speech a month ago was the sign of how fascist NYU already was. Anti-governmental is completely valid speech in the US. Just say Anti-regime you fucking cowards. I'm sure a lawyer will volunteer to inform NYU of their inability to withold the degree and this will be quietly resolved.",
                "Ah, this sounds like the free speech Musk and Vance have been ranting about.",
                "They are drawing so much more attention to this than they need to. Some textbook Streisand Effect going on.",
                "What's this American infatuation with Israel? I just don't seem to understand.",
                "What the hell kind of reality are we living in?!",
                "[removed]",
                "I feel like my whole country is built on lies.  Free speech first among them.",
                "Free speech? Ehhhhh.\n\nAcademic freedom? Ehhhhh.\n\nDetermining truth in a marketplace of ideas? Ehhhhh.\n\nThought police? Now you're talking!\n\nIt's just so *easy* to not have to debate and discuss!",
                ">Rozos went on to say: “The genocide currently occurring is supported politically and militarily by the United States, is paid for by our tax dollars and has been livestreamed to our phones for the past 18 months. And that I do not wish to speak only to my own politics today, but to speak for all people of conscience, and all people who feel the moral injury of this atrocity.”\n\n>\n\nThink about it.\n\nWhy is it so important to Democrats and Republicans that Americans or  foreigners in America support a Far Right Wing fascist foreign Government like Israel?  Free speech exists in America to support or condemn any country we want, to protect unpopular speech.   This is another person who was viewed as an \"Anti-semite\" for criticizing the Israel Government or Zionist that operate that government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia woman missing in California's Sierra Nevada for weeks found alive in snow-covered cabin",
            "external_url": "https://www.cbsnews.com/sacramento/news/georgia-woman-missing-in-california-sierra-nevada-found-alive/",
            "upvotes": 11646,
            "date": "05/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/15/3f856e8d-3539-478f-b0c8-c10e8393c354/thumbnail/1200x630/8643f51bc3c0fa17ad8816e9033898a1/slaton.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "> Gutierrez said he leaves a cabin unlocked for situations like this, allowing for an increased chance of survival.\n\nThe true hero of this story.",
                "The first thing she did was go to hug her rescuer, the first thing her dad did when she knew she was safe was to hug the nearest person to him. 🥲",
                "I remember this woman's brother posting in some of the local hiking subs asking for help searching etc. Astonishing she was found, I'm so glad.",
                "Good news feels rare these days. So happy she was found alive",
                "Driving the Alcan and took a wrong turn and ended up going a few hours out of our way which sucked. Pull over to a small cabin with a map board and confirm we were going the wrong way but man that cabin was soooo cool. It was a big out cabin hours from any civilization that had two bunk beds, basic canned food, firewood with a wood stove and other basics and an outhouse. There was a wonderful guest book and read through stories of people getting stuck in storms and finding the cabin and using it to survive the night or until the weather passed and they could get back on the road. Totally worth the detour, also saw my first and only white colored black bear.",
                "The cabin owner SAVED HER LIFE!\n\nHe admitted he only leaves one of his cabins unlocked and stocked with emergency supplies SPECIFICALLY for blizzard shelter in case of emergency like this.\n\nFucking saint.",
                "The BLM handles the upkeep on alot of little cabins on public land for just this reason",
                "This is wonderful news! So happy that she was fine and going home to her family. \n\nAlso, how wonderful sounding is that family? Tiffany is found and the first thing she does is hug her rescuer. Her mother is told she’s been found and all she wants is a hug from a stranger. \n\nSound like lovely people which makes me extra glad Tiffany was found alive and well.",
                "She was lost for THREE weeks?! Wow that’s miraculous",
                "Everyone please, buy an SOS device."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 32633,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "You can't donate the organs of someone who died without their consent but a braindead woman who does not consent to this (nor does her family) must remain an incubator. Corpses have more rights than women. This is fucking shameful. And when the baby is born, then what? The family takes the baby? And who has to pay for all these hospital bills to keep her alive? Like what if they were not in a place financially to do that? This is where the claim that this is \"pro life\" completely falls apart. These people do not give a fuck about anything except controlling the bodies of women. Some days it feels like my anger at this country is going to completely drive me insane.\n\nWomen are not state-sanctioned gestation tanks. Fuck anyone who voted for this administration.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs.",
                "How DARE they use that photo while reporting she was 9 weeks pregnant. They’re deliberately misleading the public into thinking this was a full term viable pregnancy rather than what it really is which is the same age most pregnancies fail. This is not only ghoulish on the people responsible but on NBC for this deliberately manipulative reporting. Shame on NBC and I hope you all will spread the word where you can. This has major implications.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "This is some genuine Handmaids Tale shit.",
                "It's even worse than what a lot of posters here are reacting to: there's a good chance that if it weren't for the risks to the pregnancy, the doctors could have intervened with the clots that rendered her braindead, because they mentioned that they had found it in time and were about to try to relieve pressure. She's braindead because of that. They aren't just keeping her on life support to incubate the fetus, they KILLED HER in order to incubate the fetus."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Federal judge orders Marshall man detained by ICE to be immediately released",
            "external_url": "https://www.mprnews.org/story/2025/05/14/federal-judge-orders-marshall-man-detained-by-ice-to-be-immediately-released",
            "upvotes": 5682,
            "date": "05/15/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Some band recently had to cancel their European tour because their Mexican drummer, who was *in the country legally*, got detained at the airport to *fly out of the country*.",
                ">…arrested Harsono in March at his job at a Marshall hospital, days after his student visa was revoked without his knowledge.\n\nThey revoked his visa without his knowledge! Setting him up for his arrest. Disgusting.",
                "Honestly, does anyone think he's actually going to be released?",
                "Send ICE Barbie to El Salvador in his stead, she's overdue for another fashion show - this time let her do it from the other side of the bars.",
                "\"lol, no. Get fucked.\"\n\n\\-ICE to Judge, 2025.",
                "Our Concentration Camps are getting outta hand. Are we the bad guys?",
                "Ice: just put him in a plane to New Mexico",
                "Why aren't there clashes between enforcing departments of government? Why aren't the US Marshalls going to ICE detention centers and trying to pull people out? I mean besides widespread institutional racism, nepotism, and cronyism at every level.",
                "Until the fascism stops, I’m not paying taxes. I refuse to fund this unconstitutional authoritarian clown show. We need a national tax strike.",
                "That baby is adorable"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "James Comey investigated over seashell photo claimed to be ‘threat’ against Trump | James Comey",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/james-comey-instagram-trump",
            "upvotes": 2781,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7832fb1e817d30f8bd6f8e465fc9b6d9ade3a40c/290_0_2871_2297/master/2871.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d71f111554cc25fb4b0e0a44e155197",
            "top_comments": [
                "Bet he wouldn't have released that Hillary statement in 2016 if he had it to do over agin. Haha, fuck Comey.",
                "Nothing but a bunch of fucking children.",
                "What about Biden hogtied in those truck paintings?",
                "lol I remember when republicans put crosshairs over the profile pictures of all the dems they wanted to “eliminate” from their positions and then there was an assassination attempt on Gabby Giffords, who had been pictured.\n\nMidterms will shackle Trump. Hold strong everyone.",
                "I mean, when I think of seashells, I definitely think of Trump. Though only when it's 3 seashells, specifically.",
                "You'd think the right would be more grateful to the man who put his finger on the scale in 2016 to help put us where we are.",
                "Maybe he shouldn’t have, I dunno, not broken all previous FBI protocols to tip the scales towards Trump and help him win with announcing every detail about Clinton’s email investigation (while not disclosing a single thing about Trump’s collusion with RUSSIA investigation) then he wouldn’t be in this situation.  He should deal with the erosion of American democracy like every other citizen now - he enabled it.",
                "I'm sure the Maga crowd would have had no problem if it had said 88 47.",
                "LOL so Trump called for and successfully incited a riot against Mike Pence and the Capitol and then pardoned all of those who were punished, but Comey is the bad guy now for taking a photo of a few sea shells...",
                "86 means throw out, not kill.  They all know this, but if the outrage machine runs out of fuel it starts eating itself."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/16/2025 16:10:45 UTC"
}