{
    "posts": [
        {
            "category": "HOT",
            "title": "Town official allegedly shoots lost DoorDash driver looking for directions: Police",
            "external_url": "https://abcnews.go.com/US/town-official-allegedly-shoots-lost-doordash-driver-directions/story?id=121521187",
            "upvotes": 15859,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d845f5c7-a11e-4f3c-8df2-db41b0f8055b/chester-ny-shooting-main-ht-jt-250506_1746551721498_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nHe tells him to leave, so he tries to leave, but he gets shot anyway, *in the fucking back*. Fuck this guy forever.",
                ">He \"approached several homes asking for directions before arriving at the residence of John Reilly III,\" who is the Town of Chester highway superintendent, police said.\n\n>Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nWhen someone pulls into my driveway, my first inclination is to assume they're probably turning around. My second is I'm about to win money from the Prize Patrol. Further down the line is that they're armed Nova Scotia separatist radicals. \n\n>Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nThose guns are probably going to go away. New York state doesn't allow felons to possess firearms. All because he wanted to \"stand his ground\".",
                ">Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nFederally licensed firearms dealer has illegal gun. Fantastic.",
                "Imagine being such a paranoid scaredy cat little baby you have to shoot at someone just because they went up your driveway, and I bet he thinks he's acting manly.",
                "Getting lost... **try that in a small town.*",
                " Assault is really underselling what he did. He deliberately shot at someone he knew wasn't a threat to him, he should be getting tried for attempted murder.",
                "It's really touching that both DoorDash and the town have issued statements of remorse for the driver without offering to help cover the guy's medical bills.",
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\n>The driver was shot once in the back and hospitalized with serious injuries, police said. He's currently in stable condition, police said on Tuesday.\n\n>>**Reilly -- who is a federally licensed firearms dealer**\n\nTypical. The victim was complying and attempting to leave, there was no reason to open fire. This is just another \"*GoOd GuY wItH a GuN*\" looking for an excuse to shoot someone. He's made it abundantly clear that he is a danger to society and belongs in prison for the rest of his life.",
                "Fox News: “they’re coming for your guns” \nDoorbell: ding",
                "This must be that “polite society” they told us we’d have if everyone was armed"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump plans to end Energy Star home appliance program amid EPA reorganization",
            "external_url": "https://www.reuters.com/business/energy/trump-administration-plans-end-energy-star-program-home-appliances-washington-2025-05-06/",
            "upvotes": 4662,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> “Let’s be clear: Cutting the popular Energy Star program - which helps everyday households and businesses save on their energy bills - would mark another rash attempt by this administration to line the pockets of billionaires and utility companies at the expense of hardworking Americans,\" she said in a statement.\n\nEnergy efficiency saves consumers money, and that's vital during a time when people are struggling to afford the cost of living. Not to mention how critical strides in energy efficiency are when it comes to our whole population's environmental impact.",
                "They’re reaching into every corner and crevice to eliminate anything that is good in any way.",
                "Something that saved Americans billions of dollars ",
                "This is a program that has directly saved me money on my bills, and has helped tremendously with reducing load on the electric grid.  \n\n\nGetting rid of the program that has helped me save thousands of dollars is short sighted and a blatant middle finger to progress. ",
                "This guy is such a fuckin asshole. Seriously, go fuck yourself don",
                "The EPA is being gutted and dismantled. Why can't our media relay accurate headlines? This is not a 'reorganization'.",
                "I can't say what I really want to happen to him since my account was already warned for telling people to \"learn to f ght back\" on a post about police forceably removing an elderly woman from a town hall",
                "It's like this administration is going after anything remotely positive. What's especially baffling is that the majority of the voting population supported this buffoon. It's embarrassing.",
                "Conservatives, can you please provide your opinion as to why this is a good thing?\n\n- manufactures create e ergy efficient products and get this label\n- consumers buy and save on energy\n- municipalities see less strain on the grid \n\n\nThis is legit good all around and forces R&D for companies to produce more energy efficient devices to compete",
                "His cultists say he’s playing 4D chess, his detractors say he’s just helping his oligarch buddies. I don’t give him that much credit for either. He’s just a stupid fucking contrarian, throwing the baby out with the bath water everywhere he goes. He has no comprehension of why we have rules and regulations, just that they are all inconvenient and need to be eliminated."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration has shut down CDC's infection control committee",
            "external_url": "https://www.nbcnews.com/health/health-news/trump-administration-shut-cdcs-infection-control-committee-rcna205209",
            "upvotes": 5153,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250507-cdc-protest-mb-0855-2b14d1.jpg",
            "top_comments": [
                "Its hard not to think they're just trying to manufacture a crisis and get people killed at this point.",
                "Americans will soon not be allowed to enter other countries without proof of vaccination",
                "To understand why they are doing this kind of thing it helps to keep in mind that Trump hates America and the American people.  He HATES us for the 2020 election.  When you consider what he did to his first wife it starts to make sense.   Ivana Trump wrote a book that described the time he raped her after having scalp surgery. After that he openly cheated on her, divorced her, sued for custody of the kids he didn't want, eventually \"forgave\" her but somehow she died falling down stairs and is now buried in an untended grave on a golf course.  Probably in a  coffin packed with classified documents he stole.\n\nHe hates us and he's going to keep punishing us in any way he can until he's dead.",
                "Destroying government is easy. Fixing it will take much longer. All this is being done so Trump has more power and regular people have less control. ",
                "Never forget how the Trump admin bumbled their way through covid.",
                "Just like he did weeks before Covid was discovered in China.  ",
                "Trump and his cult are at war with higher learning because they know that don't have it and if they don't have it, it must be evil.",
                "If your intent was to prime the pump for a huge pandemic you'd do exactly what they are doing.",
                "I will never forgive what Hanlon's Razor has done to the collective and the way people perceive malice. People would rather believe that this administration is full of stupid people who are too dumb to realize the harm they're causing rather than dangerous sociopaths whose sole purpose is to kill as many people as possible in the cruelest ways possible.",
                "after our dumb shit societal response to covid, it made it abundantly clear to our adversaries that a super casual biologic weapon would completely fuck us. \n\nLet's even assume that COVID was a lab leak- imagine how screwed we'd be if it was an engineered virus. No amount of racism, bravado, or screeching would stop said virus from fucking you over while you whine about wearing a mask."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 1397,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "That's incredible... with all the footage",
                "I'd like to know how they were acquitted. There was no evidence of probable cause to stop him in the first place \n\nThe poor guy was running to his mom's house screaming for his mom, after being pepper sprayed and tased. Then the Police officers proceeded to punch, kick, pepper spray again, and beat him with a baton until he died of his wounds at a near by hospital.",
                "They were \"overcome by the moment.\" Go fuck yourselves. If you can't do the only hard part of your job without killing someone, maybe don't become a cop.",
                "This country is a shithole.",
                "The defense blaming the victim is a pretty wild thing to do"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Woman says security guard at Liberty Hotel in Boston confronted her in bathroom, asked to prove gender",
            "external_url": "https://www.cbsnews.com/boston/news/women-boston-liberty-hotel-bathroom-gender/",
            "upvotes": 3539,
            "date": "05/07/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/06/ba497b68-8a58-4675-8a4a-c37e1e01d50a/thumbnail/1200x630/5c5d7d9b32f58d43fdd437a62e034e18/couple.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "The irony of doing this in Liberty Hotel",
                "So a man went into the women’s room and tried to find out what someone using that women’s rooms genitals look like? \n\nIsn’t that the whole thing these people are supposedly mad about? The thing they supposedly want to prevent is actually happening because they’re so scared of a trans woman potentially being in the stall next to them?",
                "An actual man walked into the women’s bathroom and harassed a woman. This is why these conservatives gross me out- I’ve never been harassed by a transgender person but I’ve been plenty harassed by men.",
                "> Ansley Baker and her girlfriend, Liz Victor, went to a Kentucky Derby party at the hotel Saturday. The couple, who are both cis women, said their afternoon ended when hotel security searched the women's restroom and allegedly asked them to show their identification to prove their sex. \n\nRemembering how terfs talked about protecting lesbians and end up creating environment where they’re harassed\n\n> Nina Selvaggio, the Executive Director of the Greater Boston PFLAG, said this incident is the result of ramped up rhetoric at the national level. Selvaggio pointed to a statistic that showed Massachusetts hate crimes have hit a 20-year high.  \n\n>\"For gender nonconforming, lesbians, women in general, being harassed in public restrooms is a tale as old as time. I do think the surge in national anti-trans rhetoric is contributing to an increased policing of women's bodies and their expression of gender,\" Selvaggio said.",
                "Sure would be interesting to hear from the hotel why an investigation was not done before they put out their first statement which put blame on the couple.",
                "I'm so glad we have these brave mall cops who are willing to harass women trying to take a piss. If only we could get some brave officers to patrol our elementary school classrooms for liter boxes next.",
                "Conservative Men fantasize about white knighting in the women’s bathroom and seeing trans dick at the same time. Conservative Men want to show trans women how to be a real man.",
                "I’m not afraid of transwomen being in a bathroom with me. I’m afraid of cismale transphobic misogynists being in a bathroom with me.",
                "Will TERFs like JK Rowling tweet all day about the injustice done to this woman? That not only did a guard harass her, but also other women in the bathroom said “he [sic] is a creep get him out”! Will she say they failed to be true allies? I suspect no TERFs will give a shit when they see the woman’s picture because they don’t care about women’s rights - they are about the correct women’s (eg their own) rights and mostly the right to have society conform to them.\n\nHappy to be corrected if any TERFs stand up",
                "I’m a male, how do women’s bathrooms work? Aren’t there just a bunch of stalls and then sinks and mirrors outside the stalls? Are women walking around naked in there? It’s not like a locker room, right? Even if a straight male walked in there (by mistake) they wouldn’t see anything, right? The whole thing is stupid. I have seen many of a women use the men’s room when the lady’s line was to long, nobody gave a shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "WeightWatchers files for bankruptcy amid rise of weight-loss drugs",
            "external_url": "https://www.aljazeera.com/economy/2025/5/7/weightwatchers-files-for-bankruptcy-amid-rise-of-weight-loss-drugs",
            "upvotes": 1017,
            "date": "05/07/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25126856600680-1746610063_384f18-1746610427.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                ">The diet company formerly known as WeightWatchers has filed for bankruptcy after its 62-year-old business model was put under strain by the rise of weight-loss drugs such as Ozempic.\n\n[Ozempic users are also spending less on groceries.](https://progressivegrocer.com/do-weight-loss-drugs-lead-grocery-sales-losses) There's plenty of industries taking a hit because of weight loss drugs. No surprise restaurant chains are also filing bankruptcy.",
                "My view is: Any organization that is meant to solve a problem should have a goal to put itself out of business. For example, I volunteer for organizations that promote organ donation. They know that as soon as permanent solutions are developed, their mission is fulfilled.\n\nHowever, is Ozempic/etc. the correct answer? Maybe, maybe not for a multitude of reasons. If it is not, then an organization such as Weight Watchers is still theoretically needed.",
                "They need to go down to San Antonio. Gold mine down there I hear.",
                "*“The decisive actions we’re taking today, with the overwhelming support of our lenders and noteholders, will give us the flexibility to accelerate innovation, reinvest in our members, and lead with authority in a rapidly evolving weight management landscape,” CEO Tara Comonte said in a statement*\n\nWhenever I see that word \"innovation\" when coming from a CEO, I think of the appearance of a solution. Of course, the word \"drug\" when dealing with excess weight, inspires me even less.",
                "I'm no expert, but I feel like this was the straw that broke the camel's back, but I think the Internet also has made programs like Weight Watchers a lot less effective. Why pay for what is essentially glorified advice on how to eat healthy when you can find 1000 tiktok nutritonist who are legitimate and give much more nuanced nutrition advice. \n\nBack in the 90's it made sense, the Internet was far more niche, and nutritonists were expensive, you couldn't reliably find dieting tips that were effective. \n\nNow you can't take 10 steps without tripping over some actually legitimately good nutritonists. People who are realistic and don't have this expectation that every person is going to eat nothing but grilled chicken, fruit, and salad for every meal. People who know you are going to cheat and give you ways to minimize the harm a cheat day does. \n\nAs a frame of reference, I lost over 100 lbs last year just from diet changes (and a bit of exercise, but mostly diet), I did very little research, I just started off by cutting out obviously bad things (fried foods, processed red meats), and then just randomly saw quite a few accounts that gave good advice on effective fast food orders. Like legitimate realistic advice that made it a lot easier to stay consistent.",
                "It's funny that the article even mentions that weight watchers also acquired a company that prescribes these weight loss drugs to people too.",
                "I knew WW didn't work the minute Oprah Winfrey abandoned the shit and went directly for the Ozempic shots. It was just nonsense all along, while she was cashing those checks - as if she needed more money. \n\nAdd WW to the list of scams Oprah's run, Dr Oz Dr Phil and all those other gurus of stupid shit advice.",
                "This article popped up right under a weightwatchers ad",
                "Weightwatchers bows to bankruptcy, the Ozempic of the corporate world",
                "Sucks for them, but I'm sure they are all pretty happy that people are losing weight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kari Lake says OAN's far-right coverage will fuel Voice of America",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389453/kari-lake-says-oans-far-right-coverage-will-fuel-voice-of-america",
            "upvotes": 1989,
            "date": "05/07/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2F9c%2F5a162d83447885677185898e61c7%2Flake-oan-real.jpg",
            "top_comments": [
                "So spew lies, propaganda and garbage.",
                "Radio ~~Free Europe~~ Far Right\n\nAfter failing to win a senate seat. Then failing at multiple lawsuits Kari Lake was nominated to head the agency that runs Voice of America.",
                "Oh that's disgusting. Like really, truly disgusting.",
                "Anti-american propaganda ",
                "So. Tax payer funded media is ok?",
                "If you think that's bad check out the [COVID page on the White House website](https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/). \n\nEverything related to the federal government is becoming saturated with right-wing propaganda. All official channels are becoming propaganda outlets. Shit is way worse than most people think right now, and getting worse every single day.",
                "There's not a right wing news platform that is to be trusted in this country. Loyalty to the Dear Leader for profit is their only concern.",
                "Who let her out of the penalty box?",
                "Nazi playbook:\n https://encyclopedia.ushmm.org/content/en/article/ministry-of-propaganda-and-public-enlightenment",
                "I never thought that American fascism would look so transparently like German Fascism of 90 years ago. Their comfort in not even trying to conceal it is beyond alarming."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Woman arrested after raccoon named Chewy found with meth pipe in driver's seat during police stop",
            "external_url": "https://abcnews.go.com/US/woman-arrested-after-raccoon-named-chewy-found-meth/story?id=121546807",
            "upvotes": 1982,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/b461235b-c2e6-4669-b8d4-d9b956313d00/raccoon-pipe_1746598934420_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This raccoon hasn't slept in 9 days. He's since alphabetised the contents of three dumpsters, and rewired a bird feeder into a radio.",
                "Fingers crossed it’s Florida….\n\nAw, crap. That’s my state. Thanks, Ohio.",
                "Seems like the racoon should have been arrested here. He was the one with the meth pipe...\n\n\nMore seriously though, I wonder what they did with him, and what's going to become of the little guy? ",
                "“Chewy, punch it.” *[Raccoon hits meth pipe]*",
                "I watched the video this morning and let me be clear this headline is misleading!\n\nShe was arrested first and then the raccoon was found with the meth pipe! \n\nStupid clickbait headlines /s",
                "I've seen this movie.. it's called Crackcoon. They really should have arrested the racoon, he's a menace",
                "\"Finding a raccoon holding a meth pipe is a first,\" police said.  🤣\n\nTo be fare she was going to get arrested anyways due to a warrant and driving with a suspended license.",
                "The headline just got better and better.\n\nAlso, surprisingly enough, happened in Ohio, not Florida.",
                "“Listen, Chewy gets what Chewy wants!” - her, probably. ",
                "It’s chewys pipe, not mine"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Pub forced to pay family £75k after scathing 'dine and dash' claim on social media",
            "external_url": "https://www.manchestereveningnews.co.uk/news/uk-news/pub-forced-pay-family-75k-31575983",
            "upvotes": 1064,
            "date": "05/07/2025",
            "thumbnail": "https://i2-prod.manchestereveningnews.co.uk/article31575982.ece/ALTERNATES/s1200/1_Image.jpg",
            "top_comments": [
                "Surely the CCTV they pulled the screen shots from to shame the family on social media would have also showed them paying for their meal?? Not much critical thinking on show here. ",
                "\"Mistake\" by one of their staff to not ring the cash into the till.\n\nNo evidence of wrongdoing, but the staff member was dismissed for \"honest mistake\".",
                "Maybe the pub owners should have been a little less quick to name and shame the family before double checking the facts.\n\nThis could have been settled without posting it on Facebook at all.",
                "I wonder how they proved they paid? You would think the owners would have checked thoroughly before accusing. When I read that it hadn't been \"rung through the register\", I was reminded of my days as a restaurant manager and a thing called \"sweetheart checking\" where people wouldn't ring orders up, but would take the cash and pocket it. Of course, that was in the days when almost everyone paid in cash. Maybe that's why the server was dismissed?",
                ">> “There was no dishonesty involved from our staff, it was an honest mistake but we have dismissed the member of staff responsible for the error.”\n\nSo they dismissed the server who messed up, but the lawsuit was about the Facebook post where the owners libeled the family. \n\nI hope the server has grounds to sue them as well.",
                "If your going to publicly accuse someone of a crime make sure its them and not your staff member doing it lol.\n\nAfter being nearly national headlines the last thing they would want was the bad press of having criminal staff members so of course it was \"an honest mistake\"    So when everyone was enraged and talking about the family that just dined and dash that person didnt go - O yea i severed them and they paid .\n\nBro severs LOVE to talk and gossip no way who ever grabbed the check didnt know.  \n\nHere is my 2 cents - the owner snapped , because they were tired of dine and dashers - but it turns out it was a staff member claiming dine and dash on people that paid cash and pocketing the money every here and there.",
                "If only the owners behaved like adults and didn’t try to settle it on Facebook",
                "Save the click. The pub said they made a mistake. Family paid. Saved you a click. 50 ads and a few sentences to say they paid and it was all a mistake.",
                "Must feel nice for them to get vindicated.  Check doesn't hurt either lol",
                "Bosses blast media and defame the family… bosses also fire staff for not doing anything wrong. Please boycott this pub"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Exclusive: Ford hikes prices on Mexico-produced models, citing tariffs",
            "external_url": "https://www.reuters.com/business/autos-transportation/ford-hikes-prices-mexico-produced-models-citing-tariffs-2025-05-07/",
            "upvotes": 1215,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "DETROIT, May 7 (Reuters) - Ford Motor [(F.N), opens new tab](https://www.reuters.com/markets/companies/F.N) is hiking prices on three of its Mexico-produced models effective May 2, becoming one of the first major automakers to adjust sticker prices following U.S. President Donald Trump's tariffs.\n\nPrices on the Mustang Mach-E electric SUV, Maverick pickup and Bronco Sport will increase by as much as $2,000 on some models, according to a notice sent to dealers reviewed by Reuters.\n\nFord's decision to hike prices comes just days [after it said](https://www.reuters.com/business/autos-transportation/ford-pulls-guidance-warns-it-will-take-15-billion-hit-trumps-tariffs-2025-05-05/) the effects of U.S. President Donald Trump's trade war would add about $2.5 billion in overall costs for 2025, and as it suspended its annual earnings guidance. Rival GM also said tariffs would cost it billions of dollars following the hefty levies imposed by Trump on foreign imports of automobiles...\n\n...Analysts have said U.S. auto sales could drop by more than 1 million vehicles a year if tariffs were to remain in place.",
                "It's going to take years, if not decades, to undo the damage being done by this administration.",
                "Goodbye to the Maverick being an affordable truck. They already managed to get the prices way up on higher trims, and it's approaching $50k on a vehicle that was supposed to be less than $30K",
                "These automakers are dead dude. They already hiked prices one during covid, now most dealers are offering $5-$10k off sticker on 2025 models. \n\nThey can raise MSRP all they want. No ones coming in to buy. All their millions in lobbying blood money comes to nothing when you lobby to a madman",
                "Their CEO just went on CNN and continuously repeated the line about ford being the most american company and that they were offering employee pricing avoiding the question about raising prices...\n\n  \nShocked to see he was full of shit, let me tell you...",
                "Who could have seen this coming?",
                "Didn’t they just announce 5 days ago they wouldn’t raise prices?\n\n\nLol",
                "Shit cars AND they are more expensive? Thanks for making my next purchase a lot easier fam.",
                "Aaaaaaaand so it begins.\n\n\nEnjoy the next couple months before it all collapses thanks to the incompetent assholes in charge.",
                "Whaaaat! A company passing down costs to consumers in order to protect itself and the interests of its shareholders? No way!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Do you feel justice was served correctly?",
            "external_url": "https://www.samsung-news.com/articles/BZHvkqwQKDuza-bvmXwlIw-en-US?section=top_news&action=news&tab=foryou&landing=news_detail&url=https%253A%252F%252Fwww.samsung-news.com%252Farticles%252FBZHvkqwQKDuza-bvmXwlIw-en-US%253Fsection%253Dtop_news&id=BZHvkqwQKDuza-bvmXwlIw-en-US&pub_id=nbcnews.com&pub=NBC%20News&pub_logo=https%253A%252F%252Fnews-image.samsung-news.com%252Flogo%252Fcustom%252FNBCU%252Fnbc_banner.svg&theme_color=%23142037&referrer=share-news&title=Memphis%20police%20officers%20found%20not%20guilty%20of%20all%20state%20charges%20in%20Tyre%20Nichols%20beating%20death&rss_url=https%3A%2F%2Fwww.nbcnews.com%2Fnews%2Famp%2Frcna204934%3Futm_source%3Dsnews%26utm_medium%3Dreferral&img=https%3A%2F%2Fimage.samsung-news.com%2Fapi%2Fv1%2Fimage%2Fstatic%2Fw%3D1600%2Ch%3D1600%2Cface%3Dtrue%2Cstyle%3DSQUARE%2Fhttps%3A%2F%2Fmedia-cldnry.s-nbcnews.com%2Fimage%2Fupload%2Ft_fit_1500w%2Frockcms%2F2024-09%2F240910-tyre-nichols-trial-se-1237p-37be33.jpg&pub_time=2025-05-07T19%3A27%3A38Z&ed=en_US&section_type=headlines&category_id=news",
            "upvotes": 0,
            "date": "05/07/2025",
            "thumbnail": "https://www.samsung-news.com/assets/articles/default.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "NBC News: Memphis police officers found not guilty of all state charges in Tyre Nichols beating death",
            "external_url": "https://www.nbcnews.com/news/us-news/memphis-police-officers-found-not-guilty-state-charges-tyre-nichols-be-rcna204934",
            "upvotes": 4,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-09/240910-tyre-nichols-trial-se-1237p-37be33.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://apnews.com/article/tyre-nichols-death-memphis-officers-trial-bad7bc4273fcc272f7b884d5d7386261",
            "upvotes": 16,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So police officers can hold up the body of a man they beat unconscious while their fellow officers use his face as a punching bag until he dies, and be acquitted of murder… speechless."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 1394,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "That's incredible... with all the footage",
                "I'd like to know how they were acquitted. There was no evidence of probable cause to stop him in the first place \n\nThe poor guy was running to his mom's house screaming for his mom, after being pepper sprayed and tased. Then the Police officers proceeded to punch, kick, pepper spray again, and beat him with a baton until he died of his wounds at a near by hospital.",
                "They were \"overcome by the moment.\" Go fuck yourselves. If you can't do the only hard part of your job without killing someone, maybe don't become a cop.",
                "This country is a shithole.",
                "The defense blaming the victim is a pretty wild thing to do"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Polish police detain man after he kills one person with axe at Warsaw University",
            "external_url": "https://www.reuters.com/world/europe/polish-police-detain-man-after-he-kills-one-person-with-axe-warsaw-university-2025-05-07/",
            "upvotes": 31,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They'll arrest you for anything these days"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Disney to open up first theme park in the Middle East",
            "external_url": "https://www.cnbc.com/2025/05/07/disney-abu-dhabi-theme-park.html",
            "upvotes": 51,
            "date": "05/07/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108142092-1746619044798-Disney_Experiences_Abu_Dhabi_1.jpg?v=1746619098&w=1920&h=1080",
            "top_comments": [
                "Rich people playground",
                "For a bit of context here:\n\nDisney is **not** operating or building this park.  They are licensing their IP and providing their consulting servieces to the park owners.  This is what they did with Tokyo Disney Sea (which is owned by the Oriental Land Company).\n\nThat all said, Im sure there will be lots of opinions on having a park in Dubai but this is more akin to Cedar Fair or something asking Disney to use their characters and imagineers to build a park that someone else owns.\n\n>**This will be Disney’s seventh theme park resort and it will be fully developed and built by Miral. Disney’s imagineers will lead creative design and operational oversight on the project.**",
                "Unless they make this Indoors, no one is going to survive the summer there",
                "It will be at the UAE, so I suppose no pride day celebration.  \n\nI wonder how much slave labor will go into this?  100%. 90%.",
                "How can I tell a Disney Princess from Casper?",
                "Minnie and Daisy will have to cover up, but Donald can still be pantsless",
                "That's it. Im going to say it:\n\n*Abu Dhabi Disney*\n\n  \n(very adult giggling)",
                "Oh cool, fun for the whole family!",
                "Disney knows where the willingness to pay is.",
                "Females not permitted w/o a male guardian.  Women must be covered up despite the heat.  Women not permitted to operate the bumper cars.  Females found to be overly friendly with Donald Duck will be stoned to death.\nHave fun at Disney!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "WeightWatchers files for bankruptcy amid rise of weight-loss drugs",
            "external_url": "https://www.aljazeera.com/economy/2025/5/7/weightwatchers-files-for-bankruptcy-amid-rise-of-weight-loss-drugs",
            "upvotes": 1022,
            "date": "05/07/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25126856600680-1746610063_384f18-1746610427.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                ">The diet company formerly known as WeightWatchers has filed for bankruptcy after its 62-year-old business model was put under strain by the rise of weight-loss drugs such as Ozempic.\n\n[Ozempic users are also spending less on groceries.](https://progressivegrocer.com/do-weight-loss-drugs-lead-grocery-sales-losses) There's plenty of industries taking a hit because of weight loss drugs. No surprise restaurant chains are also filing bankruptcy.",
                "My view is: Any organization that is meant to solve a problem should have a goal to put itself out of business. For example, I volunteer for organizations that promote organ donation. They know that as soon as permanent solutions are developed, their mission is fulfilled.\n\nHowever, is Ozempic/etc. the correct answer? Maybe, maybe not for a multitude of reasons. If it is not, then an organization such as Weight Watchers is still theoretically needed.",
                "They need to go down to San Antonio. Gold mine down there I hear.",
                "*“The decisive actions we’re taking today, with the overwhelming support of our lenders and noteholders, will give us the flexibility to accelerate innovation, reinvest in our members, and lead with authority in a rapidly evolving weight management landscape,” CEO Tara Comonte said in a statement*\n\nWhenever I see that word \"innovation\" when coming from a CEO, I think of the appearance of a solution. Of course, the word \"drug\" when dealing with excess weight, inspires me even less.",
                "I'm no expert, but I feel like this was the straw that broke the camel's back, but I think the Internet also has made programs like Weight Watchers a lot less effective. Why pay for what is essentially glorified advice on how to eat healthy when you can find 1000 tiktok nutritonist who are legitimate and give much more nuanced nutrition advice. \n\nBack in the 90's it made sense, the Internet was far more niche, and nutritonists were expensive, you couldn't reliably find dieting tips that were effective. \n\nNow you can't take 10 steps without tripping over some actually legitimately good nutritonists. People who are realistic and don't have this expectation that every person is going to eat nothing but grilled chicken, fruit, and salad for every meal. People who know you are going to cheat and give you ways to minimize the harm a cheat day does. \n\nAs a frame of reference, I lost over 100 lbs last year just from diet changes (and a bit of exercise, but mostly diet), I did very little research, I just started off by cutting out obviously bad things (fried foods, processed red meats), and then just randomly saw quite a few accounts that gave good advice on effective fast food orders. Like legitimate realistic advice that made it a lot easier to stay consistent.",
                "It's funny that the article even mentions that weight watchers also acquired a company that prescribes these weight loss drugs to people too.",
                "I knew WW didn't work the minute Oprah Winfrey abandoned the shit and went directly for the Ozempic shots. It was just nonsense all along, while she was cashing those checks - as if she needed more money. \n\nAdd WW to the list of scams Oprah's run, Dr Oz Dr Phil and all those other gurus of stupid shit advice.",
                "This article popped up right under a weightwatchers ad",
                "Weightwatchers bows to bankruptcy, the Ozempic of the corporate world",
                "Sucks for them, but I'm sure they are all pretty happy that people are losing weight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US planning to deport migrants to Libya despite ‘hellish’ conditions – reports | Libya",
            "external_url": "https://www.theguardian.com/world/2025/may/07/us-planning-to-deport-migrants-to-libya-despite-hellish-conditions-reports",
            "upvotes": 367,
            "date": "05/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8913014985a092fa92543b11a1443ab76b4e2624/485_0_1709_1367/master/1709.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cdd9b29ffe9c70eabf4ee5950b39c453",
            "top_comments": [
                "*In its annual human rights report released last year, the US state department criticised Libya’s “harsh and life-threatening prison conditions” and “arbitrary arrest or detention”, citing how migrants , including children, had “no access to immigration courts or due process”.*\n\nThe above is one of most mild assessments of Libyan prisons and detention centers. It would be a compressed life sentence to send migrants to this torturous hell hole.",
                "\"Despite\"? I think you mean \"Because of\". Remember: cruelty is the point.",
                "El salvador full already?\n\nNow they are shipping them to a warzone?",
                "#When are we going to say fuck it and remove Trump from office, charge him for his crimes and throw his ass in prison?\n\n\n#when?",
                "Nothing would surprise me at this point. The vile cruelty of this bunch is astounding.",
                "One has to ask… Why are Republicans so dead set on circumventing the justice system (and the Constitution)? I believe it’s because 1) Cruelty is the point, 2) They know and want extreme abuses to occur that will not fly in America, and 3) they want to ship perceived enemies out of country so they can pull the BS of “ well yeah we screwed up, but ooops we don’t have any control or say in the camp/prison they are in now. Too bad.”.",
                "How about deporting old, fat, orange convicted sex offender felons?",
                "[removed]",
                "*The hellish conditions are the point*",
                "I think they should start deporting speeders and drunk drivers overseas without due process. Speeders and drunks kill more people than immigrants and are an actual danger to society. Maybe being sent to El Salvador, Rwanda, or Libya would be a harsh enough penalty to dissuade people from breaking the law. (It wouldn't. You could impose the death penalty for DUI or reckless driving, and people will still do it at about the same rate--the rules are for other people.)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Woman killed by alligator during couple canoe trip, husband tried to save her",
            "external_url": "https://abcnews.go.com/US/woman-killed-alligator-couple-canoe-trip-husband-save/story?id=121552147",
            "upvotes": 283,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a5832958-6383-4320-b9ff-090a6fe9aa7c/gator-attack-wfaa-jef-250507_1746642008077_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We rode over an alligator once and I could feel the ridges on its back scraping the boat as we slid over it. I was fully expecting the equivalent of the hippo scene in Congo but nothing happened. I have never wanted to hit one of my friends that badly in my life for taking us over it. (On purpose. \"Haha, should have seen your face!\")\n\nNever went anywhere near the water with that asshole again.",
                "This is tragic. I did however chuckle at them locating an alligator \"matching the description\".",
                "Pretty scary stuff. I did a Backcountry Everglades canoe trip a couple years ago and there was a 10ft croc on our trailhead. Not even a gator, a straight up croc. He got spooked by our noise and vanished completely into the water on the trailhead, roughly 3 feet deep. We paddled past him roughly 150 ft up the trail as he got out onto a slide, and he luckily must have eaten recently because he paid us no mind despite us being a few mere feet away from him. But in the back of my head for the whole trip all I could think of is how easily he vanished and how there could be anything below us at any given moment. At his size he very easily could have capsized our canoe if he really wanted to. Extremely unfortunate for this couple.",
                "Soon to be an episode of Dateline.",
                "In Florida you don't do murky, that being said gators are pretty timid compared to their cousins and tend to avoid places with a lot of boat traffic of any type",
                "This happened to a famous guy a few years back in Africa. Crocodile snatched him right out of the canoe.",
                "Dang.  lady fell on the gator and it didn't care for it.\n\nUnfortunate all around",
                "Canoe drifted over a gator, probably didn't even see it.  The gator reacted like the wild animal it is.  Just one of those tragic things that happens.",
                "When I was a teenager, my mom and I went canoeing in the Okefenokee swamp. I was paddling up front and my mom said \"Watch out for that gator!\" I said \"What gator?\" and steered right over it. The canoe just brushed the top of it, and it swam away looking relatively unperturbed.",
                "Very sad and I hope the husband gets some therapy for this. I couldn’t imagine trying to rescue my spouse from an alligator 🐊."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "French official says Pakistan downed Rafale jet as officials examine possible further losses",
            "external_url": "https://edition.cnn.com/world/live-news/india-pakistan-attack-kashmir-tourists-intl-hnk#cmadq2i4j00003b6tu7krhsys",
            "upvotes": 560,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25126786572134-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This is confirmed by the french authorities in addition to the confirmation by Local Governments this morning and also India accepting an “Unidentified” crashed aircraft in Punjab.",
                "This is horrible, but I have to admit watching the Indians and Pakistanis fight about it on reddit has been super entertaining.",
                "C’mon. We need India to continue denying it so we can have deescalation. We were at a good place: India claimed killing 70 terrorists and no downed plane. Pakistan confirmed being attacked but shot down 6 jets. Everyone was happy and can claim victory, it was a chance for both sides to backdown",
                "Last time when indian jets attacked Pakistan in 2019. Their wing commander got captured in Pakistan, they served him tea. That's where the phrase \"tea is fantastic\" comes from.",
                "Rafale eh? That's a nice fighter jet.",
                "Oh no. They will have to buy another one - Macron, probably",
                "The other thread was insane with posters who were energetically mocking Pakistan shooting down jets as if it was more ridiculous than ghost flying pigs.\n\nFor sure this could be a fake claim but Pakistan has plenty of advanced air defence and a modern air force. Was bizarre to see the replies in that thread in some frantic competition of hyperbole over how ridiculous their claim was.\n\nI suppose it was just some Indian bot network.",
                "So much for the downed rafale [https://www.reddit.com/r/JammuandKashmir/s/GQFoB1i9sU](https://www.reddit.com/r/JammuandKashmir/s/GQFoB1i9sU)",
                ">\"A high-ranking French intelligence official told CNN today that one Rafale fighter jet operated by the Indian Air Force was downed by Pakistan\"\n\nI wonder how this unnamed official can KNOW that it was DOWNED and by Pakistan rather than merely having crashed due to a mechanical fault or pilot error. Or it could have been shot down by Indian forces in error. \n\nHow does the French official know what he claims? There are other possibilities.",
                "False\n\nhttps://www.dw.com/en/fact-check-kashmir-conflict-out-of-context-old-videos-computer-game-footage-disinformation/a-72465246"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 1410,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "That's incredible... with all the footage",
                "I'd like to know how they were acquitted. There was no evidence of probable cause to stop him in the first place \n\nThe poor guy was running to his mom's house screaming for his mom, after being pepper sprayed and tased. Then the Police officers proceeded to punch, kick, pepper spray again, and beat him with a baton until he died of his wounds at a near by hospital.",
                "They were \"overcome by the moment.\" Go fuck yourselves. If you can't do the only hard part of your job without killing someone, maybe don't become a cop.",
                "This country is a shithole.",
                "The defense blaming the victim is a pretty wild thing to do"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WeightWatchers files for bankruptcy amid rise of weight-loss drugs",
            "external_url": "https://www.aljazeera.com/economy/2025/5/7/weightwatchers-files-for-bankruptcy-amid-rise-of-weight-loss-drugs",
            "upvotes": 1022,
            "date": "05/07/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25126856600680-1746610063_384f18-1746610427.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                ">The diet company formerly known as WeightWatchers has filed for bankruptcy after its 62-year-old business model was put under strain by the rise of weight-loss drugs such as Ozempic.\n\n[Ozempic users are also spending less on groceries.](https://progressivegrocer.com/do-weight-loss-drugs-lead-grocery-sales-losses) There's plenty of industries taking a hit because of weight loss drugs. No surprise restaurant chains are also filing bankruptcy.",
                "My view is: Any organization that is meant to solve a problem should have a goal to put itself out of business. For example, I volunteer for organizations that promote organ donation. They know that as soon as permanent solutions are developed, their mission is fulfilled.\n\nHowever, is Ozempic/etc. the correct answer? Maybe, maybe not for a multitude of reasons. If it is not, then an organization such as Weight Watchers is still theoretically needed.",
                "They need to go down to San Antonio. Gold mine down there I hear.",
                "*“The decisive actions we’re taking today, with the overwhelming support of our lenders and noteholders, will give us the flexibility to accelerate innovation, reinvest in our members, and lead with authority in a rapidly evolving weight management landscape,” CEO Tara Comonte said in a statement*\n\nWhenever I see that word \"innovation\" when coming from a CEO, I think of the appearance of a solution. Of course, the word \"drug\" when dealing with excess weight, inspires me even less.",
                "I'm no expert, but I feel like this was the straw that broke the camel's back, but I think the Internet also has made programs like Weight Watchers a lot less effective. Why pay for what is essentially glorified advice on how to eat healthy when you can find 1000 tiktok nutritonist who are legitimate and give much more nuanced nutrition advice. \n\nBack in the 90's it made sense, the Internet was far more niche, and nutritonists were expensive, you couldn't reliably find dieting tips that were effective. \n\nNow you can't take 10 steps without tripping over some actually legitimately good nutritonists. People who are realistic and don't have this expectation that every person is going to eat nothing but grilled chicken, fruit, and salad for every meal. People who know you are going to cheat and give you ways to minimize the harm a cheat day does. \n\nAs a frame of reference, I lost over 100 lbs last year just from diet changes (and a bit of exercise, but mostly diet), I did very little research, I just started off by cutting out obviously bad things (fried foods, processed red meats), and then just randomly saw quite a few accounts that gave good advice on effective fast food orders. Like legitimate realistic advice that made it a lot easier to stay consistent.",
                "It's funny that the article even mentions that weight watchers also acquired a company that prescribes these weight loss drugs to people too.",
                "I knew WW didn't work the minute Oprah Winfrey abandoned the shit and went directly for the Ozempic shots. It was just nonsense all along, while she was cashing those checks - as if she needed more money. \n\nAdd WW to the list of scams Oprah's run, Dr Oz Dr Phil and all those other gurus of stupid shit advice.",
                "This article popped up right under a weightwatchers ad",
                "Weightwatchers bows to bankruptcy, the Ozempic of the corporate world",
                "Sucks for them, but I'm sure they are all pretty happy that people are losing weight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US planning to deport migrants to Libya despite ‘hellish’ conditions – reports | Libya",
            "external_url": "https://www.theguardian.com/world/2025/may/07/us-planning-to-deport-migrants-to-libya-despite-hellish-conditions-reports",
            "upvotes": 371,
            "date": "05/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8913014985a092fa92543b11a1443ab76b4e2624/485_0_1709_1367/master/1709.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cdd9b29ffe9c70eabf4ee5950b39c453",
            "top_comments": [
                "*In its annual human rights report released last year, the US state department criticised Libya’s “harsh and life-threatening prison conditions” and “arbitrary arrest or detention”, citing how migrants , including children, had “no access to immigration courts or due process”.*\n\nThe above is one of most mild assessments of Libyan prisons and detention centers. It would be a compressed life sentence to send migrants to this torturous hell hole.",
                "\"Despite\"? I think you mean \"Because of\". Remember: cruelty is the point.",
                "El salvador full already?\n\nNow they are shipping them to a warzone?",
                "#When are we going to say fuck it and remove Trump from office, charge him for his crimes and throw his ass in prison?\n\n\n#when?",
                "Nothing would surprise me at this point. The vile cruelty of this bunch is astounding.",
                "One has to ask… Why are Republicans so dead set on circumventing the justice system (and the Constitution)? I believe it’s because 1) Cruelty is the point, 2) They know and want extreme abuses to occur that will not fly in America, and 3) they want to ship perceived enemies out of country so they can pull the BS of “ well yeah we screwed up, but ooops we don’t have any control or say in the camp/prison they are in now. Too bad.”.",
                "How about deporting old, fat, orange convicted sex offender felons?",
                "[removed]",
                "*The hellish conditions are the point*",
                "I think they should start deporting speeders and drunk drivers overseas without due process. Speeders and drunks kill more people than immigrants and are an actual danger to society. Maybe being sent to El Salvador, Rwanda, or Libya would be a harsh enough penalty to dissuade people from breaking the law. (It wouldn't. You could impose the death penalty for DUI or reckless driving, and people will still do it at about the same rate--the rules are for other people.)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration has shut down CDC's infection control committee",
            "external_url": "https://www.nbcnews.com/health/health-news/trump-administration-shut-cdcs-infection-control-committee-rcna205209",
            "upvotes": 5151,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250507-cdc-protest-mb-0855-2b14d1.jpg",
            "top_comments": [
                "Its hard not to think they're just trying to manufacture a crisis and get people killed at this point.",
                "Americans will soon not be allowed to enter other countries without proof of vaccination",
                "To understand why they are doing this kind of thing it helps to keep in mind that Trump hates America and the American people.  He HATES us for the 2020 election.  When you consider what he did to his first wife it starts to make sense.   Ivana Trump wrote a book that described the time he raped her after having scalp surgery. After that he openly cheated on her, divorced her, sued for custody of the kids he didn't want, eventually \"forgave\" her but somehow she died falling down stairs and is now buried in an untended grave on a golf course.  Probably in a  coffin packed with classified documents he stole.\n\nHe hates us and he's going to keep punishing us in any way he can until he's dead.",
                "Destroying government is easy. Fixing it will take much longer. All this is being done so Trump has more power and regular people have less control. ",
                "Never forget how the Trump admin bumbled their way through covid.",
                "Just like he did weeks before Covid was discovered in China.  ",
                "Trump and his cult are at war with higher learning because they know that don't have it and if they don't have it, it must be evil.",
                "If your intent was to prime the pump for a huge pandemic you'd do exactly what they are doing.",
                "I will never forgive what Hanlon's Razor has done to the collective and the way people perceive malice. People would rather believe that this administration is full of stupid people who are too dumb to realize the harm they're causing rather than dangerous sociopaths whose sole purpose is to kill as many people as possible in the cruelest ways possible.",
                "after our dumb shit societal response to covid, it made it abundantly clear to our adversaries that a super casual biologic weapon would completely fuck us. \n\nLet's even assume that COVID was a lab leak- imagine how screwed we'd be if it was an engineered virus. No amount of racism, bravado, or screeching would stop said virus from fucking you over while you whine about wearing a mask."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump plans to end Energy Star home appliance program amid EPA reorganization",
            "external_url": "https://www.reuters.com/business/energy/trump-administration-plans-end-energy-star-program-home-appliances-washington-2025-05-06/",
            "upvotes": 4663,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> “Let’s be clear: Cutting the popular Energy Star program - which helps everyday households and businesses save on their energy bills - would mark another rash attempt by this administration to line the pockets of billionaires and utility companies at the expense of hardworking Americans,\" she said in a statement.\n\nEnergy efficiency saves consumers money, and that's vital during a time when people are struggling to afford the cost of living. Not to mention how critical strides in energy efficiency are when it comes to our whole population's environmental impact.",
                "They’re reaching into every corner and crevice to eliminate anything that is good in any way.",
                "Something that saved Americans billions of dollars ",
                "This is a program that has directly saved me money on my bills, and has helped tremendously with reducing load on the electric grid.  \n\n\nGetting rid of the program that has helped me save thousands of dollars is short sighted and a blatant middle finger to progress. ",
                "This guy is such a fuckin asshole. Seriously, go fuck yourself don",
                "The EPA is being gutted and dismantled. Why can't our media relay accurate headlines? This is not a 'reorganization'.",
                "I can't say what I really want to happen to him since my account was already warned for telling people to \"learn to f ght back\" on a post about police forceably removing an elderly woman from a town hall",
                "It's like this administration is going after anything remotely positive. What's especially baffling is that the majority of the voting population supported this buffoon. It's embarrassing.",
                "Conservatives, can you please provide your opinion as to why this is a good thing?\n\n- manufactures create e ergy efficient products and get this label\n- consumers buy and save on energy\n- municipalities see less strain on the grid \n\n\nThis is legit good all around and forces R&D for companies to produce more energy efficient devices to compete",
                "His cultists say he’s playing 4D chess, his detractors say he’s just helping his oligarch buddies. I don’t give him that much credit for either. He’s just a stupid fucking contrarian, throwing the baby out with the bath water everywhere he goes. He has no comprehension of why we have rules and regulations, just that they are all inconvenient and need to be eliminated."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Woman arrested after raccoon named Chewy found with meth pipe in driver's seat during police stop",
            "external_url": "https://abcnews.go.com/US/woman-arrested-after-raccoon-named-chewy-found-meth/story?id=121546807",
            "upvotes": 1980,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/b461235b-c2e6-4669-b8d4-d9b956313d00/raccoon-pipe_1746598934420_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This raccoon hasn't slept in 9 days. He's since alphabetised the contents of three dumpsters, and rewired a bird feeder into a radio.",
                "Fingers crossed it’s Florida….\n\nAw, crap. That’s my state. Thanks, Ohio.",
                "Seems like the racoon should have been arrested here. He was the one with the meth pipe...\n\n\nMore seriously though, I wonder what they did with him, and what's going to become of the little guy? ",
                "“Chewy, punch it.” *[Raccoon hits meth pipe]*",
                "I watched the video this morning and let me be clear this headline is misleading!\n\nShe was arrested first and then the raccoon was found with the meth pipe! \n\nStupid clickbait headlines /s",
                "I've seen this movie.. it's called Crackcoon. They really should have arrested the racoon, he's a menace",
                "\"Finding a raccoon holding a meth pipe is a first,\" police said.  🤣\n\nTo be fare she was going to get arrested anyways due to a warrant and driving with a suspended license.",
                "The headline just got better and better.\n\nAlso, surprisingly enough, happened in Ohio, not Florida.",
                "“Listen, Chewy gets what Chewy wants!” - her, probably. ",
                "It’s chewys pipe, not mine"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "French official says Pakistan downed Rafale jet as officials examine possible further losses",
            "external_url": "https://edition.cnn.com/world/live-news/india-pakistan-attack-kashmir-tourists-intl-hnk#cmadq2i4j00003b6tu7krhsys",
            "upvotes": 559,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25126786572134-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This is confirmed by the french authorities in addition to the confirmation by Local Governments this morning and also India accepting an “Unidentified” crashed aircraft in Punjab.",
                "This is horrible, but I have to admit watching the Indians and Pakistanis fight about it on reddit has been super entertaining.",
                "C’mon. We need India to continue denying it so we can have deescalation. We were at a good place: India claimed killing 70 terrorists and no downed plane. Pakistan confirmed being attacked but shot down 6 jets. Everyone was happy and can claim victory, it was a chance for both sides to backdown",
                "Last time when indian jets attacked Pakistan in 2019. Their wing commander got captured in Pakistan, they served him tea. That's where the phrase \"tea is fantastic\" comes from.",
                "Rafale eh? That's a nice fighter jet.",
                "Oh no. They will have to buy another one - Macron, probably",
                "The other thread was insane with posters who were energetically mocking Pakistan shooting down jets as if it was more ridiculous than ghost flying pigs.\n\nFor sure this could be a fake claim but Pakistan has plenty of advanced air defence and a modern air force. Was bizarre to see the replies in that thread in some frantic competition of hyperbole over how ridiculous their claim was.\n\nI suppose it was just some Indian bot network.",
                "So much for the downed rafale [https://www.reddit.com/r/JammuandKashmir/s/GQFoB1i9sU](https://www.reddit.com/r/JammuandKashmir/s/GQFoB1i9sU)",
                ">\"A high-ranking French intelligence official told CNN today that one Rafale fighter jet operated by the Indian Air Force was downed by Pakistan\"\n\nI wonder how this unnamed official can KNOW that it was DOWNED and by Pakistan rather than merely having crashed due to a mechanical fault or pilot error. Or it could have been shot down by Indian forces in error. \n\nHow does the French official know what he claims? There are other possibilities.",
                "False\n\nhttps://www.dw.com/en/fact-check-kashmir-conflict-out-of-context-old-videos-computer-game-footage-disinformation/a-72465246"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Woman killed by alligator during couple canoe trip, husband tried to save her",
            "external_url": "https://abcnews.go.com/US/woman-killed-alligator-couple-canoe-trip-husband-save/story?id=121552147",
            "upvotes": 281,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a5832958-6383-4320-b9ff-090a6fe9aa7c/gator-attack-wfaa-jef-250507_1746642008077_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We rode over an alligator once and I could feel the ridges on its back scraping the boat as we slid over it. I was fully expecting the equivalent of the hippo scene in Congo but nothing happened. I have never wanted to hit one of my friends that badly in my life for taking us over it. (On purpose. \"Haha, should have seen your face!\")\n\nNever went anywhere near the water with that asshole again.",
                "This is tragic. I did however chuckle at them locating an alligator \"matching the description\".",
                "Pretty scary stuff. I did a Backcountry Everglades canoe trip a couple years ago and there was a 10ft croc on our trailhead. Not even a gator, a straight up croc. He got spooked by our noise and vanished completely into the water on the trailhead, roughly 3 feet deep. We paddled past him roughly 150 ft up the trail as he got out onto a slide, and he luckily must have eaten recently because he paid us no mind despite us being a few mere feet away from him. But in the back of my head for the whole trip all I could think of is how easily he vanished and how there could be anything below us at any given moment. At his size he very easily could have capsized our canoe if he really wanted to. Extremely unfortunate for this couple.",
                "Soon to be an episode of Dateline.",
                "In Florida you don't do murky, that being said gators are pretty timid compared to their cousins and tend to avoid places with a lot of boat traffic of any type",
                "This happened to a famous guy a few years back in Africa. Crocodile snatched him right out of the canoe.",
                "Dang.  lady fell on the gator and it didn't care for it.\n\nUnfortunate all around",
                "Canoe drifted over a gator, probably didn't even see it.  The gator reacted like the wild animal it is.  Just one of those tragic things that happens.",
                "When I was a teenager, my mom and I went canoeing in the Okefenokee swamp. I was paddling up front and my mom said \"Watch out for that gator!\" I said \"What gator?\" and steered right over it. The canoe just brushed the top of it, and it swam away looking relatively unperturbed.",
                "Very sad and I hope the husband gets some therapy for this. I couldn’t imagine trying to rescue my spouse from an alligator 🐊."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Exclusive: Ford hikes prices on Mexico-produced models, citing tariffs",
            "external_url": "https://www.reuters.com/business/autos-transportation/ford-hikes-prices-mexico-produced-models-citing-tariffs-2025-05-07/",
            "upvotes": 1210,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "DETROIT, May 7 (Reuters) - Ford Motor [(F.N), opens new tab](https://www.reuters.com/markets/companies/F.N) is hiking prices on three of its Mexico-produced models effective May 2, becoming one of the first major automakers to adjust sticker prices following U.S. President Donald Trump's tariffs.\n\nPrices on the Mustang Mach-E electric SUV, Maverick pickup and Bronco Sport will increase by as much as $2,000 on some models, according to a notice sent to dealers reviewed by Reuters.\n\nFord's decision to hike prices comes just days [after it said](https://www.reuters.com/business/autos-transportation/ford-pulls-guidance-warns-it-will-take-15-billion-hit-trumps-tariffs-2025-05-05/) the effects of U.S. President Donald Trump's trade war would add about $2.5 billion in overall costs for 2025, and as it suspended its annual earnings guidance. Rival GM also said tariffs would cost it billions of dollars following the hefty levies imposed by Trump on foreign imports of automobiles...\n\n...Analysts have said U.S. auto sales could drop by more than 1 million vehicles a year if tariffs were to remain in place.",
                "It's going to take years, if not decades, to undo the damage being done by this administration.",
                "Goodbye to the Maverick being an affordable truck. They already managed to get the prices way up on higher trims, and it's approaching $50k on a vehicle that was supposed to be less than $30K",
                "These automakers are dead dude. They already hiked prices one during covid, now most dealers are offering $5-$10k off sticker on 2025 models. \n\nThey can raise MSRP all they want. No ones coming in to buy. All their millions in lobbying blood money comes to nothing when you lobby to a madman",
                "Their CEO just went on CNN and continuously repeated the line about ford being the most american company and that they were offering employee pricing avoiding the question about raising prices...\n\n  \nShocked to see he was full of shit, let me tell you...",
                "Who could have seen this coming?",
                "Didn’t they just announce 5 days ago they wouldn’t raise prices?\n\n\nLol",
                "Shit cars AND they are more expensive? Thanks for making my next purchase a lot easier fam.",
                "Aaaaaaaand so it begins.\n\n\nEnjoy the next couple months before it all collapses thanks to the incompetent assholes in charge.",
                "Whaaaat! A company passing down costs to consumers in order to protect itself and the interests of its shareholders? No way!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hidden cameras found in dance studio bathrooms in Hermosa Beach",
            "external_url": "https://abc7.com/post/hidden-cameras-found-bathrooms-school-dance-music-hermosa-beach/16335930/",
            "upvotes": 328,
            "date": "05/07/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16335896_050525-kabc-hermosa-beach-hidden-cams-tn-img.jpg?w=1600",
            "top_comments": [
                " >Somma says she has over a thousand students, ranging in age from 2 to 18 years old.\nOn Saturday morning, Hermosa Beach police responded to the School of Dance and Music.\n\"Investigating officers learned that hidden cameras were located in multiple bathrooms throughout the location,\" police said in a statement. \"The cameras were located by parents of students who removed the cameras and turned them in to dance school staff members who immediately contacted HBPD.\"\n\nWell that's horrifying. I wonder what the likelihood is that they can locate the culprit.",
                "I fear that hidden cameras are frighteningly common and the perpetrators rarely get caught. Scary stuff!",
                "Well surely that business is finished now.",
                "I read that as hidden cameras find dance studio located in a bathroom or maybe the edibles are kicking in",
                "Dust camera for fingerprints, ask all staff and parents for a print sample that will be compared and discarded if it isn't a match. Anyone that says no goes into the suspect list until otherwise cleared.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/07/2025 20:10:25 UTC"
}