{
    "posts": [
        {
            "category": "HOT",
            "title": "Moody's downgrades JPM, BofA and Wells Fargo after US credit rating cut",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-jpm-bofa-wells-fargo-after-us-credit-rating-cut-2025-05-19/?utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=facebook&fbclid=IwZXh0bgNhZW0CMTEAAR59mJW6zI2u7jNd2y5tL39fxMlgIz-5b7zIAHx0J_eEF0F5jvs-BtDUbbg6bw_aem_rJwFnuJFTA03uOf1EQ-XsA&sfnsn=mo",
            "upvotes": 9212,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When Moody's finally starts downgrading private equity firms and their bundled garbage, then you'll know the music is about to stop. They have to give time for the people up top to get a chair",
                "Well that’s another +500 for the DOW!",
                "I’ve said it here before and I’ll say it again. After the Wells Fargo creating unwanted accounts for the customers years ago, I still can’t wrap my head around anyone trusting them with their money.",
                "Trump bailouts are incoming. Dont worry, Republicans will blame Democrats for inflation after they spend like maniacs to clean up their reckless policy.",
                "Surprised trump hasn’t called moodys a socialist, Marxist, anti-Christian, anti-American organization",
                "And here goes the domino of sovereign credit rating to corporates. The end of it are rate hikes and defaults for the consumers recalled credits and collapsing leverage structures. \n\nThis is going to be bad. Americans think tariffs are a problem? This can snowball in months into sovereign default.",
                "100% self inflicted and optional, thanks to one person: Trump.",
                "Moody is starting to really have some balls on them.",
                "All three heavily contributed to Trump and the GOP. Leopards meet faces.",
                "Does this actually affect people?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Passenger jet aborted takeoff to avoid LaGuardia runway collision",
            "external_url": "https://www.nbcnewyork.com/news/local/passenger-jet-abort-takeoff-avoid-runway-collision-laguardia-airport/6270373/",
            "upvotes": 1169,
            "date": "05/20/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/GettyImages-1239716051.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Federal officials are investigating why two planes got dangerously close on a runway at New York's LaGuardia Airport earlier this month despite the airport being equipped with an advanced surface radar system that's designed to help prevent such close calls.\n\nBoth the Federal Aviation Administration and the National Transportation Safety Board said Monday that they are investigating the May 6 incident when a Republic Airways jet had to abort takeoff and slam to a stop because a United Airlines plane was still taxiing across the runway.\n\n**In audio from the tower that ABC obtained from the website** [**www.LiveATC.net**](https://www.liveatc.net/)**, the air traffic control said to the pilot of the Republic Airways jet: “Sorry, I thought United had cleared well before that.”...**",
                "I am a stupid person. \n\nAre these kinds of instances actually occurring more often as a result of the actions of this current administration? Or, has it been “status quo”, i.e., these things happen on a “consistent basis” and we are just receiving a hell of a lot more press on it now?\n\nAgain, I am a stupid person. Thank you for patience.",
                "Those DOGE cuts and layoffs are really saving a lot of money. What could possibly go wrong.",
                "Are we just seeing more news of near collisions and accidents or are the incidents actually up since the cuts?",
                "This administration is an embarrassment. \nI feel like it's gonna take a bit of luck to survive it.",
                "Cool.   Looking forward to flying out of LGA tomorrow.",
                "Ship travel making a comeback baby!",
                "something something Biden's prostate, Obama's tan suit,  George Soros. \n\n/s",
                "How many days without a crash?",
                "It always surprised me that LaGuardia wasn’t the NYC airport completely melting down. I have never had a positive experience flying in or out of that airport"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "DOJ says it has charged N.J. congresswoman with assaulting law enforcement at ICE facility",
            "external_url": "https://www.nbcnews.com/politics/justice-department/lamonica-mciver-ras-baraka-alina-habba-ice-new-jersey-newark-rcna207842",
            "upvotes": 8183,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-LaMonica-McIver-ac-810p-ede87e.jpg",
            "top_comments": [
                "[But have also dropped the charges against Newark mayor](https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/)",
                "Funny how there are media reports from a couple of days ago that they’re changing how they’re charging public officials (https://thehill.com/homenews/administration/5307294-doj-key-review-elected-officials-prosecutions/amp/). \n\nAlso funny how they made a big deal of not weaponizing the DOJ; only to blatantly weaponize it.",
                ">Acting U.S. Attorney for the District of New Jersey Alina Habba made the announcement on X, where she accused the Democratic lawmaker of “assaulting, impeding and interfering with law enforcement.”\n\nThis is what they're going to do to anyone and everyone who stands in ICE's way.",
                "[removed]",
                "This regime is destroying the 97% conviction rate of the DOJ",
                "Fascists are trying to instill fear into the opposition. Never back down. This is a slam dunk case for her.",
                "The visit to the ICE facility was an official act as part of her legislative oversight authority. She has legislative immunity. Supreme Court said so.",
                "Fox is analyzing the video of this “assault” this like it’s the Zapruder film. Such bullshit. Know who was really assaulted ? The Capital Police on January 6.",
                "Assaulted by LEO? Charged with assaulting LEO.",
                "Didn't Marjorie Greene Taylor kick a person and not get charged?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Netflix strikes deal to bring Sesame Street to streaming giant",
            "external_url": "https://www.bbc.co.uk/news/articles/c80k7z8z77yo",
            "upvotes": 3309,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee2f/live/016629a0-3525-11f0-8d66-cd233f41fe78.jpg",
            "top_comments": [
                "Joking aside, I like that this gives them some financial stability while still allowing the episodes to air on PBS. If that side of it eventually stops, however, it would be terrible to put something as beneficial as Sesame Street behind a paywall.",
                "Sounds good. They get continue to on PBS with same day release on Netflix",
                "A is for Are You Still Watching",
                "So it'll get cancelled in a couple seasons after getting rave reviews?",
                "Elmo doing a sketch as Eleven from Stranger Things is definitely something I'd watch.",
                "Jim Henson is rolling in his grave over the private takeover of a public learning experience for children",
                "Cookie Monster needs to do the Netflix dun dunnnn.",
                "What I really would have liked, is if Netflix made all the Sesame Street shows available without a subscription and made it ad free. But I understand their company, at least PBS has some alternative funding",
                "P is for Pay your fucking subscription fees",
                "Am I the only one that thinks this is kind of gross?  Another public asset gobbled up by a faceless corporation to be bent to their will?  Suddenly Elmo will have politics that just so happen to align with Netflix’s board."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UK pauses trade deal talks with Israel, summons ambassador over",
            "external_url": "https://www.reuters.com/world/europe/uk-pauses-trade-deal-talks-with-israel-summons-ambassador-over-new-gaza-2025-05-20/",
            "upvotes": 370,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Never again\" is only for them.",
                "The title of the article is “UK pauses trade deal talks with Israel, summons ambassador over new Gaza offensive”. \n\nThis sort of diplomatic pressure is the sort of thing Israel will now have to take into account when denying basic needs to millions of people in Gaza.",
                "There is no attainable war goal for Israel so all is left is the death and destruction of Gaza. Hamas releasing the hostages won't end the war (nor does it seem a priority for the Israeli government) and there will never be a full Hamas surrender. In fact with 40,000+ civilians killed they've likely  created more militants that hate Israel than they had before the war began. You don't create peace through death and destruction of civilian populations.\n\nIsrael need to create a better alternative to Hamas, because currently it's a choice between the terrorists of Hamas or the people killing your family and friends and a lot of them are going to pick the first option if no reasonable alternative exists. Something the current Israeli government can not provide and something they do not want to provide.",
                "\nIf what the U.N. said is even half true - that 14,000 babies are going to die from starvation in the next two days, its time for direct, very firm pressure on Netanyahu,",
                "While simultaneously arguing with their courts that they should still be allowed to sell weapons to Israel to be used in their genocide. Amazing dichotomy there.",
                "Good. It's about time it was recognised that it's not anti semitic to call Israel out on all the horrible shit they've done. Just because hamas is evil doesn't give them carte blanche to do what they like.\n\nWith this and the trade deals it's nice to have a government who gets stuff done for once.",
                "About damn time, absolutely the worst scum this planet has to offer. They don't even have second thoughts about murdering 10s of thousands of children.",
                "Good stuff.",
                "Good!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration to pay $5 million to family of Jan. 6 rioter Ashli Babbitt",
            "external_url": "https://www.cbsnews.com/news/trump-administration-5-million-ashli-babbitt-jan-6-rioter-who-was-killed/",
            "upvotes": 15325,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/9ffec37c-c692-4567-94a2-5e37a1afe9eb/thumbnail/1200x630g3/eb119d6ad53eb10ffb3b667fe65772e7/gettyimages-1471239701.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "Hey look, actual government spending waste.",
                "That's American taxpayer dollars going to someone who was trying to overthrow our government.  Our country is so fucked.",
                "My taxes are going to a fucking domestic terrorist\n\nWhat a fucked up timeline",
                "No, the American Taxpayers will pay $5M to her family. \n\nAsk yourself if you’re okay with sending money to the family of a domestic terrorist.",
                "This action is 100% designed to convince fanatics to willfully sacrifice themselves in the future.",
                "Fuck this administration and that traitor Babbitt",
                "She was a domestic terrorist. Donald trump is a domestic terrorist. MAGA is a domestic terrorist organization.",
                "Oh fuck this. Don't storm a government building then try to climb through a window to get at legislators, or they're gonna shoot you.",
                "God damn outrage.\n\nThere are 140 LEOs injured on January 6 who should now sue the Babbit family.\n\nHow much is the Trump Administration offering to the family of Capitol Police Officer Brian Sicknick?",
                "What a joke. People shouldn’t be given monetary prizes for winning Darwin Awards."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "EU, Britain go ahead with new Russia sanctions without waiting for Trump",
            "external_url": "https://www.reuters.com/world/europe/eu-adopts-new-sanctions-against-russia-kallas-says-2025-05-20/",
            "upvotes": 249,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They’ll be waiting til the sun goes supernova",
                "I remember when someone said they could stop this war on day one",
                "Trump has to get permission from Putin before he acts on anything.",
                "Trump the Manchild will throw a temper tantrum. I see eu and uk tariffs soon .",
                "That's smart, everything considered.",
                "The Brits may finally get that Love, Actually moment they've been waiting 20 years for."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 13859,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "No need to pretend anymore.",
                "America elected the dumbest idiot in the history of the nation",
                "\"Don't need an Office of Palestinian Affairs if there are no Palestinians.\"\n\n- This administration",
                "well he is trying to get rid of palestine",
                "Sure am glad that all those purists who voted \"third party\" or stayed home because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.\n\nEdit: added \"stayed home\"",
                "Isn't this why Dearborn voted for Trump?",
                "So the protest votes against Harris didn’t work?! How could anyone see this coming?? /s",
                "This is just cruelty for cruelty's sake."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "U.S. attorney drops case against Newark Mayor Ras Baraka, charges Rep. LaMonica McIver for ICE protest",
            "external_url": "https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/",
            "upvotes": 2854,
            "date": "05/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/09/689bd000-6611-40fe-a9ee-8565bdb639fd/thumbnail/1200x630/fed1cdf3473bbf947e0da1d35ffaa584/gettyimages-2213144885.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "So just curious, do congresspersons have the right to access these facilities as part of their oversight role?",
                ">Habba also announced her office [charged](https://x.com/USAttyHabba/status/1924615111198576645) U.S. Rep. LaMonica McIver for \"assaulting, impeding and interfering with law enforcement\" during the Delaney Hall visit. \n\nSo they're going to resume prosecuting all the J6 seditionists?",
                "Oh how the tables will turn. I just hope that in the next dem administration there is a call to action to get these people before committees and investigate their unlawful activities, but most of all hold them accountable for their abuse of power. (Wishful thinking)",
                "Fascist political theater.  ICE and the AG are the enemy, not Rep. McIver.",
                "“Speak up, speak out, get in the way. Get in good trouble, necessary trouble, and help redeem the soul of America.” - John Lewis\n\nI hope some of these people who are being arrested see it as a badge of honor to be arrested. They are on the right side of history and what the United States should be.",
                "[deleted]",
                "Are they suggesting she assaulted someone? Is there evidence of that? My understanding is that the Congresspeople were the ones being subjected to physical confrontation.",
                "This is about punishing anyone seen as interfering. Trying to chill any others from doing the same.",
                "BUT the right MA GAs will NEVER HEAR THIS!!!!",
                "I thought they claimed to have a video of an ICE agent getting bodyslammed? Whatever happened with that??"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supplier to major supermarkets hit by cyber attack",
            "external_url": "https://www.bbc.co.uk/news/articles/czr88myp570o",
            "upvotes": 293,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9df3/live/57f9d5b0-3542-11f0-b0a8-0d69e851e1e1.jpg",
            "top_comments": [
                "I've worked at food distribution sites and its it is laughable. it works and it's generally efficient... but fully open to attacks from internal and external sources.\n\ncomputers with no password, using unlocked excel spreadsheets, just being able to wander around the back of the building and walk through a door, thousands of agency staff with potential access...\n\nit doesn't really surprise me that something like this can happen, and it could probably happen in most warehouses",
                "I guess hackers don't want grocery stores to stay stocked? As if grocery stores aren't gonna suffer enough this year and so on.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sheriff’s office staffer arrested in connection with New Orleans jailbreak",
            "external_url": "https://www.denver7.com/us-news/sheriffs-office-staffer-arrested-in-connection-with-new-orleans-jailbreak",
            "upvotes": 71,
            "date": "05/20/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/baf92bf/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fa2%2F96%2F06cfc6dc47cf9d630c679169c869%2Fap25136708875133-1.jpg",
            "top_comments": [
                ">The inmates escaped through a hole in a wall behind a toilet in the early hours of Friday while the lone guard watching them went to get food.\n\nIt *is* toward the end of crawfish season. \n\n>Since the escape, Hutson has pointed to long-standing deficiencies such as faulty locks and staffing shortages. But a growing number of state and local officials have said blame for the escape rests squarely on her for failing her responsibility to keep inmates locked up.\n\nThere's always this finger-pointing. Louisiana is notorious for overstaffing police and DAs offices, while understaffing prisons and public defender offices. I'm going to say there are staff shortages that were ignored. [They'll still blame her.](https://en.wikipedia.org/wiki/Susan_Hutson) BTW, Sheriffs are elected positions in Louisiana.",
                "I watched the series on Netflix about  the prison breakout in upstate New York just a little while ago. This seems weirdly similar. Did they watch it too?",
                "Perfect example of why you should never talk to LEO without a lawyer.   Like, who knew just doing something that sounds like an innocuous thing would lead to a prison escape and a whole host of serious charges.",
                "Why the fuck are comments disappearing",
                "Were they too stupid to know that everyone was going to see that this was an inside job?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "EU, Britain go ahead with new Russia sanctions without waiting for Trump",
            "external_url": "https://www.reuters.com/world/europe/eu-adopts-new-sanctions-against-russia-kallas-says-2025-05-20/",
            "upvotes": 249,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They’ll be waiting til the sun goes supernova",
                "I remember when someone said they could stop this war on day one",
                "Trump has to get permission from Putin before he acts on anything.",
                "Trump the Manchild will throw a temper tantrum. I see eu and uk tariffs soon .",
                "That's smart, everything considered.",
                "The Brits may finally get that Love, Actually moment they've been waiting 20 years for."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Passenger jet aborted takeoff to avoid LaGuardia runway collision",
            "external_url": "https://www.nbcnewyork.com/news/local/passenger-jet-abort-takeoff-avoid-runway-collision-laguardia-airport/6270373/",
            "upvotes": 1169,
            "date": "05/20/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/GettyImages-1239716051.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Federal officials are investigating why two planes got dangerously close on a runway at New York's LaGuardia Airport earlier this month despite the airport being equipped with an advanced surface radar system that's designed to help prevent such close calls.\n\nBoth the Federal Aviation Administration and the National Transportation Safety Board said Monday that they are investigating the May 6 incident when a Republic Airways jet had to abort takeoff and slam to a stop because a United Airlines plane was still taxiing across the runway.\n\n**In audio from the tower that ABC obtained from the website** [**www.LiveATC.net**](https://www.liveatc.net/)**, the air traffic control said to the pilot of the Republic Airways jet: “Sorry, I thought United had cleared well before that.”...**",
                "I am a stupid person. \n\nAre these kinds of instances actually occurring more often as a result of the actions of this current administration? Or, has it been “status quo”, i.e., these things happen on a “consistent basis” and we are just receiving a hell of a lot more press on it now?\n\nAgain, I am a stupid person. Thank you for patience.",
                "Those DOGE cuts and layoffs are really saving a lot of money. What could possibly go wrong.",
                "Are we just seeing more news of near collisions and accidents or are the incidents actually up since the cuts?",
                "This administration is an embarrassment. \nI feel like it's gonna take a bit of luck to survive it.",
                "Cool.   Looking forward to flying out of LGA tomorrow.",
                "Ship travel making a comeback baby!",
                "something something Biden's prostate, Obama's tan suit,  George Soros. \n\n/s",
                "How many days without a crash?",
                "It always surprised me that LaGuardia wasn’t the NYC airport completely melting down. I have never had a positive experience flying in or out of that airport"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK pauses trade deal talks with Israel, summons ambassador over",
            "external_url": "https://www.reuters.com/world/europe/uk-pauses-trade-deal-talks-with-israel-summons-ambassador-over-new-gaza-2025-05-20/",
            "upvotes": 373,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Never again\" is only for them.",
                "The title of the article is “UK pauses trade deal talks with Israel, summons ambassador over new Gaza offensive”. \n\nThis sort of diplomatic pressure is the sort of thing Israel will now have to take into account when denying basic needs to millions of people in Gaza.",
                "There is no attainable war goal for Israel so all is left is the death and destruction of Gaza. Hamas releasing the hostages won't end the war (nor does it seem a priority for the Israeli government) and there will never be a full Hamas surrender. In fact with 40,000+ civilians killed they've likely  created more militants that hate Israel than they had before the war began. You don't create peace through death and destruction of civilian populations.\n\nIsrael need to create a better alternative to Hamas, because currently it's a choice between the terrorists of Hamas or the people killing your family and friends and a lot of them are going to pick the first option if no reasonable alternative exists. Something the current Israeli government can not provide and something they do not want to provide.",
                "\nIf what the U.N. said is even half true - that 14,000 babies are going to die from starvation in the next two days, its time for direct, very firm pressure on Netanyahu,",
                "While simultaneously arguing with their courts that they should still be allowed to sell weapons to Israel to be used in their genocide. Amazing dichotomy there.",
                "Good. It's about time it was recognised that it's not anti semitic to call Israel out on all the horrible shit they've done. Just because hamas is evil doesn't give them carte blanche to do what they like.\n\nWith this and the trade deals it's nice to have a government who gets stuff done for once.",
                "About damn time, absolutely the worst scum this planet has to offer. They don't even have second thoughts about murdering 10s of thousands of children.",
                "Good stuff.",
                "Good!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supplier to major supermarkets hit by cyber attack",
            "external_url": "https://www.bbc.co.uk/news/articles/czr88myp570o",
            "upvotes": 295,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9df3/live/57f9d5b0-3542-11f0-b0a8-0d69e851e1e1.jpg",
            "top_comments": [
                "I've worked at food distribution sites and its it is laughable. it works and it's generally efficient... but fully open to attacks from internal and external sources.\n\ncomputers with no password, using unlocked excel spreadsheets, just being able to wander around the back of the building and walk through a door, thousands of agency staff with potential access...\n\nit doesn't really surprise me that something like this can happen, and it could probably happen in most warehouses",
                "I guess hackers don't want grocery stores to stay stocked? As if grocery stores aren't gonna suffer enough this year and so on.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Moody's downgrades JPM, BofA and Wells Fargo after US credit rating cut",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-jpm-bofa-wells-fargo-after-us-credit-rating-cut-2025-05-19/?utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=facebook&fbclid=IwZXh0bgNhZW0CMTEAAR59mJW6zI2u7jNd2y5tL39fxMlgIz-5b7zIAHx0J_eEF0F5jvs-BtDUbbg6bw_aem_rJwFnuJFTA03uOf1EQ-XsA&sfnsn=mo",
            "upvotes": 9207,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When Moody's finally starts downgrading private equity firms and their bundled garbage, then you'll know the music is about to stop. They have to give time for the people up top to get a chair",
                "Well that’s another +500 for the DOW!",
                "I’ve said it here before and I’ll say it again. After the Wells Fargo creating unwanted accounts for the customers years ago, I still can’t wrap my head around anyone trusting them with their money.",
                "Trump bailouts are incoming. Dont worry, Republicans will blame Democrats for inflation after they spend like maniacs to clean up their reckless policy.",
                "Surprised trump hasn’t called moodys a socialist, Marxist, anti-Christian, anti-American organization",
                "And here goes the domino of sovereign credit rating to corporates. The end of it are rate hikes and defaults for the consumers recalled credits and collapsing leverage structures. \n\nThis is going to be bad. Americans think tariffs are a problem? This can snowball in months into sovereign default.",
                "100% self inflicted and optional, thanks to one person: Trump.",
                "Moody is starting to really have some balls on them.",
                "All three heavily contributed to Trump and the GOP. Leopards meet faces.",
                "Does this actually affect people?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Three pupils injured in Finnish school attack, police say",
            "external_url": "https://www.reuters.com/world/europe/three-people-injured-act-violence-finnish-school-perpetrator-apprehended-2025-05-20/",
            "upvotes": 149,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“The attacker used a bladed weapon, police said in a statement, adding that the injuries were not believed to be life-threatening“"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Netflix strikes deal to bring Sesame Street to streaming giant",
            "external_url": "https://www.bbc.co.uk/news/articles/c80k7z8z77yo",
            "upvotes": 3308,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee2f/live/016629a0-3525-11f0-8d66-cd233f41fe78.jpg",
            "top_comments": [
                "Joking aside, I like that this gives them some financial stability while still allowing the episodes to air on PBS. If that side of it eventually stops, however, it would be terrible to put something as beneficial as Sesame Street behind a paywall.",
                "Sounds good. They get continue to on PBS with same day release on Netflix",
                "A is for Are You Still Watching",
                "So it'll get cancelled in a couple seasons after getting rave reviews?",
                "Elmo doing a sketch as Eleven from Stranger Things is definitely something I'd watch.",
                "Jim Henson is rolling in his grave over the private takeover of a public learning experience for children",
                "Cookie Monster needs to do the Netflix dun dunnnn.",
                "What I really would have liked, is if Netflix made all the Sesame Street shows available without a subscription and made it ad free. But I understand their company, at least PBS has some alternative funding",
                "P is for Pay your fucking subscription fees",
                "Am I the only one that thinks this is kind of gross?  Another public asset gobbled up by a faceless corporation to be bent to their will?  Suddenly Elmo will have politics that just so happen to align with Netflix’s board."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Fourth New Orleans jail escapee, charged with murder, captured as manhunt for 6 others continues",
            "external_url": "https://www.nbcnews.com/news/us-news/fourth-new-orleans-jail-escapee-captured-manhunt-6-others-continues-rcna207846",
            "upvotes": 622,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-OPSO-Jail-Escape-RS-7f688b.jpg",
            "top_comments": [
                "One of the guys was pre-trial on second degree battery and obstruction. Seems crazy to try to escape when you’re facing a sentence of maybe a few months.",
                "The \"To easy\" graffiti on the wall made me giggle.",
                "If after a week you're still in New Orleans, you're not really trying to escape...",
                "New Orleans jails are 3rd world hell hole jails.\n\nI don't fault these people for trying to escape - and if we can't hold people humanely we shouldn't be holding them.",
                "Yay, they capture 4 escapees. Now they just gotta figure out where to put them. LOL.\n\nIf yer gonna just throw people in jail, ya gotta pay for the jail. They're really expensive, yo. And guess what? If you work for the jail, guess where you spend most of your day . . . in jail. Gotta be one of the shitiest jobs in the world."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "U.S. attorney drops case against Newark Mayor Ras Baraka, charges Rep. LaMonica McIver for ICE protest",
            "external_url": "https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/",
            "upvotes": 2855,
            "date": "05/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/09/689bd000-6611-40fe-a9ee-8565bdb639fd/thumbnail/1200x630/fed1cdf3473bbf947e0da1d35ffaa584/gettyimages-2213144885.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "So just curious, do congresspersons have the right to access these facilities as part of their oversight role?",
                ">Habba also announced her office [charged](https://x.com/USAttyHabba/status/1924615111198576645) U.S. Rep. LaMonica McIver for \"assaulting, impeding and interfering with law enforcement\" during the Delaney Hall visit. \n\nSo they're going to resume prosecuting all the J6 seditionists?",
                "Oh how the tables will turn. I just hope that in the next dem administration there is a call to action to get these people before committees and investigate their unlawful activities, but most of all hold them accountable for their abuse of power. (Wishful thinking)",
                "Fascist political theater.  ICE and the AG are the enemy, not Rep. McIver.",
                "“Speak up, speak out, get in the way. Get in good trouble, necessary trouble, and help redeem the soul of America.” - John Lewis\n\nI hope some of these people who are being arrested see it as a badge of honor to be arrested. They are on the right side of history and what the United States should be.",
                "[deleted]",
                "Are they suggesting she assaulted someone? Is there evidence of that? My understanding is that the Congresspeople were the ones being subjected to physical confrontation.",
                "This is about punishing anyone seen as interfering. Trying to chill any others from doing the same.",
                "BUT the right MA GAs will NEVER HEAR THIS!!!!",
                "I thought they claimed to have a video of an ICE agent getting bodyslammed? Whatever happened with that??"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "EU, Britain go ahead with new Russia sanctions without waiting for Trump",
            "external_url": "https://www.reuters.com/world/europe/eu-adopts-new-sanctions-against-russia-kallas-says-2025-05-20/",
            "upvotes": 249,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They’ll be waiting til the sun goes supernova",
                "I remember when someone said they could stop this war on day one",
                "Trump has to get permission from Putin before he acts on anything.",
                "Trump the Manchild will throw a temper tantrum. I see eu and uk tariffs soon .",
                "That's smart, everything considered.",
                "The Brits may finally get that Love, Actually moment they've been waiting 20 years for."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Passenger jet aborted takeoff to avoid LaGuardia runway collision",
            "external_url": "https://www.nbcnewyork.com/news/local/passenger-jet-abort-takeoff-avoid-runway-collision-laguardia-airport/6270373/",
            "upvotes": 1173,
            "date": "05/20/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/GettyImages-1239716051.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Federal officials are investigating why two planes got dangerously close on a runway at New York's LaGuardia Airport earlier this month despite the airport being equipped with an advanced surface radar system that's designed to help prevent such close calls.\n\nBoth the Federal Aviation Administration and the National Transportation Safety Board said Monday that they are investigating the May 6 incident when a Republic Airways jet had to abort takeoff and slam to a stop because a United Airlines plane was still taxiing across the runway.\n\n**In audio from the tower that ABC obtained from the website** [**www.LiveATC.net**](https://www.liveatc.net/)**, the air traffic control said to the pilot of the Republic Airways jet: “Sorry, I thought United had cleared well before that.”...**",
                "I am a stupid person. \n\nAre these kinds of instances actually occurring more often as a result of the actions of this current administration? Or, has it been “status quo”, i.e., these things happen on a “consistent basis” and we are just receiving a hell of a lot more press on it now?\n\nAgain, I am a stupid person. Thank you for patience.",
                "Those DOGE cuts and layoffs are really saving a lot of money. What could possibly go wrong.",
                "Are we just seeing more news of near collisions and accidents or are the incidents actually up since the cuts?",
                "This administration is an embarrassment. \nI feel like it's gonna take a bit of luck to survive it.",
                "Cool.   Looking forward to flying out of LGA tomorrow.",
                "Ship travel making a comeback baby!",
                "something something Biden's prostate, Obama's tan suit,  George Soros. \n\n/s",
                "How many days without a crash?",
                "It always surprised me that LaGuardia wasn’t the NYC airport completely melting down. I have never had a positive experience flying in or out of that airport"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UK pauses trade deal talks with Israel, summons ambassador over",
            "external_url": "https://www.reuters.com/world/europe/uk-pauses-trade-deal-talks-with-israel-summons-ambassador-over-new-gaza-2025-05-20/",
            "upvotes": 370,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Never again\" is only for them.",
                "The title of the article is “UK pauses trade deal talks with Israel, summons ambassador over new Gaza offensive”. \n\nThis sort of diplomatic pressure is the sort of thing Israel will now have to take into account when denying basic needs to millions of people in Gaza.",
                "There is no attainable war goal for Israel so all is left is the death and destruction of Gaza. Hamas releasing the hostages won't end the war (nor does it seem a priority for the Israeli government) and there will never be a full Hamas surrender. In fact with 40,000+ civilians killed they've likely  created more militants that hate Israel than they had before the war began. You don't create peace through death and destruction of civilian populations.\n\nIsrael need to create a better alternative to Hamas, because currently it's a choice between the terrorists of Hamas or the people killing your family and friends and a lot of them are going to pick the first option if no reasonable alternative exists. Something the current Israeli government can not provide and something they do not want to provide.",
                "\nIf what the U.N. said is even half true - that 14,000 babies are going to die from starvation in the next two days, its time for direct, very firm pressure on Netanyahu,",
                "While simultaneously arguing with their courts that they should still be allowed to sell weapons to Israel to be used in their genocide. Amazing dichotomy there.",
                "Good. It's about time it was recognised that it's not anti semitic to call Israel out on all the horrible shit they've done. Just because hamas is evil doesn't give them carte blanche to do what they like.\n\nWith this and the trade deals it's nice to have a government who gets stuff done for once.",
                "About damn time, absolutely the worst scum this planet has to offer. They don't even have second thoughts about murdering 10s of thousands of children.",
                "Good stuff.",
                "Good!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Moody's downgrades JPM, BofA and Wells Fargo after US credit rating cut",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-jpm-bofa-wells-fargo-after-us-credit-rating-cut-2025-05-19/?utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=facebook&fbclid=IwZXh0bgNhZW0CMTEAAR59mJW6zI2u7jNd2y5tL39fxMlgIz-5b7zIAHx0J_eEF0F5jvs-BtDUbbg6bw_aem_rJwFnuJFTA03uOf1EQ-XsA&sfnsn=mo",
            "upvotes": 9212,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When Moody's finally starts downgrading private equity firms and their bundled garbage, then you'll know the music is about to stop. They have to give time for the people up top to get a chair",
                "Well that’s another +500 for the DOW!",
                "I’ve said it here before and I’ll say it again. After the Wells Fargo creating unwanted accounts for the customers years ago, I still can’t wrap my head around anyone trusting them with their money.",
                "Trump bailouts are incoming. Dont worry, Republicans will blame Democrats for inflation after they spend like maniacs to clean up their reckless policy.",
                "Surprised trump hasn’t called moodys a socialist, Marxist, anti-Christian, anti-American organization",
                "And here goes the domino of sovereign credit rating to corporates. The end of it are rate hikes and defaults for the consumers recalled credits and collapsing leverage structures. \n\nThis is going to be bad. Americans think tariffs are a problem? This can snowball in months into sovereign default.",
                "100% self inflicted and optional, thanks to one person: Trump.",
                "Moody is starting to really have some balls on them.",
                "All three heavily contributed to Trump and the GOP. Leopards meet faces.",
                "Does this actually affect people?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supplier to major supermarkets hit by cyber attack",
            "external_url": "https://www.bbc.co.uk/news/articles/czr88myp570o",
            "upvotes": 294,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9df3/live/57f9d5b0-3542-11f0-b0a8-0d69e851e1e1.jpg",
            "top_comments": [
                "I've worked at food distribution sites and its it is laughable. it works and it's generally efficient... but fully open to attacks from internal and external sources.\n\ncomputers with no password, using unlocked excel spreadsheets, just being able to wander around the back of the building and walk through a door, thousands of agency staff with potential access...\n\nit doesn't really surprise me that something like this can happen, and it could probably happen in most warehouses",
                "I guess hackers don't want grocery stores to stay stocked? As if grocery stores aren't gonna suffer enough this year and so on.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "DOJ says it has charged N.J. congresswoman with assaulting law enforcement at ICE facility",
            "external_url": "https://www.nbcnews.com/politics/justice-department/lamonica-mciver-ras-baraka-alina-habba-ice-new-jersey-newark-rcna207842",
            "upvotes": 8171,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-LaMonica-McIver-ac-810p-ede87e.jpg",
            "top_comments": [
                "[But have also dropped the charges against Newark mayor](https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/)",
                "Funny how there are media reports from a couple of days ago that they’re changing how they’re charging public officials (https://thehill.com/homenews/administration/5307294-doj-key-review-elected-officials-prosecutions/amp/). \n\nAlso funny how they made a big deal of not weaponizing the DOJ; only to blatantly weaponize it.",
                ">Acting U.S. Attorney for the District of New Jersey Alina Habba made the announcement on X, where she accused the Democratic lawmaker of “assaulting, impeding and interfering with law enforcement.”\n\nThis is what they're going to do to anyone and everyone who stands in ICE's way.",
                "[removed]",
                "This regime is destroying the 97% conviction rate of the DOJ",
                "Fascists are trying to instill fear into the opposition. Never back down. This is a slam dunk case for her.",
                "The visit to the ICE facility was an official act as part of her legislative oversight authority. She has legislative immunity. Supreme Court said so.",
                "Fox is analyzing the video of this “assault” this like it’s the Zapruder film. Such bullshit. Know who was really assaulted ? The Capital Police on January 6.",
                "Assaulted by LEO? Charged with assaulting LEO.",
                "Didn't Marjorie Greene Taylor kick a person and not get charged?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Netflix strikes deal to bring Sesame Street to streaming giant",
            "external_url": "https://www.bbc.co.uk/news/articles/c80k7z8z77yo",
            "upvotes": 3298,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee2f/live/016629a0-3525-11f0-8d66-cd233f41fe78.jpg",
            "top_comments": [
                "Joking aside, I like that this gives them some financial stability while still allowing the episodes to air on PBS. If that side of it eventually stops, however, it would be terrible to put something as beneficial as Sesame Street behind a paywall.",
                "Sounds good. They get continue to on PBS with same day release on Netflix",
                "A is for Are You Still Watching",
                "So it'll get cancelled in a couple seasons after getting rave reviews?",
                "Elmo doing a sketch as Eleven from Stranger Things is definitely something I'd watch.",
                "Jim Henson is rolling in his grave over the private takeover of a public learning experience for children",
                "Cookie Monster needs to do the Netflix dun dunnnn.",
                "What I really would have liked, is if Netflix made all the Sesame Street shows available without a subscription and made it ad free. But I understand their company, at least PBS has some alternative funding",
                "P is for Pay your fucking subscription fees",
                "Am I the only one that thinks this is kind of gross?  Another public asset gobbled up by a faceless corporation to be bent to their will?  Suddenly Elmo will have politics that just so happen to align with Netflix’s board."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration to pay $5 million to family of Jan. 6 rioter Ashli Babbitt",
            "external_url": "https://www.cbsnews.com/news/trump-administration-5-million-ashli-babbitt-jan-6-rioter-who-was-killed/",
            "upvotes": 15319,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/9ffec37c-c692-4567-94a2-5e37a1afe9eb/thumbnail/1200x630g3/eb119d6ad53eb10ffb3b667fe65772e7/gettyimages-1471239701.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "Hey look, actual government spending waste.",
                "That's American taxpayer dollars going to someone who was trying to overthrow our government.  Our country is so fucked.",
                "My taxes are going to a fucking domestic terrorist\n\nWhat a fucked up timeline",
                "No, the American Taxpayers will pay $5M to her family. \n\nAsk yourself if you’re okay with sending money to the family of a domestic terrorist.",
                "This action is 100% designed to convince fanatics to willfully sacrifice themselves in the future.",
                "Fuck this administration and that traitor Babbitt",
                "She was a domestic terrorist. Donald trump is a domestic terrorist. MAGA is a domestic terrorist organization.",
                "Oh fuck this. Don't storm a government building then try to climb through a window to get at legislators, or they're gonna shoot you.",
                "God damn outrage.\n\nThere are 140 LEOs injured on January 6 who should now sue the Babbit family.\n\nHow much is the Trump Administration offering to the family of Capitol Police Officer Brian Sicknick?",
                "What a joke. People shouldn’t be given monetary prizes for winning Darwin Awards."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 13861,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "No need to pretend anymore.",
                "America elected the dumbest idiot in the history of the nation",
                "\"Don't need an Office of Palestinian Affairs if there are no Palestinians.\"\n\n- This administration",
                "well he is trying to get rid of palestine",
                "Sure am glad that all those purists who voted \"third party\" or stayed home because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.\n\nEdit: added \"stayed home\"",
                "Isn't this why Dearborn voted for Trump?",
                "So the protest votes against Harris didn’t work?! How could anyone see this coming?? /s",
                "This is just cruelty for cruelty's sake."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "U.S. attorney drops case against Newark Mayor Ras Baraka, charges Rep. LaMonica McIver for ICE protest",
            "external_url": "https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/",
            "upvotes": 2852,
            "date": "05/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/09/689bd000-6611-40fe-a9ee-8565bdb639fd/thumbnail/1200x630/fed1cdf3473bbf947e0da1d35ffaa584/gettyimages-2213144885.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "So just curious, do congresspersons have the right to access these facilities as part of their oversight role?",
                ">Habba also announced her office [charged](https://x.com/USAttyHabba/status/1924615111198576645) U.S. Rep. LaMonica McIver for \"assaulting, impeding and interfering with law enforcement\" during the Delaney Hall visit. \n\nSo they're going to resume prosecuting all the J6 seditionists?",
                "Oh how the tables will turn. I just hope that in the next dem administration there is a call to action to get these people before committees and investigate their unlawful activities, but most of all hold them accountable for their abuse of power. (Wishful thinking)",
                "Fascist political theater.  ICE and the AG are the enemy, not Rep. McIver.",
                "“Speak up, speak out, get in the way. Get in good trouble, necessary trouble, and help redeem the soul of America.” - John Lewis\n\nI hope some of these people who are being arrested see it as a badge of honor to be arrested. They are on the right side of history and what the United States should be.",
                "[deleted]",
                "Are they suggesting she assaulted someone? Is there evidence of that? My understanding is that the Congresspeople were the ones being subjected to physical confrontation.",
                "This is about punishing anyone seen as interfering. Trying to chill any others from doing the same.",
                "BUT the right MA GAs will NEVER HEAR THIS!!!!",
                "I thought they claimed to have a video of an ICE agent getting bodyslammed? Whatever happened with that??"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/20/2025 16:11:04 UTC"
}