{
    "posts": [
        {
            "category": "HOT",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 12163,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "This will not end well.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "We have reached the eugenics part of the plot.",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "I read the linked article, and it looks like the plan to find \"answers to autism\" is just to look at information from a bunch of US patient databases. The logic seems to be:\n\n* Amass database of patient info\n* ?????\n* Cause of autism\n\nNo analysis of this data will tell you what causes autism - even if you found differences in populations with and without autism, you would need follow up studies (you know, correlation != causation and all that). My guess is that one difference will be that patients with autism are more likely to be unvaccinated, due to misinformation.\n\nBad science aside, the most concerning issue mentioned in the article is that a \"new disease registry is being launched to track Americans with autism,\" which is highly alarming. What the hell is this for? The article doesn't say, of course, but there is no scientific rationale to \"register\" Americans with autism."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 15216,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[ Removed by Reddit ]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "I'll bet he wants to bring back debtor's prison.",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "I thought the Education Department was abolished. What are they doing still working?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 961,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "At what point does it stop being capitalism?",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. That's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Five bazillion percent!",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "WHO: countries unite on pandemic accord. US left WHO.",
            "external_url": "https://www.who.int/news/item/16-04-2025-who-member-states-conclude-negotiations-and-make-significant-progress-on-draft-pandemic-agreement",
            "upvotes": 665,
            "date": "04/22/2025",
            "thumbnail": "https://cdn.who.int/media/images/default-source/headquarters/teams/external-relations-governance-(ext)/governing-bodies-(gbs)/governance-(gov)/inb13-resumed-closing-session.tmb-1200v.jpg?sfvrsn=4183060b_4",
            "top_comments": [
                "Who needs WHO when we have the medical genius of the brain worms controlling their RFK Jr. meat suit. Sure it’s been wrung through the ringers of heroin, steroids, and unchecked supplement abuse, but they’re probably really great worms. ",
                "US citizens can sign up for their own WHO newsletters to keep up-to-date: [WHO newsletter subscription link](https://www.who.int/news-room/newsletters)",
                "America striving diligently to become an underdeveloped nation...",
                "Huge global milestone. While the U.S. walked away, most of the world just agreed on how to handle the next pandemic, together. Let’s hope politics doesn’t get in the way of science when it matters most.",
                "It’s amazing what can get done when the US is out of the picture.",
                "> The proposal affirms the sovereignty of countries to address public health matters within their borders, and provides that nothing in the draft agreement shall be interpreted as providing WHO any authority to direct, order, alter or prescribe national laws or policies, or mandate States to take specific actions, such as ban or accept travellers, impose vaccination mandates or therapeutic or diagnostic measures or implement lockdowns.\n\nAs if a country who has tossed silly things like due process on the flaming trash heap of history would listen anyway.",
                "And we all thought Plague Incs easy mode where everybody hates science and doctors was not possible.",
                "The WHO had no idea how to handle this last pandemic and gave advice that was frankly terrible. If living in a bubble would help save lives they'd recommend that ignoring the horrible consequences of what that does to society at large. We are still feeling the effects of what we did during Covid with kids growing up with some of the worst anxiety and social issues that we still can't fathom the effects of. \n\nI for one, celebrate leaving the WHO. My body my choice. Freedom to choose how I live. Freedom to choose how will die. Unvaccinated and still alive and well.",
                "**Not the headline!** ~~I read what you wrote as the US has left the WHO; the US has not left the WHO.~~",
                "Remember, WHO protected China when China was purposefully hiding how serious COVID was early on. They are puppets for the CCP"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 47218,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.\n\nEDIT - Giuliani did pay up, but after some teeth pulling. But my point still stands. Winning a verdict is only the start of the battle.",
                "I scream this into the void whenever this topic comes up, and I will continue doing so:\n\nI was a flight instructor for nearly a decade. I taught hundreds of students from recreational private pilots, up through commercial pilots and flight instructors. I taught many women, people of color, and even one trans person (that I knew of). And of course, mostly white dudes. \n\nThere is *absolutely zero* correlation between a person's gender or race and their ability to fly an airplane, make critical decisions during a flight, or manage resources.\n\nActually, I take that back. Women were generally better at studying and were less likely to take risks. The worst students were usually rich old men. \n\nAirlines **do not** hire under-performing candidates to meet \"DEI quotas.\" Everyone has to perform to the same standard. Sure, there may be initiatives to help those who have been subjected to an industry with a deeply ingrained \"good ol' boy\" tradition, but not at the expense of safety, performance, and quality. You either meet the standards, or you don't.\n\nThese cowards hide behind DEI and say stuff like \"Ohh I just don't like these woke hiring practices that allow under-qualified people in, women can be perfectly fine pilots too!\" But that's *bullshit.* They are cowards who refuse to say it with their chest. They think women can't be pilots. They think black people can't be pilots. They think trans people can't be pilots. It's fucking horseshit and they are sad little pussies who are too afraid to be openly sexist and racist.\n\nTake it from me, an *actual professional* with years of experience in the industry. Not some dipshit podcaster or brainless news personality.",
                "Unfortunately, america no longer has a justice system.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Hope she wins and wins big"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 26725,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "I’m confused, is America great again yet or not?",
                "Long term gain, though, right?\n\n...you guys?",
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "Bond yields are spiking again, too.  \nFaith is being lost in not just the dollar and U.S. equities, but Treasuries, too.  \nYikes.",
                "Every time a Republican is in office my life gets harder.",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "I think a corky laugh and a stable 401k would’ve been better than this."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "China retreats from US private equity investments, FT reports",
            "external_url": "https://www.reuters.com/world/china/china-retreats-us-private-equity-investments-ft-reports-2025-04-21/",
            "upvotes": 4045,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "God knows what kind of news we'll see in next month.",
                "Ooooh. That’s going to cause interesting problems.",
                "The flight from US Assets is worldwide, based on partially the “tariffs”, but mostly the unpredictable nature of the government ",
                "I'm really fascinated by how no one who stands to lose much as a result of this has thought to speak up yet. You know, the super but not quite mega rich. Heck, even the mega rich. Aren't they worried?",
                "China isn’t messing around while Trump sits by the phone waiting for a call that isn’t coming.",
                "yay ... president trump made private equity cheaper, just like with stocks.\n\nNext eggs. Then infrastructure week.",
                "Anyone have a non paywall link? Would like to learn something beyond the headlines.",
                "Best not to invest in Trump's mess?",
                "So how long before hyper-inflation and mass homelessness and starvation set in?",
                "Oh no, less money to buy profitable companies and rape them for every last penny before letting them go bankrupt"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Walgreens to pay up to $350 million in US opioid settlement",
            "external_url": "https://edition.cnn.com/2025/04/22/business/walgreens-opioid-settlement-hnk/index.html",
            "upvotes": 689,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25072097339624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Up next: Walgreens files for bankruptcy",
                "I feel like with how much they profited off of opioids, this is a very low number",
                "\"Walgreens to pay its way out of scandalous misconduct and avoid real-world consequences\"\n\nWhat's the sentence for a dealer on the streets slinging heroin? Should be the same for these fuckin guys.",
                "Seems like it was the pharmaceutical companies and pill mill doctors that created the epidemic, not the brick and mortar store filling prescriptions. They are not doctors so how should they know they are hurting people?\n\n(I didn’t read the article.)",
                "That's like $1 per store almost.",
                "Pharmacist here. It’s amazing to see so many people out here with pitch forks but the moment a pharmacist refuses to fill an opioid they are met with “WHAT DO YOU MEAN? JUST FILL IT?” “YOU ARENT A DOCTOR” “YOU ARE DISCRIMINATING AGAINST PAIN PATIENTS”.\n\nCan’t have it both ways folks.",
                "Pharmacies were supposed to be the last line of defense. Instead, they became part of the supply chain.",
                "They can ignore it and just move on at if nothing happened.",
                "OK, but the Sacklers belong in CECOT.  All of them.  And that would still be better than they deserve.",
                "Walmart's gross profit for 2024 was 157 billion. Which means they make roughly 450 million profit per day. \n\nThis fine is a rounding error to these people."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
            "external_url": "https://www.ctvnews.ca/world/article/person-found-on-elevated-surface-inside-trump-tower-in-new-york-is-arrested-police-say/",
            "upvotes": 2757,
            "date": "04/22/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2PADYAXEK5WCWYG67FNQU3FVSQ.jpg?smart=true&auth=28d8b408dc7fcee6c89b601bcc25a522afbde941aeb080eed5dff54b81d9e4f2&width=1200&height=630",
            "top_comments": [
                "What the fuck is an \"elevated surface\"?\n\nA platform? Stairs? Another Floor? High Heels?",
                "Aaaand that's it. The title says everything and the article contains no further details.",
                "What does this even mean? Elevated surface? Arrested for what? Seriously wtf does this mean?",
                "[removed]",
                "[removed]",
                "[removed]",
                "Don Jr coked out of his mind screaming from a balcony “I can fly!”",
                "He won’t be making it 4 years… he’s upsetting so much of his base lol.",
                "[removed]",
                "This is one of the absolute worst pieces of reporting I have ever seen. Just blue balls in reporting format"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder",
            "external_url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc",
            "upvotes": 9676,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Patrick Crusius was automatically be sentenced to life in prison without parole in the massacre near the U.S.-Mexico border. The change of plea comes after local prosecutors took the death penalty off the table.\n\n>El Paso County District Attorney James Montoya declined to pursue the death penalty, saying that decision was driven by a majority of victims’ relatives who want the case to be over.\n\nI can see the sentiment of just wanting to not think about it anymore. The murderer is 26 now and will likely spend decades in [a Texas prison](https://www.texastribune.org/2022/08/24/texas-prisons-air-conditioning/).",
                "> About 100 people from victims’ families were seated in the gallery behind a few rows reserved for media, prosecutors and Crusius’ defense team. They will be given the time to give victim impact statements starting Monday afternoon. Dozens made emotional statements during a similar hearing in federal court in 2023 that lasted for three days.\n\n> The people who were killed at Walmart ranged in age from a 15-year-old high school athlete to elderly grandparents. They included immigrants, a retired city bus driver, a teacher, tradesmen including a former iron worker, and several Mexican nationals who had crossed the U.S. border on routine shopping trips.\n\nThose people leave behind a legacy of loved ones who will keep their memories alive. 100 loved ones to share their stories. This man leaves no legacy but hatred, and will be remembered as a bigoted monster. May he rot in prison and fade into obscurity.",
                "So death for the UHC CEO murderer, but this dude gets to live?  Cool.  Cool.",
                "Wait, hold on. This guy kills 23 people in a racist attack and isn't considered a terrorist, but a guy killing a corrupt CEO is a terrorist?",
                "> The online rant speaks of a “Hispanic invasion of Texas.”\n\n>“They are the instigators, not me,” it says. “I am simply defending my country from cultural and ethnic replacement brought on by an invasion.”\n\n\nAsshole never studied U.S. history, clearly. It’s the other way around.",
                "23 people. Killed. In a grocery store.  \n\nMake it make sense. 2 is horrible but 23????",
                "It's important to note that you cannot appeal a conviction in which you plead guilty to with much chance of success. \n\nMost appeals that are successful aren't about innocence, but procedural mistakes by the prosecution and law enforcement officers in the case. \n\nAs high profile as this is, I imagine that the last thing anyone wants is for someone to have made one tiny mistake in an otherwise open and shut case and this guy go free because of it. There is still the fact that the judge can alter sentencing, and order modifiers such as without parole, or non concurrent sentences, meaning a separate life sentence for each victim, to be stacked on top of each other. \n\nI'm not a huge fan of the death penalty, but that's not the only way to make sure this man never walks away free.",
                "So let me get this straight. Killing 23 Mexicans and injuring 21 more only gets you life in prison. Killing a single white CEO gets you an instant death penalty. Is that about right?",
                "I was just thinking about this the other day. Some madman guns down Hispanics at Walmart enraged at Mexicans under Trump's stoking of hatred, for said group. Mad man kills a mother and father leaving a baby homeless. Uncle of the baby is a MAGA lover, finds out Trump is coming, first thought is not overwhelming grief for his lost sister and orphaned niece, no he thinks! Bingo! If I grab the baby like a prop and head back to hospital where my sister and brother in law just died, maybe I can get a picture with Trump! https://www.theguardian.com/us-news/2019/aug/09/trump-el-paso-melania-orphan-baby-thumbs-up\nAnd he got his picture. I always think of this when people get shocked that the maga won't turn on him.",
                "Five and a half frikkin years to get here? He posted his manifesto on one of the chan sites.\n\n\n OFC the families just want to move on now. IT'S BEEN OVER FIVE YEARS."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "WHO: countries unite on pandemic accord. US left WHO.",
            "external_url": "https://www.who.int/news/item/16-04-2025-who-member-states-conclude-negotiations-and-make-significant-progress-on-draft-pandemic-agreement",
            "upvotes": 667,
            "date": "04/22/2025",
            "thumbnail": "https://cdn.who.int/media/images/default-source/headquarters/teams/external-relations-governance-(ext)/governing-bodies-(gbs)/governance-(gov)/inb13-resumed-closing-session.tmb-1200v.jpg?sfvrsn=4183060b_4",
            "top_comments": [
                "Who needs WHO when we have the medical genius of the brain worms controlling their RFK Jr. meat suit. Sure it’s been wrung through the ringers of heroin, steroids, and unchecked supplement abuse, but they’re probably really great worms. ",
                "US citizens can sign up for their own WHO newsletters to keep up-to-date: [WHO newsletter subscription link](https://www.who.int/news-room/newsletters)",
                "America striving diligently to become an underdeveloped nation...",
                "Huge global milestone. While the U.S. walked away, most of the world just agreed on how to handle the next pandemic, together. Let’s hope politics doesn’t get in the way of science when it matters most.",
                "It’s amazing what can get done when the US is out of the picture.",
                "> The proposal affirms the sovereignty of countries to address public health matters within their borders, and provides that nothing in the draft agreement shall be interpreted as providing WHO any authority to direct, order, alter or prescribe national laws or policies, or mandate States to take specific actions, such as ban or accept travellers, impose vaccination mandates or therapeutic or diagnostic measures or implement lockdowns.\n\nAs if a country who has tossed silly things like due process on the flaming trash heap of history would listen anyway.",
                "And we all thought Plague Incs easy mode where everybody hates science and doctors was not possible.",
                "The WHO had no idea how to handle this last pandemic and gave advice that was frankly terrible. If living in a bubble would help save lives they'd recommend that ignoring the horrible consequences of what that does to society at large. We are still feeling the effects of what we did during Covid with kids growing up with some of the worst anxiety and social issues that we still can't fathom the effects of. \n\nI for one, celebrate leaving the WHO. My body my choice. Freedom to choose how I live. Freedom to choose how will die. Unvaccinated and still alive and well.",
                "**Not the headline!** ~~I read what you wrote as the US has left the WHO; the US has not left the WHO.~~",
                "Remember, WHO protected China when China was purposefully hiding how serious COVID was early on. They are puppets for the CCP"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Japan's supermarkets hike rice prices for 15th week",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250421_B83/",
            "upvotes": 191,
            "date": "04/22/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250421_B83_1517598_L.jpg",
            "top_comments": [
                "Are they still blaming the tourists for rice shortages?",
                "In 2023, Japan imported $387 million worth of rice from the United States. This represents about 51% of Japan's total rice imports and is the largest amount imported from any single country, [according to TrendEconomy](https://trendeconomy.com/data/h2/Japan/1006). Japan's WTO commitments require annual imports of 682,000 metric tons of rice, with the U.S. supplying roughly 50% of that amount, [according to the USA Rice Federation](https://www.usarice.com/discover-us-rice/international-markets/international-market/japan). \n\nTariffs",
                "100% Y/Y? That's insane.",
                "Inflation on food is like white on rice rn",
                "Japan's rice, USA's eggs.",
                "Time to buy eggs from the USA",
                "They will get it from China. \n\nIts all good."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 962,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "At what point does it stop being capitalism?",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. That's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Five bazillion percent!",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Walgreens to pay up to $350 million in US opioid settlement",
            "external_url": "https://edition.cnn.com/2025/04/22/business/walgreens-opioid-settlement-hnk/index.html",
            "upvotes": 686,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25072097339624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Up next: Walgreens files for bankruptcy",
                "I feel like with how much they profited off of opioids, this is a very low number",
                "\"Walgreens to pay its way out of scandalous misconduct and avoid real-world consequences\"\n\nWhat's the sentence for a dealer on the streets slinging heroin? Should be the same for these fuckin guys.",
                "Seems like it was the pharmaceutical companies and pill mill doctors that created the epidemic, not the brick and mortar store filling prescriptions. They are not doctors so how should they know they are hurting people?\n\n(I didn’t read the article.)",
                "That's like $1 per store almost.",
                "Pharmacist here. It’s amazing to see so many people out here with pitch forks but the moment a pharmacist refuses to fill an opioid they are met with “WHAT DO YOU MEAN? JUST FILL IT?” “YOU ARENT A DOCTOR” “YOU ARE DISCRIMINATING AGAINST PAIN PATIENTS”.\n\nCan’t have it both ways folks.",
                "Pharmacies were supposed to be the last line of defense. Instead, they became part of the supply chain.",
                "They can ignore it and just move on at if nothing happened.",
                "OK, but the Sacklers belong in CECOT.  All of them.  And that would still be better than they deserve.",
                "Walmart's gross profit for 2024 was 157 billion. Which means they make roughly 450 million profit per day. \n\nThis fine is a rounding error to these people."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Trial to boldly grow food in space labs blasts off",
            "external_url": "https://www.bbc.co.uk/news/articles/cp34wzql2xvo",
            "upvotes": 93,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ae0f/live/ccf0e300-1f57-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "How does one grow food boldly"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US FTC sues Uber, alleging deceptive subscription practices",
            "external_url": "https://www.bbc.com/news/articles/c1drkq0dy07o",
            "upvotes": 774,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/542a/live/0456b050-1f20-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "> In its complaint filed on Monday, the FTC said that Uber has made suspending subscriptions \"extremely difficult\" for consumers, who can be subjected to navigating as many as 23 screens and taking up to 32 actions if they try to cancel.\n\n\nI wonder how many people just gave up and reported their card as lost to their bank.",
                "tomorrow: Uber buys 10k Teslas",
                "Good. Go after ticket master next.",
                "Something tells me the majority of those affected will be compensated with a code for 30 days with no delivery fees to Uber Eats courtesy of Uber. Only applied to orders with a minimum purchase of $30 and with agreement that you will continue a 12 month subscription after your 30 days. You know, for your troubles.",
                "someone's grandma at FTC must have realized they paid for Uber One the last 5 years. I just don't see the current gov going after uber.",
                "I hope they get shafted hard.  Wolves in sheep's clothing.  ",
                "Musk must be mad at them.",
                "The real deception was getting the government to let them classify their employees as contractors.",
                "Looks like Uber forgot to pay their bribe to daddy Trump.",
                "Don’t forget Uber one cost more per ride than standard Uber, plenty of post and threads been tested"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 12169,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "This will not end well.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "We have reached the eugenics part of the plot.",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "I read the linked article, and it looks like the plan to find \"answers to autism\" is just to look at information from a bunch of US patient databases. The logic seems to be:\n\n* Amass database of patient info\n* ?????\n* Cause of autism\n\nNo analysis of this data will tell you what causes autism - even if you found differences in populations with and without autism, you would need follow up studies (you know, correlation != causation and all that). My guess is that one difference will be that patients with autism are more likely to be unvaccinated, due to misinformation.\n\nBad science aside, the most concerning issue mentioned in the article is that a \"new disease registry is being launched to track Americans with autism,\" which is highly alarming. What the hell is this for? The article doesn't say, of course, but there is no scientific rationale to \"register\" Americans with autism."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
            "external_url": "https://www.ctvnews.ca/world/article/person-found-on-elevated-surface-inside-trump-tower-in-new-york-is-arrested-police-say/",
            "upvotes": 2755,
            "date": "04/22/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2PADYAXEK5WCWYG67FNQU3FVSQ.jpg?smart=true&auth=28d8b408dc7fcee6c89b601bcc25a522afbde941aeb080eed5dff54b81d9e4f2&width=1200&height=630",
            "top_comments": [
                "What the fuck is an \"elevated surface\"?\n\nA platform? Stairs? Another Floor? High Heels?",
                "Aaaand that's it. The title says everything and the article contains no further details.",
                "What does this even mean? Elevated surface? Arrested for what? Seriously wtf does this mean?",
                "[removed]",
                "[removed]",
                "[removed]",
                "Don Jr coked out of his mind screaming from a balcony “I can fly!”",
                "He won’t be making it 4 years… he’s upsetting so much of his base lol.",
                "[removed]",
                "This is one of the absolute worst pieces of reporting I have ever seen. Just blue balls in reporting format"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "China retreats from US private equity investments, FT reports",
            "external_url": "https://www.reuters.com/world/china/china-retreats-us-private-equity-investments-ft-reports-2025-04-21/",
            "upvotes": 4048,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "God knows what kind of news we'll see in next month.",
                "Ooooh. That’s going to cause interesting problems.",
                "The flight from US Assets is worldwide, based on partially the “tariffs”, but mostly the unpredictable nature of the government ",
                "I'm really fascinated by how no one who stands to lose much as a result of this has thought to speak up yet. You know, the super but not quite mega rich. Heck, even the mega rich. Aren't they worried?",
                "China isn’t messing around while Trump sits by the phone waiting for a call that isn’t coming.",
                "yay ... president trump made private equity cheaper, just like with stocks.\n\nNext eggs. Then infrastructure week.",
                "Anyone have a non paywall link? Would like to learn something beyond the headlines.",
                "Best not to invest in Trump's mess?",
                "So how long before hyper-inflation and mass homelessness and starvation set in?",
                "Oh no, less money to buy profitable companies and rape them for every last penny before letting them go bankrupt"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 15218,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[ Removed by Reddit ]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "I'll bet he wants to bring back debtor's prison.",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "I thought the Education Department was abolished. What are they doing still working?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "WHO: countries unite on pandemic accord. US left WHO.",
            "external_url": "https://www.who.int/news/item/16-04-2025-who-member-states-conclude-negotiations-and-make-significant-progress-on-draft-pandemic-agreement",
            "upvotes": 663,
            "date": "04/22/2025",
            "thumbnail": "https://cdn.who.int/media/images/default-source/headquarters/teams/external-relations-governance-(ext)/governing-bodies-(gbs)/governance-(gov)/inb13-resumed-closing-session.tmb-1200v.jpg?sfvrsn=4183060b_4",
            "top_comments": [
                "Who needs WHO when we have the medical genius of the brain worms controlling their RFK Jr. meat suit. Sure it’s been wrung through the ringers of heroin, steroids, and unchecked supplement abuse, but they’re probably really great worms. ",
                "US citizens can sign up for their own WHO newsletters to keep up-to-date: [WHO newsletter subscription link](https://www.who.int/news-room/newsletters)",
                "America striving diligently to become an underdeveloped nation...",
                "Huge global milestone. While the U.S. walked away, most of the world just agreed on how to handle the next pandemic, together. Let’s hope politics doesn’t get in the way of science when it matters most.",
                "It’s amazing what can get done when the US is out of the picture.",
                "> The proposal affirms the sovereignty of countries to address public health matters within their borders, and provides that nothing in the draft agreement shall be interpreted as providing WHO any authority to direct, order, alter or prescribe national laws or policies, or mandate States to take specific actions, such as ban or accept travellers, impose vaccination mandates or therapeutic or diagnostic measures or implement lockdowns.\n\nAs if a country who has tossed silly things like due process on the flaming trash heap of history would listen anyway.",
                "And we all thought Plague Incs easy mode where everybody hates science and doctors was not possible.",
                "The WHO had no idea how to handle this last pandemic and gave advice that was frankly terrible. If living in a bubble would help save lives they'd recommend that ignoring the horrible consequences of what that does to society at large. We are still feeling the effects of what we did during Covid with kids growing up with some of the worst anxiety and social issues that we still can't fathom the effects of. \n\nI for one, celebrate leaving the WHO. My body my choice. Freedom to choose how I live. Freedom to choose how will die. Unvaccinated and still alive and well.",
                "**Not the headline!** ~~I read what you wrote as the US has left the WHO; the US has not left the WHO.~~",
                "Remember, WHO protected China when China was purposefully hiding how serious COVID was early on. They are puppets for the CCP"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Walgreens to pay up to $350 million in US opioid settlement",
            "external_url": "https://edition.cnn.com/2025/04/22/business/walgreens-opioid-settlement-hnk/index.html",
            "upvotes": 686,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25072097339624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Up next: Walgreens files for bankruptcy",
                "I feel like with how much they profited off of opioids, this is a very low number",
                "\"Walgreens to pay its way out of scandalous misconduct and avoid real-world consequences\"\n\nWhat's the sentence for a dealer on the streets slinging heroin? Should be the same for these fuckin guys.",
                "Seems like it was the pharmaceutical companies and pill mill doctors that created the epidemic, not the brick and mortar store filling prescriptions. They are not doctors so how should they know they are hurting people?\n\n(I didn’t read the article.)",
                "That's like $1 per store almost.",
                "Pharmacist here. It’s amazing to see so many people out here with pitch forks but the moment a pharmacist refuses to fill an opioid they are met with “WHAT DO YOU MEAN? JUST FILL IT?” “YOU ARENT A DOCTOR” “YOU ARE DISCRIMINATING AGAINST PAIN PATIENTS”.\n\nCan’t have it both ways folks.",
                "Pharmacies were supposed to be the last line of defense. Instead, they became part of the supply chain.",
                "They can ignore it and just move on at if nothing happened.",
                "OK, but the Sacklers belong in CECOT.  All of them.  And that would still be better than they deserve.",
                "Walmart's gross profit for 2024 was 157 billion. Which means they make roughly 450 million profit per day. \n\nThis fine is a rounding error to these people."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 963,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "At what point does it stop being capitalism?",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. That's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Five bazillion percent!",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "US FTC sues Uber, alleging deceptive subscription practices",
            "external_url": "https://www.bbc.com/news/articles/c1drkq0dy07o",
            "upvotes": 772,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/542a/live/0456b050-1f20-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "> In its complaint filed on Monday, the FTC said that Uber has made suspending subscriptions \"extremely difficult\" for consumers, who can be subjected to navigating as many as 23 screens and taking up to 32 actions if they try to cancel.\n\n\nI wonder how many people just gave up and reported their card as lost to their bank.",
                "tomorrow: Uber buys 10k Teslas",
                "Good. Go after ticket master next.",
                "Something tells me the majority of those affected will be compensated with a code for 30 days with no delivery fees to Uber Eats courtesy of Uber. Only applied to orders with a minimum purchase of $30 and with agreement that you will continue a 12 month subscription after your 30 days. You know, for your troubles.",
                "someone's grandma at FTC must have realized they paid for Uber One the last 5 years. I just don't see the current gov going after uber.",
                "I hope they get shafted hard.  Wolves in sheep's clothing.  ",
                "Musk must be mad at them.",
                "The real deception was getting the government to let them classify their employees as contractors.",
                "Looks like Uber forgot to pay their bribe to daddy Trump.",
                "Don’t forget Uber one cost more per ride than standard Uber, plenty of post and threads been tested"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 12171,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "This will not end well.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "We have reached the eugenics part of the plot.",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "I read the linked article, and it looks like the plan to find \"answers to autism\" is just to look at information from a bunch of US patient databases. The logic seems to be:\n\n* Amass database of patient info\n* ?????\n* Cause of autism\n\nNo analysis of this data will tell you what causes autism - even if you found differences in populations with and without autism, you would need follow up studies (you know, correlation != causation and all that). My guess is that one difference will be that patients with autism are more likely to be unvaccinated, due to misinformation.\n\nBad science aside, the most concerning issue mentioned in the article is that a \"new disease registry is being launched to track Americans with autism,\" which is highly alarming. What the hell is this for? The article doesn't say, of course, but there is no scientific rationale to \"register\" Americans with autism."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
            "external_url": "https://www.ctvnews.ca/world/article/person-found-on-elevated-surface-inside-trump-tower-in-new-york-is-arrested-police-say/",
            "upvotes": 2758,
            "date": "04/22/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2PADYAXEK5WCWYG67FNQU3FVSQ.jpg?smart=true&auth=28d8b408dc7fcee6c89b601bcc25a522afbde941aeb080eed5dff54b81d9e4f2&width=1200&height=630",
            "top_comments": [
                "What the fuck is an \"elevated surface\"?\n\nA platform? Stairs? Another Floor? High Heels?",
                "Aaaand that's it. The title says everything and the article contains no further details.",
                "What does this even mean? Elevated surface? Arrested for what? Seriously wtf does this mean?",
                "[removed]",
                "[removed]",
                "[removed]",
                "Don Jr coked out of his mind screaming from a balcony “I can fly!”",
                "He won’t be making it 4 years… he’s upsetting so much of his base lol.",
                "[removed]",
                "This is one of the absolute worst pieces of reporting I have ever seen. Just blue balls in reporting format"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 15216,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[ Removed by Reddit ]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "I'll bet he wants to bring back debtor's prison.",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "I thought the Education Department was abolished. What are they doing still working?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 47219,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.\n\nEDIT - Giuliani did pay up, but after some teeth pulling. But my point still stands. Winning a verdict is only the start of the battle.",
                "I scream this into the void whenever this topic comes up, and I will continue doing so:\n\nI was a flight instructor for nearly a decade. I taught hundreds of students from recreational private pilots, up through commercial pilots and flight instructors. I taught many women, people of color, and even one trans person (that I knew of). And of course, mostly white dudes. \n\nThere is *absolutely zero* correlation between a person's gender or race and their ability to fly an airplane, make critical decisions during a flight, or manage resources.\n\nActually, I take that back. Women were generally better at studying and were less likely to take risks. The worst students were usually rich old men. \n\nAirlines **do not** hire under-performing candidates to meet \"DEI quotas.\" Everyone has to perform to the same standard. Sure, there may be initiatives to help those who have been subjected to an industry with a deeply ingrained \"good ol' boy\" tradition, but not at the expense of safety, performance, and quality. You either meet the standards, or you don't.\n\nThese cowards hide behind DEI and say stuff like \"Ohh I just don't like these woke hiring practices that allow under-qualified people in, women can be perfectly fine pilots too!\" But that's *bullshit.* They are cowards who refuse to say it with their chest. They think women can't be pilots. They think black people can't be pilots. They think trans people can't be pilots. It's fucking horseshit and they are sad little pussies who are too afraid to be openly sexist and racist.\n\nTake it from me, an *actual professional* with years of experience in the industry. Not some dipshit podcaster or brainless news personality.",
                "Unfortunately, america no longer has a justice system.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Hope she wins and wins big"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 26731,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "I’m confused, is America great again yet or not?",
                "Long term gain, though, right?\n\n...you guys?",
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "Bond yields are spiking again, too.  \nFaith is being lost in not just the dollar and U.S. equities, but Treasuries, too.  \nYikes.",
                "Every time a Republican is in office my life gets harder.",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "I think a corky laugh and a stable 401k would’ve been better than this."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China retreats from US private equity investments, FT reports",
            "external_url": "https://www.reuters.com/world/china/china-retreats-us-private-equity-investments-ft-reports-2025-04-21/",
            "upvotes": 4040,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "God knows what kind of news we'll see in next month.",
                "Ooooh. That’s going to cause interesting problems.",
                "The flight from US Assets is worldwide, based on partially the “tariffs”, but mostly the unpredictable nature of the government ",
                "I'm really fascinated by how no one who stands to lose much as a result of this has thought to speak up yet. You know, the super but not quite mega rich. Heck, even the mega rich. Aren't they worried?",
                "China isn’t messing around while Trump sits by the phone waiting for a call that isn’t coming.",
                "yay ... president trump made private equity cheaper, just like with stocks.\n\nNext eggs. Then infrastructure week.",
                "Anyone have a non paywall link? Would like to learn something beyond the headlines.",
                "Best not to invest in Trump's mess?",
                "So how long before hyper-inflation and mass homelessness and starvation set in?",
                "Oh no, less money to buy profitable companies and rape them for every last penny before letting them go bankrupt"
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "04/22/2025 12:16:01 UTC"
}