{
    "posts": [
        {
            "category": "HOT",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 6986,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously a merit-based hire.",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "He sneaks the scotch around for big bro.",
                "Those are the eyes of someone who only gets off to USAID cuts. "
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 20749,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "\"In the wallet\" is his weak point.",
                "That turd needs to face all the people he’s screwing over.",
                "We need to start applying violent criminal punishments to 'white collar' crimes in this Country.  \nThis is ridiculous.",
                "Are laws still a thing in the US?",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 549,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "Too bad there's no one left at NASA to study it.",
                "With the US going to shit at least this some good news",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "Sounds like Mars needs some Freedom🦅"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 45502,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "I don't understand why we're \"suing\" people for committing felonies. What happened to arresting them?",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Billionaires are a global security issue.",
                "Dude, you're the attorney general. Just arrest the fucker.",
                "Why ask a court to block it preemptively? He’s just gonna say he was never going to do it, which is just admitting to fraud again but that forces you to file another separate lawsuit. \n\nShow up, watch him hand out the checks, then immediately arrest him for election fraud. It’s that fucking simple, and governments arrest people for election fraud all the time."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport",
            "external_url": "https://www.cnn.com/2025/03/28/us/delta-military-jet-close-call-dca/index.html",
            "upvotes": 5826,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what . . . I think I'm shifting to Dulles as my main DC airport from now on.",
                "so are they just not gonna do anything about the horrifically congested airspace in DC",
                "This happened near the spot of the fatal plane collision 2 months ago.",
                "Normal rules in the US limit aircraft that are flying below 10,000 ft to an airspeed of 250knots (roughly 304 MPH). The t-38 is a training jet (hence the T for training).\n\nWhy was the military trainer jet flying so fast in busy airspace? We have plenty of other military designated training ranges to learn to fly fast in.",
                "I'm sure Pete Hegseth will see to this very quick-- ah nevermind. Good fucking luck, America.",
                "They should introduce some kind of incentive to avoid these kinds of mishaps.",
                "'...a review of tracking data from FlightRadar24 shows an Air Force T-38 jet flying past the Delta plane and DCA airport going more than *350 miles per hour at 800 feet*. The military jet took off and landed at Langley Air Force Base, in Hampton, Virginia.'\n\n*(emphasis* mine)",
                "Why are they using commercial jets for training obstacles? Unconscionable. ",
                "Cool.  So my anxiety I had just this evening flying into DCA wasn’t totally unfounded.  I’m glad I didn’t read this before we left.",
                "Crazy to me that they allow for an airport right next to so many sensitive governmental sites.  Sure there's protected airspace however fighter jets would not be able to respond fast enough if a jet suddenly veered off as it was approaching."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 15859,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "I'm sure this will come as quite the surprise to all the union members who voted for him.  \n I mean who could expect a guy who attacked unions over and over again, including federal unions in his last term, and who praised Musk for firing people who attempted to unionize would possibly do this?!",
                "Since when did executive orders replace laws in this country? I’m pretty sure that’s not how it is supposed to work.",
                "Is anyone really surprised, this was explicitly called out in project 2025",
                "I suspect the administration will begin to treat attempts at unionizing to be domestic terrorism soon.",
                "How can these people that voted for him not have seen this?  You idiots who voted for him willingly invited this as everyone else screamed at you that you're being conned in the most graceless,  obvious manner.",
                "So the billionaire who is well known to hate unions and work against them has signed and order messing with unions? You don't say?",
                "And how many of those Maga employees voted for Trump. Poetic.",
                "Trumpers had a lot of time to read over P2025 and realize he'd screw them over.\n\n\nI feel no sympathy for them.",
                "Gotta think that’s not legal.\nSupreme Court better act quick "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Passenger flight and Air Force jet diverted from potential collision at DC airport",
            "external_url": "https://apnews.com/article/airplanes-diverted-washington-reagan-national-airport-888e2dd4e9c9d6506a37e9e6a24cfe17",
            "upvotes": 518,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like you should just avoid flying into or out of DC.",
                "Further proof that the only way to have safe skies is to allow SpaceX to have control of the Air Force /s",
                "Thats number 3 or 4 now and we are only like 3 months in",
                "For Christ’s sake, just keep military aircraft out of that area.",
                "These cuts to fed workers is going as expected.",
                "As long as we don’t have any woke air traffic controllers!!! Right?\nFucking idiots. ",
                "What’s wrong, didn’t they get Hegseth’s text?",
                "I cant wait for Trump to tell us how this is Osamas fault.",
                "That’s what happens when you put a DUI hire in charge of the military.",
                "How long before it’s blamed on DEI?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c62z2e5166eo",
            "upvotes": 5591,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b881/live/81c00fe0-0c20-11f0-ad28-1164c064d080.jpg",
            "top_comments": [
                "Me when the \"dating guru\" who claims to know everything about women is just a wife beater.",
                "It’s always the ones you ~~least suspect~~ ~~most suspect~~ already knew about.",
                "That this piece of garbage, Andrew Tate, isn't rotting in prison, is proof that justice isn't fair.",
                "Emory Andrew Tate III (born December 1, 1986), also known as Cobra Tate is an American-British kickboxer. When he's not beating men (or women, which he actually prefers now), he's a professional douche on social media.",
                "Someone should help Tate take a dirt nap",
                "Hope she wins the lawsuit",
                "Am I missing something?  The girlfriend sounds like a new one, not like a 2020 girlfriend right?\n\nLike a 2024 or 2025 girlfriend?",
                "It speaks very poorly of our society and culture that a scumbag like Tate has achieved fame and fortune.... purely on the basis of being such a scumbag. We are doomed.",
                "I hope he’s bottom bunk in prison. ",
                "Even if you didn't know who he is, what in the world would possess someone to look at THAT and want to smash?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "At least 3 people dead, hundreds rescued after severe storms flood streets in South Texas",
            "external_url": "https://www.pbs.org/newshour/nation/at-least-3-people-dead-hundreds-rescued-after-severe-storms-flood-streets-in-south-texas",
            "upvotes": 609,
            "date": "03/29/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/03/2025-03-28T053534Z_598142523_RC25MDAUBLMF_RTRMADP_3_USA-WEATHER-TEXAS-e1743199741940-1024x660.jpg",
            "top_comments": [
                "With NOAA effectively scrapped that was quite predictable.",
                "Good thing we have FEMA to help rebuild these communities.....oh wait",
                "Why would the republicans do this with the weather controlling machine that was surely handed over by the Biden administration?",
                "Is there talk of reducing the funding of FEMA or threatening agents?",
                "Where’s hot wheels at?",
                "Nearly 2 feet of rain in a week would have any part of Texas flooding. It’s about the same as their average yearly rainfall.\n\nMore rural counties like this probably still have lots of old low water crossings in and out of town. I’ve never been that far south, I don’t know the lay of the land like I do the areas north of I-10 and east of TX-87",
                "Trump will state that it’s a good deal, he’s not aware of the policy but it’s a good one and possibly the best one. He knows who made it. He’ll mention he won a gold tournament against a caddy today and it’s something we should celebrate. Maybe a holiday, he doesn’t know yet but he’s thinking about it.",
                "thoughts and something, something…",
                "Has Rafael Cruz committed to traveling to Cancun in response, yet?",
                "The people who are dying are most likely homeless people. This is probably considered a W to Republicans"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Red Cross gravely concerned for nine missing medics in Gaza",
            "external_url": "https://www.reuters.com/world/middle-east/red-cross-gravely-concerned-nine-missing-medics-gaza-2025-03-29/",
            "upvotes": 392,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "For people who are paywalled, mirror from [USNews](https://www.usnews.com/news/world/articles/2025-03-29/red-cross-gravely-concerned-for-nine-missing-medics-in-gaza).",
                "Israel breaks international law like Snoop Dogg smokes weed",
                "[removed]",
                "[deleted]",
                "Were these local hires?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Briton praised for tackling Amsterdam knife attack suspect",
            "external_url": "https://www.bbc.co.uk/news/articles/cz030jm2z5zo",
            "upvotes": 314,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b11c/live/fbc2fb70-0c72-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "A British man has been praised for tackling a suspected knifeman to the ground in central Amsterdam.\n\nThe tourist, who does not wish to be named, restrained the suspect after five people were stabbed near the Dutch capital’s Dam Square on Thursday.\n\nVideo of the incident shows the Briton, wearing jeans and a black hoodie, kneeling on his back and twisting his arm until police arrived.\n\nAmsterdam’s Mayor Femke Halsema said she was impressed by his decisive action, telling local broadcasters he showed “exceptional” instinct.",
                "Glad they recognized him. He did a great thing.",
                "A news on a British tourist that doesn't involve embarrassing behavior?\n\nThis is eerie. Something is up and we should get ready.",
                "That guys needs some real love. Hopefully he Atleast gets a gofundme. Considering how much money is spent on antiterrorism then give him a few million atleast. We really need to reward the right people.",
                "“I’m Millwall, mate”. Probably",
                "Good job River Cartwright.",
                "He should receive a medal. This kind of bravery should be rewarded",
                "What? No good guy with a gun was involved? How can this be possible?",
                "The bravery shown by the British tourist in Amsterdam is truly remarkable. In a tense and dangerous situation, he didn’t hesitate to act when a knife attack occurred in a busy public space. Tackling the suspect to the ground and restraining him until the police arrived was an incredibly courageous and quick-thinking move. It's easy to imagine how panic could set in during such an attack, but this individual’s instincts and actions helped prevent what could have been a much worse scenario.\n\nWhat stands out here is not only the tourist’s bravery but his humility in staying anonymous despite the praise he received. In a world where heroes often seek recognition, it's refreshing to see someone act purely out of selflessness and a desire to help. The acknowledgment from Amsterdam’s Mayor, calling his actions \"exceptional,\" speaks volumes about the positive impact one individual can have in an unpredictable and dangerous situation.",
                "I have read that knife crime is a problem in Europe, but that's the thing -- you can beat down someone with a knife. AR-15, not so easy, but that's the price we pay for freedom in the USA I guess. We just have to accept kids being shot from time to time"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 542,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "Too bad there's no one left at NASA to study it.",
                "With the US going to shit at least this some good news",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "Sounds like Mars needs some Freedom🦅"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Red Cross gravely concerned for nine missing medics in Gaza",
            "external_url": "https://www.reuters.com/world/middle-east/red-cross-gravely-concerned-nine-missing-medics-gaza-2025-03-29/",
            "upvotes": 393,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "For people who are paywalled, mirror from [USNews](https://www.usnews.com/news/world/articles/2025-03-29/red-cross-gravely-concerned-for-nine-missing-medics-in-gaza).",
                "Israel breaks international law like Snoop Dogg smokes weed",
                "[removed]",
                "[deleted]",
                "Were these local hires?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Airman who was shot down, imprisoned in Japan during World War II accounted for",
            "external_url": "https://www.cbsnews.com/news/world-war-ii-airman-tokyo-prison-fire-accounted-for/",
            "upvotes": 356,
            "date": "03/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/27/967af4aa-c473-4418-bd2c-425f83459f2c/thumbnail/1200x630g8/4a8e7242c096130e2350b6bc14d572d4/screenshot-2025-03-27-at-10-40-32-am.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Total accounting for every soldier, sailor, airman and Marine. Leave no man behind.",
                "I marvel at tenacity of organization geared to search and identify missing US military members lost in the fog of war.\n\nAnother missing is now identified and will return home.\n\nThank you very much for your service to US."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Passenger flight and Air Force jet diverted from potential collision at DC airport",
            "external_url": "https://apnews.com/article/airplanes-diverted-washington-reagan-national-airport-888e2dd4e9c9d6506a37e9e6a24cfe17",
            "upvotes": 517,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like you should just avoid flying into or out of DC.",
                "Further proof that the only way to have safe skies is to allow SpaceX to have control of the Air Force /s",
                "Thats number 3 or 4 now and we are only like 3 months in",
                "For Christ’s sake, just keep military aircraft out of that area.",
                "These cuts to fed workers is going as expected.",
                "As long as we don’t have any woke air traffic controllers!!! Right?\nFucking idiots. ",
                "What’s wrong, didn’t they get Hegseth’s text?",
                "I cant wait for Trump to tell us how this is Osamas fault.",
                "That’s what happens when you put a DUI hire in charge of the military.",
                "How long before it’s blamed on DEI?"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 6995,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously a merit-based hire.",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "He sneaks the scotch around for big bro.",
                "Those are the eyes of someone who only gets off to USAID cuts. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "At least 3 people dead, hundreds rescued after severe storms flood streets in South Texas",
            "external_url": "https://www.pbs.org/newshour/nation/at-least-3-people-dead-hundreds-rescued-after-severe-storms-flood-streets-in-south-texas",
            "upvotes": 609,
            "date": "03/29/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/03/2025-03-28T053534Z_598142523_RC25MDAUBLMF_RTRMADP_3_USA-WEATHER-TEXAS-e1743199741940-1024x660.jpg",
            "top_comments": [
                "With NOAA effectively scrapped that was quite predictable.",
                "Good thing we have FEMA to help rebuild these communities.....oh wait",
                "Why would the republicans do this with the weather controlling machine that was surely handed over by the Biden administration?",
                "Is there talk of reducing the funding of FEMA or threatening agents?",
                "Where’s hot wheels at?",
                "Nearly 2 feet of rain in a week would have any part of Texas flooding. It’s about the same as their average yearly rainfall.\n\nMore rural counties like this probably still have lots of old low water crossings in and out of town. I’ve never been that far south, I don’t know the lay of the land like I do the areas north of I-10 and east of TX-87",
                "Trump will state that it’s a good deal, he’s not aware of the policy but it’s a good one and possibly the best one. He knows who made it. He’ll mention he won a gold tournament against a caddy today and it’s something we should celebrate. Maybe a holiday, he doesn’t know yet but he’s thinking about it.",
                "thoughts and something, something…",
                "Has Rafael Cruz committed to traveling to Cancun in response, yet?",
                "The people who are dying are most likely homeless people. This is probably considered a W to Republicans"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Blackpool doctor not struck off by panel over 'one-off' rape",
            "external_url": "https://www.bbc.com/news/articles/ce989vygkz7o",
            "upvotes": 690,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/63a1/live/01bfa030-0be4-11f0-8ae9-2975efdc7f47.jpg",
            "top_comments": [
                "- Police investigated the incident but did not charge the doctor.\n- The doctor denies the allegations.\n- The incident had not taken place at his workplace.\n- The alleged victim was not a patient.\n- According to the tribunal, the doctor has not abused his position of trust as a doctor, and the incident did not involve patient safety concerns.\n\n\nDespite all of that the tribunal still suspended the doctor for 12 months, and he no longer works at the place he used to work.\n\n\nBoth the General Medical Council as well as the doctor have appealed the decision of the tribunal.",
                "BBC has now joined the click bait club",
                "Many in here are unaware that the General Medical Council (GMC), the UK's medical regulatory body, is very controversy within the profession. \n\nUnlike numerous medical councils worldwide, its leadership is composed of civilians rather than doctors.\n\nThe GMC has been described by a judge as racist and very much hated by doctors in the UK due to its questionable practices and ruling despite receiving tens of millions from us every year",
                "There are things you can do as a one-off mistake. Rape isn’t one of them",
                "wtf \n\n“You get one strike. Don’t do it again”. \n\nSick",
                "\"It's OK of you do it only once and have said you are sorry.\"   \nNoted.",
                "it's never \"one-off\". People who rape are serial rapists almost every single time.",
                "~~How is an event that destroys her life considered a 'one-off'? I can't get my head around that.~~\n\nI shoulda had more coffee before Redditing.",
                "Sounds like they should one of goto jail\nFor 20+ years. ",
                "I guess they’re waiting for him to commit a “two off.”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Top vaccine official forced out of FDA",
            "external_url": "https://www.cnn.com/2025/03/28/health/fda-vaccine-peter-marks-resigns/index.html",
            "upvotes": 3314,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1232822687.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These bozos are really trying to sabotage every aspect of living in post pandemic America.",
                "‘Restoring science’??? It won’t be long until the HHS starts promoting leeches, bloodletting and prayer as primary treatment.",
                "These decisions are going to kill thousands of people.",
                "The US is really speed-running its own version of the [Great Leap Forward](https://en.wikipedia.org/wiki/Great_Leap_Forward).",
                "It's sad that I have to say this, but the US Government cannot be relied on for medical information.  Use sources from the EU or organizations like WHO, the US Government is anti-science.",
                "Great. I can't wait to visit my local clinic for my annual four humors exam and bloodletting.",
                "Prepare for some serious epidemics (e.g., measles, MMR, influenza, COVID, etc.).",
                "Republicans literally go out of their way to complicate things, and create issues out of thin air. How and why they made vaccines an issue is beyond me. It is so odd me to that a bunch of people that surely received vaccines early in life, and are in probably very normal health, have become so fearful of vaccines. If they just took a moment to look around them, they would notice a lot of evidence that vaccinated people are just fine. \n\nI find it incredibly frustrating that these anti-science anti-medicine folks will one day end up in a hospital and rely on science and medicine to treat them. It is a huge slap in the face to healthcare professionals who have dedicated their lives to studying and treating illness and disease.",
                "politicizing vaccines is the dumbest thing ever.",
                "Well with the worms playing ratatouille with RFK, I'm surprised it took this long"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport",
            "external_url": "https://www.cnn.com/2025/03/28/us/delta-military-jet-close-call-dca/index.html",
            "upvotes": 5829,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what . . . I think I'm shifting to Dulles as my main DC airport from now on.",
                "so are they just not gonna do anything about the horrifically congested airspace in DC",
                "This happened near the spot of the fatal plane collision 2 months ago.",
                "Normal rules in the US limit aircraft that are flying below 10,000 ft to an airspeed of 250knots (roughly 304 MPH). The t-38 is a training jet (hence the T for training).\n\nWhy was the military trainer jet flying so fast in busy airspace? We have plenty of other military designated training ranges to learn to fly fast in.",
                "I'm sure Pete Hegseth will see to this very quick-- ah nevermind. Good fucking luck, America.",
                "They should introduce some kind of incentive to avoid these kinds of mishaps.",
                "'...a review of tracking data from FlightRadar24 shows an Air Force T-38 jet flying past the Delta plane and DCA airport going more than *350 miles per hour at 800 feet*. The military jet took off and landed at Langley Air Force Base, in Hampton, Virginia.'\n\n*(emphasis* mine)",
                "Why are they using commercial jets for training obstacles? Unconscionable. ",
                "Cool.  So my anxiety I had just this evening flying into DCA wasn’t totally unfounded.  I’m glad I didn’t read this before we left.",
                "Crazy to me that they allow for an airport right next to so many sensitive governmental sites.  Sure there's protected airspace however fighter jets would not be able to respond fast enough if a jet suddenly veered off as it was approaching."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Red Cross gravely concerned for nine missing medics in Gaza",
            "external_url": "https://www.reuters.com/world/middle-east/red-cross-gravely-concerned-nine-missing-medics-gaza-2025-03-29/",
            "upvotes": 396,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "For people who are paywalled, mirror from [USNews](https://www.usnews.com/news/world/articles/2025-03-29/red-cross-gravely-concerned-for-nine-missing-medics-in-gaza).",
                "Israel breaks international law like Snoop Dogg smokes weed",
                "[removed]",
                "[deleted]",
                "Were these local hires?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 6990,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously a merit-based hire.",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "He sneaks the scotch around for big bro.",
                "Those are the eyes of someone who only gets off to USAID cuts. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Airman who was shot down, imprisoned in Japan during World War II accounted for",
            "external_url": "https://www.cbsnews.com/news/world-war-ii-airman-tokyo-prison-fire-accounted-for/",
            "upvotes": 355,
            "date": "03/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/27/967af4aa-c473-4418-bd2c-425f83459f2c/thumbnail/1200x630g8/4a8e7242c096130e2350b6bc14d572d4/screenshot-2025-03-27-at-10-40-32-am.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Total accounting for every soldier, sailor, airman and Marine. Leave no man behind.",
                "I marvel at tenacity of organization geared to search and identify missing US military members lost in the fog of war.\n\nAnother missing is now identified and will return home.\n\nThank you very much for your service to US."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Briton praised for tackling Amsterdam knife attack suspect",
            "external_url": "https://www.bbc.co.uk/news/articles/cz030jm2z5zo",
            "upvotes": 316,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b11c/live/fbc2fb70-0c72-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "A British man has been praised for tackling a suspected knifeman to the ground in central Amsterdam.\n\nThe tourist, who does not wish to be named, restrained the suspect after five people were stabbed near the Dutch capital’s Dam Square on Thursday.\n\nVideo of the incident shows the Briton, wearing jeans and a black hoodie, kneeling on his back and twisting his arm until police arrived.\n\nAmsterdam’s Mayor Femke Halsema said she was impressed by his decisive action, telling local broadcasters he showed “exceptional” instinct.",
                "Glad they recognized him. He did a great thing.",
                "A news on a British tourist that doesn't involve embarrassing behavior?\n\nThis is eerie. Something is up and we should get ready.",
                "That guys needs some real love. Hopefully he Atleast gets a gofundme. Considering how much money is spent on antiterrorism then give him a few million atleast. We really need to reward the right people.",
                "“I’m Millwall, mate”. Probably",
                "Good job River Cartwright.",
                "He should receive a medal. This kind of bravery should be rewarded",
                "What? No good guy with a gun was involved? How can this be possible?",
                "The bravery shown by the British tourist in Amsterdam is truly remarkable. In a tense and dangerous situation, he didn’t hesitate to act when a knife attack occurred in a busy public space. Tackling the suspect to the ground and restraining him until the police arrived was an incredibly courageous and quick-thinking move. It's easy to imagine how panic could set in during such an attack, but this individual’s instincts and actions helped prevent what could have been a much worse scenario.\n\nWhat stands out here is not only the tourist’s bravery but his humility in staying anonymous despite the praise he received. In a world where heroes often seek recognition, it's refreshing to see someone act purely out of selflessness and a desire to help. The acknowledgment from Amsterdam’s Mayor, calling his actions \"exceptional,\" speaks volumes about the positive impact one individual can have in an unpredictable and dangerous situation.",
                "I have read that knife crime is a problem in Europe, but that's the thing -- you can beat down someone with a knife. AR-15, not so easy, but that's the price we pay for freedom in the USA I guess. We just have to accept kids being shot from time to time"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Passenger flight and Air Force jet diverted from potential collision at DC airport",
            "external_url": "https://apnews.com/article/airplanes-diverted-washington-reagan-national-airport-888e2dd4e9c9d6506a37e9e6a24cfe17",
            "upvotes": 523,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like you should just avoid flying into or out of DC.",
                "Further proof that the only way to have safe skies is to allow SpaceX to have control of the Air Force /s",
                "Thats number 3 or 4 now and we are only like 3 months in",
                "For Christ’s sake, just keep military aircraft out of that area.",
                "These cuts to fed workers is going as expected.",
                "As long as we don’t have any woke air traffic controllers!!! Right?\nFucking idiots. ",
                "What’s wrong, didn’t they get Hegseth’s text?",
                "I cant wait for Trump to tell us how this is Osamas fault.",
                "That’s what happens when you put a DUI hire in charge of the military.",
                "How long before it’s blamed on DEI?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 546,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "Too bad there's no one left at NASA to study it.",
                "With the US going to shit at least this some good news",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "Sounds like Mars needs some Freedom🦅"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "At least 3 people dead, hundreds rescued after severe storms flood streets in South Texas",
            "external_url": "https://www.pbs.org/newshour/nation/at-least-3-people-dead-hundreds-rescued-after-severe-storms-flood-streets-in-south-texas",
            "upvotes": 608,
            "date": "03/29/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/03/2025-03-28T053534Z_598142523_RC25MDAUBLMF_RTRMADP_3_USA-WEATHER-TEXAS-e1743199741940-1024x660.jpg",
            "top_comments": [
                "With NOAA effectively scrapped that was quite predictable.",
                "Good thing we have FEMA to help rebuild these communities.....oh wait",
                "Why would the republicans do this with the weather controlling machine that was surely handed over by the Biden administration?",
                "Is there talk of reducing the funding of FEMA or threatening agents?",
                "Where’s hot wheels at?",
                "Nearly 2 feet of rain in a week would have any part of Texas flooding. It’s about the same as their average yearly rainfall.\n\nMore rural counties like this probably still have lots of old low water crossings in and out of town. I’ve never been that far south, I don’t know the lay of the land like I do the areas north of I-10 and east of TX-87",
                "Trump will state that it’s a good deal, he’s not aware of the policy but it’s a good one and possibly the best one. He knows who made it. He’ll mention he won a gold tournament against a caddy today and it’s something we should celebrate. Maybe a holiday, he doesn’t know yet but he’s thinking about it.",
                "thoughts and something, something…",
                "Has Rafael Cruz committed to traveling to Cancun in response, yet?",
                "The people who are dying are most likely homeless people. This is probably considered a W to Republicans"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Blackpool doctor not struck off by panel over 'one-off' rape",
            "external_url": "https://www.bbc.com/news/articles/ce989vygkz7o",
            "upvotes": 686,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/63a1/live/01bfa030-0be4-11f0-8ae9-2975efdc7f47.jpg",
            "top_comments": [
                "- Police investigated the incident but did not charge the doctor.\n- The doctor denies the allegations.\n- The incident had not taken place at his workplace.\n- The alleged victim was not a patient.\n- According to the tribunal, the doctor has not abused his position of trust as a doctor, and the incident did not involve patient safety concerns.\n\n\nDespite all of that the tribunal still suspended the doctor for 12 months, and he no longer works at the place he used to work.\n\n\nBoth the General Medical Council as well as the doctor have appealed the decision of the tribunal.",
                "BBC has now joined the click bait club",
                "Many in here are unaware that the General Medical Council (GMC), the UK's medical regulatory body, is very controversy within the profession. \n\nUnlike numerous medical councils worldwide, its leadership is composed of civilians rather than doctors.\n\nThe GMC has been described by a judge as racist and very much hated by doctors in the UK due to its questionable practices and ruling despite receiving tens of millions from us every year",
                "There are things you can do as a one-off mistake. Rape isn’t one of them",
                "wtf \n\n“You get one strike. Don’t do it again”. \n\nSick",
                "\"It's OK of you do it only once and have said you are sorry.\"   \nNoted.",
                "it's never \"one-off\". People who rape are serial rapists almost every single time.",
                "~~How is an event that destroys her life considered a 'one-off'? I can't get my head around that.~~\n\nI shoulda had more coffee before Redditing.",
                "Sounds like they should one of goto jail\nFor 20+ years. ",
                "I guess they’re waiting for him to commit a “two off.”"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 20753,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "\"In the wallet\" is his weak point.",
                "That turd needs to face all the people he’s screwing over.",
                "We need to start applying violent criminal punishments to 'white collar' crimes in this Country.  \nThis is ridiculous.",
                "Are laws still a thing in the US?",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 45508,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "I don't understand why we're \"suing\" people for committing felonies. What happened to arresting them?",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Billionaires are a global security issue.",
                "Dude, you're the attorney general. Just arrest the fucker.",
                "Why ask a court to block it preemptively? He’s just gonna say he was never going to do it, which is just admitting to fraud again but that forces you to file another separate lawsuit. \n\nShow up, watch him hand out the checks, then immediately arrest him for election fraud. It’s that fucking simple, and governments arrest people for election fraud all the time."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/29/2025 20:08:06 UTC"
}