{
    "posts": [
        {
            "category": "HOT",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 5156,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "Okay, but what about her emails?",
                "Safe for thee, but not for me! Some of you may die, but that is a sacrifice I am willing to make.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???",
                "Messing with airports is a popular way for autocrats to consolidate control because it allows them to lead with fear.",
                "Same people that said the COVID vaccine wasn't safe, while vaccinating themselves and their family."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 1192,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Thank God, we're getting something to replace Fluoride.",
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "Delicious forever chemicals just what I needed.",
                "I just read an announcement from the EPAs leader that they were going to be studying and enforcing limits in the coming years. How can both be true?",
                "Out with the Flouride, In with the Flourine!",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?",
                "Best news of the day!!! I’m glad we got brain worms and president statin in charge of our health. Fucking idiots. ",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Environmental Pollution Agency"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Uruguay's José Mujica, world's 'poorest president', dies",
            "external_url": "https://www.bbc.com/news/articles/c0j71402z58o",
            "upvotes": 1164,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c871/live/51e9ec90-302a-11f0-9c4d-7b4728612d5d.jpg",
            "top_comments": [
                "Truly an inspiring person.",
                "Probably world's most honest and genuinely loved president as well. ",
                "You can judge a man's character when he has power. And this gentleman is a classy person who wants to serve\n\nRIP and hopefully more leaders will learn humility from this man",
                "The president should not be a billionaire",
                "Truly, he is one person who probably deserved to live forever.",
                "Such a mensch. His memory for a blessing.",
                "RIP. We lost a good one.",
                "Truly a leader from the people",
                "Such an amazing story!",
                "His life story is amazing. “The fight to make today better must become your central task.” RIP to a real one."
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "HOT",
            "title": "FBI ordered to prioritize immigration, as DOJ scales back white collar cases",
            "external_url": "https://www.reuters.com/world/us/fbi-ordered-prioritize-immigration-cases-over-white-collar-crime-people-familiar-2025-05-12/",
            "upvotes": 13102,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Government full of white collar criminals scales back investigation of white collar criminals.",
                "Sounds like a lot of fraud will be happening unchecked",
                "The massive tranfer of wealth during covid wasn't enough. They will not stop until we are all slaves.",
                "Sure… why not…. Let the mortgage fraudsters steal my home and life savings.….. just as long as I can rest comfortably knowing the cucumbers in my salad weren’t sullied by the hands of an undocumented farm worker getting paid 1/2 minimum wage to do back breaking labor in the hot sun.",
                "*But as....Trump has stepped up an immigration crackdown, thousands of federal law enforcement officials from multiple agencies* [*have been*](https://www.reuters.com/world/us/thousands-agents-diverted-trump-immigration-crackdown-2025-03-22/) *enlisted to take on new work as immigration enforcers, pulling crime-fighting resources away from other areas.*\n\nSo the DOJ cuts back efforts to prosecute white-collar offenses, as in \"public [corruption](https://www.reuters.com/world/us/trumps-justice-department-hits-brakes-anti-corruption-enforcement-2025-02-12/), foreign bribery, kleptocracy and foreign influence.\"   (so racist, and so self-serving)",
                "Let’s not investigate where all the hundreds million $’s of Trump’s inauguration fund went to.  Or who were the early buyers of Trump coin",
                "It's corruption all the way down.",
                "Cripple the IRS so they can't go after tax-dodging billionaires...\n\nDistract the FBI so they can't go after white collar crime...\n\nBeguile your base with a blitzkrieg of harm directed towards immigrants...\n\nPreoccupy the media with a deluge of vulgarities and other bullshit so they are too enthralled to report the rampant fraud and dismantling of American institutions...\n\nThen sit back & laugh while your uber-wealthy sycophants & sinister foreign backers gorge like vultures on the nation's dying corpse.\n\nNevermind \"draining the swamp\" we're now all up to our chins in a fucking sewage plant",
                "So Republicans are seriously dismantling the rule of law in broad daylight, openly and proverbial crickets?!?!? ",
                "Just want to point out solving and therefore preventing white collar crime actually generates money and lost tax revenue."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
            "external_url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
            "upvotes": 1454,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We are deporting students and importing cartels.",
                "Why is this not the top story on every news site?",
                "They must have bought one of Trump's immigration golden tickets.",
                "Ok lemme get this straight. Kids with cancer, Americans, veterans and immigrant with green cards are being deported to a country they’ve never been to BUT Mexican cartel members are being literally invited in? America is beyond fucked.",
                "Another day, another absolute “fuck you” to the American public…",
                "So letting actual violent foreigners in and deporting grad students and working parents",
                "Trump selling citizenships to cartel families and South African racists.",
                "$5 million dollars folks. And you get one of those fancy trump visas.",
                "TRUMP selling America to anybody that will pay him.",
                "Trump probably made money off of this. Plain and simple.  It's all transactional for him."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Robert F. Kennedy Jr. submerges in creek with high bacteria levels, including E. coli",
            "external_url": "https://abcnews.go.com/Politics/robert-kennedy-jr-swimming-park-water-high-bacteria/story?id=121734979",
            "upvotes": 740,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/abf2ddd9-061c-4cef-a5ef-bb4850246c54/robert-kennedy-1-gty-gmh-250512_1747058965848_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Brain worm’s got some competition now",
                "Swimming in literal shit. And this is the guy controlling the health decisions for the country. I hope he (also literally) shits his brains out.",
                "I love this manly traditional nature loving persona he tries to have, but can't even go further from the city to swim in non polluted water.\n\nSo fluoride in city water = bad\n\nThe city's sewage in swimming water = fine",
                ">\"Mother's Day hike in Dumbarton Oaks Park with Amaryllis, Bobby, Kick, and Jackson, and a swim with my grandchildren, Bobcat and Cassius in Rock Creek,\"\n\nthese names...",
                "Swimming in the swamp is very on brand for this administration.",
                "What amazes me is that he was doing this with his grandchildren. His own daughter described the situation where he cut the head off of a dead whale and tied it to the roof of the car. She was splashed with disgusting fluids from it as they were driving home. The parents of those grandchildren know what he is like and yet allowed them to be in his care",
                "This dude worships Nurgle.",
                "I just hope this speeds up the inevitable, the faster the better.",
                "My wife got E Coli just after we started dating.\nFit, 25 year old personal trainer, they almost died. \n\nFingers crossed.",
                "He should invite the whole administration."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "HOT",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 24708,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question.",
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Yeah, the 51st state comments are idiotic but the positive stuff about forced starvation - holy fuck, what the fuck is wrong with this man?",
                "What a fucking asshole",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "damn I actually want the Leafs to advance, now",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "It must be so hard for people to just shut the fuck up. I don't get it"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Grand jury indicts Milwaukee County judge after prosecutors allege she helped a man evade ICE",
            "external_url": "https://www.wpr.org/news/grand-jury-indicts-milwaukee-county-judge-allege-helped-man-evade-ice",
            "upvotes": 4771,
            "date": "05/13/2025",
            "thumbnail": "https://www.wpr.org/wp-content/uploads/2025/05/dugan1.jpg",
            "top_comments": [
                "In summary, an administrative warrant is issued by a government agency for regulatory or administrative purposes, while a judicial warrant is issued by a court for criminal or civil law enforcement.",
                "As the old saying goes, a grand jury would indict a ham sandwich if that’s what the prosecutor wanted.\n\nGrand jury indictments are just a rubber stamp.",
                "I’ve served on a grand jury and can clearly explain what happens there. Grand juries do not need proof beyond a reasonable doubt, they just need to be presented with enough evidence to lead a reasonable person to believe there’s enough evidence to charge somebody with a crime. The bar is much lower to indict somebody.",
                "All governmental officials should be held to account. Let's start with, idk, maybe the fucking President?",
                "> Prosecutors allege she broke federal law by helping a man evade immigration enforcement last month.\n\nLegal Eagle did a great breakdown on this whole case. The funniest part is that the door she let the man “escape” through led…right back to the main hallway where officers were waiting lol\n\nSo basically they’re going to argue either she didn’t know how her own courthouse hallways work, or somehow she did know and it still counts as helping him “escape” by leading him straight back to them!\n\nEDIT: For people wanting to dispute what I say above, please watch [the Legal Eagle video](https://m.youtube.com/watch?v=TPQeZalnArY&pp=0gcJCYsJAYcqIYzv) before doing so.",
                "This is crazy. She let him out through a different exit that lead to the SAME public hallway as where the ICE agents were waiting. The agents even rode down the elevator with the guy and his lawyer before they arrested him outside.",
                "Hope democrats remember this next time they debate 3 years whether to charge Trump or any republican for any of the crimes they commit.",
                "Sounds like someone is getting due process.",
                "how did this go to trial and get an indictment already?? TF. How long did it take for Trump to go to trial and get indicted?\n\nOh wait...",
                "[removed]"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 11412,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don't understand. There are fluoride-free mouthwashes and toothpastes already on the market. Some of us want fluoride toothpaste/mouth washes.",
                "I work in peds dentistry and trust me, parents are already saying no to fluoride and no to radiographs...and often they are spending thousands in treatments for composites, pulpotomies, etc. that could have been prevented. Dental health is overlooked so often in favor of extracirriculars. \"Sorry, Timmy has baseball practice so we need to reschedule/cancel.\" Ok, so Timmy is 7 years old, is a high caries risk, and hasn't seen us in 2 years. I think he can miss one fucking practice. People's priorities are alllll outta whack.\n\nWe get a lot of \"they won't let me brush their teeth!\" too. I'm sorry, who is the parent here? They're a small child, they need your guidance. I am empathetic to a point but you have to do it. If they didn't want to shit in the toilet, would you let them do it outside too? \n\nI fear we are going to get a lot busier. 🥺\n\nEDIT:\n\nWow ok, did not expect my comment to blow up. I just want to let yall know that I feel you on multiple fronts. I have a background in dental assisting, veterinary dentistry,  medical and dental research but now I work in the admin side of dentistry (not a dentist), so the financial issues and insurance issues I deal with on a daily basis are frustrating and heart breaking. It was the same when I worked in veterinary. As much as I wish we could do this fully subsidized, the USA hates universal health care and we have to make money to feed our staff. A lot of dentists, including my own, are eschewing being in network with a lot of insurances because they pay literal pennies for procedures. I'm talking about 15-20 bucks for full surgical procedures, which with how much dental school costs...it's not economical. I highly suggest to find a dentist that has a membership plan, it is often more cost effective than dental premiums!\n\nAs for health, if you truly don't want to give your kid flouride, there are alternatives that are NOT charcoal (seriously, don't! especially if theyre on meds!). Boka has nano hydroxyapatite toothpaste that has been clinically studied and is a great alternative. But I must insist you get radiographs, as the tooth is like an iceburg. A lot goes on underneath the surface. \n\nDentistry shouldn't be a luxury. I myself have talked to my local representatives about health care and dental care being my top concern and how we are doing nothing about it. My state, CA, can do better and I want it to be better. I wish I had all the solutions, I wish everyone here can get care. But please, do not yell at the staff if insurance isn't covering procedures. We literally can't control it. 😭 And I work with a dentist who would rather never see a cavity again. It is devastating to tell a parent their kid needs several crowns, pulpotomies, composites under anesthesia.",
                "> Instead, the FDA will ask manufacturers to voluntarily pull their products, according to an administration official.\n\nIf I was a manufacturer, my reply to that ask would be \"fuck you.\"\n\n> FDA Commissioner Marty Makary said the products pose a risk when swallowed because they may interfere with healthy gut bacteria that are critical to digestion, immunity and other key bodily functions. \n\nMeanwhile, Brainworm is out there getting MAHA parents to [pump their kids full of vitamin A to toxic levels](https://www.washingtonpost.com/wellness/2025/04/07/vitamin-a-poisoning-measles-rfk-jr/).\n\nGovernment falling from the stupid tree and hitting every branch on the way down.",
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "The idiot shouldn’t be in charge of our country’s health",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "What happened to all those anti-vaxxers yelling “my body, my choice” now that the government is dictating what they can and cannot have?",
                "[deleted]"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
            "external_url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
            "upvotes": 181,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "great news.  And we need more good news these days",
                "Surely this is something that health groups trying to limit drug access and stop overdoses can take credit for and not just one person who wasn’t even in office last year, right?",
                "Going to go up now that MAGA took away Narcan funding",
                "Trump will say it’s his border control while MAGA fucks simultaneously reduce access to life saving medical equipment and procedures.",
                "Trump to claim credit in 3...2...",
                "Good news and should be celebrated. And the Administration celebrated by cutting the Narcan funding that likely played a massive role in this.",
                "This certainly underscores the need for all of these illegal emergency power grabs by the Trump administration, doesn't it?\n\n\n>Increased availability of the overdose-reversing drug naloxone.\n\n\n>Expanded addiction treatment.\n\n\n>The growing impact of billions of dollars in opioid lawsuit settlement money.\n\n\nAnd it's a good thing the Trump administration is going to continue supporting these initiatives that have helped with the decline.",
                "I don’t trust any numbers anymore. They have proven it is too easy simply not to count properly.",
                "Yes so let's have these idiots get rid of the narcan program. Can't have less poor people dying can we?",
                "This isn't nationwide tho. Some western states like Alaska had an increase for some reason. Seems like eastern decreases are sweeping westward"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
            "external_url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
            "upvotes": 180,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "great news.  And we need more good news these days",
                "Surely this is something that health groups trying to limit drug access and stop overdoses can take credit for and not just one person who wasn’t even in office last year, right?",
                "Going to go up now that MAGA took away Narcan funding",
                "Trump will say it’s his border control while MAGA fucks simultaneously reduce access to life saving medical equipment and procedures.",
                "Trump to claim credit in 3...2...",
                "Good news and should be celebrated. And the Administration celebrated by cutting the Narcan funding that likely played a massive role in this.",
                "This certainly underscores the need for all of these illegal emergency power grabs by the Trump administration, doesn't it?\n\n\n>Increased availability of the overdose-reversing drug naloxone.\n\n\n>Expanded addiction treatment.\n\n\n>The growing impact of billions of dollars in opioid lawsuit settlement money.\n\n\nAnd it's a good thing the Trump administration is going to continue supporting these initiatives that have helped with the decline.",
                "I don’t trust any numbers anymore. They have proven it is too easy simply not to count properly.",
                "Yes so let's have these idiots get rid of the narcan program. Can't have less poor people dying can we?",
                "This isn't nationwide tho. Some western states like Alaska had an increase for some reason. Seems like eastern decreases are sweeping westward"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Menendez brothers resentenced, the pair now eligible for parole",
            "external_url": "https://globalnews.ca/news/11179233/menendez-brothers-resentenced-the-pair-now-eligible-for-parole/",
            "upvotes": 20,
            "date": "05/14/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-2081044358.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Maybe I am not understanding the judicial system but how does 50 to life make them eligible for parole now after only 30 years? Aren't the eligible only after 50 years at this point?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "They want to climb Everest in a week using an anesthetic gas. Critics warn it’s dangerous | CNN",
            "external_url": "https://www.cnn.com/2025/05/13/travel/climb-everest-one-week-xenon-intl",
            "upvotes": 61,
            "date": "05/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1148628379.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Eventually, we’ll be able to make a staircase out of the bodies.",
                "They’re xenon-doping to trick the body into thinking it’s in a low-oxygen environment and get a huge head start on the acclimation process.\n\nIt’s mostly untested. The anesthetic portion doesn’t seem to matter that much since those effects would likely be gone by the time they actually started climbing. The real issue seems to be whether they will have built up enough real acclimation by the time they start climbing.",
                "This reeks of the OceanGate disaster.",
                "Why don't they just take EPO to boost their red blood cells?",
                "https://archive.ph/9BQGn",
                "It feels like there's a statistically significant correlation between wanting to do this and wanting to own a cybertruck.",
                "People said they were crazy...and they were right.",
                "So they want to use the gas to aid in acclimating **before** climbing.  \nThe headline gave me a vision of long haired, freaky people dancing up the slope with tanks of nitrous.",
                "“There’s no shortcuts in this space, we spent easy, over 500 hours sleeping in a hypoxic tent, (and there’s) a lot of exercise involved to make sure you’re ready and fit and capable,” Carns added.\n\nlol I wondered if he said “There’s no shortcuts” if he was able to say it with a straight face.",
                "I don't think there's a way to climb Everest that *isn't* dangerous. \n\nCall me a critic if you want, but if you ask me about climbing Everest, I'm probably going to warn that it's dangerous."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 5183,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "Okay, but what about her emails?",
                "Safe for thee, but not for me! Some of you may die, but that is a sacrifice I am willing to make.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???",
                "Messing with airports is a popular way for autocrats to consolidate control because it allows them to lead with fear.",
                "Same people that said the COVID vaccine wasn't safe, while vaccinating themselves and their family."
            ],
            "aggregate_sentiment": 11.0
        },
        {
            "category": "NEW",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 1196,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Thank God, we're getting something to replace Fluoride.",
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "Delicious forever chemicals just what I needed.",
                "I just read an announcement from the EPAs leader that they were going to be studying and enforcing limits in the coming years. How can both be true?",
                "Out with the Flouride, In with the Flourine!",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?",
                "Best news of the day!!! I’m glad we got brain worms and president statin in charge of our health. Fucking idiots. ",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Environmental Pollution Agency"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Uruguay's José Mujica, world's 'poorest president', dies",
            "external_url": "https://www.bbc.com/news/articles/c0j71402z58o",
            "upvotes": 1169,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c871/live/51e9ec90-302a-11f0-9c4d-7b4728612d5d.jpg",
            "top_comments": [
                "Truly an inspiring person.",
                "Probably world's most honest and genuinely loved president as well. ",
                "You can judge a man's character when he has power. And this gentleman is a classy person who wants to serve\n\nRIP and hopefully more leaders will learn humility from this man",
                "The president should not be a billionaire",
                "Truly, he is one person who probably deserved to live forever.",
                "Such a mensch. His memory for a blessing.",
                "RIP. We lost a good one.",
                "Truly a leader from the people",
                "Such an amazing story!",
                "His life story is amazing. “The fight to make today better must become your central task.” RIP to a real one."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Tiny Company With China Ties Announces Big Purchase of Trump Cryptocurrency",
            "external_url": "https://www.nytimes.com/2025/05/13/us/politics/trump-crypto-purchase.html?unlocked_article_code=1.HE8.XNA8.MuUPO9DUVEva",
            "upvotes": 88,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well you know what they say: if it looks like a money laundering scheme and it sounds like a money laundering scheme, it’s probably a duck.",
                "Nothing suspicious here at all….. imagine if a Democrat had such an easy and public way to bribe them, right wing media would be all over it till the end of time",
                "im sure no russian bought trump",
                "AAAAA there it is. I mentioned this elsewhere, but I was wondering how much of a bribe took to pause the tariffs was.",
                "Not exactly hard to tie any company to the 2nd biggest economy in the world lol. Tying a company to China because the company uses TikTok is an insane leap."
            ],
            "aggregate_sentiment": 34.0
        },
        {
            "category": "NEW",
            "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
            "external_url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
            "upvotes": 1451,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We are deporting students and importing cartels.",
                "Why is this not the top story on every news site?",
                "They must have bought one of Trump's immigration golden tickets.",
                "Ok lemme get this straight. Kids with cancer, Americans, veterans and immigrant with green cards are being deported to a country they’ve never been to BUT Mexican cartel members are being literally invited in? America is beyond fucked.",
                "Another day, another absolute “fuck you” to the American public…",
                "So letting actual violent foreigners in and deporting grad students and working parents",
                "Trump selling citizenships to cartel families and South African racists.",
                "$5 million dollars folks. And you get one of those fancy trump visas.",
                "TRUMP selling America to anybody that will pay him.",
                "Trump probably made money off of this. Plain and simple.  It's all transactional for him."
            ],
            "aggregate_sentiment": 11.0
        },
        {
            "category": "NEW",
            "title": "Robert F. Kennedy Jr. submerges in creek with high bacteria levels, including E. coli",
            "external_url": "https://abcnews.go.com/Politics/robert-kennedy-jr-swimming-park-water-high-bacteria/story?id=121734979",
            "upvotes": 737,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/abf2ddd9-061c-4cef-a5ef-bb4850246c54/robert-kennedy-1-gty-gmh-250512_1747058965848_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Brain worm’s got some competition now",
                "Swimming in literal shit. And this is the guy controlling the health decisions for the country. I hope he (also literally) shits his brains out.",
                "I love this manly traditional nature loving persona he tries to have, but can't even go further from the city to swim in non polluted water.\n\nSo fluoride in city water = bad\n\nThe city's sewage in swimming water = fine",
                ">\"Mother's Day hike in Dumbarton Oaks Park with Amaryllis, Bobby, Kick, and Jackson, and a swim with my grandchildren, Bobcat and Cassius in Rock Creek,\"\n\nthese names...",
                "Swimming in the swamp is very on brand for this administration.",
                "What amazes me is that he was doing this with his grandchildren. His own daughter described the situation where he cut the head off of a dead whale and tied it to the roof of the car. She was splashed with disgusting fluids from it as they were driving home. The parents of those grandchildren know what he is like and yet allowed them to be in his care",
                "This dude worships Nurgle.",
                "I just hope this speeds up the inevitable, the faster the better.",
                "My wife got E Coli just after we started dating.\nFit, 25 year old personal trainer, they almost died. \n\nFingers crossed.",
                "He should invite the whole administration."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Drug dealer who killed boy, 7, in explosion jailed",
            "external_url": "https://www.bbc.co.uk/news/articles/c8e6wggw233o",
            "upvotes": 248,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d44c/live/740aa1b0-30d0-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "Drug dealer who killed boy jailed in explosion",
                "Wow, a 7 year old drug dealer who killed a boy in an explosive prison.",
                "There are so many random words and phrases in quotes that don’t need them. Even the word “tragedy” at one point, which made it sound like they were mocking the victim. Is this an AI thing or something else? Or do I just not use quotation marks properly?",
                "The headline, wording suits BBC journalistic, level.",
                "That AI written title makes no sense.",
                "Was the phrase \"7 year old boy\" too many words?  It's not like they're paying per fucking pixel to print this shit.",
                "Is that mugshot an AI photo wtf? ",
                "So according to the title, the drug dealer is, 7 years old, in a jailed explosion…?",
                "Huh? You , who the what exploded the who?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 5164,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "Okay, but what about her emails?",
                "Safe for thee, but not for me! Some of you may die, but that is a sacrifice I am willing to make.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???",
                "Messing with airports is a popular way for autocrats to consolidate control because it allows them to lead with fear.",
                "Same people that said the COVID vaccine wasn't safe, while vaccinating themselves and their family."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "Uruguay's José Mujica, world's 'poorest president', dies",
            "external_url": "https://www.bbc.com/news/articles/c0j71402z58o",
            "upvotes": 1172,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c871/live/51e9ec90-302a-11f0-9c4d-7b4728612d5d.jpg",
            "top_comments": [
                "Truly an inspiring person.",
                "Probably world's most honest and genuinely loved president as well. ",
                "You can judge a man's character when he has power. And this gentleman is a classy person who wants to serve\n\nRIP and hopefully more leaders will learn humility from this man",
                "The president should not be a billionaire",
                "Truly, he is one person who probably deserved to live forever.",
                "Such a mensch. His memory for a blessing.",
                "RIP. We lost a good one.",
                "Truly a leader from the people",
                "Such an amazing story!",
                "His life story is amazing. “The fight to make today better must become your central task.” RIP to a real one."
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "RISING",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 1200,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Thank God, we're getting something to replace Fluoride.",
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "Delicious forever chemicals just what I needed.",
                "I just read an announcement from the EPAs leader that they were going to be studying and enforcing limits in the coming years. How can both be true?",
                "Out with the Flouride, In with the Flourine!",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?",
                "Best news of the day!!! I’m glad we got brain worms and president statin in charge of our health. Fucking idiots. ",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Environmental Pollution Agency"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
            "external_url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
            "upvotes": 1461,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We are deporting students and importing cartels.",
                "Why is this not the top story on every news site?",
                "They must have bought one of Trump's immigration golden tickets.",
                "Ok lemme get this straight. Kids with cancer, Americans, veterans and immigrant with green cards are being deported to a country they’ve never been to BUT Mexican cartel members are being literally invited in? America is beyond fucked.",
                "Another day, another absolute “fuck you” to the American public…",
                "So letting actual violent foreigners in and deporting grad students and working parents",
                "Trump selling citizenships to cartel families and South African racists.",
                "$5 million dollars folks. And you get one of those fancy trump visas.",
                "TRUMP selling America to anybody that will pay him.",
                "Trump probably made money off of this. Plain and simple.  It's all transactional for him."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Robert F. Kennedy Jr. submerges in creek with high bacteria levels, including E. coli",
            "external_url": "https://abcnews.go.com/Politics/robert-kennedy-jr-swimming-park-water-high-bacteria/story?id=121734979",
            "upvotes": 741,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/abf2ddd9-061c-4cef-a5ef-bb4850246c54/robert-kennedy-1-gty-gmh-250512_1747058965848_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Brain worm’s got some competition now",
                "Swimming in literal shit. And this is the guy controlling the health decisions for the country. I hope he (also literally) shits his brains out.",
                "I love this manly traditional nature loving persona he tries to have, but can't even go further from the city to swim in non polluted water.\n\nSo fluoride in city water = bad\n\nThe city's sewage in swimming water = fine",
                ">\"Mother's Day hike in Dumbarton Oaks Park with Amaryllis, Bobby, Kick, and Jackson, and a swim with my grandchildren, Bobcat and Cassius in Rock Creek,\"\n\nthese names...",
                "Swimming in the swamp is very on brand for this administration.",
                "What amazes me is that he was doing this with his grandchildren. His own daughter described the situation where he cut the head off of a dead whale and tied it to the roof of the car. She was splashed with disgusting fluids from it as they were driving home. The parents of those grandchildren know what he is like and yet allowed them to be in his care",
                "This dude worships Nurgle.",
                "I just hope this speeds up the inevitable, the faster the better.",
                "My wife got E Coli just after we started dating.\nFit, 25 year old personal trainer, they almost died. \n\nFingers crossed.",
                "He should invite the whole administration."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Drug dealer who killed boy, 7, in explosion jailed",
            "external_url": "https://www.bbc.co.uk/news/articles/c8e6wggw233o",
            "upvotes": 252,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d44c/live/740aa1b0-30d0-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "Drug dealer who killed boy jailed in explosion",
                "Wow, a 7 year old drug dealer who killed a boy in an explosive prison.",
                "There are so many random words and phrases in quotes that don’t need them. Even the word “tragedy” at one point, which made it sound like they were mocking the victim. Is this an AI thing or something else? Or do I just not use quotation marks properly?",
                "The headline, wording suits BBC journalistic, level.",
                "That AI written title makes no sense.",
                "Was the phrase \"7 year old boy\" too many words?  It's not like they're paying per fucking pixel to print this shit.",
                "Is that mugshot an AI photo wtf? ",
                "So according to the title, the drug dealer is, 7 years old, in a jailed explosion…?",
                "Huh? You , who the what exploded the who?"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "12-and-13-year-old arrested for capital murder in connection to deadly Del Valle shooting",
            "external_url": "https://www.fox7austin.com/news/12-and-13-year-old-arrested-capital-murder-connection-deadly-del-valle-shooting",
            "upvotes": 655,
            "date": "05/14/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/05/1280/720/burg.jpg?ve=1&tl=1",
            "top_comments": [
                ">  Anthony Salas, 20, was shot, hit with a vehicle, and killed as he tried to get his family's stolen vehicle back near the intersection.\n\nKids being criminals. Terrible.",
                "Wow that lady sucks ass as a reporter!\n\n\n“…. And uhhhh that’s uh….. what happened, yeah”\n\nLmfao",
                "There shouldn’t be a hyphen joining “12-and” or “and-13”\n\nIt should read:\n\n*12- and 13-year-old arrested for capital murder…*",
                "Death Row getting booster seats.",
                "Wow that Reporter is Ass. How do people like her even have a shot at presenting something on tv? My 1st grader would have done better",
                "If kids think they are old enough to walk around with a loaded firearm and start shooting in public, they are certainly old enough for real consequences.",
                "How can people look at articles like these and say that guns are not the problem?\n\n~~Like, mf atleast try banning them for a year to see the changes, and then see what lack of guns do~~\n\nEdit: yeah, apparently it's a shit idea. My bad",
                "Start charging kids as adults. Old enough to commit murder? Old enough to serve time as an adult.",
                "GOP “We need more guns” arm everyone will make it safer 🤦🏻‍♂️",
                "Crime’s so tough in Austin that it trickled down from the adults to the kids doing it.\nCrazy."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "FBI ordered to prioritize immigration, as DOJ scales back white collar cases",
            "external_url": "https://www.reuters.com/world/us/fbi-ordered-prioritize-immigration-cases-over-white-collar-crime-people-familiar-2025-05-12/",
            "upvotes": 13097,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Government full of white collar criminals scales back investigation of white collar criminals.",
                "Sounds like a lot of fraud will be happening unchecked",
                "The massive tranfer of wealth during covid wasn't enough. They will not stop until we are all slaves.",
                "Sure… why not…. Let the mortgage fraudsters steal my home and life savings.….. just as long as I can rest comfortably knowing the cucumbers in my salad weren’t sullied by the hands of an undocumented farm worker getting paid 1/2 minimum wage to do back breaking labor in the hot sun.",
                "*But as....Trump has stepped up an immigration crackdown, thousands of federal law enforcement officials from multiple agencies* [*have been*](https://www.reuters.com/world/us/thousands-agents-diverted-trump-immigration-crackdown-2025-03-22/) *enlisted to take on new work as immigration enforcers, pulling crime-fighting resources away from other areas.*\n\nSo the DOJ cuts back efforts to prosecute white-collar offenses, as in \"public [corruption](https://www.reuters.com/world/us/trumps-justice-department-hits-brakes-anti-corruption-enforcement-2025-02-12/), foreign bribery, kleptocracy and foreign influence.\"   (so racist, and so self-serving)",
                "Let’s not investigate where all the hundreds million $’s of Trump’s inauguration fund went to.  Or who were the early buyers of Trump coin",
                "It's corruption all the way down.",
                "Cripple the IRS so they can't go after tax-dodging billionaires...\n\nDistract the FBI so they can't go after white collar crime...\n\nBeguile your base with a blitzkrieg of harm directed towards immigrants...\n\nPreoccupy the media with a deluge of vulgarities and other bullshit so they are too enthralled to report the rampant fraud and dismantling of American institutions...\n\nThen sit back & laugh while your uber-wealthy sycophants & sinister foreign backers gorge like vultures on the nation's dying corpse.\n\nNevermind \"draining the swamp\" we're now all up to our chins in a fucking sewage plant",
                "So Republicans are seriously dismantling the rule of law in broad daylight, openly and proverbial crickets?!?!? ",
                "Just want to point out solving and therefore preventing white collar crime actually generates money and lost tax revenue."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 24718,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question.",
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Yeah, the 51st state comments are idiotic but the positive stuff about forced starvation - holy fuck, what the fuck is wrong with this man?",
                "What a fucking asshole",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "damn I actually want the Leafs to advance, now",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "It must be so hard for people to just shut the fuck up. I don't get it"
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "Grand jury indicts Milwaukee County judge after prosecutors allege she helped a man evade ICE",
            "external_url": "https://www.wpr.org/news/grand-jury-indicts-milwaukee-county-judge-allege-helped-man-evade-ice",
            "upvotes": 4769,
            "date": "05/13/2025",
            "thumbnail": "https://www.wpr.org/wp-content/uploads/2025/05/dugan1.jpg",
            "top_comments": [
                "In summary, an administrative warrant is issued by a government agency for regulatory or administrative purposes, while a judicial warrant is issued by a court for criminal or civil law enforcement.",
                "As the old saying goes, a grand jury would indict a ham sandwich if that’s what the prosecutor wanted.\n\nGrand jury indictments are just a rubber stamp.",
                "I’ve served on a grand jury and can clearly explain what happens there. Grand juries do not need proof beyond a reasonable doubt, they just need to be presented with enough evidence to lead a reasonable person to believe there’s enough evidence to charge somebody with a crime. The bar is much lower to indict somebody.",
                "All governmental officials should be held to account. Let's start with, idk, maybe the fucking President?",
                "> Prosecutors allege she broke federal law by helping a man evade immigration enforcement last month.\n\nLegal Eagle did a great breakdown on this whole case. The funniest part is that the door she let the man “escape” through led…right back to the main hallway where officers were waiting lol\n\nSo basically they’re going to argue either she didn’t know how her own courthouse hallways work, or somehow she did know and it still counts as helping him “escape” by leading him straight back to them!\n\nEDIT: For people wanting to dispute what I say above, please watch [the Legal Eagle video](https://m.youtube.com/watch?v=TPQeZalnArY&pp=0gcJCYsJAYcqIYzv) before doing so.",
                "This is crazy. She let him out through a different exit that lead to the SAME public hallway as where the ICE agents were waiting. The agents even rode down the elevator with the guy and his lawyer before they arrested him outside.",
                "Hope democrats remember this next time they debate 3 years whether to charge Trump or any republican for any of the crimes they commit.",
                "Sounds like someone is getting due process.",
                "how did this go to trial and get an indictment already?? TF. How long did it take for Trump to go to trial and get indicted?\n\nOh wait...",
                "[removed]"
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "05/14/2025 16:11:00 UTC"
}