{
    "posts": [
        {
            "category": "HOT",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 28164,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "He should be fired and charged.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "Any other administration and he’d have been fired weeks ago",
                "I hope he gets fired via a Signal message in a group chat.",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "He might as well add Fox news to the chat.",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "I remember a time when a 20 year old kid had his home swarmed by heavily armed FBI agents for sharing some information…."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 7061,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "It feels like this administration is doing its best to create different ways to kill us or make us so sick we wish for death.",
                "I wonder if the fall of Rome was this stupid.",
                "Guess this is how we kill people.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "This reminds me of the Wisconsin or North Dakota politician that campaigned ***hard*** on allowing raw milk. They changed their state laws to allow for raw milk sales and at the press conference the politician drank a glass of raw milk in celebration. It immediately made him sick. Like, next day.",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "This is why we don't want your shit in our country.\n\nSorry.\n\n*Canada*",
                "They want private labs to do this testing so they can profit both through routine checks and bribes to forge lab tests so bad product can be sold instead of thrown away. A few more lives lost to various bacterial contamination that will seldom get rejected. We’ll be taking batch numbers off of food products next."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Trump must give some Venezuelan migrants 21 days' notice before deportations, judge rules",
            "external_url": "https://www.reuters.com/legal/trump-must-give-some-venezuelan-migrants-21-days-notice-before-deportations-2025-04-22/",
            "upvotes": 2152,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In coming Truth Social Post: \"All immigrants are hereby notified that you are subject to deportation in 21 days!!!\"",
                "Doesn't matter what the judge rules if he never faces consequences for anything.",
                "I admire the judges that resist him with their rulings, but what does it ultimately mean if no one will enforce it? The people with the weapons have to follow the judges' orders before they are worth more than any rando's judgment.",
                "Good. Everyone in the US is legally entitled and morally deserving of due process.",
                "> administration must tell the migrants in a language they understand that they have the right to consult a lawyer.\n\n  \nBut will they allow a lawyer to talk to them?  He know Trump goons going to skirt this part, these judges need to treat them like 5 y/o with their rulings and spell it out, every step.",
                "I’m SURE he’ll comply this time.",
                "Followed by him saying “I’m gonna do it anyway,” the judges saying “Well…you can’t,” and then him doing it anyway because the law is simply not enforced where Trump is concerned.",
                "In one ear right out the other. The fact this idiot hasn't already had the impeachment process started against him means he will ignore it and get away with it. I hate this country",
                "Trump: \"no\"\n\n\\~Probably.",
                "So, does that mean they have to shuffle them around for 21 days before they deport them?  Is there anything in the ruling that says they have rights to representation and  due process?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Mexican Cartels Are Using Casinos, to Launder Fentanyl Proceedings In the U.S.",
            "external_url": "https://www.latintimes.com/mexican-cartels-are-using-casinos-o-launder-fentanyl-proceedings-us-581335",
            "upvotes": 5576,
            "date": "04/22/2025",
            "thumbnail": "https://d.latintimes.com/en/full/574915/casino-representational-image.png",
            "top_comments": [
                "Rebooting Ozark so soon?",
                "*Proceeds*, not *proceedings*.",
                "Casinos have always been used to launder money. It's not exactly a new development",
                "Breaking: organized crime guys doing what all the other organized crime guys do all over the world.",
                "Makes me wonder if this is a small reason why so many rich people in Texas and a few politicians are pushing so hard to get gambling made legal in Texas. \n\nGet a cut of that laundering money because you know these casinos will be lightly regulated by the state if regulated at all.",
                "Maybe a casino boat on the Lake of the Ozarks?  Jason Bateman knows what's up.  \n\nSeriously, this is not new.  I guess the Trump casinos in Atlantic city missed the boat on this.",
                "One more reason not to let the Dumont/Adelsons get their casino in Texas.",
                "The inappropriate comma in the headline makes this super hard to read.",
                "What!!! Casinos are being used to launder money!?!",
                "Somebody call Sheriff Longmire. I’m sure that Nighthorse guy is involved."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Texas measles outbreak surpasses 600 cases with most among children, teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-outbreak-surpasses-600-cases-children-teens/story?id=121042863",
            "upvotes": 1764,
            "date": "04/22/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "If only there were some way to prevent this sort of thing. Like a shot you could give during infancy that provided lifelong protection. I know, it sounds like sci-fi fantasy nonsense, but if we put our collective heads together, surely we could come up with *something* so children don't die needless deaths.",
                "I just know the grizzled hot dog under the 7/11 heat lamp for 10 hours, AKA RFKJr., can do better than 600. If you want it to burn out on its own, we need orders of magnitude better.",
                "As somebody with a baby on the way, fuck all these people so hard, but especially RFK Jr and his ilk.  My kid can't get the MMR until 1 year of age, and now we have to worry about a disease that is maybe the most infectious in the world and also was basically eradicated.",
                "Owning the libs, one dead child at a time.",
                "This update adds 27 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 36 cases. Last Tuesday's update added 20 cases. Last Friday's update added 36 cases. The previous Tuesday's update added 24 cases.\n\nTwo new hospitalizations were reported, up to 64 from 62. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors. The infected are quarantined at the institution (rumored to be the Alert Academy in Big Sandy) where the outbreak occurred.",
                "This is so infuriating. Neglectful parents much??? As if they never got any Vaccines as kids that prevented them from the SAME THING.",
                "Canada's outbreak, also primarily among conservative Mennonites, is actually outpacing the U.S.'s. It has been ongoing since October and is now up to 925 cases in Ontario alone. Ontario added 109 cases to their count over the last week.\n\nhttps://www.cbc.ca/news/canada/toronto/ontario-100-new-measles-cases-outbreak-1.7513057\n\nhttps://www.cbc.ca/news/canada/london/at-the-epicentre-of-ontario-s-measles-outbreak-residents-reel-with-concern-1.7507545",
                "Scared of vaccines - another checkmark in the long list of stupid ass bullshit that Republicans use to scare you into not paying attention to their policies.",
                "Good thing all of the parents had responsible parents themselves and are safer from the outbreak unlike their children.",
                "I read this as Tesla measles outbreak."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Chan Zuckerberg Initiative announces it will close East Palo Alto school",
            "external_url": "https://www.rwcpulse.com/education/2025/04/21/the-primary-school-to-shut-down-at-end-of-school-year/",
            "upvotes": 710,
            "date": "04/22/2025",
            "thumbnail": "https://i0.wp.com/www.rwcpulse.com/wp-content/uploads/2025/04/104441_original.jpg?fit=2000%2C1333&ssl=1",
            "top_comments": [
                "*The closure comes at a time when Zuckberberg has been winding down programs at Meta that pertain to diversity, equity and inclusion*.\n\nIndeed, 80% of the students were people of color, most Latino.",
                "This is mainly going to hurt Latino populations in the area which are already underserved and financially marginalized. I actually learned about it in a class this semester. It’s part of a wider turn against diversity in tech currently underway. ",
                "Feels important to note something like this, especially so since they are not saying why it’s closing",
                "In this economy?  \nYou know how much taxes are when you own an entire Hawaiian island?",
                "Another reason not to trust charter schools.",
                "All to please the president. Taking away education from kids who need it.\n\n  \nThis is just plain stupid.",
                "Grew up in EPA. I used to go to this school back when it was Brentwood Elementary",
                "This is exactly why the right has made concepts like systemic racism, DEI, \"woke\", etc. into pejorative. True racism isn't just calling someone a slur--it's systematically depriving them of education and isolating them from the cultural privileges, all in the attemp to ensure they don't get a fair chance at getting their slice of the pie (money, political power, etc.)\n\nThis is racism, pure and simple.",
                "Bunch of pretentious billionaires. They don't care about humanity anyomore because it's not profitable. The flip flop of zucks is absolutely disgusting.",
                "If they actually wanted to support the community, they would have invested in Ravenswood School District instead of building a parallel private school system. \n\nThat’s going to be a lot of work for Ravenswood to integrate all these student, especially considering that there’s a high pourcentage of students at the Primary School with IEPs.\n\nThere’s a good French documentary about how people from EPA distrust the tech companies and don’t want them to take control and privatize the citizens services. This is a very good example of why they are right."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Bill Owens, Executive Producer Of ’60 Minutes,’ Resigns, Saying He Lost His Ability To Make “Independent Decisions” About The Show",
            "external_url": "https://deadline.com/2025/04/bill-owens-60-minutes-cbs-trump-1236373948/",
            "upvotes": 833,
            "date": "04/22/2025",
            "thumbnail": "https://deadline.com/wp-content/uploads/2024/02/Bill-Owens-headshot-credit-Michele-Crowe-CBS.jpg?w=1024",
            "top_comments": [
                "They pressured him to do Trump positive stuff, didn't they...",
                "Just a reminder, [CBS is currently in the process of a merger with Skydance Media](https://www.cnn.com/2024/07/08/media/paramount-global-skydance-merger-announcement/index.html) and is awaiting [FCC](https://www.fcc.gov/transaction/skydance-paramount) approval. \n\nTrump is currently suing CBS over [60 Minutes](https://apnews.com/article/cbs-60-minutes-lawsuit-trump-pelley-58339cc1a1eb52739bb365e2e8c6d8bc). A settlement that will need to be settled before the merger is approved.\n\nTrump's corruption is unparalleled.",
                "CBS is going to outlive the worthless orange POS. Stop kissing this motherfucker's ring!",
                "It's The Insider all over again. But this time CBS isn't bowing to Big Tobacco, it bowing to Big Cheeto.",
                "We have to collectively start to push back at these 'Trump lashed out etc' - the Dump basically has this unmoderated loudspeaker that has zero rebuttal or ability to correct. It just gets on there and speaks BS and the deluded followers believe it. And no one - other than the media who are scared shitless - can actually rebut at the same magnitude. We all play nice to it with 'oh, only the crazy believe him' or 'its just noise and bullshit, don't listen' but its impacting everyone and everything and it is so beyond needing to be stopped and corrected. Its brutal!\n\nThe dipshit doesn't even understand how or what tariffs are and is cratering economies and peoples lives. Its insane!",
                "*Owens’ departure comes amid settlement talks between CBS and Donald Trump‘s team over a lawsuit Trump filed over the way 60 Minutes edited an interview with Kamala Harris. Many legal observers call the lawsuit frivolous, but CBS’ parent company, Paramount Global, needs administration approval for its proposed merger with Skydance. A mediator was recently selected to try to resolve the dispute, sources said.*\n\nWell, that's pretty clear.",
                "In other words, 60 Minutes and CBS are now wings of the Ministry of Truth.",
                "Canceled my Paramount+ subscription.  Hell with these fascist clowns...",
                "CBS is bending the knee and kissing the ring of the Orange Fuhrer.",
                "Working Toward The Fuhrer^TM"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 3496,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "At what point does it stop being capitalism?",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. Meanwhile you guys are financing the same system using a 30yr loan. For clarification that's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Five bazillion percent!",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 19429,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=edaea84d9f9990d3a4d8ddf0e6fb4e98",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "This will not end well.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                "We have reached the eugenics part of the plot.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "They're going after autistic folks. Folks on the left are more likely to seek a medical diagnosis for their kids experiencing behavioral issues. Folks on the right are more likely to try to discipline or beat it out of their kids. They're hunting our kids.."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Films made with AI can win Oscars, Academy says",
            "external_url": "https://www.bbc.co.uk/news/articles/cqx4y1lrz2vo",
            "upvotes": 772,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bb0/live/c35e9800-1f70-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "Didn’t Hollywood strike specifically because of this wth",
                "SAG/AFTRA gonna love this one....   And so it begins....",
                "So one of the main reasons behind the combined strike couple years ago simply just fell flat and the guilds won’t do anything about it?",
                "Courts have already ruled AI-generated works can't be copyrighted - should open up a whole new can of worms when someone pirates an AI movie.",
                "We went from Trom being ineligible because using computers is not fair, to this",
                "Can the Oscars be presented and judged by AI too?",
                "Let the theatres close and the Hollywood Machine collapse, then.",
                "Why does anyone bother watching the Oscars? Awards only have meaning if they come from people who care about the craft. The academy obviously doesn't.",
                "WHAT!??!  Didn't writers and actors recently strike over this very thing??",
                "Now we can have winners as soulless as the judges. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "IMF cuts growth forecasts for most countries in wake of century-high US tariffs",
            "external_url": "https://www.reuters.com/business/imf-cuts-growth-forecasts-most-countries-wake-century-high-us-tariffs-2025-04-22/",
            "upvotes": 49,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump has single-handedly destroyed the world economy and started a second Great Depression.",
                "Yup, I imagine slowed down economic growth is much in the cards--and mostly worldwide. Unless there's some sharp turn about, what else could be forecast."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Chan Zuckerberg Initiative announces it will close East Palo Alto school",
            "external_url": "https://www.rwcpulse.com/education/2025/04/21/the-primary-school-to-shut-down-at-end-of-school-year/",
            "upvotes": 714,
            "date": "04/22/2025",
            "thumbnail": "https://i0.wp.com/www.rwcpulse.com/wp-content/uploads/2025/04/104441_original.jpg?fit=2000%2C1333&ssl=1",
            "top_comments": [
                "*The closure comes at a time when Zuckberberg has been winding down programs at Meta that pertain to diversity, equity and inclusion*.\n\nIndeed, 80% of the students were people of color, most Latino.",
                "This is mainly going to hurt Latino populations in the area which are already underserved and financially marginalized. I actually learned about it in a class this semester. It’s part of a wider turn against diversity in tech currently underway. ",
                "Feels important to note something like this, especially so since they are not saying why it’s closing",
                "In this economy?  \nYou know how much taxes are when you own an entire Hawaiian island?",
                "Another reason not to trust charter schools.",
                "All to please the president. Taking away education from kids who need it.\n\n  \nThis is just plain stupid.",
                "Grew up in EPA. I used to go to this school back when it was Brentwood Elementary",
                "This is exactly why the right has made concepts like systemic racism, DEI, \"woke\", etc. into pejorative. True racism isn't just calling someone a slur--it's systematically depriving them of education and isolating them from the cultural privileges, all in the attemp to ensure they don't get a fair chance at getting their slice of the pie (money, political power, etc.)\n\nThis is racism, pure and simple.",
                "Bunch of pretentious billionaires. They don't care about humanity anyomore because it's not profitable. The flip flop of zucks is absolutely disgusting.",
                "If they actually wanted to support the community, they would have invested in Ravenswood School District instead of building a parallel private school system. \n\nThat’s going to be a lot of work for Ravenswood to integrate all these student, especially considering that there’s a high pourcentage of students at the Primary School with IEPs.\n\nThere’s a good French documentary about how people from EPA distrust the tech companies and don’t want them to take control and privatize the citizens services. This is a very good example of why they are right."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Trump must give some Venezuelan migrants 21 days' notice before deportations, judge rules",
            "external_url": "https://www.reuters.com/legal/trump-must-give-some-venezuelan-migrants-21-days-notice-before-deportations-2025-04-22/",
            "upvotes": 2140,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In coming Truth Social Post: \"All immigrants are hereby notified that you are subject to deportation in 21 days!!!\"",
                "Doesn't matter what the judge rules if he never faces consequences for anything.",
                "I admire the judges that resist him with their rulings, but what does it ultimately mean if no one will enforce it? The people with the weapons have to follow the judges' orders before they are worth more than any rando's judgment.",
                "Good. Everyone in the US is legally entitled and morally deserving of due process.",
                "> administration must tell the migrants in a language they understand that they have the right to consult a lawyer.\n\n  \nBut will they allow a lawyer to talk to them?  He know Trump goons going to skirt this part, these judges need to treat them like 5 y/o with their rulings and spell it out, every step.",
                "I’m SURE he’ll comply this time.",
                "Followed by him saying “I’m gonna do it anyway,” the judges saying “Well…you can’t,” and then him doing it anyway because the law is simply not enforced where Trump is concerned.",
                "In one ear right out the other. The fact this idiot hasn't already had the impeachment process started against him means he will ignore it and get away with it. I hate this country",
                "Trump: \"no\"\n\n\\~Probably.",
                "So, does that mean they have to shuffle them around for 21 days before they deport them?  Is there anything in the ruling that says they have rights to representation and  due process?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Gunmen open fire on tourists in Himalayan region, killing at least 26 people, police say",
            "external_url": "https://www.cnn.com/2025/04/22/asia/gunmen-open-fire-jammu-kashmir-intl/index.html",
            "upvotes": 246,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25112448508238.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gunmen... You mean terrorists?",
                "Terrorists specifically killed Hindu tourists only. Before killing they asked for id proofs and even removed tourists' pants to check their religion.",
                "*“Pakistan and its proxies are unable to digest the return of peace and tourism in Jammu and Kashmir. They want to stifle growth and plunge the region back into fear. But we won’t allow that to happen,” Altaf Thakur said.*\n\nYeah, tensions between India and Pakistan in this border region have been going on forever.  (I can't imagine what rescue attempts were like in a place with no  vehicle traffic whatsoever)",
                "Say it clearly. Islamic terrorism.",
                "First Pope and now this...JD Vance is cursed.",
                "[deleted]"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Bill Owens, Executive Producer Of ’60 Minutes,’ Resigns, Saying He Lost His Ability To Make “Independent Decisions” About The Show",
            "external_url": "https://deadline.com/2025/04/bill-owens-60-minutes-cbs-trump-1236373948/",
            "upvotes": 829,
            "date": "04/22/2025",
            "thumbnail": "https://deadline.com/wp-content/uploads/2024/02/Bill-Owens-headshot-credit-Michele-Crowe-CBS.jpg?w=1024",
            "top_comments": [
                "They pressured him to do Trump positive stuff, didn't they...",
                "Just a reminder, [CBS is currently in the process of a merger with Skydance Media](https://www.cnn.com/2024/07/08/media/paramount-global-skydance-merger-announcement/index.html) and is awaiting [FCC](https://www.fcc.gov/transaction/skydance-paramount) approval. \n\nTrump is currently suing CBS over [60 Minutes](https://apnews.com/article/cbs-60-minutes-lawsuit-trump-pelley-58339cc1a1eb52739bb365e2e8c6d8bc). A settlement that will need to be settled before the merger is approved.\n\nTrump's corruption is unparalleled.",
                "CBS is going to outlive the worthless orange POS. Stop kissing this motherfucker's ring!",
                "It's The Insider all over again. But this time CBS isn't bowing to Big Tobacco, it bowing to Big Cheeto.",
                "We have to collectively start to push back at these 'Trump lashed out etc' - the Dump basically has this unmoderated loudspeaker that has zero rebuttal or ability to correct. It just gets on there and speaks BS and the deluded followers believe it. And no one - other than the media who are scared shitless - can actually rebut at the same magnitude. We all play nice to it with 'oh, only the crazy believe him' or 'its just noise and bullshit, don't listen' but its impacting everyone and everything and it is so beyond needing to be stopped and corrected. Its brutal!\n\nThe dipshit doesn't even understand how or what tariffs are and is cratering economies and peoples lives. Its insane!",
                "*Owens’ departure comes amid settlement talks between CBS and Donald Trump‘s team over a lawsuit Trump filed over the way 60 Minutes edited an interview with Kamala Harris. Many legal observers call the lawsuit frivolous, but CBS’ parent company, Paramount Global, needs administration approval for its proposed merger with Skydance. A mediator was recently selected to try to resolve the dispute, sources said.*\n\nWell, that's pretty clear.",
                "In other words, 60 Minutes and CBS are now wings of the Ministry of Truth.",
                "Canceled my Paramount+ subscription.  Hell with these fascist clowns...",
                "CBS is bending the knee and kissing the ring of the Orange Fuhrer.",
                "Working Toward The Fuhrer^TM"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Texas measles outbreak surpasses 600 cases with most among children, teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-outbreak-surpasses-600-cases-children-teens/story?id=121042863",
            "upvotes": 1765,
            "date": "04/22/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "If only there were some way to prevent this sort of thing. Like a shot you could give during infancy that provided lifelong protection. I know, it sounds like sci-fi fantasy nonsense, but if we put our collective heads together, surely we could come up with *something* so children don't die needless deaths.",
                "I just know the grizzled hot dog under the 7/11 heat lamp for 10 hours, AKA RFKJr., can do better than 600. If you want it to burn out on its own, we need orders of magnitude better.",
                "As somebody with a baby on the way, fuck all these people so hard, but especially RFK Jr and his ilk.  My kid can't get the MMR until 1 year of age, and now we have to worry about a disease that is maybe the most infectious in the world and also was basically eradicated.",
                "Owning the libs, one dead child at a time.",
                "This update adds 27 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 36 cases. Last Tuesday's update added 20 cases. Last Friday's update added 36 cases. The previous Tuesday's update added 24 cases.\n\nTwo new hospitalizations were reported, up to 64 from 62. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors. The infected are quarantined at the institution (rumored to be the Alert Academy in Big Sandy) where the outbreak occurred.",
                "This is so infuriating. Neglectful parents much??? As if they never got any Vaccines as kids that prevented them from the SAME THING.",
                "Canada's outbreak, also primarily among conservative Mennonites, is actually outpacing the U.S.'s. It has been ongoing since October and is now up to 925 cases in Ontario alone. Ontario added 109 cases to their count over the last week.\n\nhttps://www.cbc.ca/news/canada/toronto/ontario-100-new-measles-cases-outbreak-1.7513057\n\nhttps://www.cbc.ca/news/canada/london/at-the-epicentre-of-ontario-s-measles-outbreak-residents-reel-with-concern-1.7507545",
                "Scared of vaccines - another checkmark in the long list of stupid ass bullshit that Republicans use to scare you into not paying attention to their policies.",
                "Good thing all of the parents had responsible parents themselves and are safer from the outbreak unlike their children.",
                "I read this as Tesla measles outbreak."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 7061,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "It feels like this administration is doing its best to create different ways to kill us or make us so sick we wish for death.",
                "I wonder if the fall of Rome was this stupid.",
                "Guess this is how we kill people.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "This reminds me of the Wisconsin or North Dakota politician that campaigned ***hard*** on allowing raw milk. They changed their state laws to allow for raw milk sales and at the press conference the politician drank a glass of raw milk in celebration. It immediately made him sick. Like, next day.",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "This is why we don't want your shit in our country.\n\nSorry.\n\n*Canada*",
                "They want private labs to do this testing so they can profit both through routine checks and bribes to forge lab tests so bad product can be sold instead of thrown away. A few more lives lost to various bacterial contamination that will seldom get rejected. We’ll be taking batch numbers off of food products next."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Films made with AI can win Oscars, Academy says",
            "external_url": "https://www.bbc.co.uk/news/articles/cqx4y1lrz2vo",
            "upvotes": 767,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bb0/live/c35e9800-1f70-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "Didn’t Hollywood strike specifically because of this wth",
                "SAG/AFTRA gonna love this one....   And so it begins....",
                "So one of the main reasons behind the combined strike couple years ago simply just fell flat and the guilds won’t do anything about it?",
                "Courts have already ruled AI-generated works can't be copyrighted - should open up a whole new can of worms when someone pirates an AI movie.",
                "We went from Trom being ineligible because using computers is not fair, to this",
                "Can the Oscars be presented and judged by AI too?",
                "Let the theatres close and the Hollywood Machine collapse, then.",
                "Why does anyone bother watching the Oscars? Awards only have meaning if they come from people who care about the craft. The academy obviously doesn't.",
                "WHAT!??!  Didn't writers and actors recently strike over this very thing??",
                "Now we can have winners as soulless as the judges. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 28165,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "He should be fired and charged.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "Any other administration and he’d have been fired weeks ago",
                "I hope he gets fired via a Signal message in a group chat.",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "He might as well add Fox news to the chat.",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "I remember a time when a 20 year old kid had his home swarmed by heavily armed FBI agents for sharing some information…."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Mexican Cartels Are Using Casinos, to Launder Fentanyl Proceedings In the U.S.",
            "external_url": "https://www.latintimes.com/mexican-cartels-are-using-casinos-o-launder-fentanyl-proceedings-us-581335",
            "upvotes": 5578,
            "date": "04/22/2025",
            "thumbnail": "https://d.latintimes.com/en/full/574915/casino-representational-image.png",
            "top_comments": [
                "Rebooting Ozark so soon?",
                "*Proceeds*, not *proceedings*.",
                "Casinos have always been used to launder money. It's not exactly a new development",
                "Breaking: organized crime guys doing what all the other organized crime guys do all over the world.",
                "Makes me wonder if this is a small reason why so many rich people in Texas and a few politicians are pushing so hard to get gambling made legal in Texas. \n\nGet a cut of that laundering money because you know these casinos will be lightly regulated by the state if regulated at all.",
                "Maybe a casino boat on the Lake of the Ozarks?  Jason Bateman knows what's up.  \n\nSeriously, this is not new.  I guess the Trump casinos in Atlantic city missed the boat on this.",
                "One more reason not to let the Dumont/Adelsons get their casino in Texas.",
                "The inappropriate comma in the headline makes this super hard to read.",
                "What!!! Casinos are being used to launder money!?!",
                "Somebody call Sheriff Longmire. I’m sure that Nighthorse guy is involved."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Trump must give some Venezuelan migrants 21 days' notice before deportations, judge rules",
            "external_url": "https://www.reuters.com/legal/trump-must-give-some-venezuelan-migrants-21-days-notice-before-deportations-2025-04-22/",
            "upvotes": 2151,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In coming Truth Social Post: \"All immigrants are hereby notified that you are subject to deportation in 21 days!!!\"",
                "Doesn't matter what the judge rules if he never faces consequences for anything.",
                "I admire the judges that resist him with their rulings, but what does it ultimately mean if no one will enforce it? The people with the weapons have to follow the judges' orders before they are worth more than any rando's judgment.",
                "Good. Everyone in the US is legally entitled and morally deserving of due process.",
                "> administration must tell the migrants in a language they understand that they have the right to consult a lawyer.\n\n  \nBut will they allow a lawyer to talk to them?  He know Trump goons going to skirt this part, these judges need to treat them like 5 y/o with their rulings and spell it out, every step.",
                "I’m SURE he’ll comply this time.",
                "Followed by him saying “I’m gonna do it anyway,” the judges saying “Well…you can’t,” and then him doing it anyway because the law is simply not enforced where Trump is concerned.",
                "In one ear right out the other. The fact this idiot hasn't already had the impeachment process started against him means he will ignore it and get away with it. I hate this country",
                "Trump: \"no\"\n\n\\~Probably.",
                "So, does that mean they have to shuffle them around for 21 days before they deport them?  Is there anything in the ruling that says they have rights to representation and  due process?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Texas measles outbreak surpasses 600 cases with most among children, teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-outbreak-surpasses-600-cases-children-teens/story?id=121042863",
            "upvotes": 1772,
            "date": "04/22/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "If only there were some way to prevent this sort of thing. Like a shot you could give during infancy that provided lifelong protection. I know, it sounds like sci-fi fantasy nonsense, but if we put our collective heads together, surely we could come up with *something* so children don't die needless deaths.",
                "I just know the grizzled hot dog under the 7/11 heat lamp for 10 hours, AKA RFKJr., can do better than 600. If you want it to burn out on its own, we need orders of magnitude better.",
                "As somebody with a baby on the way, fuck all these people so hard, but especially RFK Jr and his ilk.  My kid can't get the MMR until 1 year of age, and now we have to worry about a disease that is maybe the most infectious in the world and also was basically eradicated.",
                "Owning the libs, one dead child at a time.",
                "This update adds 27 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 36 cases. Last Tuesday's update added 20 cases. Last Friday's update added 36 cases. The previous Tuesday's update added 24 cases.\n\nTwo new hospitalizations were reported, up to 64 from 62. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors. The infected are quarantined at the institution (rumored to be the Alert Academy in Big Sandy) where the outbreak occurred.",
                "This is so infuriating. Neglectful parents much??? As if they never got any Vaccines as kids that prevented them from the SAME THING.",
                "Canada's outbreak, also primarily among conservative Mennonites, is actually outpacing the U.S.'s. It has been ongoing since October and is now up to 925 cases in Ontario alone. Ontario added 109 cases to their count over the last week.\n\nhttps://www.cbc.ca/news/canada/toronto/ontario-100-new-measles-cases-outbreak-1.7513057\n\nhttps://www.cbc.ca/news/canada/london/at-the-epicentre-of-ontario-s-measles-outbreak-residents-reel-with-concern-1.7507545",
                "Scared of vaccines - another checkmark in the long list of stupid ass bullshit that Republicans use to scare you into not paying attention to their policies.",
                "Good thing all of the parents had responsible parents themselves and are safer from the outbreak unlike their children.",
                "I read this as Tesla measles outbreak."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Bill Owens, Executive Producer Of ’60 Minutes,’ Resigns, Saying He Lost His Ability To Make “Independent Decisions” About The Show",
            "external_url": "https://deadline.com/2025/04/bill-owens-60-minutes-cbs-trump-1236373948/",
            "upvotes": 832,
            "date": "04/22/2025",
            "thumbnail": "https://deadline.com/wp-content/uploads/2024/02/Bill-Owens-headshot-credit-Michele-Crowe-CBS.jpg?w=1024",
            "top_comments": [
                "They pressured him to do Trump positive stuff, didn't they...",
                "Just a reminder, [CBS is currently in the process of a merger with Skydance Media](https://www.cnn.com/2024/07/08/media/paramount-global-skydance-merger-announcement/index.html) and is awaiting [FCC](https://www.fcc.gov/transaction/skydance-paramount) approval. \n\nTrump is currently suing CBS over [60 Minutes](https://apnews.com/article/cbs-60-minutes-lawsuit-trump-pelley-58339cc1a1eb52739bb365e2e8c6d8bc). A settlement that will need to be settled before the merger is approved.\n\nTrump's corruption is unparalleled.",
                "CBS is going to outlive the worthless orange POS. Stop kissing this motherfucker's ring!",
                "It's The Insider all over again. But this time CBS isn't bowing to Big Tobacco, it bowing to Big Cheeto.",
                "We have to collectively start to push back at these 'Trump lashed out etc' - the Dump basically has this unmoderated loudspeaker that has zero rebuttal or ability to correct. It just gets on there and speaks BS and the deluded followers believe it. And no one - other than the media who are scared shitless - can actually rebut at the same magnitude. We all play nice to it with 'oh, only the crazy believe him' or 'its just noise and bullshit, don't listen' but its impacting everyone and everything and it is so beyond needing to be stopped and corrected. Its brutal!\n\nThe dipshit doesn't even understand how or what tariffs are and is cratering economies and peoples lives. Its insane!",
                "*Owens’ departure comes amid settlement talks between CBS and Donald Trump‘s team over a lawsuit Trump filed over the way 60 Minutes edited an interview with Kamala Harris. Many legal observers call the lawsuit frivolous, but CBS’ parent company, Paramount Global, needs administration approval for its proposed merger with Skydance. A mediator was recently selected to try to resolve the dispute, sources said.*\n\nWell, that's pretty clear.",
                "In other words, 60 Minutes and CBS are now wings of the Ministry of Truth.",
                "Canceled my Paramount+ subscription.  Hell with these fascist clowns...",
                "CBS is bending the knee and kissing the ring of the Orange Fuhrer.",
                "Working Toward The Fuhrer^TM"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 7063,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "It feels like this administration is doing its best to create different ways to kill us or make us so sick we wish for death.",
                "I wonder if the fall of Rome was this stupid.",
                "Guess this is how we kill people.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "This reminds me of the Wisconsin or North Dakota politician that campaigned ***hard*** on allowing raw milk. They changed their state laws to allow for raw milk sales and at the press conference the politician drank a glass of raw milk in celebration. It immediately made him sick. Like, next day.",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "This is why we don't want your shit in our country.\n\nSorry.\n\n*Canada*",
                "They want private labs to do this testing so they can profit both through routine checks and bribes to forge lab tests so bad product can be sold instead of thrown away. A few more lives lost to various bacterial contamination that will seldom get rejected. We’ll be taking batch numbers off of food products next."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Gunmen open fire on tourists in Himalayan region, killing at least 26 people, police say",
            "external_url": "https://www.cnn.com/2025/04/22/asia/gunmen-open-fire-jammu-kashmir-intl/index.html",
            "upvotes": 245,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25112448508238.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gunmen... You mean terrorists?",
                "Terrorists specifically killed Hindu tourists only. Before killing they asked for id proofs and even removed tourists' pants to check their religion.",
                "*“Pakistan and its proxies are unable to digest the return of peace and tourism in Jammu and Kashmir. They want to stifle growth and plunge the region back into fear. But we won’t allow that to happen,” Altaf Thakur said.*\n\nYeah, tensions between India and Pakistan in this border region have been going on forever.  (I can't imagine what rescue attempts were like in a place with no  vehicle traffic whatsoever)",
                "Say it clearly. Islamic terrorism.",
                "First Pope and now this...JD Vance is cursed.",
                "[deleted]"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Chan Zuckerberg Initiative announces it will close East Palo Alto school",
            "external_url": "https://www.rwcpulse.com/education/2025/04/21/the-primary-school-to-shut-down-at-end-of-school-year/",
            "upvotes": 711,
            "date": "04/22/2025",
            "thumbnail": "https://i0.wp.com/www.rwcpulse.com/wp-content/uploads/2025/04/104441_original.jpg?fit=2000%2C1333&ssl=1",
            "top_comments": [
                "*The closure comes at a time when Zuckberberg has been winding down programs at Meta that pertain to diversity, equity and inclusion*.\n\nIndeed, 80% of the students were people of color, most Latino.",
                "This is mainly going to hurt Latino populations in the area which are already underserved and financially marginalized. I actually learned about it in a class this semester. It’s part of a wider turn against diversity in tech currently underway. ",
                "Feels important to note something like this, especially so since they are not saying why it’s closing",
                "In this economy?  \nYou know how much taxes are when you own an entire Hawaiian island?",
                "Another reason not to trust charter schools.",
                "All to please the president. Taking away education from kids who need it.\n\n  \nThis is just plain stupid.",
                "Grew up in EPA. I used to go to this school back when it was Brentwood Elementary",
                "This is exactly why the right has made concepts like systemic racism, DEI, \"woke\", etc. into pejorative. True racism isn't just calling someone a slur--it's systematically depriving them of education and isolating them from the cultural privileges, all in the attemp to ensure they don't get a fair chance at getting their slice of the pie (money, political power, etc.)\n\nThis is racism, pure and simple.",
                "Bunch of pretentious billionaires. They don't care about humanity anyomore because it's not profitable. The flip flop of zucks is absolutely disgusting.",
                "If they actually wanted to support the community, they would have invested in Ravenswood School District instead of building a parallel private school system. \n\nThat’s going to be a lot of work for Ravenswood to integrate all these student, especially considering that there’s a high pourcentage of students at the Primary School with IEPs.\n\nThere’s a good French documentary about how people from EPA distrust the tech companies and don’t want them to take control and privatize the citizens services. This is a very good example of why they are right."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Mexican Cartels Are Using Casinos, to Launder Fentanyl Proceedings In the U.S.",
            "external_url": "https://www.latintimes.com/mexican-cartels-are-using-casinos-o-launder-fentanyl-proceedings-us-581335",
            "upvotes": 5576,
            "date": "04/22/2025",
            "thumbnail": "https://d.latintimes.com/en/full/574915/casino-representational-image.png",
            "top_comments": [
                "Rebooting Ozark so soon?",
                "*Proceeds*, not *proceedings*.",
                "Casinos have always been used to launder money. It's not exactly a new development",
                "Breaking: organized crime guys doing what all the other organized crime guys do all over the world.",
                "Makes me wonder if this is a small reason why so many rich people in Texas and a few politicians are pushing so hard to get gambling made legal in Texas. \n\nGet a cut of that laundering money because you know these casinos will be lightly regulated by the state if regulated at all.",
                "Maybe a casino boat on the Lake of the Ozarks?  Jason Bateman knows what's up.  \n\nSeriously, this is not new.  I guess the Trump casinos in Atlantic city missed the boat on this.",
                "One more reason not to let the Dumont/Adelsons get their casino in Texas.",
                "The inappropriate comma in the headline makes this super hard to read.",
                "What!!! Casinos are being used to launder money!?!",
                "Somebody call Sheriff Longmire. I’m sure that Nighthorse guy is involved."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 28161,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "He should be fired and charged.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "Any other administration and he’d have been fired weeks ago",
                "I hope he gets fired via a Signal message in a group chat.",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "He might as well add Fox news to the chat.",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "I remember a time when a 20 year old kid had his home swarmed by heavily armed FBI agents for sharing some information…."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Films made with AI can win Oscars, Academy says",
            "external_url": "https://www.bbc.co.uk/news/articles/cqx4y1lrz2vo",
            "upvotes": 770,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bb0/live/c35e9800-1f70-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "Didn’t Hollywood strike specifically because of this wth",
                "SAG/AFTRA gonna love this one....   And so it begins....",
                "So one of the main reasons behind the combined strike couple years ago simply just fell flat and the guilds won’t do anything about it?",
                "Courts have already ruled AI-generated works can't be copyrighted - should open up a whole new can of worms when someone pirates an AI movie.",
                "We went from Trom being ineligible because using computers is not fair, to this",
                "Can the Oscars be presented and judged by AI too?",
                "Let the theatres close and the Hollywood Machine collapse, then.",
                "Why does anyone bother watching the Oscars? Awards only have meaning if they come from people who care about the craft. The academy obviously doesn't.",
                "WHAT!??!  Didn't writers and actors recently strike over this very thing??",
                "Now we can have winners as soulless as the judges. "
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 3487,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "At what point does it stop being capitalism?",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. Meanwhile you guys are financing the same system using a 30yr loan. For clarification that's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Five bazillion percent!",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "04/22/2025 20:10:00 UTC"
}