{
    "posts": [
        {
            "category": "HOT",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 2289,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Mayday is coming people. Join in.",
                "Stickin' it to the man... In solidarity.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "Why just a 2 day strike? Why not continue the strike until you get what you want?",
                "Everyone wants more $ but no one wants to pay more taxes"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "USDA withdraws plan to limit salmonella levels in raw poultry",
            "external_url": "https://www.foxla.com/news/usda-salmonella-levels-raw-poultry-usda-withdraws-plan?taid=680e9f8b3d26750001e41bef",
            "upvotes": 15759,
            "date": "04/29/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/gettyimages-1212195382.jpg?ve=1&tl=1",
            "top_comments": [
                "Wow. How is our president making America great again with this ?",
                "This is the largest disease vector experiment I have ever seen.  \n\nWhich billionaire owns the biowarfare companies?",
                "So.... USDA plans to increase salmonella levels in raw poultry?",
                "Is it good for health now?",
                "We're all about to learn why our grandparents boiled the shit out of everything",
                "It has been some time since I suspected that US elites want to kill an entire generation of adults and harvest the assets of the dead with the hope their kids would become destitute and be forced into any kind of labour relation.\n\n\nI now firmly believe that.",
                "wtf, chicken is one of the few meats some people can afford!\n\nohhhhhhhhhh,\n\nthese motherfuckers are straight up evil.",
                "And he thinks this will make other countries want to import his trash? What a moron.",
                "I, for one, will be extremely satisfied as I shit my brains out while puking into the bathroom garbage bin, knowing that America is finally, in fact, great again.",
                "And at the same time, try to bully Europe into buying that crap. \n\nAnd not incidentally, poison the Cubans with the 200k tons that gets exported there."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 5163,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "Some kids do need a leash.",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Comments in the Independent article are pathetic.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 9202,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "“Stop breaking the law asshole.”",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness.",
                "This is the strategy of Trump's entire business and political career.  Do whatever you want, because the legal process takes too long for anyone to do anything. Sometimes more than 4 years if you  have good lawyers."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 5462,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                " **\" their exploits never got the attention afforded their white counterparts\"**  \\-\n\n  Well....\n\n  I would agree that many mostly white male units have received a lot more recognition that the Six Triple Eight but I don't think anyone would argue that any mostly white mail units have received more recognition than the Six Triple Eight.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "That’s an awesome squad name. Six triple eight!!!!! Move out!!",
                "So what does the Coward-in-Chief have to say about that?",
                "There's a Netflix movie about this unit titled \"The Six Triple Eight\""
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 5281,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine your kid dies just so you can own the libs.",
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "666 and they can summon RFK Jr directly",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "If only there was some way this could have been prevented.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "Nearly three times the amount of cases the entire US had last year."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "UPS announces 20,000 job cuts, 73 facility closures as Amazon reduces volume",
            "external_url": "https://www.denver7.com/politics/economy/ups-announces-job-cuts-and-facility-closures-as-amazon-reduces-volume",
            "upvotes": 18204,
            "date": "04/29/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/2e70855/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5e%2Ff0%2Fdd74befa41c1b6008401f4110cd2%2Fshutterstock-2301462565.jpg",
            "top_comments": [
                "There's been a lot of layoff headlines recently, but I don't recall seeing one this big. 20,000 lost jobs hurts.",
                "Can't wait to hear the White House spin on this one",
                "> “As a trusted leader in global logistics, we will leverage our integrated network and trade expertise to assist our customers as they adapt to a changing trade environment. Further, the actions we are taking to reconfigure our network and reduce costs across our business could not be timelier. The macro environment may be uncertain, but with our actions, we will emerge as an even stronger, more nimble UPS.”\n\nGot to love when PR tries to put a positive spin on people losing their jobs in this economy.",
                "The slow slide into recession continues.  I'm trying to sock enough away to tank what's coming.",
                "I bet the tariff does not help.",
                "20,000 well paying jobs with good benefits and pensions out the door.  What an idiot.",
                ">Earlier this year, UPS announced that Amazon would reduce its volume by over 50% by mid-2026. Tomé stated that Amazon is UPS' largest partner. In January, Tomé noted that Amazon represented 11.8% of the company's total revenue.\n\nThat's not the steepest cut. But as Amazon goes, other companies will follow. Seems like UPS is getting ahead of the whole thing before the ~~recession~~ amazing economic opportunity hits.",
                "Here it comes. It's like watching the Tsunami eventually come into shore after an earthquake. It's going to start hitting now. Amazon, Etsy, shipping companies, Boeing, and any trade related to Canada. Housing will be fucked as we strip our own national forests for lumber and realize we can't even mill it all to keep up with the lumber that used to come from Canada. Auto manufacturers will be fucked as they can't get parts. \n\nTrump and the Republicans are about to reap what they sowed.",
                "That's a hostile and political act, so I have heard.",
                "Marks slowing down economy, fear, moving away from US$, recession, financial crisis, and finally, collapse."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "China's factory activity drops to a near two-year low in April as trade tariffs bite",
            "external_url": "https://www.cnbc.com/2025/04/30/chinas-factory-activity-drops-to-a-near-two-year-low-in-april-as-trade-tariffs-bite.html",
            "upvotes": 1192,
            "date": "04/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108138371-1745969778598-gettyimages-2209034099-Plush_Toy_Export.jpeg?v=1745969798&w=1920&h=1080",
            "top_comments": [
                "China said openly that they don’t care.",
                "Why is the MSM acting like this is a 'China BTFO!' moment? Even the 'liberal' ones. This is barely a dent in their economy and one they can recover from once they finish negotiating new trade deals. Even their fake economy is holding its own. The HK50 has actually had gains the last three weeks even if its currently horizontal - looks like Chinese investors are waiting for a stimulus. \n\nThe only 'defeat' here is on the US's end. These orders were for things that would have been on our shelves in two months.\n\nIs this the start of some kind of collective effort from the media to make it look like China has been defeated \\*before\\* the shelves are empty so it can give chance Trump a chance to save face while dropping the tariffs? Sure feels like it. Leave it to the US media to be as detached from reality as Trump is - though purposefully so in this case.",
                "China is in a far better position to recover, since they are not declaring trade war against every country in the world, and equally they have plenty of opportunities from countries that also have trade wars declared upon them that's eager to make new trade relationships with.\n\nThis is basically like watching a soccer match where one team is celebrating an own goal they scored on themselves like they scored a world cup winning goal while the other side is ready to kick off from the center circle and 3 goals up.",
                "China survived a 4 year COVID lockdown.  Can trump even survive a year?",
                "A two year low is not that bad for them. This trade war is only really gunna hurt us the most with as many countries as we are starting it with.",
                "Obviously, all these workers losing their jobs will vote out the current President of China and the next guy voted in will bow down to Trump. Like it was planned all along.\n\n^(Wait...What?...Really. Oh. We're fucked.)",
                "They'll recover just fine.",
                "Such a clickbait title. Yes, it's technically true, by 0.1 but look at the chart in that article. It's just looks that the standard range it swings in. It's only .1 lower than what it was in Jan 2025, Aug 2024 and Feb 2024. So...... what's the big deal?",
                "Whaddup homies .. I’m tony",
                "Sounds like American propaganda like I'm gonna believe 340 million people aka all of the USA is going to effect China's business which serves 7.7 billion people world wide not including the USA"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pakistan claims 'credible intelligence' India is planning an imminent military strike",
            "external_url": "https://www.bbc.co.uk/news/articles/c75dgz5pq2no",
            "upvotes": 591,
            "date": "04/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd62/live/86ccd540-258e-11f0-8c93-17b95c5aba9f.jpg",
            "top_comments": [
                "I was just thinking, \"Hey, you know what we could really use right now?  A hot war between two nuclear powers, but only if we can make sure there's a religious element so we can speak in apocalyptic hyperbole.\"",
                "This will ruin the tour",
                "Tim Apple thought he outsmarted the tariffs by shifting the iPhone manufacturing to India. Now he's got to deal with this shit. ",
                "There's more than one country right now that needs to destabilize the world....",
                "Does Pakistan possess credible intelligence?",
                "This has some \"being nuked by Gandhi in Civilization\" vibes",
                "Are military assets being moved? What do people in India think about this? Are there calls for war? Or are they just gonna bomb some terrorists and we forget about this shit next month?",
                "Should I start popping my popcorn now or wait? I’m\nHangry",
                "I didn't have this on my 2025 bingo card. Here we go.",
                "Nuclear War? Here. We. Go...."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court weighs whether law enforcement can be held accountable for raid on wrong house",
            "external_url": "https://www.npr.org/2025/04/29/g-s1-62787/supreme-court-law-enforcement-raid",
            "upvotes": 12007,
            "date": "04/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8457x4757+0+440/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2F8e%2F2138380345e084d68d3d74e848d4%2Fgettyimages-1260961721.jpg",
            "top_comments": [
                "If the answer to this is \"no,\" then it sets a precedent that \"law enforcement is not responsible for making mistakes that harm innocent people.\"\n\n\nStrange that this is even a discussion, let alone an issue that has to be brought to the Supreme Court. ",
                ">The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations. \n\nYes, these armed LEOs can't be expected to make the same high-stakes determinations as, say, the pizza delivery guy",
                "Look man, I’m not asking for the world - I would just like our heavily militarized law enforcement agencies to be held to the same address identification standards we hold our Uber Eats drivers to. That bar is already pretty low.",
                "The U.S. government typically benefits from “sovereign immunity,” meaning it can’t be sued. But Congress passed the Federal Tort Claims Act in 1946 making an exception to allow lawsuits against the federal government for harms caused by its employees. The statute was amended in 1974, partly in response to two high-profile wrong-house FBI raids.\n\nThe question for the Supreme Court on Tuesday is whether the statute, as amended, now allows victims to sue, period. Or can they sue only if the perpetrators of the raid were following government orders, here orders from the FBI.",
                "I am curious how this one is going to go. There are too many times the police knock on the wrong door and someone answers it with a gun and it doesn't go well for them and the cops are cleared for it.",
                "Everyday we expect millions of packages, delivery food items to go to the right address.... \n\nBut somehow that minimum expectation is a bar too high for a group of heavily armed para-military forces with the authority to kill citizens as they see fit.",
                "\"The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations.\"\n\nThe FBI trained them. If they can't read a f'n mailbox number, that is a failure to train their agents for 'stressful situations.'\n\nThe CIA can train their agents to resist torture and having their fingers cut off but FBI can't figure out how to get their agents composed enough to read a street address? What are we doing?",
                "If this comes back that oopsies don’t count, then they aren’t really accountable for anything.\n\nThey literally can go to the “wrong” house on purpose and just claim mistakes.\n\nThis should be a no-brainer.",
                "I would like law enforcement agencies to do the work and have a strong case before going in on a warrant. That includes verify the residence.",
                "Incoming 5-4 with some scathing dissent sprinkled in"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Pakistan claims 'credible intelligence' India is planning an imminent military strike",
            "external_url": "https://www.bbc.co.uk/news/articles/c75dgz5pq2no",
            "upvotes": 592,
            "date": "04/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd62/live/86ccd540-258e-11f0-8c93-17b95c5aba9f.jpg",
            "top_comments": [
                "I was just thinking, \"Hey, you know what we could really use right now?  A hot war between two nuclear powers, but only if we can make sure there's a religious element so we can speak in apocalyptic hyperbole.\"",
                "This will ruin the tour",
                "Tim Apple thought he outsmarted the tariffs by shifting the iPhone manufacturing to India. Now he's got to deal with this shit. ",
                "There's more than one country right now that needs to destabilize the world....",
                "Does Pakistan possess credible intelligence?",
                "This has some \"being nuked by Gandhi in Civilization\" vibes",
                "Are military assets being moved? What do people in India think about this? Are there calls for war? Or are they just gonna bomb some terrorists and we forget about this shit next month?",
                "Should I start popping my popcorn now or wait? I’m\nHangry",
                "I didn't have this on my 2025 bingo card. Here we go.",
                "Nuclear War? Here. We. Go...."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 2287,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Mayday is coming people. Join in.",
                "Stickin' it to the man... In solidarity.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "Why just a 2 day strike? Why not continue the strike until you get what you want?",
                "Everyone wants more $ but no one wants to pay more taxes"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Trial date set for father of suspected Apalachee High School shooter",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/30/trial-date-set-father-suspected-apalachee-high-school-shooter/",
            "upvotes": 288,
            "date": "04/30/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/MXB3DOKMQ5BWFPQRWU3M337X5U.png?auth=edeb083875ca993bd3a4b41f052a05dfecd759fc663a1b1f0d860da781d453a6&width=1200&height=600&smart=true",
            "top_comments": [
                "Charge the parents who provide the gun every fucking time and this will happen less often",
                "Not wanting to make fun of the horror and tragedy of the situation but the 1st 4 paragraphs of the article sound word for word like a John Grisham novel",
                "In many countries, criminally incompetent buffoon parents are incapable of enabling a school shooting. But hey it's America...blame the cops who didn't see the signs, blame the venue who didn't check in on the hotel room often enough, blame the parents who didn't want to believe their precious little angels would do something like this. Blame anything but the guns.",
                "So, they don't know if the kid was the school shooter? And they're charging his dad for something? Sounds like traditional American \"justice\", all right.",
                "''Suspected High School Shooter'' has me kind of stuck. Do they not know who did it?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "China's factory activity drops to a near two-year low in April as trade tariffs bite",
            "external_url": "https://www.cnbc.com/2025/04/30/chinas-factory-activity-drops-to-a-near-two-year-low-in-april-as-trade-tariffs-bite.html",
            "upvotes": 1194,
            "date": "04/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108138371-1745969778598-gettyimages-2209034099-Plush_Toy_Export.jpeg?v=1745969798&w=1920&h=1080",
            "top_comments": [
                "China said openly that they don’t care.",
                "Why is the MSM acting like this is a 'China BTFO!' moment? Even the 'liberal' ones. This is barely a dent in their economy and one they can recover from once they finish negotiating new trade deals. Even their fake economy is holding its own. The HK50 has actually had gains the last three weeks even if its currently horizontal - looks like Chinese investors are waiting for a stimulus. \n\nThe only 'defeat' here is on the US's end. These orders were for things that would have been on our shelves in two months.\n\nIs this the start of some kind of collective effort from the media to make it look like China has been defeated \\*before\\* the shelves are empty so it can give chance Trump a chance to save face while dropping the tariffs? Sure feels like it. Leave it to the US media to be as detached from reality as Trump is - though purposefully so in this case.",
                "China is in a far better position to recover, since they are not declaring trade war against every country in the world, and equally they have plenty of opportunities from countries that also have trade wars declared upon them that's eager to make new trade relationships with.\n\nThis is basically like watching a soccer match where one team is celebrating an own goal they scored on themselves like they scored a world cup winning goal while the other side is ready to kick off from the center circle and 3 goals up.",
                "China survived a 4 year COVID lockdown.  Can trump even survive a year?",
                "A two year low is not that bad for them. This trade war is only really gunna hurt us the most with as many countries as we are starting it with.",
                "Obviously, all these workers losing their jobs will vote out the current President of China and the next guy voted in will bow down to Trump. Like it was planned all along.\n\n^(Wait...What?...Really. Oh. We're fucked.)",
                "They'll recover just fine.",
                "Such a clickbait title. Yes, it's technically true, by 0.1 but look at the chart in that article. It's just looks that the standard range it swings in. It's only .1 lower than what it was in Jan 2025, Aug 2024 and Feb 2024. So...... what's the big deal?",
                "Whaddup homies .. I’m tony",
                "Sounds like American propaganda like I'm gonna believe 340 million people aka all of the USA is going to effect China's business which serves 7.7 billion people world wide not including the USA"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Iraq arrests ISIS member accused of 'inciting' Bourbon Street attack; FBI says attacker acted alone",
            "external_url": "https://www.wbrz.com/news/iraqi-officials-arrest-suspected-isis-member-accused-of-inciting-bourbon-street-attack-in-new-orleans/",
            "upvotes": 876,
            "date": "04/29/2025",
            "thumbnail": "https://dcer237tfveol.cloudfront.net/v2/WSXSwiO6pPgiLFo98vBWLg4XUPkFbQM3kbx5AT53sPVji-Ka5Qlx19IDklplNrYQ_SCYY_InFgwSY8I6wZCuR3_OkqHH0qtGXIMmWdmcr6KQ",
            "top_comments": [
                "How can a member of ISIS \"act alone\" in a bombing.... that doesn't make any sense to me",
                "Maybe I’m just uninformed and naive, but I never expected to see a story where Iraq arrested an ISIS member, let alone one who committed crimes in the US",
                "Why do local news websites make it so hard to tell where the heck this stuff happened? The text of this article doesn't mention a city or state name once. I had to go digging to figure out where the tv station was based and deduce from there.",
                "Always remember two things. 1. ISIS kills more Muslims than non Muslims. 2. ISIS has never once (verifiably) attacked Israel or defended Palestinians against Israel in their homeland."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 5170,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "Some kids do need a leash.",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Comments in the Independent article are pathetic.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "A man airlifted from Japan's Mount Fuji returns to the slope days later and is rescued again",
            "external_url": "https://apnews.com/article/japan-mount-fuji-rescue-climber-student-bc1fcc11150238dee96370697944991b",
            "upvotes": 1197,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Susan Collins:\" I'm sure he's learned his lesson now.\"",
                "After I got rescued, I knew to NEVER go down that slope again. \n\n\nThankfully no airlift was involved but it was embarrassing as shit. ",
                "You may see foolishness. I see determination.",
                "Those flights aren't cheap. Charge him for the cost. He can keep going until he is broke.",
                "This mountain is basically non-technical walk up and they force you onto the established trails. There are mountain huts with rooms, food and water like every 300m of vertical. Since your starting about half way up the actual mountain, the vertical is only about 4000ft and doable in 2 or three days. \n\nThe only reason I would think you would need an airlift would be traumatic injury, hypothermia or cerebral edema from the altitude (which is only like 12,000 ft. Many mountains in the US rockies and sierras are taller).",
                "To retrieve his phone. He should be billed for the costs of the second rescue.",
                "He just can’t get enough",
                "At first you don't succeed, fail, fail, again.",
                "One time is a mistake.  Second time is rank idiocy.\n\nThey should be paying the costs associated with their rank idiocy.",
                "Imagine if he was airlifted twice in the U.S."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "FDA to undo some layoffs, after cuts to inspections and drug safety",
            "external_url": "https://www.cbsnews.com/news/fda-to-reverse-some-layoffs-food-drug-safety/",
            "upvotes": 2578,
            "date": "04/29/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/07/06/6155b273-0a87-4d22-97d4-b6aa87e83e74/thumbnail/1200x630/5904df83378be2beb3922f98d71ffa3c/fda-reuters.jpg?v=fbebbf93950d87ce40fccd82890f0617",
            "top_comments": [
                "What a fucking shit show. Hope we at least get some of those cheap groceries we were promised.",
                "Even if you’re the sort of person who supports these cost cutting efforts, how can you not be embarrassed that the party you voted in are so fucking bad at their jobs? As someone on the other side, it’s hilarious watching these idiots fail to tie their own shoe laces, but if I was a GOP voter, I’d be furious that my master had hired such complete buffoons.",
                "Now if only someone had actually taken the fucking time to make sure vital functions weren't being affected before rubbing one out from the giant throbbing erection they got from a session of seig heil salutes.",
                "What do you mean \"undo\"? This isn't a fucking Word document, some of these guys probably already moved on and said \"fuck it and fuck the government\". You can't just go around and fuck people's lives then hit ctrl-z and call it a day. Bunch of clowns running this country.",
                "Trump is doing the one thing that could hurt the Republican brand the most.\n\nShowing people that the government actually does a lot of important things",
                "I don't know which is more the hallmark of MAGA republicans:\n* Their open scorn of anything remotely resembling empathy\n-or-\n* Their sheer fucking incompetence\n\nIt's like the head of every government agency is just cosplaying at it.",
                "So uh... what are the odds \"Please Return\" Bonuses are going to be a thing?",
                "If it were me I wouldn't come back. Any employment that you can lose for no reason isn't reliable enough. I wouldn't apply to a company that just had massive lay offs.",
                "Fucking morons.\nIf we survive this, I hope the new blood lords this over the GOP. \nPersonally I'd want everyone involved in this, Including senators, dragged before a court.",
                "How do you go back to that job knowing it all might disappear again in a few days when a higher up has another whim?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 5280,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine your kid dies just so you can own the libs.",
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "666 and they can summon RFK Jr directly",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "If only there was some way this could have been prevented.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "Nearly three times the amount of cases the entire US had last year."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 5461,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                " **\" their exploits never got the attention afforded their white counterparts\"**  \\-\n\n  Well....\n\n  I would agree that many mostly white male units have received a lot more recognition that the Six Triple Eight but I don't think anyone would argue that any mostly white mail units have received more recognition than the Six Triple Eight.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "That’s an awesome squad name. Six triple eight!!!!! Move out!!",
                "So what does the Coward-in-Chief have to say about that?",
                "There's a Netflix movie about this unit titled \"The Six Triple Eight\""
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 2291,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Mayday is coming people. Join in.",
                "Stickin' it to the man... In solidarity.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "Why just a 2 day strike? Why not continue the strike until you get what you want?",
                "Everyone wants more $ but no one wants to pay more taxes"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pakistan claims 'credible intelligence' India is planning an imminent military strike",
            "external_url": "https://www.bbc.co.uk/news/articles/c75dgz5pq2no",
            "upvotes": 592,
            "date": "04/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd62/live/86ccd540-258e-11f0-8c93-17b95c5aba9f.jpg",
            "top_comments": [
                "I was just thinking, \"Hey, you know what we could really use right now?  A hot war between two nuclear powers, but only if we can make sure there's a religious element so we can speak in apocalyptic hyperbole.\"",
                "This will ruin the tour",
                "Tim Apple thought he outsmarted the tariffs by shifting the iPhone manufacturing to India. Now he's got to deal with this shit. ",
                "There's more than one country right now that needs to destabilize the world....",
                "Does Pakistan possess credible intelligence?",
                "This has some \"being nuked by Gandhi in Civilization\" vibes",
                "Are military assets being moved? What do people in India think about this? Are there calls for war? Or are they just gonna bomb some terrorists and we forget about this shit next month?",
                "Should I start popping my popcorn now or wait? I’m\nHangry",
                "I didn't have this on my 2025 bingo card. Here we go.",
                "Nuclear War? Here. We. Go...."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "China's factory activity drops to a near two-year low in April as trade tariffs bite",
            "external_url": "https://www.cnbc.com/2025/04/30/chinas-factory-activity-drops-to-a-near-two-year-low-in-april-as-trade-tariffs-bite.html",
            "upvotes": 1194,
            "date": "04/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108138371-1745969778598-gettyimages-2209034099-Plush_Toy_Export.jpeg?v=1745969798&w=1920&h=1080",
            "top_comments": [
                "China said openly that they don’t care.",
                "Why is the MSM acting like this is a 'China BTFO!' moment? Even the 'liberal' ones. This is barely a dent in their economy and one they can recover from once they finish negotiating new trade deals. Even their fake economy is holding its own. The HK50 has actually had gains the last three weeks even if its currently horizontal - looks like Chinese investors are waiting for a stimulus. \n\nThe only 'defeat' here is on the US's end. These orders were for things that would have been on our shelves in two months.\n\nIs this the start of some kind of collective effort from the media to make it look like China has been defeated \\*before\\* the shelves are empty so it can give chance Trump a chance to save face while dropping the tariffs? Sure feels like it. Leave it to the US media to be as detached from reality as Trump is - though purposefully so in this case.",
                "China is in a far better position to recover, since they are not declaring trade war against every country in the world, and equally they have plenty of opportunities from countries that also have trade wars declared upon them that's eager to make new trade relationships with.\n\nThis is basically like watching a soccer match where one team is celebrating an own goal they scored on themselves like they scored a world cup winning goal while the other side is ready to kick off from the center circle and 3 goals up.",
                "China survived a 4 year COVID lockdown.  Can trump even survive a year?",
                "A two year low is not that bad for them. This trade war is only really gunna hurt us the most with as many countries as we are starting it with.",
                "Obviously, all these workers losing their jobs will vote out the current President of China and the next guy voted in will bow down to Trump. Like it was planned all along.\n\n^(Wait...What?...Really. Oh. We're fucked.)",
                "They'll recover just fine.",
                "Such a clickbait title. Yes, it's technically true, by 0.1 but look at the chart in that article. It's just looks that the standard range it swings in. It's only .1 lower than what it was in Jan 2025, Aug 2024 and Feb 2024. So...... what's the big deal?",
                "Whaddup homies .. I’m tony",
                "Sounds like American propaganda like I'm gonna believe 340 million people aka all of the USA is going to effect China's business which serves 7.7 billion people world wide not including the USA"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Trial date set for father of suspected Apalachee High School shooter",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/30/trial-date-set-father-suspected-apalachee-high-school-shooter/",
            "upvotes": 288,
            "date": "04/30/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/MXB3DOKMQ5BWFPQRWU3M337X5U.png?auth=edeb083875ca993bd3a4b41f052a05dfecd759fc663a1b1f0d860da781d453a6&width=1200&height=600&smart=true",
            "top_comments": [
                "Charge the parents who provide the gun every fucking time and this will happen less often",
                "Not wanting to make fun of the horror and tragedy of the situation but the 1st 4 paragraphs of the article sound word for word like a John Grisham novel",
                "In many countries, criminally incompetent buffoon parents are incapable of enabling a school shooting. But hey it's America...blame the cops who didn't see the signs, blame the venue who didn't check in on the hotel room often enough, blame the parents who didn't want to believe their precious little angels would do something like this. Blame anything but the guns.",
                "So, they don't know if the kid was the school shooter? And they're charging his dad for something? Sounds like traditional American \"justice\", all right.",
                "''Suspected High School Shooter'' has me kind of stuck. Do they not know who did it?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Iraq arrests ISIS member accused of 'inciting' Bourbon Street attack; FBI says attacker acted alone",
            "external_url": "https://www.wbrz.com/news/iraqi-officials-arrest-suspected-isis-member-accused-of-inciting-bourbon-street-attack-in-new-orleans/",
            "upvotes": 875,
            "date": "04/29/2025",
            "thumbnail": "https://dcer237tfveol.cloudfront.net/v2/WSXSwiO6pPgiLFo98vBWLg4XUPkFbQM3kbx5AT53sPVji-Ka5Qlx19IDklplNrYQ_SCYY_InFgwSY8I6wZCuR3_OkqHH0qtGXIMmWdmcr6KQ",
            "top_comments": [
                "How can a member of ISIS \"act alone\" in a bombing.... that doesn't make any sense to me",
                "Maybe I’m just uninformed and naive, but I never expected to see a story where Iraq arrested an ISIS member, let alone one who committed crimes in the US",
                "Why do local news websites make it so hard to tell where the heck this stuff happened? The text of this article doesn't mention a city or state name once. I had to go digging to figure out where the tv station was based and deduce from there.",
                "Always remember two things. 1. ISIS kills more Muslims than non Muslims. 2. ISIS has never once (verifiably) attacked Israel or defended Palestinians against Israel in their homeland."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "A man airlifted from Japan's Mount Fuji returns to the slope days later and is rescued again",
            "external_url": "https://apnews.com/article/japan-mount-fuji-rescue-climber-student-bc1fcc11150238dee96370697944991b",
            "upvotes": 1198,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Susan Collins:\" I'm sure he's learned his lesson now.\"",
                "After I got rescued, I knew to NEVER go down that slope again. \n\n\nThankfully no airlift was involved but it was embarrassing as shit. ",
                "You may see foolishness. I see determination.",
                "Those flights aren't cheap. Charge him for the cost. He can keep going until he is broke.",
                "This mountain is basically non-technical walk up and they force you onto the established trails. There are mountain huts with rooms, food and water like every 300m of vertical. Since your starting about half way up the actual mountain, the vertical is only about 4000ft and doable in 2 or three days. \n\nThe only reason I would think you would need an airlift would be traumatic injury, hypothermia or cerebral edema from the altitude (which is only like 12,000 ft. Many mountains in the US rockies and sierras are taller).",
                "To retrieve his phone. He should be billed for the costs of the second rescue.",
                "He just can’t get enough",
                "At first you don't succeed, fail, fail, again.",
                "One time is a mistake.  Second time is rank idiocy.\n\nThey should be paying the costs associated with their rank idiocy.",
                "Imagine if he was airlifted twice in the U.S."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 5168,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "Some kids do need a leash.",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Comments in the Independent article are pathetic.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "USDA withdraws plan to limit salmonella levels in raw poultry",
            "external_url": "https://www.foxla.com/news/usda-salmonella-levels-raw-poultry-usda-withdraws-plan?taid=680e9f8b3d26750001e41bef",
            "upvotes": 15761,
            "date": "04/29/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/gettyimages-1212195382.jpg?ve=1&tl=1",
            "top_comments": [
                "Wow. How is our president making America great again with this ?",
                "This is the largest disease vector experiment I have ever seen.  \n\nWhich billionaire owns the biowarfare companies?",
                "So.... USDA plans to increase salmonella levels in raw poultry?",
                "Is it good for health now?",
                "We're all about to learn why our grandparents boiled the shit out of everything",
                "It has been some time since I suspected that US elites want to kill an entire generation of adults and harvest the assets of the dead with the hope their kids would become destitute and be forced into any kind of labour relation.\n\n\nI now firmly believe that.",
                "wtf, chicken is one of the few meats some people can afford!\n\nohhhhhhhhhh,\n\nthese motherfuckers are straight up evil.",
                "And he thinks this will make other countries want to import his trash? What a moron.",
                "I, for one, will be extremely satisfied as I shit my brains out while puking into the bathroom garbage bin, knowing that America is finally, in fact, great again.",
                "And at the same time, try to bully Europe into buying that crap. \n\nAnd not incidentally, poison the Cubans with the 200k tons that gets exported there."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 9202,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "“Stop breaking the law asshole.”",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness.",
                "This is the strategy of Trump's entire business and political career.  Do whatever you want, because the legal process takes too long for anyone to do anything. Sometimes more than 4 years if you  have good lawyers."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 5463,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                " **\" their exploits never got the attention afforded their white counterparts\"**  \\-\n\n  Well....\n\n  I would agree that many mostly white male units have received a lot more recognition that the Six Triple Eight but I don't think anyone would argue that any mostly white mail units have received more recognition than the Six Triple Eight.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "That’s an awesome squad name. Six triple eight!!!!! Move out!!",
                "So what does the Coward-in-Chief have to say about that?",
                "There's a Netflix movie about this unit titled \"The Six Triple Eight\""
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "04/30/2025 08:12:54 UTC"
}