{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 13775,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "I cannot imagine living in a country where you have to take with you an item solely designed for taking another humans life with you at all times to the point where you *forget you have it on you*, just to feel safe.",
                "One of the safest countries I have ever been to.",
                "how do people \"forget\" where a gun is?",
                "Jesus.  What is it with people and their damn guns??  It wasn’t even like this in the. “Wild West” days."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
            "external_url": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
            "upvotes": 2686,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124184-17435157572025-04-01t134226z_383673798_rc21pdav4zv2_rtrmadp_0_usa-trump-health.jpeg?v=1743515784&w=1920&h=1080",
            "top_comments": [
                "Lmao and the stock market is in free fall to own the Libs.",
                "I'm beginning to understand how this MF bankrupted an effing CASINO!",
                "This bullshit is going to crush the business I work for. \nFuck everyone who voted for it.",
                "Donald Trump is a terrorist. He is literally destroying everything in America.\n\nIs Trump being controlled by Putin?",
                "Burning down the economy at both ends",
                "> “It would have otherwise been a fairly quiet month for layoffs.”\nHowever, DOGE has continued to cut aggressively across the government.\nVarious reports have indicated that the Veterans Affairs department could lose 80,000 jobs, the IRS is in line for some 18,000 reductions and Treasury is expected to drop a “substantial” level of workers as well, according to a court filing.\nThe year to date tally for federal government announced layoffs represents a 672% increase from the same period in 2024, according to Challenger.\n\nA 672% increase is painful. Unemployment claims are going to take much longer, and people are going to struggle to find new jobs in an oversaturated market. Especially here in the DMW area.",
                "The funny thing is Al Gore slashed 400,000 jobs from the federal government under Clinton,  through a combination of voluntary departures, attrition and a relatively small number of layoffs, but he did it in partnership with the agencies and wasn't sued once. Coincidentally, that was the last time the country had a budget surplus.",
                "> U.S.-based employers announced 275,240 job cuts in March\n\n> Of that total, 216,670 were due to “DOGE Actions”\n\n> job cut announcements rose 60% month-on-month, and were 205% higher than in March 2024.\n\n> That’s a record high for any March, and the third-highest monthly total ever recorded.\n\n[Source](https://www.theguardian.com/us-news/live/2025/apr/03/business-news-live-updates-trump-tarrifs-asian-markets-nikkei-asx-wall-st-dow-jones-dollar-euro?page=with%3Ablock-67ee73148f08dc205ac3569c#block-67ee73148f08dc205ac3569c)",
                "And it's not even going to be saving the government money thanks to all the lost revenues",
                "Depression Donnie is just getting started."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Russia bans Elton John Aids Foundation over its support for LGBTQ+ rights",
            "external_url": "https://www.theguardian.com/world/2025/apr/03/russia-bans-elton-john-aids-foundation-support-lgbtq-rights",
            "upvotes": 1239,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1da710a393dbb0652e80593d9269e27b7c00d37e/650_325_3498_2099/master/3498.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95b5f956c29a4cce2aa1334b39d2c5ff",
            "top_comments": [
                "I am now confused between America and Russia. Seems both countries now have the same policies.",
                "My wish is one day Putin & Trump are playing cards in The Hague.",
                "Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.",
                "Tomorrows Fox News Chryon: Impending US Recession caused by LGBTQ+ rights",
                "I expect the Trump White House to follow suit, though RFK Jr is getting a head start making things deadlier over here already.\n\nIt’s so strange living in the era of the idiotic supervillain.",
                "America will probably follow suit soon",
                "Stay classy Russia. Who are you invading next?",
                "#Saturday \n\n#Saturday\n\n#Saturday nights all right for fighting Nazis \n\n\n#SEE YOU IN THE STREETS APRIL 5",
                "I'm sure Sir Elton agrees with this message.",
                "Far right conservative governments always do this as a cover... so in other words Putin probably listens to Elton John while he's getting railed by male escorts."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 753,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "And none of the people involved with Signalgate",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "Seems like President poopy pants wants some of that handy candy",
                "Jigsaw gives T a BJ and as a result he fired people.  What an exciting episode of dumpster fire 2025.",
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "\"Come s my d and you can fire whoever you want\"",
                "It’s wild how much she turned herself into a goblin",
                "Nazis doing Nazi shit."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Stock futures plunge as investors digest Trump’s tariffs",
            "external_url": "https://www.cnn.com/2025/04/02/business/us-stock-market/index.html",
            "upvotes": 8813,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25090525469541.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Hey guys, I think this Trump guy may be a fucking idiot. ",
                "Trump is screwing up my retirement plans.",
                "Someone tell me how this is winning",
                "The guy who bankrupted his own casino is not good at this economy thing. Who could have guessed?",
                "I'm tired of this take that the markets rallied ahead of Trump's tariffs. The markets rallied on the news that Musk will be leaving government soon.",
                "This is the beginning of a recession. Brace yourself.",
                "Really interesting how Doge is asking everyone to retire early on this fucking shit.",
                "…did they not see this coming? I feel like they would have already reacted to the threat, no?",
                "Who is this even for? Who wants this?",
                "The Trump Dump\n\nRepublicans fucking it up and will blame it on Dems"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "John Oliver faces defamation lawsuit from US healthcare executive | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/02/john-oliver-defamation-lawsuit-healthcare",
            "upvotes": 18124,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/beed2090a1681a048562802c0d69bcb6e8321211/343_297_3296_1977/master/3296.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f69132c8f0c4af080c75135db925c7ad",
            "top_comments": [
                ">The lawsuit argues that context cut from the show changes the meaning of Morley’s words, which they quote as thus: “In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”\n\nOh yeah, the full context makes it sound *so much* better.",
                "Oh yeah let's get to the discovery phases on this. \n\nPure Streisand Effect on this one.",
                "From the article:  A US [healthcare](https://www.theguardian.com/us-news/healthcare) executive has sued [John Oliver](https://www.theguardian.com/tv-and-radio/series/john-oliver-recap) for defamation following a Last Week Tonight [episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid), in which the British-American comedian quoted the doctor as saying it was okay for a patient with bowel issues to be “a little dirty for a couple of days”.\n\nDr Brian Morley, the ex-medical director of AmeriHealth Caritas, argues that Oliver – an outspoken comic whose show has not only [addressed muzzling lawsuits](https://www.theguardian.com/culture/2019/nov/11/john-oliver-last-week-tonight-lawsuits-murray-energy) but been subject to them – took the quote out of context in an [April 2024 episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid).\n\nThe suit against Oliver and the Last Week Tonight producers Partially Important Productions seeks unspecified damages “in an amount to be determined and in excess of $75,000”, according to [Deadline](https://deadline.com/2025/04/john-oliver-sued-defamation-healthcare-executive-1236356624/). It does not name Last Week Tonight’s broadcaster, HBO.",
                "good luck.  The \"Last Week Tonight\" legal team is airtight.",
                "So I read this like 3 times because I didn’t understand the context. \n\nSo it appears Oliver said that this doctor said it was fine for a disabled person to sit in their own shit for a few days. \n\nIn reality the doctor said its fine for a disabled person to sit in their own shit for a few days *unless for some reason sitting in shit would kill them.* \n\nLike dude- no one was thinking “oh that could kill them” they were thinking “that’s incredibly cruel.” \n\nOliver is going to have a lot of fun with this.",
                "I’m pretty sure Mr. Oliver and his attorneys are quite ready for this complaint.",
                "The full quote is not any better dude.",
                "We can all see what's coming:  \n\\- Dr. Brian Morley donates to Trump's PAC  \n\\- Trump revokes John Oliver's American citizenship",
                "The episode he did about Bob Murray after that defamation suit got withdrawn was gold. It's the first Last Week Tonight I show anyone.\n\nFor anyone who hasnt seen it\n\n[https://www.youtube.com/watch?v=UN8bJb8biZU](https://www.youtube.com/watch?v=UN8bJb8biZU)",
                "Sounds like it'll get tossed based on precedent:\n\n>In 2017, a West Virginia judge [tossed](https://www.avclub.com/judge-tosses-out-that-defamation-lawsuit-against-hbo-an-1823295045) a defamation suit filed against the comedian and his show by Bob Murray, the CEO of a coal company. The judge agreed with HBO’s argument that Oliver’s comments were either factual and sourced from various court documents, or clearly satirical and thus protected by the first amendment."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump announces sweeping new tariffs to promote US manufacturing, risking inflation and trade wars",
            "external_url": "https://apnews.com/article/trump-tariffs-liberation-day-2a031b3c16120a5672a6ddd01da09933",
            "upvotes": 42442,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Things are about to get a LOT more expensive.\n\nMeanwhile no, manufacturing will still not come back to US.  All companies will do is increase prices and pass them onto consumers.",
                "Here are the numbers:\n\n* A 10% baseline tax on imports from all countries and higher tariff rates on dozens of nations that run trade surpluses with the United States\n\n* 34% tax on imports from China\n\n* 20% tax on imports from the European Union\n\n* 25% on South Korea\n\n* 24% on Japan \n\n* and 32% on Taiwan.",
                "Don't even look at your 401K tomorrow.",
                "He’s calling it liberation day? \nWhat the fuck are we getting liberated from?",
                "President who campaigned on affordability announces 20% national sales tax. Conservatives cheer.\n\nI want off this ride.",
                "Nuking the economy to own the libs",
                "Holy hell are we about to get financially stomped.",
                "> “Taxpayers have been ripped off for more than 50 years,” Trump said in remarks at the White House. “But it is not going to happen anymore.”\n\nWho does he think suffers the economic burden of tariffs? 10-34% tariffs on all imports will have a brutal impact.",
                "This speech is pumping so much shit out into the atmosphere that it's going to rain diarrhea. How anyone can believe a goddamn word he says is incomprehensible.",
                "Trump take egg. Trump take Switch 2."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Stellantis idles plants in Mexico and Canada due to tariffs",
            "external_url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html",
            "upvotes": 450,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124412-1743531991434-gettyimages-2207473532-_C3A5390CR2.jpeg?v=1743532113&w=1920&h=1080",
            "top_comments": [
                "900 \"US-represented\" employees laid off as of Monday. That's working out great.",
                "Donald Trump is officially an international economic terrorist.",
                "Honestly with how poorly jeeps been doing and other stellantis brands, won’t be shocked if this is a good excuse to slim down and blame tariffs rather than own up to stellantis being absolute dogshit. Just bottom of the barrel quality, with top tier prices- again looking at you Jeep, and you grand Durango ermmm grand wagoneer. Way to wreck an iconic vehicle.",
                "Anyone tired of winning yet?",
                "When you let the \"dumb class\" from your school run our country this is the result.",
                "expect a lot more announcements like this one...",
                "Considering the current new car market, this may be a silver lining. The manufacturers don't have to worry too much on making new cars with so many sitting on the lots. If they're smart about this, they can retool, retrain, and up their Q.C. game. Just kidding, its stellantis.",
                "Stellantis was on the ropes already, at Dodge Hornet at 25% more dollars is simply not going to sell.",
                "American uprising against tariffs and economic terrorism by Trump is necessary to save our country.",
                "Ha get ur parts and ur tariff now aholes! ~ Stellantis"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 261,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Fuck. The poor surviving brother.",
                "Dude had a 4.0 GPA. What a waste of life. I hope Karmelo Anthony gets life for this. ",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "https://www.aol.com/texas-high-school-football-star-052514972.html",
                "That's wild how the father of the deceased is already saying he forgives the murderer. Hope they lock that pos up and let him rot tbh.",
                "[removed]",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge holds ICE agent in contempt after he detained suspect during a trial",
            "external_url": "https://apnews.com/article/boston-immigration-ice-municipal-court-due-process-f2d13626ffba28025a3e0314fa6ca908",
            "upvotes": 1222,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How is ice allowed to do this?  Can't they be charged for kidnapping?",
                "ICE thinks they are above the law. Fucks around and breaks the law, and finds out they are not. Good on this judge for holding them accountable. When ICE is not held accountable, we get people sent to El Salvador, which should not even be happening in the first place",
                "In Germany, the SA enforced Nazi racial policies through violence and intimidation; ICE enforces harsh immigration laws through raids, detentions, and family separations. The tactics have changed, but the role remains familiar.",
                "The ICE agents know they are lawless. They know they are backed by lawless goons. The agent held in contempt is one of them. This judge will be retaliated against.",
                "ICE is Trump's Brownshirt gestapo in action. They may say they're not Nazis, but they sure are operating from their playbook, right down to disappearing dissenters and \"unwanted people\" in the middle of the night.",
                "Who enforces the enforcers? \n\nNo one.... and we all are next.",
                "It's not clear to me what's supposed to happen when separate agencies arrest someone. It's not like currently being out on bail is a get out of any other jail free card.\n\nYes yes trump and ice are fully off the rails.",
                "Follow up headline:\n\nBoston Judge Held by ICE for Protecting Illegal Aliens.",
                "From the article:\n\n\"What we were challenging is that they arrested him in the middle of his trial and did not return him,” he said. “If he had been brought to court on Friday morning by ICE, we would not have moved to dismiss. We would not be asking for sanctions. We would have just finished the trial.”",
                "This article is just another example of once trusted news outlets playing politics. \n\nWilson Martell-Lebron WAS afforded due process. Not only is he here illegally, he has felony convictions for two counts of cocaine trafficking and one count of heroin trafficking, and a removal order by an immigration judge. The reason he was in court in front of this judge was because he lied about his identity to the Secretary of State. He knew if he gave his real name that his convictions and removal order would show up. Since states are refusing to work with federal agencies to remove ppl with felony convictions, how would people expect ICE to do their job? \n\nAn American with the same convictions would have essentially ruined their lives. At no point would there be misleading articles and public outrage for one of us. Hell, ask a black American if charges would ever be dropped for giving a false name. Someone needs to make this make sense."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "15-year-old girl attacked by sea lion in California",
            "external_url": "https://abcnews.go.com/US/15-year-girl-attacked-sea-lion-california/story?id=120369992",
            "upvotes": 11,
            "date": "04/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/625f69ff-3d58-4bb8-a93c-51ca1b212260/sea-lion-1-ht-er-250402_1743614646916_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "she's got a look on her face like \"fuck, now i'm gonna be on the news for being attacked by a sea lion\"",
                ">This incident comes after sea lions on the California coast have reportedly been displaying strange behavior, likely due to a harmful algae bloom impacting the region, according to marine researchers.\n\n[Early Bloom of Toxic Algae off Southern California Sickens Hundreds of Sea Lions and Dolphins](https://www.fisheries.noaa.gov/feature-story/early-bloom-toxic-algae-southern-california-sickens-hundreds-sea-lions-and-dolphins)\n\n*The culprit in the strandings is domoic acid, a neurotoxin produced by the harmful algae Pseudo-nitzschia that can multiply quickly in the right conditions. Wind-driven upwelling of deep ocean water provides nutrients that fuel California’s rich marine ecosystem. That same upwelling can also feed rapid growth of the algae and the toxin it produces.*\n\nIsn't this almost the plot of The Happening?",
                "They are basically feral ocean dogs.",
                "from the article:\n\n>Phoebe Beltran, 15, has always been a \"water baby,\" according to her mom, Bibi Beltran.\n\n>In the middle of competing in the 1,000-yard swim test, she felt pain in her right arm.\n\n>\"My initial reaction was, 'I'm getting eaten in the middle of the water, it's a shark, I'm going to die,'\" Phoebe Beltran told ABC News.\n\n>Phoebe Beltran immediately screamed for help, which is when the animal -- she later found out was a sea lion -- let go of her arm.\n\n>She was assisted back to the shore and a lifeguard boat patrolling the water brought all the other swimmers to safety, according to the Long Beach Fire Department.\n\n>\"As I was getting up onto shore, that's when I stood up, the lifeguards saw that my arm was bleeding, they took me to the sand and started fixing me up before sending me to the ER,\" Phoebe Beltran said.\n\n>Her mom heard the screams, but didn't think it was her daughter until she saw her arm gushing with blood.\n\n>\"I don't have the words to explain the panic in a mom's heart when they see their child like that,\" Bibi Beltran said. \"It was a rollercoaster of emotions.\"\n\n>Phoebe Beltran had bites \"localized to her arms and extremities\" and was taken to the local hospital, but \"did not require advanced treatment,\" officials said.\n\n>Phoebe Beltran said she did not do \"anything that provoked\" the sea lion and she would not have swum next to it if she had seen the animal.\n\n>\"It came out of nowhere, I was surprised by it and so were other people,\" Phoebe Beltran said."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "NEW",
            "title": "Carbon monoxide poisoning was the cause of death for former Yankees OF Brett Gardner’s teenage son",
            "external_url": "https://apnews.com/article/brett-gardner-son-yankees-death-costa-rica-7ffebf92542073d6b186e8d17fdff65f",
            "upvotes": 4,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 261,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Fuck. The poor surviving brother.",
                "Dude had a 4.0 GPA. What a waste of life. I hope Karmelo Anthony gets life for this. ",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "https://www.aol.com/texas-high-school-football-star-052514972.html",
                "That's wild how the father of the deceased is already saying he forgives the murderer. Hope they lock that pos up and let him rot tbh.",
                "[removed]",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 763,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "And none of the people involved with Signalgate",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "Seems like President poopy pants wants some of that handy candy",
                "Jigsaw gives T a BJ and as a result he fired people.  What an exciting episode of dumpster fire 2025.",
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "\"Come s my d and you can fire whoever you want\"",
                "It’s wild how much she turned herself into a goblin",
                "Nazis doing Nazi shit."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Volkswagen to introduce 'import fee' on tariff-hit cars, WSJ reports",
            "external_url": "https://www.reuters.com/business/autos-transportation/volkswagen-introduce-import-fee-tariff-hit-cars-wsj-reports-2025-04-03/",
            "upvotes": 104,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Call it \"Import fee\" or \"Trump Tax\" whatever.  Inflation is going to skyrocket.",
                "Imagine trying to sell imported cars during this chaotic timeline. It takes around 4 weeks for RORO boats to arrive loaded with new cars. Tariffs change overnight whenever Trump is bored. Good luck to businesses trying to project sales and turn a profit.",
                "Call it a Trump Tax you fucking pussies",
                "Weird, I've been assured through magical alchemy that tariffs would not impact the cost of goods and that Americans wouldn't bear the burden of them...  \n\nSurely the people who told me Mexico is going to buy us a wall wouldn't have lied again...",
                "Volkswagens were already not appealing before the tariffs, can’t imagine drooling over one after the tariffs"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Back to its Roots: Clearwater Founders Step in as Hooters Files for Bankruptcy",
            "external_url": "https://floridamedianow.com/2025/04/hooters-founders-step-in/",
            "upvotes": 75,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hooters are trying to rebrand as more family-friendly per this article. I suspect this won't work(not to mention all of the existing competition in that space).\n\nHooters isn't anything special foodwise, has an adult oriented reputation, but isn't a strip club. Maybe I'm being cynical here, but I don't like their chances.",
                "they just need to rebrand in to a strip mall wing joint",
                "Oh, so this wasn’t an April Fools thing then.",
                "I had a friend that worked her way through med school working there, back then the wings were really good too.",
                "Holy shit that's the new port richey location i used to drive my boat pst that place all the time when i lived in Florida ",
                "Someone’s going to save the most overrated wings/women? ",
                "There wings are chronic I hope this isn’t so"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Stellantis idles plants in Mexico and Canada due to tariffs",
            "external_url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html",
            "upvotes": 448,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124412-1743531991434-gettyimages-2207473532-_C3A5390CR2.jpeg?v=1743532113&w=1920&h=1080",
            "top_comments": [
                "900 \"US-represented\" employees laid off as of Monday. That's working out great.",
                "Donald Trump is officially an international economic terrorist.",
                "Honestly with how poorly jeeps been doing and other stellantis brands, won’t be shocked if this is a good excuse to slim down and blame tariffs rather than own up to stellantis being absolute dogshit. Just bottom of the barrel quality, with top tier prices- again looking at you Jeep, and you grand Durango ermmm grand wagoneer. Way to wreck an iconic vehicle.",
                "Anyone tired of winning yet?",
                "When you let the \"dumb class\" from your school run our country this is the result.",
                "expect a lot more announcements like this one...",
                "Considering the current new car market, this may be a silver lining. The manufacturers don't have to worry too much on making new cars with so many sitting on the lots. If they're smart about this, they can retool, retrain, and up their Q.C. game. Just kidding, its stellantis.",
                "Stellantis was on the ropes already, at Dodge Hornet at 25% more dollars is simply not going to sell.",
                "American uprising against tariffs and economic terrorism by Trump is necessary to save our country.",
                "Ha get ur parts and ur tariff now aholes! ~ Stellantis"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Russia bans Elton John Aids Foundation over its support for LGBTQ+ rights",
            "external_url": "https://www.theguardian.com/world/2025/apr/03/russia-bans-elton-john-aids-foundation-support-lgbtq-rights",
            "upvotes": 1239,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1da710a393dbb0652e80593d9269e27b7c00d37e/650_325_3498_2099/master/3498.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95b5f956c29a4cce2aa1334b39d2c5ff",
            "top_comments": [
                "I am now confused between America and Russia. Seems both countries now have the same policies.",
                "My wish is one day Putin & Trump are playing cards in The Hague.",
                "Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.",
                "Tomorrows Fox News Chryon: Impending US Recession caused by LGBTQ+ rights",
                "I expect the Trump White House to follow suit, though RFK Jr is getting a head start making things deadlier over here already.\n\nIt’s so strange living in the era of the idiotic supervillain.",
                "America will probably follow suit soon",
                "Stay classy Russia. Who are you invading next?",
                "#Saturday \n\n#Saturday\n\n#Saturday nights all right for fighting Nazis \n\n\n#SEE YOU IN THE STREETS APRIL 5",
                "I'm sure Sir Elton agrees with this message.",
                "Far right conservative governments always do this as a cover... so in other words Putin probably listens to Elton John while he's getting railed by male escorts."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
            "external_url": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
            "upvotes": 2682,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124184-17435157572025-04-01t134226z_383673798_rc21pdav4zv2_rtrmadp_0_usa-trump-health.jpeg?v=1743515784&w=1920&h=1080",
            "top_comments": [
                "Lmao and the stock market is in free fall to own the Libs.",
                "I'm beginning to understand how this MF bankrupted an effing CASINO!",
                "This bullshit is going to crush the business I work for. \nFuck everyone who voted for it.",
                "Donald Trump is a terrorist. He is literally destroying everything in America.\n\nIs Trump being controlled by Putin?",
                "Burning down the economy at both ends",
                "> “It would have otherwise been a fairly quiet month for layoffs.”\nHowever, DOGE has continued to cut aggressively across the government.\nVarious reports have indicated that the Veterans Affairs department could lose 80,000 jobs, the IRS is in line for some 18,000 reductions and Treasury is expected to drop a “substantial” level of workers as well, according to a court filing.\nThe year to date tally for federal government announced layoffs represents a 672% increase from the same period in 2024, according to Challenger.\n\nA 672% increase is painful. Unemployment claims are going to take much longer, and people are going to struggle to find new jobs in an oversaturated market. Especially here in the DMW area.",
                "The funny thing is Al Gore slashed 400,000 jobs from the federal government under Clinton,  through a combination of voluntary departures, attrition and a relatively small number of layoffs, but he did it in partnership with the agencies and wasn't sued once. Coincidentally, that was the last time the country had a budget surplus.",
                "> U.S.-based employers announced 275,240 job cuts in March\n\n> Of that total, 216,670 were due to “DOGE Actions”\n\n> job cut announcements rose 60% month-on-month, and were 205% higher than in March 2024.\n\n> That’s a record high for any March, and the third-highest monthly total ever recorded.\n\n[Source](https://www.theguardian.com/us-news/live/2025/apr/03/business-news-live-updates-trump-tarrifs-asian-markets-nikkei-asx-wall-st-dow-jones-dollar-euro?page=with%3Ablock-67ee73148f08dc205ac3569c#block-67ee73148f08dc205ac3569c)",
                "And it's not even going to be saving the government money thanks to all the lost revenues",
                "Depression Donnie is just getting started."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 13750,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "I cannot imagine living in a country where you have to take with you an item solely designed for taking another humans life with you at all times to the point where you *forget you have it on you*, just to feel safe.",
                "One of the safest countries I have ever been to.",
                "how do people \"forget\" where a gun is?",
                "Jesus.  What is it with people and their damn guns??  It wasn’t even like this in the. “Wild West” days."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 752,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "And none of the people involved with Signalgate",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "Seems like President poopy pants wants some of that handy candy",
                "Jigsaw gives T a BJ and as a result he fired people.  What an exciting episode of dumpster fire 2025.",
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "\"Come s my d and you can fire whoever you want\"",
                "It’s wild how much she turned herself into a goblin",
                "Nazis doing Nazi shit."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Russia bans Elton John Aids Foundation over its support for LGBTQ+ rights",
            "external_url": "https://www.theguardian.com/world/2025/apr/03/russia-bans-elton-john-aids-foundation-support-lgbtq-rights",
            "upvotes": 1241,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1da710a393dbb0652e80593d9269e27b7c00d37e/650_325_3498_2099/master/3498.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95b5f956c29a4cce2aa1334b39d2c5ff",
            "top_comments": [
                "I am now confused between America and Russia. Seems both countries now have the same policies.",
                "My wish is one day Putin & Trump are playing cards in The Hague.",
                "Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.",
                "Tomorrows Fox News Chryon: Impending US Recession caused by LGBTQ+ rights",
                "I expect the Trump White House to follow suit, though RFK Jr is getting a head start making things deadlier over here already.\n\nIt’s so strange living in the era of the idiotic supervillain.",
                "America will probably follow suit soon",
                "Stay classy Russia. Who are you invading next?",
                "#Saturday \n\n#Saturday\n\n#Saturday nights all right for fighting Nazis \n\n\n#SEE YOU IN THE STREETS APRIL 5",
                "I'm sure Sir Elton agrees with this message.",
                "Far right conservative governments always do this as a cover... so in other words Putin probably listens to Elton John while he's getting railed by male escorts."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
            "external_url": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
            "upvotes": 2683,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124184-17435157572025-04-01t134226z_383673798_rc21pdav4zv2_rtrmadp_0_usa-trump-health.jpeg?v=1743515784&w=1920&h=1080",
            "top_comments": [
                "Lmao and the stock market is in free fall to own the Libs.",
                "I'm beginning to understand how this MF bankrupted an effing CASINO!",
                "This bullshit is going to crush the business I work for. \nFuck everyone who voted for it.",
                "Donald Trump is a terrorist. He is literally destroying everything in America.\n\nIs Trump being controlled by Putin?",
                "Burning down the economy at both ends",
                "> “It would have otherwise been a fairly quiet month for layoffs.”\nHowever, DOGE has continued to cut aggressively across the government.\nVarious reports have indicated that the Veterans Affairs department could lose 80,000 jobs, the IRS is in line for some 18,000 reductions and Treasury is expected to drop a “substantial” level of workers as well, according to a court filing.\nThe year to date tally for federal government announced layoffs represents a 672% increase from the same period in 2024, according to Challenger.\n\nA 672% increase is painful. Unemployment claims are going to take much longer, and people are going to struggle to find new jobs in an oversaturated market. Especially here in the DMW area.",
                "The funny thing is Al Gore slashed 400,000 jobs from the federal government under Clinton,  through a combination of voluntary departures, attrition and a relatively small number of layoffs, but he did it in partnership with the agencies and wasn't sued once. Coincidentally, that was the last time the country had a budget surplus.",
                "> U.S.-based employers announced 275,240 job cuts in March\n\n> Of that total, 216,670 were due to “DOGE Actions”\n\n> job cut announcements rose 60% month-on-month, and were 205% higher than in March 2024.\n\n> That’s a record high for any March, and the third-highest monthly total ever recorded.\n\n[Source](https://www.theguardian.com/us-news/live/2025/apr/03/business-news-live-updates-trump-tarrifs-asian-markets-nikkei-asx-wall-st-dow-jones-dollar-euro?page=with%3Ablock-67ee73148f08dc205ac3569c#block-67ee73148f08dc205ac3569c)",
                "And it's not even going to be saving the government money thanks to all the lost revenues",
                "Depression Donnie is just getting started."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 268,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Fuck. The poor surviving brother.",
                "Dude had a 4.0 GPA. What a waste of life. I hope Karmelo Anthony gets life for this. ",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "https://www.aol.com/texas-high-school-football-star-052514972.html",
                "That's wild how the father of the deceased is already saying he forgives the murderer. Hope they lock that pos up and let him rot tbh.",
                "[removed]",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Stellantis idles plants in Mexico and Canada due to tariffs",
            "external_url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html",
            "upvotes": 448,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124412-1743531991434-gettyimages-2207473532-_C3A5390CR2.jpeg?v=1743532113&w=1920&h=1080",
            "top_comments": [
                "900 \"US-represented\" employees laid off as of Monday. That's working out great.",
                "Donald Trump is officially an international economic terrorist.",
                "Honestly with how poorly jeeps been doing and other stellantis brands, won’t be shocked if this is a good excuse to slim down and blame tariffs rather than own up to stellantis being absolute dogshit. Just bottom of the barrel quality, with top tier prices- again looking at you Jeep, and you grand Durango ermmm grand wagoneer. Way to wreck an iconic vehicle.",
                "Anyone tired of winning yet?",
                "When you let the \"dumb class\" from your school run our country this is the result.",
                "expect a lot more announcements like this one...",
                "Considering the current new car market, this may be a silver lining. The manufacturers don't have to worry too much on making new cars with so many sitting on the lots. If they're smart about this, they can retool, retrain, and up their Q.C. game. Just kidding, its stellantis.",
                "Stellantis was on the ropes already, at Dodge Hornet at 25% more dollars is simply not going to sell.",
                "American uprising against tariffs and economic terrorism by Trump is necessary to save our country.",
                "Ha get ur parts and ur tariff now aholes! ~ Stellantis"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 13776,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "I cannot imagine living in a country where you have to take with you an item solely designed for taking another humans life with you at all times to the point where you *forget you have it on you*, just to feel safe.",
                "One of the safest countries I have ever been to.",
                "how do people \"forget\" where a gun is?",
                "Jesus.  What is it with people and their damn guns??  It wasn’t even like this in the. “Wild West” days."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Judge holds ICE agent in contempt after he detained suspect during a trial",
            "external_url": "https://apnews.com/article/boston-immigration-ice-municipal-court-due-process-f2d13626ffba28025a3e0314fa6ca908",
            "upvotes": 1223,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How is ice allowed to do this?  Can't they be charged for kidnapping?",
                "ICE thinks they are above the law. Fucks around and breaks the law, and finds out they are not. Good on this judge for holding them accountable. When ICE is not held accountable, we get people sent to El Salvador, which should not even be happening in the first place",
                "In Germany, the SA enforced Nazi racial policies through violence and intimidation; ICE enforces harsh immigration laws through raids, detentions, and family separations. The tactics have changed, but the role remains familiar.",
                "The ICE agents know they are lawless. They know they are backed by lawless goons. The agent held in contempt is one of them. This judge will be retaliated against.",
                "ICE is Trump's Brownshirt gestapo in action. They may say they're not Nazis, but they sure are operating from their playbook, right down to disappearing dissenters and \"unwanted people\" in the middle of the night.",
                "Who enforces the enforcers? \n\nNo one.... and we all are next.",
                "It's not clear to me what's supposed to happen when separate agencies arrest someone. It's not like currently being out on bail is a get out of any other jail free card.\n\nYes yes trump and ice are fully off the rails.",
                "Follow up headline:\n\nBoston Judge Held by ICE for Protecting Illegal Aliens.",
                "From the article:\n\n\"What we were challenging is that they arrested him in the middle of his trial and did not return him,” he said. “If he had been brought to court on Friday morning by ICE, we would not have moved to dismiss. We would not be asking for sanctions. We would have just finished the trial.”",
                "This article is just another example of once trusted news outlets playing politics. \n\nWilson Martell-Lebron WAS afforded due process. Not only is he here illegally, he has felony convictions for two counts of cocaine trafficking and one count of heroin trafficking, and a removal order by an immigration judge. The reason he was in court in front of this judge was because he lied about his identity to the Secretary of State. He knew if he gave his real name that his convictions and removal order would show up. Since states are refusing to work with federal agencies to remove ppl with felony convictions, how would people expect ICE to do their job? \n\nAn American with the same convictions would have essentially ruined their lives. At no point would there be misleading articles and public outrage for one of us. Hell, ask a black American if charges would ever be dropped for giving a false name. Someone needs to make this make sense."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Stock futures plunge as investors digest Trump’s tariffs",
            "external_url": "https://www.cnn.com/2025/04/02/business/us-stock-market/index.html",
            "upvotes": 8808,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25090525469541.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Hey guys, I think this Trump guy may be a fucking idiot. ",
                "Trump is screwing up my retirement plans.",
                "Someone tell me how this is winning",
                "The guy who bankrupted his own casino is not good at this economy thing. Who could have guessed?",
                "I'm tired of this take that the markets rallied ahead of Trump's tariffs. The markets rallied on the news that Musk will be leaving government soon.",
                "This is the beginning of a recession. Brace yourself.",
                "Really interesting how Doge is asking everyone to retire early on this fucking shit.",
                "…did they not see this coming? I feel like they would have already reacted to the threat, no?",
                "Who is this even for? Who wants this?",
                "The Trump Dump\n\nRepublicans fucking it up and will blame it on Dems"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "John Oliver faces defamation lawsuit from US healthcare executive | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/02/john-oliver-defamation-lawsuit-healthcare",
            "upvotes": 18124,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/beed2090a1681a048562802c0d69bcb6e8321211/343_297_3296_1977/master/3296.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f69132c8f0c4af080c75135db925c7ad",
            "top_comments": [
                ">The lawsuit argues that context cut from the show changes the meaning of Morley’s words, which they quote as thus: “In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”\n\nOh yeah, the full context makes it sound *so much* better.",
                "Oh yeah let's get to the discovery phases on this. \n\nPure Streisand Effect on this one.",
                "From the article:  A US [healthcare](https://www.theguardian.com/us-news/healthcare) executive has sued [John Oliver](https://www.theguardian.com/tv-and-radio/series/john-oliver-recap) for defamation following a Last Week Tonight [episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid), in which the British-American comedian quoted the doctor as saying it was okay for a patient with bowel issues to be “a little dirty for a couple of days”.\n\nDr Brian Morley, the ex-medical director of AmeriHealth Caritas, argues that Oliver – an outspoken comic whose show has not only [addressed muzzling lawsuits](https://www.theguardian.com/culture/2019/nov/11/john-oliver-last-week-tonight-lawsuits-murray-energy) but been subject to them – took the quote out of context in an [April 2024 episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid).\n\nThe suit against Oliver and the Last Week Tonight producers Partially Important Productions seeks unspecified damages “in an amount to be determined and in excess of $75,000”, according to [Deadline](https://deadline.com/2025/04/john-oliver-sued-defamation-healthcare-executive-1236356624/). It does not name Last Week Tonight’s broadcaster, HBO.",
                "good luck.  The \"Last Week Tonight\" legal team is airtight.",
                "So I read this like 3 times because I didn’t understand the context. \n\nSo it appears Oliver said that this doctor said it was fine for a disabled person to sit in their own shit for a few days. \n\nIn reality the doctor said its fine for a disabled person to sit in their own shit for a few days *unless for some reason sitting in shit would kill them.* \n\nLike dude- no one was thinking “oh that could kill them” they were thinking “that’s incredibly cruel.” \n\nOliver is going to have a lot of fun with this.",
                "I’m pretty sure Mr. Oliver and his attorneys are quite ready for this complaint.",
                "The full quote is not any better dude.",
                "We can all see what's coming:  \n\\- Dr. Brian Morley donates to Trump's PAC  \n\\- Trump revokes John Oliver's American citizenship",
                "The episode he did about Bob Murray after that defamation suit got withdrawn was gold. It's the first Last Week Tonight I show anyone.\n\nFor anyone who hasnt seen it\n\n[https://www.youtube.com/watch?v=UN8bJb8biZU](https://www.youtube.com/watch?v=UN8bJb8biZU)",
                "Sounds like it'll get tossed based on precedent:\n\n>In 2017, a West Virginia judge [tossed](https://www.avclub.com/judge-tosses-out-that-defamation-lawsuit-against-hbo-an-1823295045) a defamation suit filed against the comedian and his show by Bob Murray, the CEO of a coal company. The judge agreed with HBO’s argument that Oliver’s comments were either factual and sourced from various court documents, or clearly satirical and thus protected by the first amendment."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump announces sweeping new tariffs to promote US manufacturing, risking inflation and trade wars",
            "external_url": "https://apnews.com/article/trump-tariffs-liberation-day-2a031b3c16120a5672a6ddd01da09933",
            "upvotes": 42449,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Things are about to get a LOT more expensive.\n\nMeanwhile no, manufacturing will still not come back to US.  All companies will do is increase prices and pass them onto consumers.",
                "Here are the numbers:\n\n* A 10% baseline tax on imports from all countries and higher tariff rates on dozens of nations that run trade surpluses with the United States\n\n* 34% tax on imports from China\n\n* 20% tax on imports from the European Union\n\n* 25% on South Korea\n\n* 24% on Japan \n\n* and 32% on Taiwan.",
                "Don't even look at your 401K tomorrow.",
                "He’s calling it liberation day? \nWhat the fuck are we getting liberated from?",
                "President who campaigned on affordability announces 20% national sales tax. Conservatives cheer.\n\nI want off this ride.",
                "Nuking the economy to own the libs",
                "Holy hell are we about to get financially stomped.",
                "> “Taxpayers have been ripped off for more than 50 years,” Trump said in remarks at the White House. “But it is not going to happen anymore.”\n\nWho does he think suffers the economic burden of tariffs? 10-34% tariffs on all imports will have a brutal impact.",
                "This speech is pumping so much shit out into the atmosphere that it's going to rain diarrhea. How anyone can believe a goddamn word he says is incomprehensible.",
                "Trump take egg. Trump take Switch 2."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "04/03/2025 16:10:23 UTC"
}