{
    "posts": [
        {
            "category": "HOT",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 4131,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.",
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "Is this winning and bringing manufacturing back to America…..?",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                "This is what bringing manufacturing back to America looks like?!",
                "This is a sign of an impending recession."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 2009,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Islam trying to keep women from having rights...\n\nCan't say I'm shocked...\n\nThe muslim religion is stuck in ~~5AD~~ 610CE...  \n\nedit:  corrected the start date of Islam, thanks @[Alternative\\_Pin\\_7551](https://www.reddit.com/user/Alternative_Pin_7551/)",
                "Again, the religion of so-called “peace” and “tolerance”.\n\nThis religion is antithetical to Western values and need to stay away from Western countries",
                "Mostly peaceful religion",
                "I’ve said it in another post. Just a bunch of weak men that cant get a woman without them being enslaved.",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 32826,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "I had discitis after spine surgery it was the most painful thing I have ever ever in my life ever expeirenced.  Not one doctor believed me they all said I was drug seeking and told me to go to rehab.  I got to the point the pain was so bad that I would pass out from going from a laying to a sitting position.  My 5th visit to emerg a doctor finally believed me.  I was admitted to hospital for 8 months, had to be on a picc line for 18 months with constant infusion of antibiotics.  Because I was not treated for 6 weeks the infection had gotten so bad it went from the surgical site at l4 all the way to my c7.  I could no longer walk and had to use a wheelchair for 2 years.  I had to have 80 k in renos to my house to accomodate a wheelchair.  It took me 2 years to go back to work and 10 years to be out of the wheelchair.  All because 3 different doctors including the surgeon all thought I was a pill head looking for opiates.",
                "The discrimination towards younger patients is honestly sad",
                "In Canada a friend of mine in her late 20s knew she was at risk of breast cancer but couldn't find any place that would give her a preventative mastectomy without also booking in expensive reconstructive surgery which she couldn't afford. She died from breast cancer a few years later.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Putin, 72, says the succession is always on his mind",
            "external_url": "https://www.reuters.com/world/europe/putin-72-says-succession-is-always-his-mind-2025-05-04/",
            "upvotes": 853,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "His death is always on my mind",
                "Hope that cunt never has a moments peace and is constantly looking over his shoulder for the rest of his hopefully few remaining days ",
                "Putin, 72, ..... DAMN IT!",
                "It was such a good series",
                "I thought succession wasn’t a thing where people “vote” 😂",
                "He has no plans on giving up power any time soon. This is just more bait to keep his loyalists at his beck  and call.",
                "Maybe mistranslated and he meant war crimes?",
                "I think he deserves a nice retirement soon, a bit like Gaddafi's.",
                "Because he never had a son. You could argue the world is fucked today because he is worried about his daughters' futures.",
                "What happened to all of the talk about him having cancer, or having Parkinson's? It seems like a few year back, everyone was saying he was terminally ill."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Secretariat horse racing: Every horse in 2025 Kentucky Derby is descendant of legendary Triple Crown winner",
            "external_url": "https://www.cbssports.com/general/news/secretariat-horse-racing-every-horse-in-2025-kentucky-derby-is-descendant-of-legendary-triple-crown-winner/",
            "upvotes": 488,
            "date": "05/04/2025",
            "thumbnail": "https://sportshub.cbsistatic.com/i/r/2025/05/03/ca8b7c0a-2ad0-4f4d-a839-ce861925960e/thumbnail/1200x675/46c2a5c9b943da2a7d06891d36190711/gettyimages-84388880.jpg",
            "top_comments": [
                "Horse racing’s Genghis Khan",
                "Talk about sibling rivalry ...",
                "Never knew it was such an incestuous industry.",
                "There will never be another horse like Secretariat. His Belmont win? Are you kidding me: [“…Moving like a tremendous machine!”](https://youtu.be/AG_27cCW5bw?si=KYcDX_I6OHkOxF8d)",
                "\"As the trainer of one of his opponents put it, 'The only chance we have is if he falls down.' \"\n\nSecretariat was unmatched. There's a reason his name is still known worldwide 35y after his death.",
                "Lexington in particular is an… interesting place. Even smaller (think standard ranch/bungalow/whatever), will have a horse or two. Obviously not EVERY home, but enough for you to notice the trend.",
                "Who’s that at the Door ?!!!!!\n\nhttps://youtu.be/bvlrvgus0Ww?si=1YVzGQh5-TYblQd6",
                "Weird. My recollection was that Secretariat was a terrible stud horse.  Maybe it was just the first generation.  He sired a lot but was not as successful as Northern Dancer.",
                "They're going to do this with HorseRaceTesting. Fearsome Fate will be used to make the next generation",
                "And they'll all be dead in two years tops."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 341,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Why would they tin foil a bomb?\n\nEdit: Downvoted for asking a serious question. Cool."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 2556,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "> Several years ago when the government shut down for 35 days the FAA was required to close its training academy and missed its original hiring target by over 500 trainees… Once training resumed, the FAA reduced its FY 2019 controller hiring target by more than one-third (from 1,431 down to 907), and its staffing numbers never recovered,\" he said.\n\n[Chickens coming home to roost](https://www.nbcwashington.com/news/national-international/air-traffic-control-centers-understaffed-doge-layoffs/3870270/)\n\nATC and USPS are the poster children of the GOP strategy of sabatoging our national institutions in order to claim they don't work.",
                "White House suggests “really high” traffic lights.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                "I seriously can’t imagine the stress of being an EWR controller, not even for 500k a year yet along 200k a year. (Jersey is crazy expensive) with the scheduling and hours? Nope… maybe it’s cool for some people, but not me. Somewhere in Montana? Yeah, sign me up. \n\nThere is a much better way to do this, but, nah…",
                "The chickens are coming home",
                "Maybe stop trying to cut their benefits",
                "If this clown-car administration was actually serious about anything, addressing this issue would be one of the easiest places to start.\n\nHowever, because they have no actual policy strategy other than sowing discord through incompetency and chaos, they have no ability to fix anything and no one in their right mind would trust any intention of theirs to do anything correctly and safely. Who would want \"supercharged\" trainees (and who would want to be one?) in these positions, especially at one of the busiest airports in the country?",
                "Maybe electing an unqualified moron with a bone to pick against the world was a bad idea."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 25890,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "Very sad story the cop wasn't even involved",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 6631,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 3830,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "I wish they would charge these rapists in the prime of their life instead of when they’re in the worst health of their life and knocking on deaths door",
                "Looks like Nic Cage in Longlegs",
                "[removed]",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "100% predator. He got off easy. Fucker.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 340,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Why would they tin foil a bomb?\n\nEdit: Downvoted for asking a serious question. Cool."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Starbase: Elon Musk’s SpaceX launch site becomes an official Texas city",
            "external_url": "https://apnews.com/article/elon-musk-starbase-texas-city-7863bf3bac65e9718eef19b27978933b",
            "upvotes": 125,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "15 years from now:  How did a small Texas town became the largest Superfund site.",
                "How many weeks til employees are paid in scrip?",
                "https://en.wikipedia.org/wiki/Company_town \n\n[Sixteen Tons · Tennessee Ernie Ford](https://www.youtube.com/watch?v=BSvORvIjZiU)",
                "Company towns are back then. They were so great for everyone living in them last time. /s.",
                "Good, now let’s pack all of MAGA into Texas and Florida and pull a bugs bunny and saw along the state lines and send them seawarding.",
                "Didn't Republicans hate on Disney just last year or so because they ran a lot of services at their location that were normally done by the city, defacto making them their own city?",
                "Can’t wait for “Ketamine Days”!",
                "Yet another reason to avoid Texas.",
                "And the seeds have been sown here in America. The techno-fascist oligarchs are one step closer to realizing their network states.",
                "Guess we won't have to wait till mars to see what dystopian society musk has planned."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Putin, 72, says the succession is always on his mind",
            "external_url": "https://www.reuters.com/world/europe/putin-72-says-succession-is-always-his-mind-2025-05-04/",
            "upvotes": 857,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "His death is always on my mind",
                "Hope that cunt never has a moments peace and is constantly looking over his shoulder for the rest of his hopefully few remaining days ",
                "Putin, 72, ..... DAMN IT!",
                "It was such a good series",
                "I thought succession wasn’t a thing where people “vote” 😂",
                "He has no plans on giving up power any time soon. This is just more bait to keep his loyalists at his beck  and call.",
                "Maybe mistranslated and he meant war crimes?",
                "I think he deserves a nice retirement soon, a bit like Gaddafi's.",
                "Because he never had a son. You could argue the world is fucked today because he is worried about his daughters' futures.",
                "What happened to all of the talk about him having cancer, or having Parkinson's? It seems like a few year back, everyone was saying he was terminally ill."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Colorado May Become The First State In Years To Pass A Law Winning The Battle Against Imported Car Bans - The Autopian",
            "external_url": "https://www.theautopian.com/colorado-may-become-the-first-state-in-years-to-pass-a-law-winning-the-battle-against-imported-car-bans/",
            "upvotes": 135,
            "date": "05/04/2025",
            "thumbnail": "https://images-stag.jazelc.com/uploads/theautopian-m2en/Colorado_Kei_Law_TS.jpg",
            "top_comments": [
                "I really want one of those cute Japanese trucks",
                "I'd love to have something more economical than the tanks coming from Ford, Dodge, and Chevy.",
                "I have no idea what that headline is trying to say. Are they banning imported cars or banning a ban of importing cars?",
                "I guess we are past the point where news at least tried to separate reporting from opinion pieces. I don’t care much about the policy, but the way this was written has the opposite effect on me as the author probably intended. “The poor enthusiasts living a nightmare because of the evil DMV”. C’mon. Its not like the dmv stole their candy. The “enthusiasts” imported weird tiny cars and are having a hard time getting them past smog and safety checks so they can drive them in traffic amongst the rest of us. Sounds pretty reasonable to me. Is it “shadow banned” or is it just the few underpaid workers at the dmv arent set up for some nonstandard vehicles that havent been certified before? There’s probably one dude in the state that inspects custom made vehicles. I never thought Id be siding with the dmv on an issue but the way this article was written gave me the irk.\n\nEdit: 1) my point is more about how this article was written and 2) Kei trucks do not meet the Federal Motor Vehicle Safety Standards."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 4133,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.",
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "Is this winning and bringing manufacturing back to America…..?",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                "This is what bringing manufacturing back to America looks like?!",
                "This is a sign of an impending recession."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Secretariat horse racing: Every horse in 2025 Kentucky Derby is descendant of legendary Triple Crown winner",
            "external_url": "https://www.cbssports.com/general/news/secretariat-horse-racing-every-horse-in-2025-kentucky-derby-is-descendant-of-legendary-triple-crown-winner/",
            "upvotes": 490,
            "date": "05/04/2025",
            "thumbnail": "https://sportshub.cbsistatic.com/i/r/2025/05/03/ca8b7c0a-2ad0-4f4d-a839-ce861925960e/thumbnail/1200x675/46c2a5c9b943da2a7d06891d36190711/gettyimages-84388880.jpg",
            "top_comments": [
                "Horse racing’s Genghis Khan",
                "Talk about sibling rivalry ...",
                "Never knew it was such an incestuous industry.",
                "There will never be another horse like Secretariat. His Belmont win? Are you kidding me: [“…Moving like a tremendous machine!”](https://youtu.be/AG_27cCW5bw?si=KYcDX_I6OHkOxF8d)",
                "\"As the trainer of one of his opponents put it, 'The only chance we have is if he falls down.' \"\n\nSecretariat was unmatched. There's a reason his name is still known worldwide 35y after his death.",
                "Lexington in particular is an… interesting place. Even smaller (think standard ranch/bungalow/whatever), will have a horse or two. Obviously not EVERY home, but enough for you to notice the trend.",
                "Who’s that at the Door ?!!!!!\n\nhttps://youtu.be/bvlrvgus0Ww?si=1YVzGQh5-TYblQd6",
                "Weird. My recollection was that Secretariat was a terrible stud horse.  Maybe it was just the first generation.  He sired a lot but was not as successful as Northern Dancer.",
                "They're going to do this with HorseRaceTesting. Fearsome Fate will be used to make the next generation",
                "And they'll all be dead in two years tops."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 2012,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Islam trying to keep women from having rights...\n\nCan't say I'm shocked...\n\nThe muslim religion is stuck in ~~5AD~~ 610CE...  \n\nedit:  corrected the start date of Islam, thanks @[Alternative\\_Pin\\_7551](https://www.reddit.com/user/Alternative_Pin_7551/)",
                "Again, the religion of so-called “peace” and “tolerance”.\n\nThis religion is antithetical to Western values and need to stay away from Western countries",
                "Mostly peaceful religion",
                "I’ve said it in another post. Just a bunch of weak men that cant get a woman without them being enslaved.",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 2550,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "> Several years ago when the government shut down for 35 days the FAA was required to close its training academy and missed its original hiring target by over 500 trainees… Once training resumed, the FAA reduced its FY 2019 controller hiring target by more than one-third (from 1,431 down to 907), and its staffing numbers never recovered,\" he said.\n\n[Chickens coming home to roost](https://www.nbcwashington.com/news/national-international/air-traffic-control-centers-understaffed-doge-layoffs/3870270/)\n\nATC and USPS are the poster children of the GOP strategy of sabatoging our national institutions in order to claim they don't work.",
                "White House suggests “really high” traffic lights.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                "I seriously can’t imagine the stress of being an EWR controller, not even for 500k a year yet along 200k a year. (Jersey is crazy expensive) with the scheduling and hours? Nope… maybe it’s cool for some people, but not me. Somewhere in Montana? Yeah, sign me up. \n\nThere is a much better way to do this, but, nah…",
                "The chickens are coming home",
                "Maybe stop trying to cut their benefits",
                "If this clown-car administration was actually serious about anything, addressing this issue would be one of the easiest places to start.\n\nHowever, because they have no actual policy strategy other than sowing discord through incompetency and chaos, they have no ability to fix anything and no one in their right mind would trust any intention of theirs to do anything correctly and safely. Who would want \"supercharged\" trainees (and who would want to be one?) in these positions, especially at one of the busiest airports in the country?",
                "Maybe electing an unqualified moron with a bone to pick against the world was a bad idea."
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "NEW",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 32824,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "I had discitis after spine surgery it was the most painful thing I have ever ever in my life ever expeirenced.  Not one doctor believed me they all said I was drug seeking and told me to go to rehab.  I got to the point the pain was so bad that I would pass out from going from a laying to a sitting position.  My 5th visit to emerg a doctor finally believed me.  I was admitted to hospital for 8 months, had to be on a picc line for 18 months with constant infusion of antibiotics.  Because I was not treated for 6 weeks the infection had gotten so bad it went from the surgical site at l4 all the way to my c7.  I could no longer walk and had to use a wheelchair for 2 years.  I had to have 80 k in renos to my house to accomodate a wheelchair.  It took me 2 years to go back to work and 10 years to be out of the wheelchair.  All because 3 different doctors including the surgeon all thought I was a pill head looking for opiates.",
                "The discrimination towards younger patients is honestly sad",
                "In Canada a friend of mine in her late 20s knew she was at risk of breast cancer but couldn't find any place that would give her a preventative mastectomy without also booking in expensive reconstructive surgery which she couldn't afford. She died from breast cancer a few years later.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 3839,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "I wish they would charge these rapists in the prime of their life instead of when they’re in the worst health of their life and knocking on deaths door",
                "Looks like Nic Cage in Longlegs",
                "[removed]",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "100% predator. He got off easy. Fucker.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 340,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Why would they tin foil a bomb?\n\nEdit: Downvoted for asking a serious question. Cool."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 4132,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.",
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "Is this winning and bringing manufacturing back to America…..?",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                "This is what bringing manufacturing back to America looks like?!",
                "This is a sign of an impending recession."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 2014,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Islam trying to keep women from having rights...\n\nCan't say I'm shocked...\n\nThe muslim religion is stuck in ~~5AD~~ 610CE...  \n\nedit:  corrected the start date of Islam, thanks @[Alternative\\_Pin\\_7551](https://www.reddit.com/user/Alternative_Pin_7551/)",
                "Again, the religion of so-called “peace” and “tolerance”.\n\nThis religion is antithetical to Western values and need to stay away from Western countries",
                "Mostly peaceful religion",
                "I’ve said it in another post. Just a bunch of weak men that cant get a woman without them being enslaved.",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Secretariat horse racing: Every horse in 2025 Kentucky Derby is descendant of legendary Triple Crown winner",
            "external_url": "https://www.cbssports.com/general/news/secretariat-horse-racing-every-horse-in-2025-kentucky-derby-is-descendant-of-legendary-triple-crown-winner/",
            "upvotes": 490,
            "date": "05/04/2025",
            "thumbnail": "https://sportshub.cbsistatic.com/i/r/2025/05/03/ca8b7c0a-2ad0-4f4d-a839-ce861925960e/thumbnail/1200x675/46c2a5c9b943da2a7d06891d36190711/gettyimages-84388880.jpg",
            "top_comments": [
                "Horse racing’s Genghis Khan",
                "Talk about sibling rivalry ...",
                "Never knew it was such an incestuous industry.",
                "There will never be another horse like Secretariat. His Belmont win? Are you kidding me: [“…Moving like a tremendous machine!”](https://youtu.be/AG_27cCW5bw?si=KYcDX_I6OHkOxF8d)",
                "\"As the trainer of one of his opponents put it, 'The only chance we have is if he falls down.' \"\n\nSecretariat was unmatched. There's a reason his name is still known worldwide 35y after his death.",
                "Lexington in particular is an… interesting place. Even smaller (think standard ranch/bungalow/whatever), will have a horse or two. Obviously not EVERY home, but enough for you to notice the trend.",
                "Who’s that at the Door ?!!!!!\n\nhttps://youtu.be/bvlrvgus0Ww?si=1YVzGQh5-TYblQd6",
                "Weird. My recollection was that Secretariat was a terrible stud horse.  Maybe it was just the first generation.  He sired a lot but was not as successful as Northern Dancer.",
                "They're going to do this with HorseRaceTesting. Fearsome Fate will be used to make the next generation",
                "And they'll all be dead in two years tops."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Putin, 72, says the succession is always on his mind",
            "external_url": "https://www.reuters.com/world/europe/putin-72-says-succession-is-always-his-mind-2025-05-04/",
            "upvotes": 860,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "His death is always on my mind",
                "Hope that cunt never has a moments peace and is constantly looking over his shoulder for the rest of his hopefully few remaining days ",
                "Putin, 72, ..... DAMN IT!",
                "It was such a good series",
                "I thought succession wasn’t a thing where people “vote” 😂",
                "He has no plans on giving up power any time soon. This is just more bait to keep his loyalists at his beck  and call.",
                "Maybe mistranslated and he meant war crimes?",
                "I think he deserves a nice retirement soon, a bit like Gaddafi's.",
                "Because he never had a son. You could argue the world is fucked today because he is worried about his daughters' futures.",
                "What happened to all of the talk about him having cancer, or having Parkinson's? It seems like a few year back, everyone was saying he was terminally ill."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 32827,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "I had discitis after spine surgery it was the most painful thing I have ever ever in my life ever expeirenced.  Not one doctor believed me they all said I was drug seeking and told me to go to rehab.  I got to the point the pain was so bad that I would pass out from going from a laying to a sitting position.  My 5th visit to emerg a doctor finally believed me.  I was admitted to hospital for 8 months, had to be on a picc line for 18 months with constant infusion of antibiotics.  Because I was not treated for 6 weeks the infection had gotten so bad it went from the surgical site at l4 all the way to my c7.  I could no longer walk and had to use a wheelchair for 2 years.  I had to have 80 k in renos to my house to accomodate a wheelchair.  It took me 2 years to go back to work and 10 years to be out of the wheelchair.  All because 3 different doctors including the surgeon all thought I was a pill head looking for opiates.",
                "The discrimination towards younger patients is honestly sad",
                "In Canada a friend of mine in her late 20s knew she was at risk of breast cancer but couldn't find any place that would give her a preventative mastectomy without also booking in expensive reconstructive surgery which she couldn't afford. She died from breast cancer a few years later.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 2553,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "> Several years ago when the government shut down for 35 days the FAA was required to close its training academy and missed its original hiring target by over 500 trainees… Once training resumed, the FAA reduced its FY 2019 controller hiring target by more than one-third (from 1,431 down to 907), and its staffing numbers never recovered,\" he said.\n\n[Chickens coming home to roost](https://www.nbcwashington.com/news/national-international/air-traffic-control-centers-understaffed-doge-layoffs/3870270/)\n\nATC and USPS are the poster children of the GOP strategy of sabatoging our national institutions in order to claim they don't work.",
                "White House suggests “really high” traffic lights.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                "I seriously can’t imagine the stress of being an EWR controller, not even for 500k a year yet along 200k a year. (Jersey is crazy expensive) with the scheduling and hours? Nope… maybe it’s cool for some people, but not me. Somewhere in Montana? Yeah, sign me up. \n\nThere is a much better way to do this, but, nah…",
                "The chickens are coming home",
                "Maybe stop trying to cut their benefits",
                "If this clown-car administration was actually serious about anything, addressing this issue would be one of the easiest places to start.\n\nHowever, because they have no actual policy strategy other than sowing discord through incompetency and chaos, they have no ability to fix anything and no one in their right mind would trust any intention of theirs to do anything correctly and safely. Who would want \"supercharged\" trainees (and who would want to be one?) in these positions, especially at one of the busiest airports in the country?",
                "Maybe electing an unqualified moron with a bone to pick against the world was a bad idea."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 25886,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "Very sad story the cop wasn't even involved",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 6628,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 3836,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "I wish they would charge these rapists in the prime of their life instead of when they’re in the worst health of their life and knocking on deaths door",
                "Looks like Nic Cage in Longlegs",
                "[removed]",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "100% predator. He got off easy. Fucker.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "05/04/2025 16:09:17 UTC"
}