{
    "posts": [
        {
            "category": "HOT",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 15308,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                " now probably works for ICE instead",
                "So he could work with the Gestapo?",
                "Assuming he was immediately hired by ~~The Gestapo~~ ICE?",
                "Huh, before clicking on the article and even while reading it early on I assumed he resigned from the sheer fact that the teenager he arrested ultimately led to her life being completely turned upside down and the guilt just eroded him away until he was too ashamed to even wear a badge that is supposed to resemble his oath to the people. \n\nBut no, he's actually just another dickbag cop that was worried about his reputation LMAO",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "25 years ago, I got pulled over on the highway by a cop who demanded I was speeding even though I was on cruise control the whole time 1mph below the speed limit. I figured he mistook me for a different car that had blown past me. I didn't get frustrated and calmly explained to the cop that the car he was looking for drove past me. \"I understand how this type of mistake can happen, officer,\" I explained, \"but I promise you, I was in cruise control the whole time 1mph below the speed limit.\" He wouldn't have it, so I asked him if he knew how fast he had to go to catch me. He wouldn't answer, so I said, \"If it was less than 100mph, that would explain why you caught me since the car I think you're looking for was going at least 80mph. You caught up to me when you did because I was going 30mph slower.\"\n\nHe wouldn't admit I was right, but said because I didn't give him a \"hard time\" that he was going to let me go with a warning... but that next time I wouldn't get off so easy.\n\nThat whole situation made me start to think about how often cops pull over the wrong person."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 6088,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "So which department will he be running?",
                "No worries for that guy. Trump will pardon him.",
                "If yall want more deep dives in Neo Nazi stuff. I implore you to check out the podcast Weird Little Guys. It’s fantastic and shows how just weird as fuck these people are.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Illinois prosecutors weigh hate crime charges after lesbian attacked at McDonald's",
            "external_url": "https://www.cbsnews.com/chicago/news/kane-county-prosecutors-hate-crime-investigation-mcdonalds-attack-carpentersville/",
            "upvotes": 939,
            "date": "05/25/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/876a2fff-120d-4ef3-a122-c9a755aa2212/thumbnail/1200x630/720d650c2bd8766b5a040fb9e4feaf5a/kady-grass.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "How is this even a discussion?? This is the definition of a hate crime…..",
                "God, that's horrible. I hope she recovers well and quickly. Once again, what a ridiculous fucking unnecessary thing to do to another human for such a stupid reason. What is the problem with humanity, man?",
                "They fucking stomped on her head!! They could have murdered her! Omg, I hope she gets the justice that is needed and I hope those worthless pieces of trash stay in prison for at least 30 years with no parole. I know it sounds too much but they could have killed her, or at the very least, caused permanent life changing damage. \n\nI hope she recovers.",
                "This kinda feels like the definition of a \"hate crime\". \n\nTwo men beating the shit out of a woman for merely trying to use the restroom all while broadcasting their prejudices during the attack - if they're not pursuing them here then what the fuck?",
                "[removed]",
                "From the article - “\"Kane County is a welcoming community,” yeah just don’t mind the blood stains on the welcome mat. It’s real telling the State prosecutor declined hate crime charges. These people have no real interest in enforcing the law. And where were the “good guys” in this restaurant trying to stop this attack?",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israeli use of human shields in Gaza was systematic, soldiers and former detainees tell the AP",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
            "upvotes": 2702,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What's another war crime between more war crimes",
                "Hamas uses human shields = bad\n\nIsrael uses human shields = totally ok\n\nCool…\n\nThis is not just a claim that is being made by Palestinians, soldiers have admitted to it. \n\n> The AP spoke with seven Palestinians who described being used as shields in Gaza and the occupied West Bank and with two members of Israel’s military who said they engaged in the practice, which is prohibited by international law. Rights groups are ringing the alarm, saying it’s become standard procedure increasingly used in the war.\n\nI feel like I need to put this here even though I shouldn’t have to. I am not condoning the use of human shield by either side. It’s horrific, it’s abhorrent, and it should absolutely not be happening and anybody who does it deserves to face stiff penalties.",
                "Former Israeli Prime Minister Ehud Olmert:\n\n> What we are doing in Gaza is a war of extermination: indiscriminate, unrestrained, brutal, and criminal killing of civilians. We are doing this not because of an accidental loss of control in a particular sector, not because of a disproportionate outburst of fighters in some unit — but as a result of a policy dictated by the government, knowingly, intentionally, viciously, maliciously, recklessly. Yes, we are committing war crimes.",
                "If you have not noticed this is how the IDF rolls you have purposely not been paying attention.",
                "Every accusation is a confession",
                "“Accuse the other of what you are guilty of yourself.”",
                "\"Whoever fights monsters, should see to it that in the process he does not become a monster. And if you gaze long into an abyss, the abyss also gazes into you.\" Nietzsche",
                "[removed]",
                "So Israel was projecting the whole time? Who could've known, this isn't something they regularly do...",
                "There's a long proud history of using Palestinians as human shields."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Calif. mother who was kidnapped and forced to rob a bank falsely painted as a criminal in court",
            "external_url": "https://www.cbsnews.com/news/michelle-renee-kidnapped-forced-to-rob-bank-falsely-painted-as-a-criminal-in-court/",
            "upvotes": 534,
            "date": "05/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/09/9fb83ef2-612d-47a8-86ac-43972ff2c793/thumbnail/1200x630/ed9acbec02a68ec2c961d6eb896c2acb/renee-michelle-court.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "This story is chilling. Imagine surviving a violent kidnapping, being forced to commit a crime, and then being re-victimized in court by being painted as the criminal. It really highlights how trauma survivors can be misunderstood and even punished by the very system meant to protect them. Cases like this show why victim advocacy and trauma-informed legal practices are so important.",
                "Haven't read the article but isn't that basically what happened to Patty Hearst when she was kidnapped too?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 11149,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "If I had the money to leave I’d already be out",
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditors whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "My fiancé works completely remote, and we were considering the 'digital nomad' lifestyle, it's just *insanely* expensive in the UK compared to where we currently live. We also considered New Zealand, but it's too difficult to get in.",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "I have UK citizenship, so that's an option for me...but it's not that simple to just pack your entire life up, lose your home and job, thousands of things you have to deal with...but on the other hand, by the time it becomes super worth it to leave, maybe you can't anymore.",
                "Took almost 200 years but it's time to go home."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 9153,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly ~~what he voted for~~ the policy he supports. He just didn't think it would happen to him \\[because he's white\\].",
                "And there won’t be any Medicaid for his 5 anchor babies after he’s deported.  His wife voted for Trump, he stumped for Trump.  When he had an expired green card. \n\n#FAFO",
                "The social media accounts of Kasper Eriksen show him to be a rabid Trump MAGA supporter. He’s having the day he deserves.",
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "Amazing that conservatives can say \"we just want people to come here the legal way\" when the \"legal way\" is so damn complicated that it's this easy to screw up one little thing.",
                "This article mentions that the government thugs that were sent to take this man were \"embarrassed\" about the proceedings and needing to retain him. Who wants to bet they were just shocked as hell this dude was white and this made them feel this embarrassment?",
                "Mississippi, blue collar, 4 kids and pregnant wife.  \n\nI bet all of his friends and probably his wife voted for Trump.",
                "I'm not saying that any of these detentions are justified. But it has been common practice for years to send people in his position to immigration court for removal proceedings. He was required by law to apply for removal of conditions on his residence at the two-year mark. With children and a life together with his USC spouse, it would have been an easy approval, might not have even required an interview. When he didn't file the petition that is required of *everyone* in his position, he opened himself up to this possibility. It's a three-page application. Now a judge has to sort it out while his family is in limbo."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Actor Jussie Smollett to pay $50,000 to Chicago charity",
            "external_url": "https://www.bbc.com/news/articles/c2lke8l980no",
            "upvotes": 1071,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0455/live/9af94a90-37c1-11f0-8c61-1388b061cbbc.jpg",
            "top_comments": [
                ">Chicago police had wanted Smollett to pay $130,000 to cover the investigation costs, but on Thursday, Chicago's law department confirmed that the donation will be made instead.\n\nIs that the end of it? I haven't been following the criminal case any more. Was that resolved entirely?",
                "*The money will go to Building Brighter Futures Center for the Arts, an organisation that supports Chicago's underprivileged youth.*\n\nNice--but who gets to pay the 130,000 in investigative costs?  Did I hear \"Chicago tax payers.\"",
                "Is this that French actor Dave Chappelle was talking about? :)",
                "He’s a useless waste of space and energy",
                "“America, do not commit crimes with checks”\n-Charles Barkley",
                "Hope he doesn’t get mugged by those guys on his way to the charity. ",
                "One of the most embarassing cases I’ve ever seen in my life.",
                "He got off way too easy.",
                "Jeez this happened 6 years ago",
                "I never want to hear from him agaim"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 1831,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/25/ee2699e5-bcb5-4aa7-be3e-b8ec0e60430c/thumbnail/1200x630/446fd4253114e7cd12fdbd4341c3ad22/snapshot2025-05-24-17h27m20s907-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">Woeltz is a crypto investor originally from Kentucky who rents an apartment in the home for between $30,000 and $40,000 per month.\n\nThat's a hell of a monthly expense, and with that kind of money you'd think he'd want to stay under the radar.",
                "> The motive for the alleged attack is still unclear. Investigators say there were two butlers at the residence who would also be interviewed.\n\nWtf.\n\nI can't wait to hear the story behind this.",
                "I don't know how many times we have to say cryptoworld is full of criminals.",
                "He'll probably find some loose change, buy an audience at one of DJT's dinners, come in disguise 🥸, and get out next day with 5 million USD for calomny. ",
                "Good to have a sideline, in case the crypto thing doesn't work out.",
                "It's always the people most likely to do it.",
                "This guy's just going to pay Trump to get a pardon.",
                "[Relevant XKCD](https://xkcd.com/538)",
                "\"crypto investor\" you mean money launderer",
                "So this is real news not like last time with Mohammed Arsalan kidnapping?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 6810,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "Prison time was far shorter than all the time spent on legal wrangling and the trials.",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "She brought live ammunition to a movie set FOR THE FUCKING GUN BEING USED IN THE MOVIE so her and other cast and crew could use the gun to shoot cans and targets during lunch and breaks.\n\nShe should be in fucking prison for a lot longer than 13 months!",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Florida man who shot and poisoned dolphins sentenced to 1 month",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-man-shot-poisoned-dolphins-sentenced-1-month-rcna208937",
            "upvotes": 25,
            "date": "05/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-florida-dolphin-shooting-poison-rc-922p-edf349.jpg",
            "top_comments": [
                "What a piece of shit. Should be going to prison for a long time, never be allowed to fish ever again, and his company should be seized.",
                ">A Florida man who shot dolphins attracted to baited fishing lines cast from boats he operated was sentenced to 30 days in prison and one year of supervised release.\n\n>Zackery Brandon Barfield, 31, not only shot the bottlenose dolphins but also used poisoned bait after growing frustrated that they were eating from his charter fishing clients, according to prosecutors, who said the crimes happened in 2022 and 2023.\n\n>Prosecutors and federal law enforcement with the National Oceanic and Atmospheric Administration said Barfield shot at five dolphins, killing at least one, and used poisoned bait on dozens more during outings from Panama City.\n\n>“He knew the regulations protecting dolphins, yet he killed them anyway — once in front of children,” federal environmental prosecutor Adam Gustafson said Friday in a statement. Barfield’s attorney in the case did not immediately respond to a request for comment Saturday.\n\n>Barfield opened fire while two elementary school-aged children were on board and, separately, while more than a dozen fishermen were on board boats he operated, prosecutors said.\n\n>He used poisoned bait even more prodigiously, they said.\n\n>\"Barfield fed an estimated 24–70 dolphins poison-laden baitfish on charter trips that he captained,\" NOAA Fisheries said in a separate statement Friday.\n\nHe was mad because the dolphins were doing a better job at catching the fish than his customers were. \n\nIt’s a light sentence considering how long he was doing this and how many dolphins he cruelly killed. He should really lose his boat because he has no business being in the boat charter business after this.",
                "The dolphins may have taught to hold grudge on humans to other dolphins by now...",
                "Too light a punishment for that ass.",
                "Well, the US may have school shootings but at least it allows for more instances of animal cruelty so it evens out I guess.",
                "Were they evil dolphins? Maybe he didn't mean to do it on porpoise."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Illinois prosecutors weigh hate crime charges after lesbian attacked at McDonald's",
            "external_url": "https://www.cbsnews.com/chicago/news/kane-county-prosecutors-hate-crime-investigation-mcdonalds-attack-carpentersville/",
            "upvotes": 937,
            "date": "05/25/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/876a2fff-120d-4ef3-a122-c9a755aa2212/thumbnail/1200x630/720d650c2bd8766b5a040fb9e4feaf5a/kady-grass.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "How is this even a discussion?? This is the definition of a hate crime…..",
                "God, that's horrible. I hope she recovers well and quickly. Once again, what a ridiculous fucking unnecessary thing to do to another human for such a stupid reason. What is the problem with humanity, man?",
                "They fucking stomped on her head!! They could have murdered her! Omg, I hope she gets the justice that is needed and I hope those worthless pieces of trash stay in prison for at least 30 years with no parole. I know it sounds too much but they could have killed her, or at the very least, caused permanent life changing damage. \n\nI hope she recovers.",
                "This kinda feels like the definition of a \"hate crime\". \n\nTwo men beating the shit out of a woman for merely trying to use the restroom all while broadcasting their prejudices during the attack - if they're not pursuing them here then what the fuck?",
                "[removed]",
                "From the article - “\"Kane County is a welcoming community,” yeah just don’t mind the blood stains on the welcome mat. It’s real telling the State prosecutor declined hate crime charges. These people have no real interest in enforcing the law. And where were the “good guys” in this restaurant trying to stop this attack?",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Calif. mother who was kidnapped and forced to rob a bank falsely painted as a criminal in court",
            "external_url": "https://www.cbsnews.com/news/michelle-renee-kidnapped-forced-to-rob-bank-falsely-painted-as-a-criminal-in-court/",
            "upvotes": 535,
            "date": "05/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/09/9fb83ef2-612d-47a8-86ac-43972ff2c793/thumbnail/1200x630/ed9acbec02a68ec2c961d6eb896c2acb/renee-michelle-court.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "This story is chilling. Imagine surviving a violent kidnapping, being forced to commit a crime, and then being re-victimized in court by being painted as the criminal. It really highlights how trauma survivors can be misunderstood and even punished by the very system meant to protect them. Cases like this show why victim advocacy and trauma-informed legal practices are so important.",
                "Haven't read the article but isn't that basically what happened to Patty Hearst when she was kidnapped too?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Orthodox Christianity: Young US men joining 'masculine' Russian churches",
            "external_url": "https://www.bbc.com/news/articles/c30q5l8d4lro",
            "upvotes": 523,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ae73/live/84976680-2671-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "Half my family is Greek Orthodox and nothing about that religion struck me as inherently 'masculine' but maybe the Russian version is different? Or maybe this isn't really 'about' religion?",
                "For anyone who didn't read the article, the men aren't leaving the US and going to Russia. These Russian Orthodox churches are here in the US. The guy in the picture is the priest of one of these churches in Georgetown, Texas.\n\nROCOR is apparently the name of the congregation, meaning Russian Orthodox Church Outside of Russia. They have a HQ in New York and are spreading. Apparently they've been established here since 1917 though (not the masculinity church, just ROCOR).",
                "\"They see it as a military, rigid, disciplinary, masculine, authoritarian religion,\" Elissa says.\n\nHow is any of this what Jesus stood for lmao? I mean is this even Christianity at this point? Or is it just a boy’s social club using religion as an excuse to look more “trad”? \n\nI wonder how many of these folks have read the Bible or even could just explain some of the basic concepts of what being a Christian even means…",
                "That is very beta of them.",
                "I've seen some alt-right guys in random (male-dominated, obviously) YouTube comments sections saying they converted to Russian Orthodoxy because Western churches have apparently \"lost their way\".\n\n☦ signs everywhere. Strong cultish vibes.",
                "The same young men who were [swayed towards the Right Wing over the last election cycle](https://www.americansurveycenter.org/newsletter/are-young-men-becoming-conservative/) after it was proven [Russia paid Youtubers and Podcasters to spread right-wing propaganda](https://www.npr.org/2024/09/07/nx-s1-5101895/doj-says-russia-paid-right-wing-influencers-to-spread-russian-propaganda) are heading towards the Russian orthodox church and after [several whistle-blowers claimed Trump was in collusion with Russia](https://www.google.com/amp/s/amp.cnn.com/cnn/2020/09/09/politics/dhs-whistleblower-white-supremacist-threat) and even his own son said in 2008, [\"Russians make up a pretty disproportionate cross-section of a lot of our assets. \"](https://foreignpolicy.com/2018/12/21/how-russian-money-helped-save-trumps-business/)\n\nYeah, Russia definitely owns Trump and helped him get elected.\n\nWhich more than explains why [Trump's actions are nearly exact replicas of what a Russian asset would do to Americans and their interests.](https://foreignpolicy.com/2025/03/10/trump-putin-russia-asset-spy-security-ukraine-europe-war/)",
                "I really need to be told what's masculine by a guy wearing a dress and jewelry.",
                "The guys who are doing this ironically aren't the ones getting laid.",
                "I’m an Orthodox Christian, and this ridiculous nonsense doesn’t represent me or my Church in the slightest. This priest is a joke.",
                "Maga traitors sure do love Russia."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Actor Jussie Smollett to pay $50,000 to Chicago charity",
            "external_url": "https://www.bbc.com/news/articles/c2lke8l980no",
            "upvotes": 1068,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0455/live/9af94a90-37c1-11f0-8c61-1388b061cbbc.jpg",
            "top_comments": [
                ">Chicago police had wanted Smollett to pay $130,000 to cover the investigation costs, but on Thursday, Chicago's law department confirmed that the donation will be made instead.\n\nIs that the end of it? I haven't been following the criminal case any more. Was that resolved entirely?",
                "*The money will go to Building Brighter Futures Center for the Arts, an organisation that supports Chicago's underprivileged youth.*\n\nNice--but who gets to pay the 130,000 in investigative costs?  Did I hear \"Chicago tax payers.\"",
                "Is this that French actor Dave Chappelle was talking about? :)",
                "He’s a useless waste of space and energy",
                "“America, do not commit crimes with checks”\n-Charles Barkley",
                "Hope he doesn’t get mugged by those guys on his way to the charity. ",
                "One of the most embarassing cases I’ve ever seen in my life.",
                "He got off way too easy.",
                "Jeez this happened 6 years ago",
                "I never want to hear from him agaim"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 15309,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                " now probably works for ICE instead",
                "So he could work with the Gestapo?",
                "Assuming he was immediately hired by ~~The Gestapo~~ ICE?",
                "Huh, before clicking on the article and even while reading it early on I assumed he resigned from the sheer fact that the teenager he arrested ultimately led to her life being completely turned upside down and the guilt just eroded him away until he was too ashamed to even wear a badge that is supposed to resemble his oath to the people. \n\nBut no, he's actually just another dickbag cop that was worried about his reputation LMAO",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "25 years ago, I got pulled over on the highway by a cop who demanded I was speeding even though I was on cruise control the whole time 1mph below the speed limit. I figured he mistook me for a different car that had blown past me. I didn't get frustrated and calmly explained to the cop that the car he was looking for drove past me. \"I understand how this type of mistake can happen, officer,\" I explained, \"but I promise you, I was in cruise control the whole time 1mph below the speed limit.\" He wouldn't have it, so I asked him if he knew how fast he had to go to catch me. He wouldn't answer, so I said, \"If it was less than 100mph, that would explain why you caught me since the car I think you're looking for was going at least 80mph. You caught up to me when you did because I was going 30mph slower.\"\n\nHe wouldn't admit I was right, but said because I didn't give him a \"hard time\" that he was going to let me go with a warning... but that next time I wouldn't get off so easy.\n\nThat whole situation made me start to think about how often cops pull over the wrong person."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli use of human shields in Gaza was systematic, soldiers and former detainees tell the AP",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
            "upvotes": 2698,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What's another war crime between more war crimes",
                "Hamas uses human shields = bad\n\nIsrael uses human shields = totally ok\n\nCool…\n\nThis is not just a claim that is being made by Palestinians, soldiers have admitted to it. \n\n> The AP spoke with seven Palestinians who described being used as shields in Gaza and the occupied West Bank and with two members of Israel’s military who said they engaged in the practice, which is prohibited by international law. Rights groups are ringing the alarm, saying it’s become standard procedure increasingly used in the war.\n\nI feel like I need to put this here even though I shouldn’t have to. I am not condoning the use of human shield by either side. It’s horrific, it’s abhorrent, and it should absolutely not be happening and anybody who does it deserves to face stiff penalties.",
                "Former Israeli Prime Minister Ehud Olmert:\n\n> What we are doing in Gaza is a war of extermination: indiscriminate, unrestrained, brutal, and criminal killing of civilians. We are doing this not because of an accidental loss of control in a particular sector, not because of a disproportionate outburst of fighters in some unit — but as a result of a policy dictated by the government, knowingly, intentionally, viciously, maliciously, recklessly. Yes, we are committing war crimes.",
                "If you have not noticed this is how the IDF rolls you have purposely not been paying attention.",
                "Every accusation is a confession",
                "“Accuse the other of what you are guilty of yourself.”",
                "\"Whoever fights monsters, should see to it that in the process he does not become a monster. And if you gaze long into an abyss, the abyss also gazes into you.\" Nietzsche",
                "[removed]",
                "So Israel was projecting the whole time? Who could've known, this isn't something they regularly do...",
                "There's a long proud history of using Palestinians as human shields."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 6088,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "So which department will he be running?",
                "No worries for that guy. Trump will pardon him.",
                "If yall want more deep dives in Neo Nazi stuff. I implore you to check out the podcast Weird Little Guys. It’s fantastic and shows how just weird as fuck these people are.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 1831,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/25/ee2699e5-bcb5-4aa7-be3e-b8ec0e60430c/thumbnail/1200x630/446fd4253114e7cd12fdbd4341c3ad22/snapshot2025-05-24-17h27m20s907-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">Woeltz is a crypto investor originally from Kentucky who rents an apartment in the home for between $30,000 and $40,000 per month.\n\nThat's a hell of a monthly expense, and with that kind of money you'd think he'd want to stay under the radar.",
                "> The motive for the alleged attack is still unclear. Investigators say there were two butlers at the residence who would also be interviewed.\n\nWtf.\n\nI can't wait to hear the story behind this.",
                "I don't know how many times we have to say cryptoworld is full of criminals.",
                "He'll probably find some loose change, buy an audience at one of DJT's dinners, come in disguise 🥸, and get out next day with 5 million USD for calomny. ",
                "Good to have a sideline, in case the crypto thing doesn't work out.",
                "It's always the people most likely to do it.",
                "This guy's just going to pay Trump to get a pardon.",
                "[Relevant XKCD](https://xkcd.com/538)",
                "\"crypto investor\" you mean money launderer",
                "So this is real news not like last time with Mohammed Arsalan kidnapping?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sabotage suspected as power cut hits Cannes Film Festival",
            "external_url": "https://www.bbc.com/news/articles/c4gel3g84q0o",
            "upvotes": 1228,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5cb/live/84b16460-38cb-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">\"Cannes is in a total slowdown, meltdown, there's no coffee anywhere, and I think the town has run out of croissants, so this is like crisis territory.\"\n\nA man with priorities.",
                "It's the cannes! He hates these cannes! ",
                "A saboteur at Cannes?\n\nThis is so Inspector Clouseau coded.",
                "I can't stand it. I know you planned it.",
                "Man the Catholic League is protesting Dogma again!?",
                "This article is light on details. Where is the information about sabotage coming from? Why is sabotage suspected? What is the motive?",
                "You must construct additional pylons.",
                "I Cannes ‘tand it, I know you planned it",
                "Kevin Spacey has claimed responsibility for this act of terrorism.",
                "It *is* one of Sabbath’s best albums, after all"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Illinois prosecutors weigh hate crime charges after lesbian attacked at McDonald's",
            "external_url": "https://www.cbsnews.com/chicago/news/kane-county-prosecutors-hate-crime-investigation-mcdonalds-attack-carpentersville/",
            "upvotes": 942,
            "date": "05/25/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/876a2fff-120d-4ef3-a122-c9a755aa2212/thumbnail/1200x630/720d650c2bd8766b5a040fb9e4feaf5a/kady-grass.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "How is this even a discussion?? This is the definition of a hate crime…..",
                "God, that's horrible. I hope she recovers well and quickly. Once again, what a ridiculous fucking unnecessary thing to do to another human for such a stupid reason. What is the problem with humanity, man?",
                "They fucking stomped on her head!! They could have murdered her! Omg, I hope she gets the justice that is needed and I hope those worthless pieces of trash stay in prison for at least 30 years with no parole. I know it sounds too much but they could have killed her, or at the very least, caused permanent life changing damage. \n\nI hope she recovers.",
                "This kinda feels like the definition of a \"hate crime\". \n\nTwo men beating the shit out of a woman for merely trying to use the restroom all while broadcasting their prejudices during the attack - if they're not pursuing them here then what the fuck?",
                "[removed]",
                "From the article - “\"Kane County is a welcoming community,” yeah just don’t mind the blood stains on the welcome mat. It’s real telling the State prosecutor declined hate crime charges. These people have no real interest in enforcing the law. And where were the “good guys” in this restaurant trying to stop this attack?",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Calif. mother who was kidnapped and forced to rob a bank falsely painted as a criminal in court",
            "external_url": "https://www.cbsnews.com/news/michelle-renee-kidnapped-forced-to-rob-bank-falsely-painted-as-a-criminal-in-court/",
            "upvotes": 533,
            "date": "05/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/09/9fb83ef2-612d-47a8-86ac-43972ff2c793/thumbnail/1200x630/ed9acbec02a68ec2c961d6eb896c2acb/renee-michelle-court.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "This story is chilling. Imagine surviving a violent kidnapping, being forced to commit a crime, and then being re-victimized in court by being painted as the criminal. It really highlights how trauma survivors can be misunderstood and even punished by the very system meant to protect them. Cases like this show why victim advocacy and trauma-informed legal practices are so important.",
                "Haven't read the article but isn't that basically what happened to Patty Hearst when she was kidnapped too?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Orthodox Christianity: Young US men joining 'masculine' Russian churches",
            "external_url": "https://www.bbc.com/news/articles/c30q5l8d4lro",
            "upvotes": 527,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ae73/live/84976680-2671-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "Half my family is Greek Orthodox and nothing about that religion struck me as inherently 'masculine' but maybe the Russian version is different? Or maybe this isn't really 'about' religion?",
                "For anyone who didn't read the article, the men aren't leaving the US and going to Russia. These Russian Orthodox churches are here in the US. The guy in the picture is the priest of one of these churches in Georgetown, Texas.\n\nROCOR is apparently the name of the congregation, meaning Russian Orthodox Church Outside of Russia. They have a HQ in New York and are spreading. Apparently they've been established here since 1917 though (not the masculinity church, just ROCOR).",
                "\"They see it as a military, rigid, disciplinary, masculine, authoritarian religion,\" Elissa says.\n\nHow is any of this what Jesus stood for lmao? I mean is this even Christianity at this point? Or is it just a boy’s social club using religion as an excuse to look more “trad”? \n\nI wonder how many of these folks have read the Bible or even could just explain some of the basic concepts of what being a Christian even means…",
                "That is very beta of them.",
                "I've seen some alt-right guys in random (male-dominated, obviously) YouTube comments sections saying they converted to Russian Orthodoxy because Western churches have apparently \"lost their way\".\n\n☦ signs everywhere. Strong cultish vibes.",
                "The same young men who were [swayed towards the Right Wing over the last election cycle](https://www.americansurveycenter.org/newsletter/are-young-men-becoming-conservative/) after it was proven [Russia paid Youtubers and Podcasters to spread right-wing propaganda](https://www.npr.org/2024/09/07/nx-s1-5101895/doj-says-russia-paid-right-wing-influencers-to-spread-russian-propaganda) are heading towards the Russian orthodox church and after [several whistle-blowers claimed Trump was in collusion with Russia](https://www.google.com/amp/s/amp.cnn.com/cnn/2020/09/09/politics/dhs-whistleblower-white-supremacist-threat) and even his own son said in 2008, [\"Russians make up a pretty disproportionate cross-section of a lot of our assets. \"](https://foreignpolicy.com/2018/12/21/how-russian-money-helped-save-trumps-business/)\n\nYeah, Russia definitely owns Trump and helped him get elected.\n\nWhich more than explains why [Trump's actions are nearly exact replicas of what a Russian asset would do to Americans and their interests.](https://foreignpolicy.com/2025/03/10/trump-putin-russia-asset-spy-security-ukraine-europe-war/)",
                "I really need to be told what's masculine by a guy wearing a dress and jewelry.",
                "The guys who are doing this ironically aren't the ones getting laid.",
                "I’m an Orthodox Christian, and this ridiculous nonsense doesn’t represent me or my Church in the slightest. This priest is a joke.",
                "Maga traitors sure do love Russia."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Actor Jussie Smollett to pay $50,000 to Chicago charity",
            "external_url": "https://www.bbc.com/news/articles/c2lke8l980no",
            "upvotes": 1069,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0455/live/9af94a90-37c1-11f0-8c61-1388b061cbbc.jpg",
            "top_comments": [
                ">Chicago police had wanted Smollett to pay $130,000 to cover the investigation costs, but on Thursday, Chicago's law department confirmed that the donation will be made instead.\n\nIs that the end of it? I haven't been following the criminal case any more. Was that resolved entirely?",
                "*The money will go to Building Brighter Futures Center for the Arts, an organisation that supports Chicago's underprivileged youth.*\n\nNice--but who gets to pay the 130,000 in investigative costs?  Did I hear \"Chicago tax payers.\"",
                "Is this that French actor Dave Chappelle was talking about? :)",
                "He’s a useless waste of space and energy",
                "“America, do not commit crimes with checks”\n-Charles Barkley",
                "Hope he doesn’t get mugged by those guys on his way to the charity. ",
                "One of the most embarassing cases I’ve ever seen in my life.",
                "He got off way too easy.",
                "Jeez this happened 6 years ago",
                "I never want to hear from him agaim"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 15306,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                " now probably works for ICE instead",
                "So he could work with the Gestapo?",
                "Assuming he was immediately hired by ~~The Gestapo~~ ICE?",
                "Huh, before clicking on the article and even while reading it early on I assumed he resigned from the sheer fact that the teenager he arrested ultimately led to her life being completely turned upside down and the guilt just eroded him away until he was too ashamed to even wear a badge that is supposed to resemble his oath to the people. \n\nBut no, he's actually just another dickbag cop that was worried about his reputation LMAO",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "25 years ago, I got pulled over on the highway by a cop who demanded I was speeding even though I was on cruise control the whole time 1mph below the speed limit. I figured he mistook me for a different car that had blown past me. I didn't get frustrated and calmly explained to the cop that the car he was looking for drove past me. \"I understand how this type of mistake can happen, officer,\" I explained, \"but I promise you, I was in cruise control the whole time 1mph below the speed limit.\" He wouldn't have it, so I asked him if he knew how fast he had to go to catch me. He wouldn't answer, so I said, \"If it was less than 100mph, that would explain why you caught me since the car I think you're looking for was going at least 80mph. You caught up to me when you did because I was going 30mph slower.\"\n\nHe wouldn't admit I was right, but said because I didn't give him a \"hard time\" that he was going to let me go with a warning... but that next time I wouldn't get off so easy.\n\nThat whole situation made me start to think about how often cops pull over the wrong person."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 6089,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "So which department will he be running?",
                "No worries for that guy. Trump will pardon him.",
                "If yall want more deep dives in Neo Nazi stuff. I implore you to check out the podcast Weird Little Guys. It’s fantastic and shows how just weird as fuck these people are.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli use of human shields in Gaza was systematic, soldiers and former detainees tell the AP",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
            "upvotes": 2704,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What's another war crime between more war crimes",
                "Hamas uses human shields = bad\n\nIsrael uses human shields = totally ok\n\nCool…\n\nThis is not just a claim that is being made by Palestinians, soldiers have admitted to it. \n\n> The AP spoke with seven Palestinians who described being used as shields in Gaza and the occupied West Bank and with two members of Israel’s military who said they engaged in the practice, which is prohibited by international law. Rights groups are ringing the alarm, saying it’s become standard procedure increasingly used in the war.\n\nI feel like I need to put this here even though I shouldn’t have to. I am not condoning the use of human shield by either side. It’s horrific, it’s abhorrent, and it should absolutely not be happening and anybody who does it deserves to face stiff penalties.",
                "Former Israeli Prime Minister Ehud Olmert:\n\n> What we are doing in Gaza is a war of extermination: indiscriminate, unrestrained, brutal, and criminal killing of civilians. We are doing this not because of an accidental loss of control in a particular sector, not because of a disproportionate outburst of fighters in some unit — but as a result of a policy dictated by the government, knowingly, intentionally, viciously, maliciously, recklessly. Yes, we are committing war crimes.",
                "If you have not noticed this is how the IDF rolls you have purposely not been paying attention.",
                "Every accusation is a confession",
                "“Accuse the other of what you are guilty of yourself.”",
                "\"Whoever fights monsters, should see to it that in the process he does not become a monster. And if you gaze long into an abyss, the abyss also gazes into you.\" Nietzsche",
                "[removed]",
                "So Israel was projecting the whole time? Who could've known, this isn't something they regularly do...",
                "There's a long proud history of using Palestinians as human shields."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 11143,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "If I had the money to leave I’d already be out",
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditors whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "My fiancé works completely remote, and we were considering the 'digital nomad' lifestyle, it's just *insanely* expensive in the UK compared to where we currently live. We also considered New Zealand, but it's too difficult to get in.",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "I have UK citizenship, so that's an option for me...but it's not that simple to just pack your entire life up, lose your home and job, thousands of things you have to deal with...but on the other hand, by the time it becomes super worth it to leave, maybe you can't anymore.",
                "Took almost 200 years but it's time to go home."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 9155,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly ~~what he voted for~~ the policy he supports. He just didn't think it would happen to him \\[because he's white\\].",
                "And there won’t be any Medicaid for his 5 anchor babies after he’s deported.  His wife voted for Trump, he stumped for Trump.  When he had an expired green card. \n\n#FAFO",
                "The social media accounts of Kasper Eriksen show him to be a rabid Trump MAGA supporter. He’s having the day he deserves.",
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "Amazing that conservatives can say \"we just want people to come here the legal way\" when the \"legal way\" is so damn complicated that it's this easy to screw up one little thing.",
                "This article mentions that the government thugs that were sent to take this man were \"embarrassed\" about the proceedings and needing to retain him. Who wants to bet they were just shocked as hell this dude was white and this made them feel this embarrassment?",
                "Mississippi, blue collar, 4 kids and pregnant wife.  \n\nI bet all of his friends and probably his wife voted for Trump.",
                "I'm not saying that any of these detentions are justified. But it has been common practice for years to send people in his position to immigration court for removal proceedings. He was required by law to apply for removal of conditions on his residence at the two-year mark. With children and a life together with his USC spouse, it would have been an easy approval, might not have even required an interview. When he didn't file the petition that is required of *everyone* in his position, he opened himself up to this possibility. It's a three-page application. Now a judge has to sort it out while his family is in limbo."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 1838,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/25/ee2699e5-bcb5-4aa7-be3e-b8ec0e60430c/thumbnail/1200x630/446fd4253114e7cd12fdbd4341c3ad22/snapshot2025-05-24-17h27m20s907-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">Woeltz is a crypto investor originally from Kentucky who rents an apartment in the home for between $30,000 and $40,000 per month.\n\nThat's a hell of a monthly expense, and with that kind of money you'd think he'd want to stay under the radar.",
                "> The motive for the alleged attack is still unclear. Investigators say there were two butlers at the residence who would also be interviewed.\n\nWtf.\n\nI can't wait to hear the story behind this.",
                "I don't know how many times we have to say cryptoworld is full of criminals.",
                "He'll probably find some loose change, buy an audience at one of DJT's dinners, come in disguise 🥸, and get out next day with 5 million USD for calomny. ",
                "Good to have a sideline, in case the crypto thing doesn't work out.",
                "It's always the people most likely to do it.",
                "This guy's just going to pay Trump to get a pardon.",
                "[Relevant XKCD](https://xkcd.com/538)",
                "\"crypto investor\" you mean money launderer",
                "So this is real news not like last time with Mohammed Arsalan kidnapping?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/25/2025 12:14:27 UTC"
}