{
    "posts": [
        {
            "category": "HOT",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 6110,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Not deported. Kicked out illegally",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Remember this when they're asking for mercy",
                "Sending both citizen child and illegal immigrant mother out of the country is one option to avoid family separation. Rightwingers opposed to immigration hate the idea of having both stay, using the term \"anchor baby\" to frame it as a political if not legal barrier to deporting the mother, related to seeing birthright citizenship as a perverse incentive for illegal immigration\n\nSome people come legally with the intent of giving birth, which may involve immigration violations like overstaying a temporary visa, and that could present similar issues",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "The  kids should be with their legal guardians, probably, the mothers were the ones"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 25559,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "Where was he when I was a teen?",
                "The riddler if he was cool",
                "Give this man a key the city",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that.",
                "\"In total, officers said they recovered over a quarter of an ounce of marijuana.\"\n\nBet it was 8 grams. 2g per egg. Doesn't sound as good as a quarter ounce for rage bait though."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 8992,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 17741,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "Probably shouldn't cut parts off babies for no reason",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "It's crazy it's still the norm in many parts of the US.\n\nMy son was born at the Montreal **Jewish** Hospital. It was clearly stated that circumcision (for non-medical cases) was not offered by the obstetrics department. There was a clinic available in the hospital with a doctor who is also a Mohel for those parents who chose so. It was a paid service not covered by the government.\n\nIMO, it should be made illegal, but that's a debate for another time.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Genital mutilation should be illegal",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "Maybe don’t elect to  mutilate your newborns genitalia"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 4376,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "I’m not just going to take their word for it that they’re immigrants",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!",
                "They’re saying that both MS-13 and Tren de Aragua were there. They’re literally just calling all immigrants members of these two gangs. If you demonize them and call them gang members, it becomes easier for the general public to justify deporting brown people left and right. You know who else was wrongly demonized in history, and the consequences of what happened to them because of it?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 2487,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "You know you're the bad guy when N. Korea's got your back.",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "These are replacement troops for the troops that were sent there last year, 40% casualties from last year....geez\n\n[https://www.bbc.com/news/articles/c87djeezjxeo](https://www.bbc.com/news/articles/c87djeezjxeo)",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America.",
                "Explains Trump's \"magical\" 180 this weekend",
                "> North Korean leader Kim Jong Un watches a cadet practicing on the parallel bars \n\nSending gymnasts off to war.",
                "Why is Russia provoking WW3??",
                "This certainly complicates matters. Under normal circumstances, this would be the perfect justification to up our aid to our European and Asian allies, but with our current leader, we are not in a normal situation."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 17173,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Part of the issue is us the consumer. We need to be active & skeptical in the news we absorb. We need to question and research the information we believe, but that would take critical thinking skills. We do not we don’t teach that in the US.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Suspect charged with murder over Vancouver Filipino festival car ramming, police say victims were aged five to 65",
            "external_url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk/index.html",
            "upvotes": 644,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-27t060646z-1584350354-rc256eaf4qtw-rtrmadp-3-canada-vancouver-street-festival-crash.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Kai-Ji Adam Lo, he had a brother that was killed like a year ago and even had a go fund me page.\n\n\nHis father also died shortly after they moved to the area.\n\n\nHis mother attempted suicide not too long ago too.\n\n\nHistory of mental illness, paranoia, probably schizophrenia, just sad all around. Often caught shouting with his mom where police would be called on them (no out right violence though).\n\n\nToo many lives lost for no reason at all.",
                "They were saying he had schizophrenia on the radio this afternoon, can’t imagine what must have been going through his mind. So many people have had their lives taken and others will be devastated, what a tragedy. I can’t hate on someone who is obviously extremely ill, he will never know peace now. That is his life sentence as well as being put in an institution for the extremely ill. Such a horrible tragedy.",
                "A very very minute part of me takes the smallest sliver of solace that this wasn't a hate fueled attack on people, but it's still a tragic nightmare of an event. I feel terrible for the victims and their families.",
                "Crazy guy, did something crazy.  It’s as simple as that.  Nothing political, nothing racial, nothing. Just bring back mental hospitals to deal with these damaged people instead of letting them roam the streets alone with their damaged thinking.  Get them help.",
                "I thought it would be racism but it’s mental illness.",
                "What a disgusting human …what is wrong with this world",
                "I was on the same day at a nearly identical street/food festival about 100km away, and the idea of security or the possibility that something dreadful like this could occur where I was walking around in the pleasant sunshine did not enter my mind. How sheltered we all are."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 272,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "Gun laws must be discussed seriously, man, I am from out of the States. Every month I certainly hear some hooligans' shooting and killing innocent people. \n\nI am scared to go to U.S. for my Masters, thinking I might get shot randomly for no reason at all.",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Why is this not shocking anymore?",
                "\"Not my problem\" -Trump ",
                "It’s the same question time and time again. \nHow many more need to die?",
                "[deleted]",
                "Why even bother posting this shit anymore is beyond me, isn't this just a day of life in America?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 2224,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "This sounds ridiculous.",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "In a court filing, Cano denied the U.S. government’s characterization of the men as gang members, saying each of them were subjected to “thorough and rigorous” proceedings with Immigration and Customs Enforcement agents when they entered the country. He said the first time he heard that they may have gang ties was the morning federal agents raided their home took the men into custody.\n\nCano said he and his wife, Nancy Cano allowed the men to stay in their spare studio apartment in April 2024. He said they told the couple that they requested asylum upon entering the U.S. in 2023, were processed by immigration officials and were then released with court dates for their requests. Cano said the men showed paperwork to back up their stories.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "\"Federal agents say videos and photos on Ortega-Lopez’s social media accounts 'displayed clear indicators of Tren de Aragua' and that other elements – tattoos, clothing and hand gestures – 'provide strong evidence' of a potential connection to the gang.\"\n\nIt is unbelievably disingenuous to include this info without either saying WHY these elements allegedly indicate gang connections, or to include that there has been a spate of instances where ICE states the existence of any type of tattoo is indication of gang connections for South American immigrants.\n\nAP News is up there with Reuters in terms of good sources of news, but this \"x said this, y said this\" type of reporting legitimizes lies and liars even if it is factually accurate.\n\nEverything else aside this is a great example to demonstrate that legacy media will not save us from fascism, or even properly contextualize it.",
                "If everyone is a gang member, no one is.",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Dozens of African migrants killed in US strike on Yemen, Houthis say",
            "external_url": "https://www.bbc.com/news/articles/c9qw274w72vo",
            "upvotes": 19,
            "date": "04/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e43/live/54aedf50-23fd-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "Terrible. Given the Houthi's attitudes towards African migrants I am guessing these people were enslaved there. I wish wealth countries would attempt to save people in these situations instead of bombing them."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 25,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 271,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "Gun laws must be discussed seriously, man, I am from out of the States. Every month I certainly hear some hooligans' shooting and killing innocent people. \n\nI am scared to go to U.S. for my Masters, thinking I might get shot randomly for no reason at all.",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Why is this not shocking anymore?",
                "\"Not my problem\" -Trump ",
                "It’s the same question time and time again. \nHow many more need to die?",
                "[deleted]",
                "Why even bother posting this shit anymore is beyond me, isn't this just a day of life in America?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 6111,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Not deported. Kicked out illegally",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Remember this when they're asking for mercy",
                "Sending both citizen child and illegal immigrant mother out of the country is one option to avoid family separation. Rightwingers opposed to immigration hate the idea of having both stay, using the term \"anchor baby\" to frame it as a political if not legal barrier to deporting the mother, related to seeing birthright citizenship as a perverse incentive for illegal immigration\n\nSome people come legally with the intent of giving birth, which may involve immigration violations like overstaying a temporary visa, and that could present similar issues",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "The  kids should be with their legal guardians, probably, the mothers were the ones"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Suspect charged with murder over Vancouver Filipino festival car ramming, police say victims were aged five to 65",
            "external_url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk/index.html",
            "upvotes": 655,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-27t060646z-1584350354-rc256eaf4qtw-rtrmadp-3-canada-vancouver-street-festival-crash.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Kai-Ji Adam Lo, he had a brother that was killed like a year ago and even had a go fund me page.\n\n\nHis father also died shortly after they moved to the area.\n\n\nHis mother attempted suicide not too long ago too.\n\n\nHistory of mental illness, paranoia, probably schizophrenia, just sad all around. Often caught shouting with his mom where police would be called on them (no out right violence though).\n\n\nToo many lives lost for no reason at all.",
                "They were saying he had schizophrenia on the radio this afternoon, can’t imagine what must have been going through his mind. So many people have had their lives taken and others will be devastated, what a tragedy. I can’t hate on someone who is obviously extremely ill, he will never know peace now. That is his life sentence as well as being put in an institution for the extremely ill. Such a horrible tragedy.",
                "A very very minute part of me takes the smallest sliver of solace that this wasn't a hate fueled attack on people, but it's still a tragic nightmare of an event. I feel terrible for the victims and their families.",
                "Crazy guy, did something crazy.  It’s as simple as that.  Nothing political, nothing racial, nothing. Just bring back mental hospitals to deal with these damaged people instead of letting them roam the streets alone with their damaged thinking.  Get them help.",
                "I thought it would be racism but it’s mental illness.",
                "What a disgusting human …what is wrong with this world",
                "I was on the same day at a nearly identical street/food festival about 100km away, and the idea of security or the possibility that something dreadful like this could occur where I was walking around in the pleasant sunshine did not enter my mind. How sheltered we all are."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 2487,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "You know you're the bad guy when N. Korea's got your back.",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "These are replacement troops for the troops that were sent there last year, 40% casualties from last year....geez\n\n[https://www.bbc.com/news/articles/c87djeezjxeo](https://www.bbc.com/news/articles/c87djeezjxeo)",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America.",
                "Explains Trump's \"magical\" 180 this weekend",
                "> North Korean leader Kim Jong Un watches a cadet practicing on the parallel bars \n\nSending gymnasts off to war.",
                "Why is Russia provoking WW3??",
                "This certainly complicates matters. Under normal circumstances, this would be the perfect justification to up our aid to our European and Asian allies, but with our current leader, we are not in a normal situation."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 4382,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "I’m not just going to take their word for it that they’re immigrants",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!",
                "They’re saying that both MS-13 and Tren de Aragua were there. They’re literally just calling all immigrants members of these two gangs. If you demonize them and call them gang members, it becomes easier for the general public to justify deporting brown people left and right. You know who else was wrongly demonized in history, and the consequences of what happened to them because of it?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 25565,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "Where was he when I was a teen?",
                "The riddler if he was cool",
                "Give this man a key the city",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that.",
                "\"In total, officers said they recovered over a quarter of an ounce of marijuana.\"\n\nBet it was 8 grams. 2g per egg. Doesn't sound as good as a quarter ounce for rage bait though."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 8998,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "11 injured, 1 dead after shooting on North Ocean Blvd, SLED investigating: MBPD",
            "external_url": "https://wpde.com/news/local/police-investigating-after-shooting-incident-on-north-ocean-blvd-in-myrtle-beach",
            "upvotes": 954,
            "date": "04/27/2025",
            "thumbnail": "https://wpde.com/resources/media2/16x9/800/986/1x9/90/6953005f-244f-4ed6-9f99-651908232175-Image.jpg",
            "top_comments": [
                "*“Our officer saw what happened, and when he saw that an altercation was taking place and a gun was being shot, the officer responded very quickly and in my opinion, saved lives,” she said. “Last night could have been so much worse.”*\n\nAnd thus opens the tourist season in Myrtle Beach.",
                "“MYRTLE BEACH, S.C. (WPDE) — As of Sunday morning, 11 people are injured and one is dead after a shooting along the 900 block of North Ocean Boulevard on Saturday night, according to The Myrtle Beach Police Department.”",
                "Well, this would have not been known had it not been posted in this subreddit.\n\nJFC, if I had the ability to move out of this hellhole of a country, I would be more than happy to.",
                "Not a drag queen and not trans…",
                "If only there was some way to help prevent this. Damn.",
                "No mention of whether the person the officer shot was the one doing the shooting, eh?",
                "So just another day in America then? \n\nWe are so fucking stupid. Weapons in abundance but no help to be found for the downtrodden.",
                "[deleted]"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 6116,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Not deported. Kicked out illegally",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Remember this when they're asking for mercy",
                "Sending both citizen child and illegal immigrant mother out of the country is one option to avoid family separation. Rightwingers opposed to immigration hate the idea of having both stay, using the term \"anchor baby\" to frame it as a political if not legal barrier to deporting the mother, related to seeing birthright citizenship as a perverse incentive for illegal immigration\n\nSome people come legally with the intent of giving birth, which may involve immigration violations like overstaying a temporary visa, and that could present similar issues",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "The  kids should be with their legal guardians, probably, the mothers were the ones"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 271,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "Gun laws must be discussed seriously, man, I am from out of the States. Every month I certainly hear some hooligans' shooting and killing innocent people. \n\nI am scared to go to U.S. for my Masters, thinking I might get shot randomly for no reason at all.",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Why is this not shocking anymore?",
                "\"Not my problem\" -Trump ",
                "It’s the same question time and time again. \nHow many more need to die?",
                "[deleted]",
                "Why even bother posting this shit anymore is beyond me, isn't this just a day of life in America?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Suspect charged with murder over Vancouver Filipino festival car ramming, police say victims were aged five to 65",
            "external_url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk/index.html",
            "upvotes": 647,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-27t060646z-1584350354-rc256eaf4qtw-rtrmadp-3-canada-vancouver-street-festival-crash.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Kai-Ji Adam Lo, he had a brother that was killed like a year ago and even had a go fund me page.\n\n\nHis father also died shortly after they moved to the area.\n\n\nHis mother attempted suicide not too long ago too.\n\n\nHistory of mental illness, paranoia, probably schizophrenia, just sad all around. Often caught shouting with his mom where police would be called on them (no out right violence though).\n\n\nToo many lives lost for no reason at all.",
                "They were saying he had schizophrenia on the radio this afternoon, can’t imagine what must have been going through his mind. So many people have had their lives taken and others will be devastated, what a tragedy. I can’t hate on someone who is obviously extremely ill, he will never know peace now. That is his life sentence as well as being put in an institution for the extremely ill. Such a horrible tragedy.",
                "A very very minute part of me takes the smallest sliver of solace that this wasn't a hate fueled attack on people, but it's still a tragic nightmare of an event. I feel terrible for the victims and their families.",
                "Crazy guy, did something crazy.  It’s as simple as that.  Nothing political, nothing racial, nothing. Just bring back mental hospitals to deal with these damaged people instead of letting them roam the streets alone with their damaged thinking.  Get them help.",
                "I thought it would be racism but it’s mental illness.",
                "What a disgusting human …what is wrong with this world",
                "I was on the same day at a nearly identical street/food festival about 100km away, and the idea of security or the possibility that something dreadful like this could occur where I was walking around in the pleasant sunshine did not enter my mind. How sheltered we all are."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 2489,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "You know you're the bad guy when N. Korea's got your back.",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "These are replacement troops for the troops that were sent there last year, 40% casualties from last year....geez\n\n[https://www.bbc.com/news/articles/c87djeezjxeo](https://www.bbc.com/news/articles/c87djeezjxeo)",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America.",
                "Explains Trump's \"magical\" 180 this weekend",
                "> North Korean leader Kim Jong Un watches a cadet practicing on the parallel bars \n\nSending gymnasts off to war.",
                "Why is Russia provoking WW3??",
                "This certainly complicates matters. Under normal circumstances, this would be the perfect justification to up our aid to our European and Asian allies, but with our current leader, we are not in a normal situation."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 4385,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "I’m not just going to take their word for it that they’re immigrants",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!",
                "They’re saying that both MS-13 and Tren de Aragua were there. They’re literally just calling all immigrants members of these two gangs. If you demonize them and call them gang members, it becomes easier for the general public to justify deporting brown people left and right. You know who else was wrongly demonized in history, and the consequences of what happened to them because of it?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 25563,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "Where was he when I was a teen?",
                "The riddler if he was cool",
                "Give this man a key the city",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that.",
                "\"In total, officers said they recovered over a quarter of an ounce of marijuana.\"\n\nBet it was 8 grams. 2g per egg. Doesn't sound as good as a quarter ounce for rage bait though."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 8992,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 17741,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "Probably shouldn't cut parts off babies for no reason",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "It's crazy it's still the norm in many parts of the US.\n\nMy son was born at the Montreal **Jewish** Hospital. It was clearly stated that circumcision (for non-medical cases) was not offered by the obstetrics department. There was a clinic available in the hospital with a doctor who is also a Mohel for those parents who chose so. It was a paid service not covered by the government.\n\nIMO, it should be made illegal, but that's a debate for another time.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Genital mutilation should be illegal",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "Maybe don’t elect to  mutilate your newborns genitalia"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 17175,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Part of the issue is us the consumer. We need to be active & skeptical in the news we absorb. We need to question and research the information we believe, but that would take critical thinking skills. We do not we don’t teach that in the US.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 2221,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "This sounds ridiculous.",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "In a court filing, Cano denied the U.S. government’s characterization of the men as gang members, saying each of them were subjected to “thorough and rigorous” proceedings with Immigration and Customs Enforcement agents when they entered the country. He said the first time he heard that they may have gang ties was the morning federal agents raided their home took the men into custody.\n\nCano said he and his wife, Nancy Cano allowed the men to stay in their spare studio apartment in April 2024. He said they told the couple that they requested asylum upon entering the U.S. in 2023, were processed by immigration officials and were then released with court dates for their requests. Cano said the men showed paperwork to back up their stories.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "\"Federal agents say videos and photos on Ortega-Lopez’s social media accounts 'displayed clear indicators of Tren de Aragua' and that other elements – tattoos, clothing and hand gestures – 'provide strong evidence' of a potential connection to the gang.\"\n\nIt is unbelievably disingenuous to include this info without either saying WHY these elements allegedly indicate gang connections, or to include that there has been a spate of instances where ICE states the existence of any type of tattoo is indication of gang connections for South American immigrants.\n\nAP News is up there with Reuters in terms of good sources of news, but this \"x said this, y said this\" type of reporting legitimizes lies and liars even if it is factually accurate.\n\nEverything else aside this is a great example to demonstrate that legacy media will not save us from fascism, or even properly contextualize it.",
                "If everyone is a gang member, no one is.",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role"
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "04/28/2025 08:30:52 UTC"
}