{
    "posts": [
        {
            "category": "HOT",
            "title": "FBI Employees Reviewing Jeffrey Epstein Files Told to Limit Redactions",
            "external_url": "https://www.wsj.com/us-news/law/doj-jeffrey-epstein-documents-7da298dc",
            "upvotes": 13633,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only redact the victims, do not redact the perpetrators.",
                "The only thing redacted should be the names of the victims. Fuck all the pedos, enablers, and other scum that were associated with Epstein and Maxwell. And yes that means the Clinton’s as well as Trump and all his buddies.",
                "\"Just make sure they get the ones involving person of interest number 1.\"",
                "why is revealing the list be “national security concerning” it’s not like it’s nuclear bomb manuals?",
                "Limit them to what, those inside the current admin?",
                "I think there's gonna be a huge meltdown on the internet when the ultimate conclusion in the files is \"we have no reason, beyond nebulous allegations of motive, to think any third party was involved in his death.\" No one online is gonna buy that, regardless of if it was written by an earnest investigator or not.\n\nBasically, I think everyone is about to feel a serious case of angry blue balls.",
                "Yup.  Just need to limit all redactions to removing all references to the word \"Trump.\"  Easy peasy!",
                "I’m sure they’re going to limit the redactions to Republicans only. Any Democrats or Left leaning individuals will be implicated, without a single Right wing donor or politician on the list. Really sell that narrative that the Left is a bastion of scum and villainy. \n\nWe’ve got enough consciousness to actually prosecute our own when they do horrible things. Which unfortunately plays into that narrative even further.",
                "Wasn't Elon photographed with Maxwell?  Why is he so invested in getting into so many government agencies?  I am just asking questions.",
                "They want to get the Clintons, but not the Republican donors."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "The Pentagon's DEI purge: Officials describe a scramble to remove and then restore online content",
            "external_url": "https://apnews.com/article/pentagon-dei-diversity-social-media-purge-fb15996733408a8122a97acd3baa6820",
            "upvotes": 2286,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*While the pages of some well-known veterans... are now back up on Pentagon websites, officials warn that many posts tagged for removal in error may be gone forever.*\n\nSounds familiar:  they're great at razing but not at raising.",
                "A great use of our tax dollars for sure! /s",
                "What are the odds they will quietly remove them again in a few months, hoping people will be distracted by another thing?",
                "These revisionists deemed the Enola Gay, the Tuskegee airmen, and Major General Charles Rogers's Medal of Honor DEI. They are trying to scrub the history of the military and they call themselves patriots and America First. People really should have paid attention to Project 2025 since now, we have to wait until 2026 to change the Congress.",
                "They also took down the web pages concerning the most decorated military unit in US history, the 442nd Regimental Combat Team. An outcry from veterans restored it.",
                "Racist, homophobic assholes.",
                "I know that they're sworn to obedience, and they are being given lawful orders.\n\nBut the orders echo the Nazi purges of the past century. They are actions that mirror the policies of our enemies. The nation mobilized against such things, pouring out blood and treasure to stop them. It was one of our proudest moments, and one that serves to define how we see ourselves as a nation.\n\nThe Pentagon shouldn't be \"scrambling\" to obey such orders, however technically lawful they may be. This purge impresses a stain on the honor of our Armed Forces that will never be expunged. I would expect them to be slow-walking every step. Every order should be met by the impenetrable bureaucracy and red tape that military organizations are famous for. Every signature should be obtained only after each word of the orders and plans are inspected in detail, reviewed by committees, stamped, filed, lost, found, encoded with reference numbers, and distributed to each relevant department. If a form must be filled out, pens should be requisitioned for the purpose. When the pens arrive, they should be deemed unsuitable because the ink viscosity doesn't comply with procurement regulations. The rejected shipment should be returned, and a refund from the contracted vendor obtained and accounted before a new requisition is originated. And once pens are obtained, the forms can be filled out in proper triplicate, to be separated and filed in their widespread destinations. \n\nUn-American orders need not be expedited; they should be completed with \"all deliberate speed\". Emphasis on \"deliberation\". If the \"Received\" stamp is crooked in its little square, the paperwork should be rejected without explanation until a communication is established to convey that the papers need to be re-done, with a proper cross-reference number linking the rejected paperwork with the replacement.\n\nRemoving an entry on a website *ought to take MONTHS.*",
                "Why would people that want to overthrow our democracy spend this much time and effort pissing off the military FOR NO TANGIBLE BENEFIT?\n\nWell I suppose if these people were smart they wouldn’t be racist..",
                "Glad to see my tax dollars spent well.....",
                "It's almost like big balls wrote an algorithm that checks everything against a keyword list of things that this admin wants to erase from history."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Trump rescinds security clearances of political rivals Harris, Clinton and others | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/21/politics/security-clearances-trump-harris-clinton/index.html",
            "upvotes": 5658,
            "date": "03/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/20250321-harrisclintonsplit.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> He directed Attorney General Pam Bondi to review the conduct of lawyers and law firms the administration considers to have filed frivolous lawsuits against the Trump administration or attempted to block immigration initiatives, broadening the president’s crackdown on the US legal community in the United States. \n\nThis is a whole article in its own right, tacked on the end there. \n\n[Trump ordered the attorney general to report 'frivolous' lawsuits against his administration so he can consider executive actions against firms. Read the memo.](https://www.businessinsider.com/donald-trump-attorney-general-memo-identify-target-law-firms-2025-3)",
                "If Trump had to go through the actual security clearance process, he would not even be able to get a Secret.",
                "The irony^* of a (then) former president storing classified information in a private bathroom, then becoming president and revoking clearances of other former officials is spectacularly bizarre. \n\n\n^* hypocrisy",
                "Found the weaponizing of the Justice Department that Trump has long complained about...",
                "Like, imagine if Obama did this to Bush Jr? Ohh wait, you can't because it's only something a petty immature asshole would do, right, and a US president would have enough self dignity to not act like a child, so you would think. \n\nI'm sure they can attempt to sue to get it back since the clearances weren't revoked for anything meaningful, it seems, but I'm not sure how that would work or if there is any legal recourse available.",
                "He thinks the DOJ is his personal law firm and Bondi seems to agree with him",
                "Some of them did not even have security clearance anymore. This was mostly performative.\n\nKinzinger made a post to his substack about it.",
                "Our president, ladies & germs - the sniveling cowardly punk ass bitch",
                "This is so dumb because when high level officials leave, they usually retain their security clearances *so current officials can ask them questions on new info.*\n\n\nIt's not like Clinton is getting a daily intelligence brief.",
                "Now the president has the power to determine the legitimacy of lawsuits.\n\nNo authoritarian conduct here.  No Imperial Presidency to see folks. Move along or you'll be in prison in El salvador."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "3 killed, 14 injured in mass shooting at New Mexico park",
            "external_url": "https://www.nbcnews.com/news/us-news/3-killed-14-injured-new-mexico-mass-shooting-rcna197615",
            "upvotes": 2122,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250322-las-cruces-ch-1139-b42971.jpg",
            "top_comments": [
                "200 miles from Albuquerque? Thats like attributing Cooperstown to NYC",
                "From the article:\n\n“The Las Cruces Police Department said the shooting happened at around 10 p.m. at Young Park, over 200 miles south of Albuquerque. Three victims, a 16-year-old boy and two 19-year-old men, were found dead.”\n\nMost parks close at 10 pm.",
                "Idiots at a car meet/takeover at 10pm. Those seem to only attract the shittiest type of people.",
                "They say you can tell when winter is over in France because they start setting cars on fire again.\n\nI guess winter is over in America.",
                "I'm at a park with my kid as I see this\n\n\nFuck guns and those that prioritize gun execs being wealthy over human lives\n\nedit: \"Blame the tool, not the murderer\" hey chief do you think we should allow people to bring bombs on planes too? After all, it's not the bomb's fault! We have to protect the inanimate weapons!\n\nEvery other developed nation in the world has this figured out, but then again, they haven't had large factions doing their best to dismantle education for half a century\n\nedit: Like i said, proven effective in every other country in the developed world. Yes, it would reduce shootings immensely to have fewer guns around. Can't believe how dumb people are about this, people like u/optimaloutcome making the \"no laws work so we shouldn't have any laws\" argument. Laws are effective, this doesn't need to be demonstrated or proven any more than all of human history already has.\n\nGun laws work. Restricted access and fewer guns in the population means fewer guns in the hands of people willing to commit shootings. Please use your brains, and not just regurgitate logic-free gun lobby talking points.\n\n*There is a reason this shit doesn't happen all the time anywhere else in the world.* Australia's example is *right there.*",
                "But it's not Domestic Terrorism because no Teslas were spray painted...",
                "Fuck. I was just thinking yesterday about how it’s been nice having not hearing about a mass or school shooting in a minute. Also I went to college in las cruces so breaks my heart even more to hear about this. I hope they’re able to find this piece of shit who did this quickly",
                "Not worthy reporting on Fox, unless a Tesla was damaged.",
                "Good thing they didn't vandalize a Tesla.",
                "I feel like there have been far fewer shootings in the USA lately. Or maybe so much else is happening so fast that they’re just background noise. And I can’t tell what’s sadder."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "2 more cases of measles confirmed in Maryland",
            "external_url": "https://wtop.com/health-fitness/2025/03/2-more-cases-of-measles-confirmed-in-maryland/",
            "upvotes": 615,
            "date": "03/22/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2024/04/Technology_Passport_Control_91675-scaled.jpg",
            "top_comments": [
                "Needles with vaccine?  Bad.  \nNeedles with heroin? Good!\n\n-RFK Jr. ",
                "Between this, H5N1, and a looming economic downturn, we're in for a hell of a time.",
                "If only we had a proven medical way to prevent measles from spreading.",
                "Jeez the possible exposure areas/times feels like an itinerary list.",
                "Just take a multivitamin and you’ll be fine! /s",
                "This administration of effete billionaires, who've never crossed paths with a hard day's work, don't think we really need vaccines. Or CDC research. Or affordable health care, or educations, or affordable groceries, or our foreign allies, or the social security benefits that we payed into for years. What we need - above all - is for *them* to pay less taxes. \n\nThen they hop on a jet to go play golf on one of their many private, guarded properties - again at our expense, of course. I mean, you'd have to just despise your fellow Americans to cheer these inept, pampered, bad-actors on.",
                "Sacrificing their children on the altar to their orange god-king.",
                "Oh dear. Wow.\n\nI hope they can figure out a way to prevent all of this.",
                "Our enemies are laughing there asses off \n\nHow do you defeat a more advanced enemy? \n\nFROM WITHIN",
                "We know who didn't get vaccinated"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "OCDSB seeking court order in bid to unmask anonymous “Redditor”",
            "external_url": "https://www.cbc.ca/news/canada/ottawa/ocdsb-seeking-court-order-in-bid-to-unmask-anonymous-redditor-1.7489101",
            "upvotes": 3954,
            "date": "03/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7141767.1710274888!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/reddit-ipo.JPG?im=Resize%3D620",
            "top_comments": [
                "From The CBC:\n\n>The Ottawa-Carleton District School Board (OCDSB) is locked in a court battle to compel social media site Reddit to turn over identifying information of a user who it alleges has been defaming staff at a local elementary school.\n\n>The board alleges the posts about ongoing issues at Pinecrest Public School were made in an attempt to defame employees “for some unknown ulterior motive.” None of the allegations have been proven in court.\n\n>The board wants Reddit to provide any email addresses, phone numbers, location data and other identifying information about the user. In a statement, it said it was compelled by its “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.”\n\n>Reddit argues handing over the information will create a chill among other users, explaining in its court filings that “anonymity is not just a user preference but a defining feature of Reddit’s business model and identity.”\n\n>Most of the comments in question were in response to discussions around news stories about the board and problems at specific schools. Several involved specific incidents and ongoing issues at Pinecrest Public School that have been reported in the media.\n\n>Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations. \n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school [student who died after being stabbed in Nepean](https://www.cbc.ca/news/canada/ottawa/high-school-student-stabbed-last-week-in-nepean-dies-1.7194798) last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\n>The board said it’s considering a defamation lawsuit against the person responsible for posting the comments. But Reddit denies OCDSB’s claim that the information is “necessary for it to determine whether to pursue a potential claim for defamation.”\n\n>OCDSB ‘vigorously defending’ employees. In response to CBC’s request for comment, OCDSB communications manager Diane Pernari said the board is committed to “vigorously defending our employees against unfounded attacks and upholding our legal and ethical obligations.”\n\n>She wrote the legal action underscores the board’s “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.” Known as a Norwich Order, the board’s application seeks to compel a third party to provide information about alleged wrongdoing, even if the third party isn’t directly involved in the wrongdoing.\n\n>Reddit did not respond to a request for comment. Lawyers for both parties are expected to have another court date later this year. \n\n>Court to consider free speech, defamation. Ottawa-based lawyer Karin Page said the school board will have to demonstrate the user’s comments were defamatory, rather than just critical of its policies. \n\n>Page said the court will need to balance the public interest in protecting anonymous speech against the board’s need to defend itself against alleged defamation. “There’s a difference between someone just voicing their opposition to a policy or ... to the government, or to disclosing their own personal situations,” she said. “There’s a distinction between that and making defamatory statements online.”\n\n>She added the fact the comments named or identified specific individuals is concerning, as it makes it difficult for those people to defend themselves.",
                ">Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations.\n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school student who died after being stabbed in Nepean last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\nThey're trying to go after a teacher who criticized them. Fuck that district.\n\n~ Teacher",
                "Of course it’s pinecrest lmao, that school is a shit hole.",
                "I feel like this action by the school officials has made the \"defamatory\" comments much more widely known.\n\nAlso trying to \"unmask\" and sue a commenter on reddit makes them look even worse, somehow.",
                "This lawsuit is a joke and an example of how school boards attract some seriously ignorant people.",
                "I feel like they would be better off using the money paying court costs on solving the issue the redditor is being critical of. If there wasn't anything that warranted complaining about, the issue wouldn't have come up.\n\nAside from that tangent, I do hope reddit keeps that user anonymous. Maybe ban the user if it is determined a defamation case against them would succeed beyond reasonable doubt. Reddit giving up information to a smaller non-us court would almost certainly set a precedent of giving up any info requested by a larger government that is being overrun by Nazis. And that spooks me because that could be used for any number of things. \n\nSure, I could be worried about a slippery slope, but given it hasn't even been 2 months with Trump in office, I would like to avoid the risk over the next... 3.5 years...",
                "The OCDSB certainly could defend themselves against false allegation, it doesn't take the posters identity to do it, that's a pig that wants revenge. What's worse, bad mouthing the system, or trying to identify your detractors for revenge?",
                "Sounds like they deserve all the criticism they get.",
                "If Reddit caves to a school board what will they do when the Trump administration demands the same thing?",
                "This is a big test for Reddit if they will cave-in with the authoritarian school district board in Canada.\n\nGiving away user information will have bigger implication for this community. \n\nClearly, it was not defamation. OCDSB is a bully school board who doesn't care about their teachers and students."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis to be discharged from hospital tomorrow but needs two months of rest, say doctors",
            "external_url": "https://news.sky.com/story/pope-francis-to-be-discharged-from-hospital-tomorrow-13333785",
            "upvotes": 889,
            "date": "03/22/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-pope-francis-vatican_6864342.jpg?20250322175352",
            "top_comments": [
                "Does rest help like 80 year olds with pnemonia? Dont they need to stay active",
                "Producers of “Conclave” are screaming internally right now.",
                "It was all just publicity stunt to promote \"Conclave\"s Oscar campaign",
                "Honestly bonkers that he survived this.",
                "Good. He’s actually a good person which is rare for many religious public figures nowadays",
                "No fucking way he lived. That’s crazy. Good on him though, not many men his age can come back from something as serious as this",
                "I’m not a conspiracy theorist, but needing two months of rest at home is suspicious as hell\n\nEdit: Yeah, he's 88, but \"two months at home\" instead of \"rest indefinitely\" makes no sense to me",
                "Is this the new hospice?",
                "Its strange how God alledgedly use to do all these miracles and healing and when his guy needs it, requires all these doctors and mortal healing periods. Why doesn't God (who totally exists) just fix him up lickety-split so he can get back to business?",
                "Oh but how will the world keep spinning?!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 23292,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "[deleted]",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "Still set to fight Jake Paul next month.",
                "\"Down goes Frazier! Down goes Frazier! Down goes Frazier!\"\n\nHe won the heavyweight title in 1974 and then again in 1994.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 6376,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "LA county Sheriff's 2 years ago. 4 suicides within 24. hours.https://www.google.com/amp/s/abc7.com/amp/los-angeles-county-sheriffs-department-suicide-deaths-lasd-employees/14036429/",
                "[deleted]",
                "Something nasty went down",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, you won’t find that person here.”",
                "Harris County (Texas) Sheriff's Office, for those too lazy, but still curious.",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious.",
                "Did they all fall out of a huge window together?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 115,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "Had enough of their shit fr",
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Obviously this was the absolute wrong way to handle it but the passenger more or less admitted to hogging the bathroom. Take as much time as you want in your own house but maybe be considerate of the other people on a fucking PLANE. It's not like they can get off and use a different one.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "Honestly valid crash out",
                "*Liebb and a fellow Orthodox Jewish traveler said they were forced to miss a connecting flight to New York City while US Customs and Border Protection officers paraded them through an airport terminal, placed them in holding cells and searched their luggage.*\n\nHomeland Security also boarded the plane in NYC and hustled the group off the plane, handing them over to US Customs officers.  (the bathroom nightmare wasn't enough)",
                "Pilots are on edge or what"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 113,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "Had enough of their shit fr",
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Obviously this was the absolute wrong way to handle it but the passenger more or less admitted to hogging the bathroom. Take as much time as you want in your own house but maybe be considerate of the other people on a fucking PLANE. It's not like they can get off and use a different one.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "Honestly valid crash out",
                "*Liebb and a fellow Orthodox Jewish traveler said they were forced to miss a connecting flight to New York City while US Customs and Border Protection officers paraded them through an airport terminal, placed them in holding cells and searched their luggage.*\n\nHomeland Security also boarded the plane in NYC and hustled the group off the plane, handing them over to US Customs officers.  (the bathroom nightmare wasn't enough)",
                "Pilots are on edge or what"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Protesters in Turkey rally 'for justice' after mayor's arrest - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c0egjvj8vdro.amp",
            "upvotes": 109,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9c8e/live/db493160-075f-11f0-8ef8-d90499625106.jpg",
            "top_comments": [
                "#Tear Gas and Turmoil as Turkey Rises for Justice\n\nThe streets of Istanbul have been lit up not by celebration but by the fierce glow of protest as thousands rally for justice following the arrest of the city’s mayor, Ekrem Imamoglu. For four nights running, crowds have surged across Turkey’s major cities, marking the country’s largest wave of demonstrations in over a decade. What began with a few scattered gatherings has now grown into a roar of resistance.\n\nImamoglu, long seen as a serious rival to President Recep Tayyip Erdogan, was taken into custody on Wednesday, just days before his party was expected to confirm him as their presidential candidate for 2028. Accused of corruption and aiding terrorist groups, charges he flatly denies, his arrest has shaken the political landscape and drawn thousands into the streets demanding his release.\n\nOn Saturday, he appeared in court, his supporters chanting \"rights, law, justice\" outside as tear gas swirled in the cold night air. Riot police stood shoulder to shoulder, firing round after round to break up the crowds, but still they came. Mothers holding their children, students in masks, pensioners waving flags, all united by a shared belief that something fundamental is slipping away.\n\n\"I'm here for liberty,\" one young woman told the BBC, her face hidden behind a mask. \"Turkish people cannot accept this. This is against our behaviour and culture.\" Her words echoed the mood across Istanbul, where the government has banned public gatherings in a bid to quell the unrest. But the ban only seems to have poured fuel on the fire.\n\nIn Izmir and Ankara, the story was much the same. Water cannons, arrests, more tear gas. On Friday alone, 343 people were reportedly detained. Still, the crowds held their ground, shouting not in anger but in defiance, determined to be heard. There is an unmistakable feeling that this is no longer just about one man, but about the future of democracy itself in Turkey.\n\nImamoglu’s bid for the presidency now hangs in the balance. Just a day before his arrest, Istanbul University stripped him of his degree, citing irregularities. If upheld, this would disqualify him from running, as Turkish law requires a university qualification for presidential candidates. The timing has raised eyebrows across the political spectrum.\n\nPresident Erdogan, who has ruled the country for over two decades, cannot stand again in 2028 unless the constitution is changed. Critics argue that the arrests of Imamoglu and more than a hundred others, including journalists and business figures, are an attempt to clear the political field before the next election. The government, for its part, insists the judiciary is acting independently and has hit out at those suggesting otherwise.\n\nWhether or not that claim holds weight, what is clear is that a growing number of Turkish citizens feel they are being silenced. The sheer courage of those risking arrest to march night after night speaks volumes. These protests are no longer just about one politician behind bars. They are about the soul of a nation, and the kind of future its people are willing to fight for."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "A passenger says a United pilot forcibly removed him from an airplane bathroom. Now he is suing",
            "external_url": "https://apnews.com/article/united-airlines-bathroom-lavatory-lawsuit-orthodox-jews-348d297cec3ff009c29859047b9d2fe4",
            "upvotes": 3,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "2 more cases of measles confirmed in Maryland",
            "external_url": "https://wtop.com/health-fitness/2025/03/2-more-cases-of-measles-confirmed-in-maryland/",
            "upvotes": 610,
            "date": "03/22/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2024/04/Technology_Passport_Control_91675-scaled.jpg",
            "top_comments": [
                "Needles with vaccine?  Bad.  \nNeedles with heroin? Good!\n\n-RFK Jr. ",
                "Between this, H5N1, and a looming economic downturn, we're in for a hell of a time.",
                "If only we had a proven medical way to prevent measles from spreading.",
                "Jeez the possible exposure areas/times feels like an itinerary list.",
                "Just take a multivitamin and you’ll be fine! /s",
                "This administration of effete billionaires, who've never crossed paths with a hard day's work, don't think we really need vaccines. Or CDC research. Or affordable health care, or educations, or affordable groceries, or our foreign allies, or the social security benefits that we payed into for years. What we need - above all - is for *them* to pay less taxes. \n\nThen they hop on a jet to go play golf on one of their many private, guarded properties - again at our expense, of course. I mean, you'd have to just despise your fellow Americans to cheer these inept, pampered, bad-actors on.",
                "Sacrificing their children on the altar to their orange god-king.",
                "Oh dear. Wow.\n\nI hope they can figure out a way to prevent all of this.",
                "Our enemies are laughing there asses off \n\nHow do you defeat a more advanced enemy? \n\nFROM WITHIN",
                "We know who didn't get vaccinated"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Nova Scotia legislators vote unanimously to scrap electric car rebates for Tesla",
            "external_url": "https://www.thecanadianpressnews.ca/politics/nova-scotia-legislators-vote-unanimously-to-scrap-electric-car-rebates-for-tesla/article_644f9fd5-46b5-5b39-9032-772de4b37f7c.html",
            "upvotes": 55,
            "date": "03/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/d/bd/dbdbe4b2-efe8-50e1-9af3-4f193ff5b396/67ded0c011d58.image.jpg?crop=1400%2C735%2C0%2C99&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The Pentagon's DEI purge: Officials describe a scramble to remove and then restore online content",
            "external_url": "https://apnews.com/article/pentagon-dei-diversity-social-media-purge-fb15996733408a8122a97acd3baa6820",
            "upvotes": 2288,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*While the pages of some well-known veterans... are now back up on Pentagon websites, officials warn that many posts tagged for removal in error may be gone forever.*\n\nSounds familiar:  they're great at razing but not at raising.",
                "A great use of our tax dollars for sure! /s",
                "What are the odds they will quietly remove them again in a few months, hoping people will be distracted by another thing?",
                "These revisionists deemed the Enola Gay, the Tuskegee airmen, and Major General Charles Rogers's Medal of Honor DEI. They are trying to scrub the history of the military and they call themselves patriots and America First. People really should have paid attention to Project 2025 since now, we have to wait until 2026 to change the Congress.",
                "They also took down the web pages concerning the most decorated military unit in US history, the 442nd Regimental Combat Team. An outcry from veterans restored it.",
                "Racist, homophobic assholes.",
                "I know that they're sworn to obedience, and they are being given lawful orders.\n\nBut the orders echo the Nazi purges of the past century. They are actions that mirror the policies of our enemies. The nation mobilized against such things, pouring out blood and treasure to stop them. It was one of our proudest moments, and one that serves to define how we see ourselves as a nation.\n\nThe Pentagon shouldn't be \"scrambling\" to obey such orders, however technically lawful they may be. This purge impresses a stain on the honor of our Armed Forces that will never be expunged. I would expect them to be slow-walking every step. Every order should be met by the impenetrable bureaucracy and red tape that military organizations are famous for. Every signature should be obtained only after each word of the orders and plans are inspected in detail, reviewed by committees, stamped, filed, lost, found, encoded with reference numbers, and distributed to each relevant department. If a form must be filled out, pens should be requisitioned for the purpose. When the pens arrive, they should be deemed unsuitable because the ink viscosity doesn't comply with procurement regulations. The rejected shipment should be returned, and a refund from the contracted vendor obtained and accounted before a new requisition is originated. And once pens are obtained, the forms can be filled out in proper triplicate, to be separated and filed in their widespread destinations. \n\nUn-American orders need not be expedited; they should be completed with \"all deliberate speed\". Emphasis on \"deliberation\". If the \"Received\" stamp is crooked in its little square, the paperwork should be rejected without explanation until a communication is established to convey that the papers need to be re-done, with a proper cross-reference number linking the rejected paperwork with the replacement.\n\nRemoving an entry on a website *ought to take MONTHS.*",
                "Why would people that want to overthrow our democracy spend this much time and effort pissing off the military FOR NO TANGIBLE BENEFIT?\n\nWell I suppose if these people were smart they wouldn’t be racist..",
                "Glad to see my tax dollars spent well.....",
                "It's almost like big balls wrote an algorithm that checks everything against a keyword list of things that this admin wants to erase from history."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Families concerned over living conditions at Krome Detention Center",
            "external_url": "https://www.nbcmiami.com/news/local/families-concerned-over-living-conditions-at-krome-detention-center/3573640/",
            "upvotes": 250,
            "date": "03/22/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/03/Families-concerned-over-conditions-overcrowding-at-Krome-Detention-Center.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "*The U.S. Immigration and Customs Enforcement said in a statement that while they* ***can’t “provide*** *population numbers* ***due to operational and security concerns****, some ICE facilities are experiencing temporary overcrowding due to recent increases in detention populations.*\n\nThat's called speaking officialese. This is always both a first and last resort of the professional dissemblers.",
                "> A video that has since gone viral shows people sleeping on the floor, and a man pleads for help, explaining there is little to no food at Krome.\n\nAnd \n\n> “Osiris was deported to Mexico. He was detained in Krome for several days with no water, sleeping outside,” she said.\n\nWe are in the early days of the time of monsters, and the people running these prisons already feel comfortable depriving their prisoners of the most basic necessities. \n\nIf you think this is okay, would it be all right if it was your partner? Your family? Your kid? You?\n\nBecause we have no reason to think the people responsible for this will stop at any law or challenge or line.",
                "The cruelty is the point."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Nearly 2,000-acre brush fire burns in Florida's Everglades National Park",
            "external_url": "https://www.gulfcoastnewsnow.com/article/florida-everglades-fire-brush-national-park/64231906",
            "upvotes": 11,
            "date": "03/22/2025",
            "thumbnail": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/screenshot-2025-03-19-121350-67daed436893d.png?crop=1.00xw:0.961xh;0,0&resize=1200:*",
            "top_comments": [
                "They need to start vacuuming fast!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Trump rescinds security clearances of political rivals Harris, Clinton and others | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/21/politics/security-clearances-trump-harris-clinton/index.html",
            "upvotes": 5661,
            "date": "03/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/20250321-harrisclintonsplit.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> He directed Attorney General Pam Bondi to review the conduct of lawyers and law firms the administration considers to have filed frivolous lawsuits against the Trump administration or attempted to block immigration initiatives, broadening the president’s crackdown on the US legal community in the United States. \n\nThis is a whole article in its own right, tacked on the end there. \n\n[Trump ordered the attorney general to report 'frivolous' lawsuits against his administration so he can consider executive actions against firms. Read the memo.](https://www.businessinsider.com/donald-trump-attorney-general-memo-identify-target-law-firms-2025-3)",
                "If Trump had to go through the actual security clearance process, he would not even be able to get a Secret.",
                "The irony^* of a (then) former president storing classified information in a private bathroom, then becoming president and revoking clearances of other former officials is spectacularly bizarre. \n\n\n^* hypocrisy",
                "Found the weaponizing of the Justice Department that Trump has long complained about...",
                "Like, imagine if Obama did this to Bush Jr? Ohh wait, you can't because it's only something a petty immature asshole would do, right, and a US president would have enough self dignity to not act like a child, so you would think. \n\nI'm sure they can attempt to sue to get it back since the clearances weren't revoked for anything meaningful, it seems, but I'm not sure how that would work or if there is any legal recourse available.",
                "He thinks the DOJ is his personal law firm and Bondi seems to agree with him",
                "Some of them did not even have security clearance anymore. This was mostly performative.\n\nKinzinger made a post to his substack about it.",
                "Our president, ladies & germs - the sniveling cowardly punk ass bitch",
                "This is so dumb because when high level officials leave, they usually retain their security clearances *so current officials can ask them questions on new info.*\n\n\nIt's not like Clinton is getting a daily intelligence brief.",
                "Now the president has the power to determine the legitimacy of lawsuits.\n\nNo authoritarian conduct here.  No Imperial Presidency to see folks. Move along or you'll be in prison in El salvador."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis to be discharged from hospital tomorrow but needs two months of rest, say doctors",
            "external_url": "https://news.sky.com/story/pope-francis-to-be-discharged-from-hospital-tomorrow-13333785",
            "upvotes": 898,
            "date": "03/22/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-pope-francis-vatican_6864342.jpg?20250322175352",
            "top_comments": [
                "Does rest help like 80 year olds with pnemonia? Dont they need to stay active",
                "Producers of “Conclave” are screaming internally right now.",
                "It was all just publicity stunt to promote \"Conclave\"s Oscar campaign",
                "Honestly bonkers that he survived this.",
                "Good. He’s actually a good person which is rare for many religious public figures nowadays",
                "No fucking way he lived. That’s crazy. Good on him though, not many men his age can come back from something as serious as this",
                "I’m not a conspiracy theorist, but needing two months of rest at home is suspicious as hell\n\nEdit: Yeah, he's 88, but \"two months at home\" instead of \"rest indefinitely\" makes no sense to me",
                "Is this the new hospice?",
                "Its strange how God alledgedly use to do all these miracles and healing and when his guy needs it, requires all these doctors and mortal healing periods. Why doesn't God (who totally exists) just fix him up lickety-split so he can get back to business?",
                "Oh but how will the world keep spinning?!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "2 more cases of measles confirmed in Maryland",
            "external_url": "https://wtop.com/health-fitness/2025/03/2-more-cases-of-measles-confirmed-in-maryland/",
            "upvotes": 614,
            "date": "03/22/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2024/04/Technology_Passport_Control_91675-scaled.jpg",
            "top_comments": [
                "Needles with vaccine?  Bad.  \nNeedles with heroin? Good!\n\n-RFK Jr. ",
                "Between this, H5N1, and a looming economic downturn, we're in for a hell of a time.",
                "If only we had a proven medical way to prevent measles from spreading.",
                "Jeez the possible exposure areas/times feels like an itinerary list.",
                "Just take a multivitamin and you’ll be fine! /s",
                "This administration of effete billionaires, who've never crossed paths with a hard day's work, don't think we really need vaccines. Or CDC research. Or affordable health care, or educations, or affordable groceries, or our foreign allies, or the social security benefits that we payed into for years. What we need - above all - is for *them* to pay less taxes. \n\nThen they hop on a jet to go play golf on one of their many private, guarded properties - again at our expense, of course. I mean, you'd have to just despise your fellow Americans to cheer these inept, pampered, bad-actors on.",
                "Sacrificing their children on the altar to their orange god-king.",
                "Oh dear. Wow.\n\nI hope they can figure out a way to prevent all of this.",
                "Our enemies are laughing there asses off \n\nHow do you defeat a more advanced enemy? \n\nFROM WITHIN",
                "We know who didn't get vaccinated"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "The Pentagon's DEI purge: Officials describe a scramble to remove and then restore online content",
            "external_url": "https://apnews.com/article/pentagon-dei-diversity-social-media-purge-fb15996733408a8122a97acd3baa6820",
            "upvotes": 2282,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*While the pages of some well-known veterans... are now back up on Pentagon websites, officials warn that many posts tagged for removal in error may be gone forever.*\n\nSounds familiar:  they're great at razing but not at raising.",
                "A great use of our tax dollars for sure! /s",
                "What are the odds they will quietly remove them again in a few months, hoping people will be distracted by another thing?",
                "These revisionists deemed the Enola Gay, the Tuskegee airmen, and Major General Charles Rogers's Medal of Honor DEI. They are trying to scrub the history of the military and they call themselves patriots and America First. People really should have paid attention to Project 2025 since now, we have to wait until 2026 to change the Congress.",
                "They also took down the web pages concerning the most decorated military unit in US history, the 442nd Regimental Combat Team. An outcry from veterans restored it.",
                "Racist, homophobic assholes.",
                "I know that they're sworn to obedience, and they are being given lawful orders.\n\nBut the orders echo the Nazi purges of the past century. They are actions that mirror the policies of our enemies. The nation mobilized against such things, pouring out blood and treasure to stop them. It was one of our proudest moments, and one that serves to define how we see ourselves as a nation.\n\nThe Pentagon shouldn't be \"scrambling\" to obey such orders, however technically lawful they may be. This purge impresses a stain on the honor of our Armed Forces that will never be expunged. I would expect them to be slow-walking every step. Every order should be met by the impenetrable bureaucracy and red tape that military organizations are famous for. Every signature should be obtained only after each word of the orders and plans are inspected in detail, reviewed by committees, stamped, filed, lost, found, encoded with reference numbers, and distributed to each relevant department. If a form must be filled out, pens should be requisitioned for the purpose. When the pens arrive, they should be deemed unsuitable because the ink viscosity doesn't comply with procurement regulations. The rejected shipment should be returned, and a refund from the contracted vendor obtained and accounted before a new requisition is originated. And once pens are obtained, the forms can be filled out in proper triplicate, to be separated and filed in their widespread destinations. \n\nUn-American orders need not be expedited; they should be completed with \"all deliberate speed\". Emphasis on \"deliberation\". If the \"Received\" stamp is crooked in its little square, the paperwork should be rejected without explanation until a communication is established to convey that the papers need to be re-done, with a proper cross-reference number linking the rejected paperwork with the replacement.\n\nRemoving an entry on a website *ought to take MONTHS.*",
                "Why would people that want to overthrow our democracy spend this much time and effort pissing off the military FOR NO TANGIBLE BENEFIT?\n\nWell I suppose if these people were smart they wouldn’t be racist..",
                "Glad to see my tax dollars spent well.....",
                "It's almost like big balls wrote an algorithm that checks everything against a keyword list of things that this admin wants to erase from history."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Families concerned over living conditions at Krome Detention Center",
            "external_url": "https://www.nbcmiami.com/news/local/families-concerned-over-living-conditions-at-krome-detention-center/3573640/",
            "upvotes": 249,
            "date": "03/22/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/03/Families-concerned-over-conditions-overcrowding-at-Krome-Detention-Center.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "*The U.S. Immigration and Customs Enforcement said in a statement that while they* ***can’t “provide*** *population numbers* ***due to operational and security concerns****, some ICE facilities are experiencing temporary overcrowding due to recent increases in detention populations.*\n\nThat's called speaking officialese. This is always both a first and last resort of the professional dissemblers.",
                "> A video that has since gone viral shows people sleeping on the floor, and a man pleads for help, explaining there is little to no food at Krome.\n\nAnd \n\n> “Osiris was deported to Mexico. He was detained in Krome for several days with no water, sleeping outside,” she said.\n\nWe are in the early days of the time of monsters, and the people running these prisons already feel comfortable depriving their prisoners of the most basic necessities. \n\nIf you think this is okay, would it be all right if it was your partner? Your family? Your kid? You?\n\nBecause we have no reason to think the people responsible for this will stop at any law or challenge or line.",
                "The cruelty is the point."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis to be discharged from hospital tomorrow but needs two months of rest, say doctors",
            "external_url": "https://news.sky.com/story/pope-francis-to-be-discharged-from-hospital-tomorrow-13333785",
            "upvotes": 895,
            "date": "03/22/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-pope-francis-vatican_6864342.jpg?20250322175352",
            "top_comments": [
                "Does rest help like 80 year olds with pnemonia? Dont they need to stay active",
                "Producers of “Conclave” are screaming internally right now.",
                "It was all just publicity stunt to promote \"Conclave\"s Oscar campaign",
                "Honestly bonkers that he survived this.",
                "Good. He’s actually a good person which is rare for many religious public figures nowadays",
                "No fucking way he lived. That’s crazy. Good on him though, not many men his age can come back from something as serious as this",
                "I’m not a conspiracy theorist, but needing two months of rest at home is suspicious as hell\n\nEdit: Yeah, he's 88, but \"two months at home\" instead of \"rest indefinitely\" makes no sense to me",
                "Is this the new hospice?",
                "Its strange how God alledgedly use to do all these miracles and healing and when his guy needs it, requires all these doctors and mortal healing periods. Why doesn't God (who totally exists) just fix him up lickety-split so he can get back to business?",
                "Oh but how will the world keep spinning?!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump rescinds security clearances of political rivals Harris, Clinton and others | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/21/politics/security-clearances-trump-harris-clinton/index.html",
            "upvotes": 5665,
            "date": "03/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/20250321-harrisclintonsplit.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> He directed Attorney General Pam Bondi to review the conduct of lawyers and law firms the administration considers to have filed frivolous lawsuits against the Trump administration or attempted to block immigration initiatives, broadening the president’s crackdown on the US legal community in the United States. \n\nThis is a whole article in its own right, tacked on the end there. \n\n[Trump ordered the attorney general to report 'frivolous' lawsuits against his administration so he can consider executive actions against firms. Read the memo.](https://www.businessinsider.com/donald-trump-attorney-general-memo-identify-target-law-firms-2025-3)",
                "If Trump had to go through the actual security clearance process, he would not even be able to get a Secret.",
                "The irony^* of a (then) former president storing classified information in a private bathroom, then becoming president and revoking clearances of other former officials is spectacularly bizarre. \n\n\n^* hypocrisy",
                "Found the weaponizing of the Justice Department that Trump has long complained about...",
                "Like, imagine if Obama did this to Bush Jr? Ohh wait, you can't because it's only something a petty immature asshole would do, right, and a US president would have enough self dignity to not act like a child, so you would think. \n\nI'm sure they can attempt to sue to get it back since the clearances weren't revoked for anything meaningful, it seems, but I'm not sure how that would work or if there is any legal recourse available.",
                "He thinks the DOJ is his personal law firm and Bondi seems to agree with him",
                "Some of them did not even have security clearance anymore. This was mostly performative.\n\nKinzinger made a post to his substack about it.",
                "Our president, ladies & germs - the sniveling cowardly punk ass bitch",
                "This is so dumb because when high level officials leave, they usually retain their security clearances *so current officials can ask them questions on new info.*\n\n\nIt's not like Clinton is getting a daily intelligence brief.",
                "Now the president has the power to determine the legitimacy of lawsuits.\n\nNo authoritarian conduct here.  No Imperial Presidency to see folks. Move along or you'll be in prison in El salvador."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "3 killed, 14 injured in mass shooting at New Mexico park",
            "external_url": "https://www.nbcnews.com/news/us-news/3-killed-14-injured-new-mexico-mass-shooting-rcna197615",
            "upvotes": 2125,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250322-las-cruces-ch-1139-b42971.jpg",
            "top_comments": [
                "200 miles from Albuquerque? Thats like attributing Cooperstown to NYC",
                "From the article:\n\n“The Las Cruces Police Department said the shooting happened at around 10 p.m. at Young Park, over 200 miles south of Albuquerque. Three victims, a 16-year-old boy and two 19-year-old men, were found dead.”\n\nMost parks close at 10 pm.",
                "Idiots at a car meet/takeover at 10pm. Those seem to only attract the shittiest type of people.",
                "They say you can tell when winter is over in France because they start setting cars on fire again.\n\nI guess winter is over in America.",
                "I'm at a park with my kid as I see this\n\n\nFuck guns and those that prioritize gun execs being wealthy over human lives\n\nedit: \"Blame the tool, not the murderer\" hey chief do you think we should allow people to bring bombs on planes too? After all, it's not the bomb's fault! We have to protect the inanimate weapons!\n\nEvery other developed nation in the world has this figured out, but then again, they haven't had large factions doing their best to dismantle education for half a century\n\nedit: Like i said, proven effective in every other country in the developed world. Yes, it would reduce shootings immensely to have fewer guns around. Can't believe how dumb people are about this, people like u/optimaloutcome making the \"no laws work so we shouldn't have any laws\" argument. Laws are effective, this doesn't need to be demonstrated or proven any more than all of human history already has.\n\nGun laws work. Restricted access and fewer guns in the population means fewer guns in the hands of people willing to commit shootings. Please use your brains, and not just regurgitate logic-free gun lobby talking points.\n\n*There is a reason this shit doesn't happen all the time anywhere else in the world.* Australia's example is *right there.*",
                "But it's not Domestic Terrorism because no Teslas were spray painted...",
                "Fuck. I was just thinking yesterday about how it’s been nice having not hearing about a mass or school shooting in a minute. Also I went to college in las cruces so breaks my heart even more to hear about this. I hope they’re able to find this piece of shit who did this quickly",
                "Not worthy reporting on Fox, unless a Tesla was damaged.",
                "Good thing they didn't vandalize a Tesla.",
                "I feel like there have been far fewer shootings in the USA lately. Or maybe so much else is happening so fast that they’re just background noise. And I can’t tell what’s sadder."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "FBI Employees Reviewing Jeffrey Epstein Files Told to Limit Redactions",
            "external_url": "https://www.wsj.com/us-news/law/doj-jeffrey-epstein-documents-7da298dc",
            "upvotes": 13621,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only redact the victims, do not redact the perpetrators.",
                "The only thing redacted should be the names of the victims. Fuck all the pedos, enablers, and other scum that were associated with Epstein and Maxwell. And yes that means the Clinton’s as well as Trump and all his buddies.",
                "\"Just make sure they get the ones involving person of interest number 1.\"",
                "why is revealing the list be “national security concerning” it’s not like it’s nuclear bomb manuals?",
                "Limit them to what, those inside the current admin?",
                "I think there's gonna be a huge meltdown on the internet when the ultimate conclusion in the files is \"we have no reason, beyond nebulous allegations of motive, to think any third party was involved in his death.\" No one online is gonna buy that, regardless of if it was written by an earnest investigator or not.\n\nBasically, I think everyone is about to feel a serious case of angry blue balls.",
                "Yup.  Just need to limit all redactions to removing all references to the word \"Trump.\"  Easy peasy!",
                "I’m sure they’re going to limit the redactions to Republicans only. Any Democrats or Left leaning individuals will be implicated, without a single Right wing donor or politician on the list. Really sell that narrative that the Left is a bastion of scum and villainy. \n\nWe’ve got enough consciousness to actually prosecute our own when they do horrible things. Which unfortunately plays into that narrative even further.",
                "Wasn't Elon photographed with Maxwell?  Why is he so invested in getting into so many government agencies?  I am just asking questions.",
                "They want to get the Clintons, but not the Republican donors."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "OCDSB seeking court order in bid to unmask anonymous “Redditor”",
            "external_url": "https://www.cbc.ca/news/canada/ottawa/ocdsb-seeking-court-order-in-bid-to-unmask-anonymous-redditor-1.7489101",
            "upvotes": 3952,
            "date": "03/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7141767.1710274888!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/reddit-ipo.JPG?im=Resize%3D620",
            "top_comments": [
                "From The CBC:\n\n>The Ottawa-Carleton District School Board (OCDSB) is locked in a court battle to compel social media site Reddit to turn over identifying information of a user who it alleges has been defaming staff at a local elementary school.\n\n>The board alleges the posts about ongoing issues at Pinecrest Public School were made in an attempt to defame employees “for some unknown ulterior motive.” None of the allegations have been proven in court.\n\n>The board wants Reddit to provide any email addresses, phone numbers, location data and other identifying information about the user. In a statement, it said it was compelled by its “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.”\n\n>Reddit argues handing over the information will create a chill among other users, explaining in its court filings that “anonymity is not just a user preference but a defining feature of Reddit’s business model and identity.”\n\n>Most of the comments in question were in response to discussions around news stories about the board and problems at specific schools. Several involved specific incidents and ongoing issues at Pinecrest Public School that have been reported in the media.\n\n>Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations. \n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school [student who died after being stabbed in Nepean](https://www.cbc.ca/news/canada/ottawa/high-school-student-stabbed-last-week-in-nepean-dies-1.7194798) last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\n>The board said it’s considering a defamation lawsuit against the person responsible for posting the comments. But Reddit denies OCDSB’s claim that the information is “necessary for it to determine whether to pursue a potential claim for defamation.”\n\n>OCDSB ‘vigorously defending’ employees. In response to CBC’s request for comment, OCDSB communications manager Diane Pernari said the board is committed to “vigorously defending our employees against unfounded attacks and upholding our legal and ethical obligations.”\n\n>She wrote the legal action underscores the board’s “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.” Known as a Norwich Order, the board’s application seeks to compel a third party to provide information about alleged wrongdoing, even if the third party isn’t directly involved in the wrongdoing.\n\n>Reddit did not respond to a request for comment. Lawyers for both parties are expected to have another court date later this year. \n\n>Court to consider free speech, defamation. Ottawa-based lawyer Karin Page said the school board will have to demonstrate the user’s comments were defamatory, rather than just critical of its policies. \n\n>Page said the court will need to balance the public interest in protecting anonymous speech against the board’s need to defend itself against alleged defamation. “There’s a difference between someone just voicing their opposition to a policy or ... to the government, or to disclosing their own personal situations,” she said. “There’s a distinction between that and making defamatory statements online.”\n\n>She added the fact the comments named or identified specific individuals is concerning, as it makes it difficult for those people to defend themselves.",
                ">Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations.\n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school student who died after being stabbed in Nepean last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\nThey're trying to go after a teacher who criticized them. Fuck that district.\n\n~ Teacher",
                "Of course it’s pinecrest lmao, that school is a shit hole.",
                "I feel like this action by the school officials has made the \"defamatory\" comments much more widely known.\n\nAlso trying to \"unmask\" and sue a commenter on reddit makes them look even worse, somehow.",
                "This lawsuit is a joke and an example of how school boards attract some seriously ignorant people.",
                "I feel like they would be better off using the money paying court costs on solving the issue the redditor is being critical of. If there wasn't anything that warranted complaining about, the issue wouldn't have come up.\n\nAside from that tangent, I do hope reddit keeps that user anonymous. Maybe ban the user if it is determined a defamation case against them would succeed beyond reasonable doubt. Reddit giving up information to a smaller non-us court would almost certainly set a precedent of giving up any info requested by a larger government that is being overrun by Nazis. And that spooks me because that could be used for any number of things. \n\nSure, I could be worried about a slippery slope, but given it hasn't even been 2 months with Trump in office, I would like to avoid the risk over the next... 3.5 years...",
                "The OCDSB certainly could defend themselves against false allegation, it doesn't take the posters identity to do it, that's a pig that wants revenge. What's worse, bad mouthing the system, or trying to identify your detractors for revenge?",
                "Sounds like they deserve all the criticism they get.",
                "If Reddit caves to a school board what will they do when the Trump administration demands the same thing?",
                "This is a big test for Reddit if they will cave-in with the authoritarian school district board in Canada.\n\nGiving away user information will have bigger implication for this community. \n\nClearly, it was not defamation. OCDSB is a bully school board who doesn't care about their teachers and students."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 23285,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "[deleted]",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "Still set to fight Jake Paul next month.",
                "\"Down goes Frazier! Down goes Frazier! Down goes Frazier!\"\n\nHe won the heavyweight title in 1974 and then again in 1994.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 6370,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "LA county Sheriff's 2 years ago. 4 suicides within 24. hours.https://www.google.com/amp/s/abc7.com/amp/los-angeles-county-sheriffs-department-suicide-deaths-lasd-employees/14036429/",
                "[deleted]",
                "Something nasty went down",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, you won’t find that person here.”",
                "Harris County (Texas) Sheriff's Office, for those too lazy, but still curious.",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious.",
                "Did they all fall out of a huge window together?"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/23/2025 00:43:55 UTC"
}