{
    "posts": [
        {
            "category": "HOT",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 22663,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Must have been holding out for one last Easter",
                "I'm glad he made it out of the hospital, anyway. He died in his own bed.",
                "I was a closeted teenager in Catholic school when he was elected, and as he preached compassion over the years I felt like I could tangibly sense the people around me change their viewpoints on queerness. So many of my family members, including my godfather, changed their minds without knowing at the time that I was queer. I think it made me feel a lot more secure in my self when I did decide to start coming out a few years ago.\n\nI'm not Catholic anymore, but I think it would have taken me a lot longer to get on my own path if not for him. I'll always appreciate him for that. I hope he knows that he helped a little lesbian feel a bit more loved.",
                "> Francis appointed nearly 80% of the cardinal electors who will choose the next pope, increasing the possibility that his successor will continue his progressive policies, despite the strong pushback from traditionalists.\n\n\nThis will provide some hope.",
                "Gone the day after Easter. Idk, is there anything more... Catholic? May he rest in eternal peace far from the trials and tribulations of Earth.",
                "Damn, the guy clung to life for that Easter appearance, probably because he knew that it would mean a lot to a lot of people and then he just let go. \n\nRest in Peace, Francis. You were actually a good Pope. \n\nI hope we can find someone similar, especially in these insane times.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "He was the right person to lead the Catholic Church in a world where war, inequality and fear of immigrants are all too common. I can only hope the next Pope is as kind, gentle and caring as Francis.",
                "Meeting Vance was the last nail in his coffin"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 33175,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Sir, a second group chat has hit the pentagon",
                "SECOND Signal chat?  Wtf?! Are the secure communications channels that our tax dollars pay for not good enough, Republicans? You have to go out of your way to compromise our ridiculously expensive security?!",
                "“I know what I am doing”",
                "MAGA – Morons Are Governing America",
                "So like, you know lets pretend for a second that we give this jackass a second chance to stop fucking up so badly for 5 fucking seconds. \n\n\n\nHow the fuck are Republicans in congress up in arms about Hilary's emails, but see no problem with this guy getting caught, not changing his behavior, and then doubling down on his fucking idiocy. \n\n\n\n\nThese fucks all deserve the boot, if not jail time. Fuck em all, hypocritical fuckheads."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "China sends back new Boeing jet made too expensive by tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/china-returns-boeing-737-jet-us-too-expensive-tariffs",
            "upvotes": 5549,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/227200971586a3853a06dc29b6592e9d5ec7fbcb/0_101_1658_995/master/1658.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cee2dfd476d3330ba13839c27da81ef6",
            "top_comments": [
                "What's fucking crazy to me is tariffs apply on orders already made.... Planes, or board games, doesn't matter, you get fucked",
                "On the upside, I got to leave Hong Kong on Friday with half the junk my in-laws gave us left behind since the HKPO decided it was going to deal with US for a bit. Downside, I'm sure management at Boeing will use this as an excuse to can more engineers that have ever dared to bring up concerns to management. Or get rid of some suppliers. Regardless my local economy is going to take a hit.",
                "Boeing Tech here, this is bad, like really fuckin bad. Billions of dollars of China bound planes just sitting waiting for delivery is going to stack up quick. Boeing doesn't get the final check until it tickets.",
                "Did they check the back or bottom of the receipt for the return policy",
                "I wonder if those “I did that” stickers come in plane-size?",
                "It has always been funny to me how people type “If it’s it not made in America, I don’t want it” from their (non) American-made smart phone or laptop.",
                "Boeing has to be angry. And we know what happens to people who make Boeing angry..",
                ">(She wrote upon it)  \nReturn to sender, address unknown  \nNo such person, no such zone\n\n\\- Elvis Presley \"[Return To Sender](https://www.youtube.com/watch?v=-Ml1_SLU6x4)\"",
                "is this more \"Art of The Deal \" 5d chess by trump?",
                "I flew on Xiamen airlines out of Xiamen island in 2018. I thought it was a really good airline with good economy class accommodations. Sucks to hear tariffs causing this headache."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "US citizen wrongfully arrested by border patrol in Arizona held for nearly 10 days | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/20/us-citizen-jose-hermosillo-border-patrol",
            "upvotes": 2988,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cbfef30392575583987696eeaa4fc2095a168dc7/0_407_6500_3902/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=777eb2c63672ae9ad29d3e3a28ea5d41",
            "top_comments": [
                "Notice the recurring theme of how the border cops always lie to the court and say that the US citizen confessed to them (with zero evidence) to being an illegal immigrant? \n\n“According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico. Two days later, the federal court document notes that Hermosillo continued to claim he was a US citizen. On 17 April, a federal judge dismissed his case.”",
                "This is the 2nd incident of a US citizen being detained. Another US citizen in Florida was detained last week",
                "Trump's personal gestapo. There's a reason organizations like border patrol, corrections and homeland security were deployed to Portland during the George Floyd protests. This isn't trump 1.0 with the Drumpf jokes, Rudy's hair peeling off and the four seasons landscaping fiasco. This is organized. They've got a plan and they're putting it into motion. Who knows where this will end.",
                "Yesterday NBC published an article on what to do if you’re a US citizen detained by ICE. Unbelievable that this is happening, and how fast we’ve fallen.\n\nhttps://www.nbcnews.com/news/us-news/us-citizens-email-notice-to-deport-rcna201862",
                "Nothing in America takes 10 days.  They knew after an hour, maybe two.  The other 238 hours were because they didn't like him.",
                "Ice needs to be dissolved and a new immigration enforcement agency needs to be built in its place. \n\nIt’s obvious the current culture of ice doesn’t care about due process.",
                "Remember when Democrats warned this would happen and republican said we were fear mongering. ",
                "*Travelling while brown*.\n\nOnly *felony interference with profit* is worse.",
                "These ICE agents must have been vetted by Trump staff? Why are they so dumb? Even MTG is smarter.",
                "What sucks is anyone with a spanish ancestry who looks...\"spanish\"  is getting stopped."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "‘Trust is gone’: fears grow as police on some Florida campuses trained by Ice",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/florida-universities-ice-international-students",
            "upvotes": 369,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d5b04cebe50656ae25b4f8357ee9e08cd6501e8/0_218_6575_3948/master/6575.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=42c65ffaaa6c605fc39154f59a549dc2",
            "top_comments": [
                "> Earlier this year, the government reactivated the taskforce model of the Ice partnership program that was discontinued by Barack Obama in 2012 for racial profiling, and which the American Civil Liberties Union has argued is unconstitutional.\n\n\n- The article.. the task force model was authorized under:\n\n> The Illegal Immigration Reform and Immigrant Responsibility Act of 1996 added Section 287(g) to the Immigration and Nationality Act (INA) — authorizing U.S. Immigration and Customs Enforcement (ICE) to delegate to state and local law enforcement officers the authority to perform specified immigration officer functions under the agency’s direction and oversight.\n\n\nCan't keep crafting all these authoritarian toolsets and delegating broad authority to the executive branch with hopes that electorial dice rolls and rational actors will use it wisely.\n\n\nSeparately, it's a little annoying how quickly Abolish ICE/CBP evaporated after the last trump admin.. it's fun watching everyone's collective amnesia heal. ",
                "Who still trusts the police?",
                "And the rest probably trained in Israel",
                "So they trusted the police before?  🙄",
                "Campus Police are now ICE.\n\nWhat’s next Mall cops?",
                "Yeah, why be a normal American policeman when you can be a shiny Gestapo.  Ugh.",
                "And the rest of the world is just asking why you have police on campuses."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "El Salvador offers Venezuela prisoner swap involving US deportees",
            "external_url": "https://www.bbc.com/news/articles/cn5xl5ppzr2o",
            "upvotes": 1539,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d21e/live/4b500ad0-1e4c-11f0-86e6-e13957bc23df.png",
            "top_comments": [
                "So they can send people to Venezuela, but not the US? Right...",
                "What in the fuck is this timeline",
                "Basically. The US paid Bukele to take over 200 Venezuelan criminals(tbd). Now Bukele gets to keep this money and extort more from Venezuela. Trump really handed over hundreds of people to a human trafficker. What a joke.",
                "Are these Venezuelan refugees/migrants now being sent back to Venezuela? Maduro: “Oh so you went USA as a refugee saying we ‘oppressed’ you huh? You gone learn about oppression now boi.” They’ll be tortured and buried in unmarked graves I suspect.",
                "Is this slave trading?",
                "If they move the prisoners enough, they'll be easier to disappear.",
                "If you could travel back to 2000 and tell everyone this is where the US would be in 25 years people would think you were crazy.",
                "So America snatches people of the streets, pays private prison storage to detain them, pays El Salvador to imprison them and then El Salvador can use them a bargaining chips?",
                "The legal argument that if you are deported from the US and the country you send them to is going to traffic them for political favors is going to end up getting a lot of people asylum status.",
                "So he can get them out?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 4090,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect\n\nEdit: The ICC already issued arrest warrants and trump invites Netanyahu to the oval. The ICJ has no enforcement capabilities, that goes to the UN and the USA has veto power there. Just for clarity",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                "This was on video. Imagine what's happening that is not recorded",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 2261,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 12034,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burglar who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "For him to know there was a 9 year old girl in the house tells me he saw her at one point and decided to do this. Which brings in premeditation.\n\nThrow the book at the creep.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Chinese executive linked to Bangkok building collapse arrested",
            "external_url": "https://www.ctvnews.ca/world/article/chinese-executive-linked-to-bangkok-building-collapse-arrested/",
            "upvotes": 2026,
            "date": "04/20/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/3QSXNATHWOIBSBLR6EB6W7ZUAE.jpg?smart=true&auth=470978b9815b6ed72e6915b2efe2b2538b2819409d5ac2c8d6e2c860bc74875a&width=1200&height=630",
            "top_comments": [
                "Good. I'm Chinese. It's good. Fuck these national corporation.",
                "We should be doing this in the US.",
                "Wait, you mean they don't just step down from their position with a 60 million dollar bonus?",
                "*Substandard metal, fake signatures, bid rigging.* All worrying in light of stories we've heard that the abandoned Oceanwide Plaza towers in Downtown Los Angeles, a Chinese funded project halted due to claimed bankruptcy, were not properly built and cannot be finished.",
                "Is this the same building collapse that was censored from Chinese media because, you know, Chinese national pride is too fragile to risk telling the truth?",
                "I was wondering about that building figured it had to do with the fact that it was still under construction didn’t think it should have been able to survive that type of earth quake while not even completely built ",
                "[deleted]",
                "I'd be more impressed if it was a Thai executive, or that the arrest of the Chinese exec had happened in China. You know, when it wasn't an easy domestic political win.\n\n\nBut still better than nothing I guess..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "‘Trust is gone’: fears grow as police on some Florida campuses trained by Ice",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/florida-universities-ice-international-students",
            "upvotes": 372,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d5b04cebe50656ae25b4f8357ee9e08cd6501e8/0_218_6575_3948/master/6575.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=42c65ffaaa6c605fc39154f59a549dc2",
            "top_comments": [
                "> Earlier this year, the government reactivated the taskforce model of the Ice partnership program that was discontinued by Barack Obama in 2012 for racial profiling, and which the American Civil Liberties Union has argued is unconstitutional.\n\n\n- The article.. the task force model was authorized under:\n\n> The Illegal Immigration Reform and Immigrant Responsibility Act of 1996 added Section 287(g) to the Immigration and Nationality Act (INA) — authorizing U.S. Immigration and Customs Enforcement (ICE) to delegate to state and local law enforcement officers the authority to perform specified immigration officer functions under the agency’s direction and oversight.\n\n\nCan't keep crafting all these authoritarian toolsets and delegating broad authority to the executive branch with hopes that electorial dice rolls and rational actors will use it wisely.\n\n\nSeparately, it's a little annoying how quickly Abolish ICE/CBP evaporated after the last trump admin.. it's fun watching everyone's collective amnesia heal. ",
                "Who still trusts the police?",
                "And the rest probably trained in Israel",
                "So they trusted the police before?  🙄",
                "Campus Police are now ICE.\n\nWhat’s next Mall cops?",
                "Yeah, why be a normal American policeman when you can be a shiny Gestapo.  Ugh.",
                "And the rest of the world is just asking why you have police on campuses."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 22676,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Must have been holding out for one last Easter",
                "I'm glad he made it out of the hospital, anyway. He died in his own bed.",
                "I was a closeted teenager in Catholic school when he was elected, and as he preached compassion over the years I felt like I could tangibly sense the people around me change their viewpoints on queerness. So many of my family members, including my godfather, changed their minds without knowing at the time that I was queer. I think it made me feel a lot more secure in my self when I did decide to start coming out a few years ago.\n\nI'm not Catholic anymore, but I think it would have taken me a lot longer to get on my own path if not for him. I'll always appreciate him for that. I hope he knows that he helped a little lesbian feel a bit more loved.",
                "> Francis appointed nearly 80% of the cardinal electors who will choose the next pope, increasing the possibility that his successor will continue his progressive policies, despite the strong pushback from traditionalists.\n\n\nThis will provide some hope.",
                "Gone the day after Easter. Idk, is there anything more... Catholic? May he rest in eternal peace far from the trials and tribulations of Earth.",
                "Damn, the guy clung to life for that Easter appearance, probably because he knew that it would mean a lot to a lot of people and then he just let go. \n\nRest in Peace, Francis. You were actually a good Pope. \n\nI hope we can find someone similar, especially in these insane times.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "He was the right person to lead the Catholic Church in a world where war, inequality and fear of immigrants are all too common. I can only hope the next Pope is as kind, gentle and caring as Francis.",
                "Meeting Vance was the last nail in his coffin"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US citizen wrongfully arrested by border patrol in Arizona held for nearly 10 days | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/20/us-citizen-jose-hermosillo-border-patrol",
            "upvotes": 2989,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cbfef30392575583987696eeaa4fc2095a168dc7/0_407_6500_3902/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=777eb2c63672ae9ad29d3e3a28ea5d41",
            "top_comments": [
                "Notice the recurring theme of how the border cops always lie to the court and say that the US citizen confessed to them (with zero evidence) to being an illegal immigrant? \n\n“According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico. Two days later, the federal court document notes that Hermosillo continued to claim he was a US citizen. On 17 April, a federal judge dismissed his case.”",
                "This is the 2nd incident of a US citizen being detained. Another US citizen in Florida was detained last week",
                "Trump's personal gestapo. There's a reason organizations like border patrol, corrections and homeland security were deployed to Portland during the George Floyd protests. This isn't trump 1.0 with the Drumpf jokes, Rudy's hair peeling off and the four seasons landscaping fiasco. This is organized. They've got a plan and they're putting it into motion. Who knows where this will end.",
                "Yesterday NBC published an article on what to do if you’re a US citizen detained by ICE. Unbelievable that this is happening, and how fast we’ve fallen.\n\nhttps://www.nbcnews.com/news/us-news/us-citizens-email-notice-to-deport-rcna201862",
                "Nothing in America takes 10 days.  They knew after an hour, maybe two.  The other 238 hours were because they didn't like him.",
                "Ice needs to be dissolved and a new immigration enforcement agency needs to be built in its place. \n\nIt’s obvious the current culture of ice doesn’t care about due process.",
                "Remember when Democrats warned this would happen and republican said we were fear mongering. ",
                "*Travelling while brown*.\n\nOnly *felony interference with profit* is worse.",
                "These ICE agents must have been vetted by Trump staff? Why are they so dumb? Even MTG is smarter.",
                "What sucks is anyone with a spanish ancestry who looks...\"spanish\"  is getting stopped."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "El Salvador offers Venezuela prisoner swap involving US deportees",
            "external_url": "https://www.bbc.com/news/articles/cn5xl5ppzr2o",
            "upvotes": 1536,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d21e/live/4b500ad0-1e4c-11f0-86e6-e13957bc23df.png",
            "top_comments": [
                "So they can send people to Venezuela, but not the US? Right...",
                "What in the fuck is this timeline",
                "Basically. The US paid Bukele to take over 200 Venezuelan criminals(tbd). Now Bukele gets to keep this money and extort more from Venezuela. Trump really handed over hundreds of people to a human trafficker. What a joke.",
                "Are these Venezuelan refugees/migrants now being sent back to Venezuela? Maduro: “Oh so you went USA as a refugee saying we ‘oppressed’ you huh? You gone learn about oppression now boi.” They’ll be tortured and buried in unmarked graves I suspect.",
                "Is this slave trading?",
                "If they move the prisoners enough, they'll be easier to disappear.",
                "If you could travel back to 2000 and tell everyone this is where the US would be in 25 years people would think you were crazy.",
                "So America snatches people of the streets, pays private prison storage to detain them, pays El Salvador to imprison them and then El Salvador can use them a bargaining chips?",
                "The legal argument that if you are deported from the US and the country you send them to is going to traffic them for political favors is going to end up getting a lot of people asylum status.",
                "So he can get them out?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "China sends back new Boeing jet made too expensive by tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/china-returns-boeing-737-jet-us-too-expensive-tariffs",
            "upvotes": 5536,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/227200971586a3853a06dc29b6592e9d5ec7fbcb/0_101_1658_995/master/1658.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cee2dfd476d3330ba13839c27da81ef6",
            "top_comments": [
                "What's fucking crazy to me is tariffs apply on orders already made.... Planes, or board games, doesn't matter, you get fucked",
                "On the upside, I got to leave Hong Kong on Friday with half the junk my in-laws gave us left behind since the HKPO decided it was going to deal with US for a bit. Downside, I'm sure management at Boeing will use this as an excuse to can more engineers that have ever dared to bring up concerns to management. Or get rid of some suppliers. Regardless my local economy is going to take a hit.",
                "Boeing Tech here, this is bad, like really fuckin bad. Billions of dollars of China bound planes just sitting waiting for delivery is going to stack up quick. Boeing doesn't get the final check until it tickets.",
                "Did they check the back or bottom of the receipt for the return policy",
                "I wonder if those “I did that” stickers come in plane-size?",
                "It has always been funny to me how people type “If it’s it not made in America, I don’t want it” from their (non) American-made smart phone or laptop.",
                "Boeing has to be angry. And we know what happens to people who make Boeing angry..",
                ">(She wrote upon it)  \nReturn to sender, address unknown  \nNo such person, no such zone\n\n\\- Elvis Presley \"[Return To Sender](https://www.youtube.com/watch?v=-Ml1_SLU6x4)\"",
                "is this more \"Art of The Deal \" 5d chess by trump?",
                "I flew on Xiamen airlines out of Xiamen island in 2018. I thought it was a really good airline with good economy class accommodations. Sucks to hear tariffs causing this headache."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 33173,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Sir, a second group chat has hit the pentagon",
                "SECOND Signal chat?  Wtf?! Are the secure communications channels that our tax dollars pay for not good enough, Republicans? You have to go out of your way to compromise our ridiculously expensive security?!",
                "“I know what I am doing”",
                "MAGA – Morons Are Governing America",
                "So like, you know lets pretend for a second that we give this jackass a second chance to stop fucking up so badly for 5 fucking seconds. \n\n\n\nHow the fuck are Republicans in congress up in arms about Hilary's emails, but see no problem with this guy getting caught, not changing his behavior, and then doubling down on his fucking idiocy. \n\n\n\n\nThese fucks all deserve the boot, if not jail time. Fuck em all, hypocritical fuckheads."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "4 witnesses shed light on Montgomery woman’s murder, husband’s arrest",
            "external_url": "https://www.wsfa.com/2025/04/18/4-witnesses-shed-light-montgomery-womans-murder-husbands-arrest/",
            "upvotes": 495,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/E7RUVXFEZRBHZNGLRJCJKETPEY.png?auth=24a3f559c495be9ec0015da8a715f94cd40e6503adffb5e9e213f57a52de03b2&width=1200&height=600&smart=true",
            "top_comments": [
                "The witnesses said they were driving their city-owned vehicle on the Boulevard when an unknown woman ran up to them and tried to get in. They then reported a man firing shots at them, three of which hit the vehicle. While no one was injured, the witnesses said the woman then fled to the wood line and was chased by the man.",
                "The witnesses said they fled the area and didn’t see what happened next, but were able to identify Wright as the suspect through a photographic lineup.",
                "“A motive for the shooting was not immediately clear” — that line always frustrates me in cases like this, that are DV related. Men kill their wives all the time, because they feel entitled to control over these women’s lives. “why does he do that?” By Lundy Bancroft is a very eye opening read about this subject",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 4081,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect\n\nEdit: The ICC already issued arrest warrants and trump invites Netanyahu to the oval. The ICJ has no enforcement capabilities, that goes to the UN and the USA has veto power there. Just for clarity",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                "This was on video. Imagine what's happening that is not recorded",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 2258,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Single-engine plane crashes in Illinois, killing all 4 people aboard",
            "external_url": "https://www.nbcnews.com/news/us-news/single-engine-plane-crashes-illinois-rcna202021",
            "upvotes": 1014,
            "date": "04/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250420-trilla-plane-crash-vl-1051a-be3489.jpg",
            "top_comments": [
                "Is this just being reported on more? Because it seems like everyday or every week there's a plane crash. \n\nI'd love to see some statistics",
                "I can trust large, commercial airlines to a reasonable degree. I'd never get on a private plane. ",
                "Wouldn't it be nice to have a high speed train system in our country.  At least it would give us more choices of travel, not just driving or flying.",
                "Landing in a nice open, flat field? No problem. Landing a plane and clipping a wire? That'll do it. The C180G is a tail dragger which makes landing more challenging since you pitch up and visibility is poor over the nose. https://asn.flightsafety.org/wikibase/500313",
                "> Cessna C180G\n\nThat model was built in 1964.   61 years old",
                "If Pritzker is already weighing in on this, chances are it was a private plane with some wealthy/influential people on board",
                "Fingers crossed it got the Ulines",
                "If we could go 1 week without a serious aviation incident, that'd be great. Thanks."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "‘Trust is gone’: fears grow as police on some Florida campuses trained by Ice",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/florida-universities-ice-international-students",
            "upvotes": 370,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d5b04cebe50656ae25b4f8357ee9e08cd6501e8/0_218_6575_3948/master/6575.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=42c65ffaaa6c605fc39154f59a549dc2",
            "top_comments": [
                "> Earlier this year, the government reactivated the taskforce model of the Ice partnership program that was discontinued by Barack Obama in 2012 for racial profiling, and which the American Civil Liberties Union has argued is unconstitutional.\n\n\n- The article.. the task force model was authorized under:\n\n> The Illegal Immigration Reform and Immigrant Responsibility Act of 1996 added Section 287(g) to the Immigration and Nationality Act (INA) — authorizing U.S. Immigration and Customs Enforcement (ICE) to delegate to state and local law enforcement officers the authority to perform specified immigration officer functions under the agency’s direction and oversight.\n\n\nCan't keep crafting all these authoritarian toolsets and delegating broad authority to the executive branch with hopes that electorial dice rolls and rational actors will use it wisely.\n\n\nSeparately, it's a little annoying how quickly Abolish ICE/CBP evaporated after the last trump admin.. it's fun watching everyone's collective amnesia heal. ",
                "Who still trusts the police?",
                "And the rest probably trained in Israel",
                "So they trusted the police before?  🙄",
                "Campus Police are now ICE.\n\nWhat’s next Mall cops?",
                "Yeah, why be a normal American policeman when you can be a shiny Gestapo.  Ugh.",
                "And the rest of the world is just asking why you have police on campuses."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US citizen wrongfully arrested by border patrol in Arizona held for nearly 10 days | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/20/us-citizen-jose-hermosillo-border-patrol",
            "upvotes": 2985,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cbfef30392575583987696eeaa4fc2095a168dc7/0_407_6500_3902/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=777eb2c63672ae9ad29d3e3a28ea5d41",
            "top_comments": [
                "Notice the recurring theme of how the border cops always lie to the court and say that the US citizen confessed to them (with zero evidence) to being an illegal immigrant? \n\n“According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico. Two days later, the federal court document notes that Hermosillo continued to claim he was a US citizen. On 17 April, a federal judge dismissed his case.”",
                "This is the 2nd incident of a US citizen being detained. Another US citizen in Florida was detained last week",
                "Trump's personal gestapo. There's a reason organizations like border patrol, corrections and homeland security were deployed to Portland during the George Floyd protests. This isn't trump 1.0 with the Drumpf jokes, Rudy's hair peeling off and the four seasons landscaping fiasco. This is organized. They've got a plan and they're putting it into motion. Who knows where this will end.",
                "Yesterday NBC published an article on what to do if you’re a US citizen detained by ICE. Unbelievable that this is happening, and how fast we’ve fallen.\n\nhttps://www.nbcnews.com/news/us-news/us-citizens-email-notice-to-deport-rcna201862",
                "Nothing in America takes 10 days.  They knew after an hour, maybe two.  The other 238 hours were because they didn't like him.",
                "Ice needs to be dissolved and a new immigration enforcement agency needs to be built in its place. \n\nIt’s obvious the current culture of ice doesn’t care about due process.",
                "Remember when Democrats warned this would happen and republican said we were fear mongering. ",
                "*Travelling while brown*.\n\nOnly *felony interference with profit* is worse.",
                "These ICE agents must have been vetted by Trump staff? Why are they so dumb? Even MTG is smarter.",
                "What sucks is anyone with a spanish ancestry who looks...\"spanish\"  is getting stopped."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 22705,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Must have been holding out for one last Easter",
                "I'm glad he made it out of the hospital, anyway. He died in his own bed.",
                "I was a closeted teenager in Catholic school when he was elected, and as he preached compassion over the years I felt like I could tangibly sense the people around me change their viewpoints on queerness. So many of my family members, including my godfather, changed their minds without knowing at the time that I was queer. I think it made me feel a lot more secure in my self when I did decide to start coming out a few years ago.\n\nI'm not Catholic anymore, but I think it would have taken me a lot longer to get on my own path if not for him. I'll always appreciate him for that. I hope he knows that he helped a little lesbian feel a bit more loved.",
                "> Francis appointed nearly 80% of the cardinal electors who will choose the next pope, increasing the possibility that his successor will continue his progressive policies, despite the strong pushback from traditionalists.\n\n\nThis will provide some hope.",
                "Gone the day after Easter. Idk, is there anything more... Catholic? May he rest in eternal peace far from the trials and tribulations of Earth.",
                "Damn, the guy clung to life for that Easter appearance, probably because he knew that it would mean a lot to a lot of people and then he just let go. \n\nRest in Peace, Francis. You were actually a good Pope. \n\nI hope we can find someone similar, especially in these insane times.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "He was the right person to lead the Catholic Church in a world where war, inequality and fear of immigrants are all too common. I can only hope the next Pope is as kind, gentle and caring as Francis.",
                "Meeting Vance was the last nail in his coffin"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "China sends back new Boeing jet made too expensive by tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/china-returns-boeing-737-jet-us-too-expensive-tariffs",
            "upvotes": 5545,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/227200971586a3853a06dc29b6592e9d5ec7fbcb/0_101_1658_995/master/1658.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cee2dfd476d3330ba13839c27da81ef6",
            "top_comments": [
                "What's fucking crazy to me is tariffs apply on orders already made.... Planes, or board games, doesn't matter, you get fucked",
                "On the upside, I got to leave Hong Kong on Friday with half the junk my in-laws gave us left behind since the HKPO decided it was going to deal with US for a bit. Downside, I'm sure management at Boeing will use this as an excuse to can more engineers that have ever dared to bring up concerns to management. Or get rid of some suppliers. Regardless my local economy is going to take a hit.",
                "Boeing Tech here, this is bad, like really fuckin bad. Billions of dollars of China bound planes just sitting waiting for delivery is going to stack up quick. Boeing doesn't get the final check until it tickets.",
                "Did they check the back or bottom of the receipt for the return policy",
                "I wonder if those “I did that” stickers come in plane-size?",
                "It has always been funny to me how people type “If it’s it not made in America, I don’t want it” from their (non) American-made smart phone or laptop.",
                "Boeing has to be angry. And we know what happens to people who make Boeing angry..",
                ">(She wrote upon it)  \nReturn to sender, address unknown  \nNo such person, no such zone\n\n\\- Elvis Presley \"[Return To Sender](https://www.youtube.com/watch?v=-Ml1_SLU6x4)\"",
                "is this more \"Art of The Deal \" 5d chess by trump?",
                "I flew on Xiamen airlines out of Xiamen island in 2018. I thought it was a really good airline with good economy class accommodations. Sucks to hear tariffs causing this headache."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "El Salvador offers Venezuela prisoner swap involving US deportees",
            "external_url": "https://www.bbc.com/news/articles/cn5xl5ppzr2o",
            "upvotes": 1537,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d21e/live/4b500ad0-1e4c-11f0-86e6-e13957bc23df.png",
            "top_comments": [
                "So they can send people to Venezuela, but not the US? Right...",
                "What in the fuck is this timeline",
                "Basically. The US paid Bukele to take over 200 Venezuelan criminals(tbd). Now Bukele gets to keep this money and extort more from Venezuela. Trump really handed over hundreds of people to a human trafficker. What a joke.",
                "Are these Venezuelan refugees/migrants now being sent back to Venezuela? Maduro: “Oh so you went USA as a refugee saying we ‘oppressed’ you huh? You gone learn about oppression now boi.” They’ll be tortured and buried in unmarked graves I suspect.",
                "Is this slave trading?",
                "If they move the prisoners enough, they'll be easier to disappear.",
                "If you could travel back to 2000 and tell everyone this is where the US would be in 25 years people would think you were crazy.",
                "So America snatches people of the streets, pays private prison storage to detain them, pays El Salvador to imprison them and then El Salvador can use them a bargaining chips?",
                "The legal argument that if you are deported from the US and the country you send them to is going to traffic them for political favors is going to end up getting a lot of people asylum status.",
                "So he can get them out?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 33178,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Sir, a second group chat has hit the pentagon",
                "SECOND Signal chat?  Wtf?! Are the secure communications channels that our tax dollars pay for not good enough, Republicans? You have to go out of your way to compromise our ridiculously expensive security?!",
                "“I know what I am doing”",
                "MAGA – Morons Are Governing America",
                "So like, you know lets pretend for a second that we give this jackass a second chance to stop fucking up so badly for 5 fucking seconds. \n\n\n\nHow the fuck are Republicans in congress up in arms about Hilary's emails, but see no problem with this guy getting caught, not changing his behavior, and then doubling down on his fucking idiocy. \n\n\n\n\nThese fucks all deserve the boot, if not jail time. Fuck em all, hypocritical fuckheads."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 4093,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect\n\nEdit: The ICC already issued arrest warrants and trump invites Netanyahu to the oval. The ICJ has no enforcement capabilities, that goes to the UN and the USA has veto power there. Just for clarity",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                "This was on video. Imagine what's happening that is not recorded",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 2263,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 12030,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burglar who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "For him to know there was a 9 year old girl in the house tells me he saw her at one point and decided to do this. Which brings in premeditation.\n\nThrow the book at the creep.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Chinese executive linked to Bangkok building collapse arrested",
            "external_url": "https://www.ctvnews.ca/world/article/chinese-executive-linked-to-bangkok-building-collapse-arrested/",
            "upvotes": 2024,
            "date": "04/20/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/3QSXNATHWOIBSBLR6EB6W7ZUAE.jpg?smart=true&auth=470978b9815b6ed72e6915b2efe2b2538b2819409d5ac2c8d6e2c860bc74875a&width=1200&height=630",
            "top_comments": [
                "Good. I'm Chinese. It's good. Fuck these national corporation.",
                "We should be doing this in the US.",
                "Wait, you mean they don't just step down from their position with a 60 million dollar bonus?",
                "*Substandard metal, fake signatures, bid rigging.* All worrying in light of stories we've heard that the abandoned Oceanwide Plaza towers in Downtown Los Angeles, a Chinese funded project halted due to claimed bankruptcy, were not properly built and cannot be finished.",
                "Is this the same building collapse that was censored from Chinese media because, you know, Chinese national pride is too fragile to risk telling the truth?",
                "I was wondering about that building figured it had to do with the fact that it was still under construction didn’t think it should have been able to survive that type of earth quake while not even completely built ",
                "[deleted]",
                "I'd be more impressed if it was a Thai executive, or that the arrest of the Chinese exec had happened in China. You know, when it wasn't an easy domestic political win.\n\n\nBut still better than nothing I guess..."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "04/21/2025 12:15:49 UTC"
}