{
    "posts": [
        {
            "category": "HOT",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 3443,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "No worries for that guy. Trump will pardon him.",
                "[removed]",
                "Are you sure he's arrested and not arriving as a \"refugee\"? If he is arrested, how long do you think before he gets pardoned?",
                "Trump imported White South Africans, Nazis are next on his list."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 1335,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                " now probably works for ICE instead",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "Good.  He's an embarrassment to humankind.",
                "Started as slave catchers and never stopped. Consequences for actions need to go all the way to the top or there can be no justice ",
                "Stop being civil with MAGAs.",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "At least we know what he looks like…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 8161,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditors whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "If I had the money to leave I’d already be out",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "I have UK citizenship, so that's an option for me...but it's not that simple to just pack your entire life up, lose your home and job, thousands of things you have to deal with...but on the other hand, by the time it becomes super worth it to leave, maybe you can't anymore.",
                "My fiancé works completely remote, and we were considering the 'digital nomad' lifestyle, it's just *insanely* expensive in the UK compared to where we currently live. We also considered New Zealand, but it's too difficult to get in.",
                "Took almost 200 years but it's time to go home."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 4259,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly ~~what he voted for~~ the policy he supports. He just didn't think it would happen to him \\[because he's white\\].",
                "And there won’t be any Medicaid for his 5 anchor babies after he’s deported.  His wife voted for Trump, he stumped for Trump.  When he had an expired green card. \n\n#FAFO",
                "Amazing that conservatives can say \"we just want people to come here the legal way\" when the \"legal way\" is so damn complicated that it's this easy to screw up one little thing.",
                "The social media accounts of Kasper Eriksen show him to be a rabid Trump MAGA supporter. He’s having the day he deserves.",
                "Mississippi, blue collar, 4 kids and pregnant wife.  \n\nI bet all of his friends and probably his wife voted for Trump.",
                "The party of law and order really seems to hate law and order. Like, literally trying to subvert the courts and prevent them from doing their job, while people are trying to comply with the law at the courthouse.",
                "I'm not saying that any of these detentions are justified. But it has been common practice for years to send people in his position to immigration court for removal proceedings. He was required by law to apply for removal of conditions on his residence at the two-year mark. With children and a life together with his USC spouse, it would have been an easy approval, might not have even required an interview. When he didn't file the petition that is required of *everyone* in his position, he opened himself up to this possibility. It's a three-page application. Now a judge has to sort it out while his family is in limbo."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israeli use of human shields in Gaza was systematic, soldiers and former detainees tell the AP",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
            "upvotes": 909,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What's another war crime between more war crimes",
                "Hamas uses human shields = bad\n\nIsrael uses human shields = totally ok\n\nCool…\n\nThis is not just a claim that is being made by Palestinians, soldiers have admitted to it. \n\n> The AP spoke with seven Palestinians who described being used as shields in Gaza and the occupied West Bank and with two members of Israel’s military who said they engaged in the practice, which is prohibited by international law. Rights groups are ringing the alarm, saying it’s become standard procedure increasingly used in the war.\n\nI feel like I need to put this here even though I shouldn’t have to. I am not condoning the use of human shield by either side. It’s horrific, it’s abhorrent, and it should absolutely not be happening and anybody who does it deserves to face stiff penalties.",
                "If you have not noticed this is how the IDF rolls you have purposely not been paying attention.",
                "Every accusation is a confession",
                "\"Whoever fights monsters, should see to it that in the process he does not become a monster. And if you gaze long into an abyss, the abyss also gazes into you.\" Nietzsche",
                "“Accuse the other of what you are guilty of yourself.”",
                "They've been doing this forever there was that video of Israeli patrols strapping Palestinians to the hoods of their vehicles. \n\nIsrael is straight ghouls.  They operate at the same moral level as African warlords.",
                "Every accusation an admission. When the idf starts accusing hamas of applying “non-genocidal tactics”, you’ll know things have started moving in the right direction.",
                "This is why fundamentalism has been so successful for centuries, its one \"saving grace\" is that the true believers have no problem with killing themselves or others. They \"reason\" that if it is possible, it is God's will. So, if God doesn't approve of their actions, He will surely stop them.\n\nThey are cancer.",
                "So Israel was projecting the whole time? Who could've known, this isn't something they regularly do..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 3070,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "How the fuck is lead introduced into baby food? Are they using lead mixing bowls? Why is lead anywhere near a baby food processing facility? Please explain to me, I don’t understand.",
                "Fox News is outraged that Publix is preventing future Fox news watchers.",
                "Good thing Trumpster is ditching all of our food regulations. Before long, Pubix can just shrug it off because no government body will be able to hold them to account, and no private citizen will be able to afford suing them.",
                "So thankful the FDA is being gutted, can’t say there’s lead in the food if no one is checking 🤷‍♂️",
                "How dare they test for lead in baby food?!? Where is RFK?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 4901,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "13 months for being the reason someone is dead because of your negligence....\n\nthere is no justice.",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns",
                "Prison time was far shorter than all the time spent on legal wrangling and the trials."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 1071,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/23/848bb1fe-05f0-4636-8209-5be198c5f672/thumbnail/1200x630/b16228493cbe4a2e3e4666ca78618bc9/6-reid-image-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "> The motive for the alleged attack is still unclear. Investigators say there were two butlers at the residence who would also be interviewed.\n\nWtf.\n\nI can't wait to hear the story behind this.",
                ">Woeltz is a crypto investor originally from Kentucky who rents an apartment in the home for between $30,000 and $40,000 per month.\n\nThat's a hell of a monthly expense, and with that kind of money you'd think he'd want to stay under the radar.",
                "I don't know how many times we have to say cryptoworld is full of criminals.",
                "Good to have a sideline, in case the crypto thing doesn't work out.",
                "He'll probably find some loose change, buy an audience at one of DJT's dinners, come in disguise 🥸, and get out next day with 5 million USD for calomny. ",
                "This guy's just going to pay Trump to get a pardon.",
                "It's always the people most likely to do it.",
                "\"crypto investor\" you mean money launderer",
                "Is crypto used anywhere that isn’t a legit scam? Feels like it’s pretend money only for laundering and ripping off other people.",
                "Wait - I though they cancelled 'Start up'? Didn't expect a new season..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Sabotage suspected as power cut hits Cannes Film Festival",
            "external_url": "https://www.bbc.com/news/articles/c4gel3g84q0o",
            "upvotes": 931,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5cb/live/84b16460-38cb-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">\"Cannes is in a total slowdown, meltdown, there's no coffee anywhere, and I think the town has run out of croissants, so this is like crisis territory.\"\n\nA man with priorities.",
                "It's the cannes! He hates these cannes! ",
                "A saboteur at Cannes?\n\nThis is so Inspector Clouseau coded.",
                "I can't stand it. I know you planned it.",
                "Man the Catholic League is protesting Dogma again!?",
                "This article is light on details. Where is the information about sabotage coming from? Why is sabotage suspected? What is the motive?",
                "You must construct additional pylons.",
                "I Cannes ‘tand it, I know you planned it",
                "Kevin Spacey has claimed responsibility for this act of terrorism.",
                "I can't stand it, I know you planned it\n\nI'm gonna set it straight, this Watergate\n\nI can't stand rocking when I'm in here\n\n'Cause your crystal ball ain't so crystal clear\n\nSo while you sit back and wonder why\n\nI got this fucking thorn in my side\n\nOh my God, it's a mirage\n\nI'm tellin' y'all…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 1080,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "I can’t even imagine losing your children like this. Just utter depravity.",
                "“The IDF is finally conducting a campaign against the civilian rule of ⁦‪Hamas‬⁩ and not just focusing on the military infrastructure. We are eliminating ministers, officials, money changers, and elements of the economic and governmental system”\n\nIsraeli defense minister Smotrich a few days ago. Expect more targeted assassinations of healthcare workers and their families.",
                "Evil",
                "They learnt lessons from the Nazis; why bother with concentration camps when you can skip straight to the ethnic cleansing?",
                "\"we thought there were more\" - Israel when asked why they killed 9 children ",
                "At this point, there is never going to be accountability, there will never be ramifications of what has been done, there is never turning back to the children who have lost limbs, lives, parents, relatives because they see nothing but revenge. So the cycle will continue, the cause for freedom will continue, in forms of terror, in forms of violence, exactly what those in power need to fuel their desire for power and money to feed their military doctrines.\n\nPeace is only going to be a thought, condemnation will come and go, stern words will be thrown out. But the victim card that Israel holds, unfortunately, over the world is heavy, because 6 million plus lives were lost, and the loss of innocence is being used as a tool to say \"never again\" fueld with violence, and desire to stay in power.\n\nAt the end only innocence will suffer, only innocence will be stolen, only tears that will be cared for, will be the ones who are privileged and not the impoverished. \n\nSadly because rich tears are far more valuable than the poor ones for the world to do something and care.",
                "Everyone is Hamas, so no genocide. - Israel\n\nBibi belongs in jail!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Actor Jussie Smollett to pay $50,000 to Chicago charity",
            "external_url": "https://www.bbc.com/news/articles/c2lke8l980no",
            "upvotes": 170,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0455/live/9af94a90-37c1-11f0-8c61-1388b061cbbc.jpg",
            "top_comments": [
                ">Chicago police had wanted Smollett to pay $130,000 to cover the investigation costs, but on Thursday, Chicago's law department confirmed that the donation will be made instead.\n\nIs that the end of it? I haven't been following the criminal case any more. Was that resolved entirely?",
                "*The money will go to Building Brighter Futures Center for the Arts, an organisation that supports Chicago's underprivileged youth.*\n\nNice--but who gets to pay the 130,000 in investigative costs?  Did I hear \"Chicago tax payers.\"",
                "He’s a useless waste of space and energy",
                "Hope he doesn’t get mugged by those guys on his way to the charity. ",
                "Is this that French actor Dave Chappelle was talking about? :)",
                "Really hoping normal black people outweigh black activists when it comes to this loser and he never works again.",
                "I'm a liberal and I don't want to hear about this schmuck anymore.",
                "For only $7.99, you could rent his new movie The Lost Holiday ",
                "I'll believe it when I see it.",
                "What does Ja think about this?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 1335,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                " now probably works for ICE instead",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "Good.  He's an embarrassment to humankind.",
                "Started as slave catchers and never stopped. Consequences for actions need to go all the way to the top or there can be no justice ",
                "Stop being civil with MAGAs.",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "At least we know what he looks like…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli use of human shields in Gaza was systematic, soldiers and former detainees tell the AP",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
            "upvotes": 908,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What's another war crime between more war crimes",
                "Hamas uses human shields = bad\n\nIsrael uses human shields = totally ok\n\nCool…\n\nThis is not just a claim that is being made by Palestinians, soldiers have admitted to it. \n\n> The AP spoke with seven Palestinians who described being used as shields in Gaza and the occupied West Bank and with two members of Israel’s military who said they engaged in the practice, which is prohibited by international law. Rights groups are ringing the alarm, saying it’s become standard procedure increasingly used in the war.\n\nI feel like I need to put this here even though I shouldn’t have to. I am not condoning the use of human shield by either side. It’s horrific, it’s abhorrent, and it should absolutely not be happening and anybody who does it deserves to face stiff penalties.",
                "If you have not noticed this is how the IDF rolls you have purposely not been paying attention.",
                "Every accusation is a confession",
                "\"Whoever fights monsters, should see to it that in the process he does not become a monster. And if you gaze long into an abyss, the abyss also gazes into you.\" Nietzsche",
                "“Accuse the other of what you are guilty of yourself.”",
                "They've been doing this forever there was that video of Israeli patrols strapping Palestinians to the hoods of their vehicles. \n\nIsrael is straight ghouls.  They operate at the same moral level as African warlords.",
                "Every accusation an admission. When the idf starts accusing hamas of applying “non-genocidal tactics”, you’ll know things have started moving in the right direction.",
                "This is why fundamentalism has been so successful for centuries, its one \"saving grace\" is that the true believers have no problem with killing themselves or others. They \"reason\" that if it is possible, it is God's will. So, if God doesn't approve of their actions, He will surely stop them.\n\nThey are cancer.",
                "So Israel was projecting the whole time? Who could've known, this isn't something they regularly do..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 3440,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "No worries for that guy. Trump will pardon him.",
                "[removed]",
                "Are you sure he's arrested and not arriving as a \"refugee\"? If he is arrested, how long do you think before he gets pardoned?",
                "Trump imported White South Africans, Nazis are next on his list."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 1070,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/23/848bb1fe-05f0-4636-8209-5be198c5f672/thumbnail/1200x630/b16228493cbe4a2e3e4666ca78618bc9/6-reid-image-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "> The motive for the alleged attack is still unclear. Investigators say there were two butlers at the residence who would also be interviewed.\n\nWtf.\n\nI can't wait to hear the story behind this.",
                ">Woeltz is a crypto investor originally from Kentucky who rents an apartment in the home for between $30,000 and $40,000 per month.\n\nThat's a hell of a monthly expense, and with that kind of money you'd think he'd want to stay under the radar.",
                "I don't know how many times we have to say cryptoworld is full of criminals.",
                "Good to have a sideline, in case the crypto thing doesn't work out.",
                "He'll probably find some loose change, buy an audience at one of DJT's dinners, come in disguise 🥸, and get out next day with 5 million USD for calomny. ",
                "This guy's just going to pay Trump to get a pardon.",
                "It's always the people most likely to do it.",
                "\"crypto investor\" you mean money launderer",
                "Is crypto used anywhere that isn’t a legit scam? Feels like it’s pretend money only for laundering and ripping off other people.",
                "Wait - I though they cancelled 'Start up'? Didn't expect a new season..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sabotage suspected as power cut hits Cannes Film Festival",
            "external_url": "https://www.bbc.com/news/articles/c4gel3g84q0o",
            "upvotes": 928,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5cb/live/84b16460-38cb-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">\"Cannes is in a total slowdown, meltdown, there's no coffee anywhere, and I think the town has run out of croissants, so this is like crisis territory.\"\n\nA man with priorities.",
                "It's the cannes! He hates these cannes! ",
                "A saboteur at Cannes?\n\nThis is so Inspector Clouseau coded.",
                "I can't stand it. I know you planned it.",
                "Man the Catholic League is protesting Dogma again!?",
                "This article is light on details. Where is the information about sabotage coming from? Why is sabotage suspected? What is the motive?",
                "You must construct additional pylons.",
                "I Cannes ‘tand it, I know you planned it",
                "Kevin Spacey has claimed responsibility for this act of terrorism.",
                "I can't stand it, I know you planned it\n\nI'm gonna set it straight, this Watergate\n\nI can't stand rocking when I'm in here\n\n'Cause your crystal ball ain't so crystal clear\n\nSo while you sit back and wonder why\n\nI got this fucking thorn in my side\n\nOh my God, it's a mirage\n\nI'm tellin' y'all…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump's trade war puts Australian beef centre stage in Shanghai",
            "external_url": "https://www.abc.net.au/news/2025-05-24/shanghai-expo-during-trump-tariffs-puts-aussie-beef-centre-stage/105326724",
            "upvotes": 65,
            "date": "05/24/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef08860d3a56df67c28ee69b5735e409?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "I bet those farmers sitting on beef in the US are enjoying the vote.",
                "Australia beef sales will now be the choice. US beef took theirs off the menu. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House slashing staff in major overhaul of National Security Council, officials say",
            "external_url": "https://apnews.com/article/trump-national-security-council-nsc-50ac71e10b9700a0c0e4266afc958cc3",
            "upvotes": 283,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After all, who needs intelligence briefings when the president is a stone cold moron so stupid the briefings literally bounce off his smooth brain?",
                "I hear the secret service has way too many agents.  Maybe start there?",
                "Uhg, I'm sure this is bad and has lots of ripple effects we can't even foresee but at this point..add it to the list of shit we have to try to fix once fuckface is gone",
                "Key Proposals Regarding NSC in Project 2025: Ensure national security decisions are aligned with the President's objectives. Replace career officials with individuals more closely aligned with loyalty and adherence to President's vision. Consolidate executive power, so the President has greater control of national security decisions. To emphasize alignment with conservative principles, or a Christian Nationalist Agenda. Criminalize behavior that does not conform to specific religious doctrines. Such a fun timeline.",
                "Yes—this is what happens in an autocracy.",
                "Can’t help but read this as “solidifying control by removing non boot lickers.”  \n\n\nI am reminded a of a quote. I read somewhere that Trump said he wants to be the smartest one in the room and surround himself only with people stupider than him.  And the quote just sounds like he doesn’t want to feel stupid himself. Which he is. ",
                "This is a despotic move for more control. It makes us weaker.",
                "Why do I get the strong feeling that after originally purging the office and restaffing it, they discover people were still trying to follow the constitution.",
                "National security appears to be overrated",
                "I still can't believe that this is our reality. I guess I'm still coming to grips with how stupid over half of America's people are."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 4254,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly ~~what he voted for~~ the policy he supports. He just didn't think it would happen to him \\[because he's white\\].",
                "And there won’t be any Medicaid for his 5 anchor babies after he’s deported.  His wife voted for Trump, he stumped for Trump.  When he had an expired green card. \n\n#FAFO",
                "Amazing that conservatives can say \"we just want people to come here the legal way\" when the \"legal way\" is so damn complicated that it's this easy to screw up one little thing.",
                "The social media accounts of Kasper Eriksen show him to be a rabid Trump MAGA supporter. He’s having the day he deserves.",
                "Mississippi, blue collar, 4 kids and pregnant wife.  \n\nI bet all of his friends and probably his wife voted for Trump.",
                "The party of law and order really seems to hate law and order. Like, literally trying to subvert the courts and prevent them from doing their job, while people are trying to comply with the law at the courthouse.",
                "I'm not saying that any of these detentions are justified. But it has been common practice for years to send people in his position to immigration court for removal proceedings. He was required by law to apply for removal of conditions on his residence at the two-year mark. With children and a life together with his USC spouse, it would have been an easy approval, might not have even required an interview. When he didn't file the petition that is required of *everyone* in his position, he opened himself up to this possibility. It's a three-page application. Now a judge has to sort it out while his family is in limbo."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ten Women Assaulted by Denver Lyft Driver Urge Governor to Sign Rideshare Bill",
            "external_url": "https://www.westword.com/news/women-assaulted-by-lyft-driver-ask-colorado-gov-sign-bill-24608150",
            "upvotes": 177,
            "date": "05/24/2025",
            "thumbnail": "https://media2.westword.com/den/imager/ten-women-kidnapped-assaulted-by-denver-lyft-driver-urge-governor-to-sign-rideshare-safety-bill/u/r-landingfeature/24608845/lyft_copy.webp?cb=1748004297",
            "top_comments": [
                "Not sure why this isn't a no brainer",
                ">“The governor is not planning to take any action that would lead to ride-sharing companies leaving the state,\"\n\nOf course, because the most important thing to the elites is not upsetting a corporation that only exists to suck wealth out of the populace by being an unregulated cab company that pushes all the costs onto employees and all the risks on to the consumers. They really are a perfect example of what America stands for, all the benefits go to people with more money and power, while all the costs go to people with with less money and power."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 1336,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                " now probably works for ICE instead",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "Good.  He's an embarrassment to humankind.",
                "Started as slave catchers and never stopped. Consequences for actions need to go all the way to the top or there can be no justice ",
                "Stop being civil with MAGAs.",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "At least we know what he looks like…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli use of human shields in Gaza was systematic, soldiers and former detainees tell the AP",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
            "upvotes": 903,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What's another war crime between more war crimes",
                "Hamas uses human shields = bad\n\nIsrael uses human shields = totally ok\n\nCool…\n\nThis is not just a claim that is being made by Palestinians, soldiers have admitted to it. \n\n> The AP spoke with seven Palestinians who described being used as shields in Gaza and the occupied West Bank and with two members of Israel’s military who said they engaged in the practice, which is prohibited by international law. Rights groups are ringing the alarm, saying it’s become standard procedure increasingly used in the war.\n\nI feel like I need to put this here even though I shouldn’t have to. I am not condoning the use of human shield by either side. It’s horrific, it’s abhorrent, and it should absolutely not be happening and anybody who does it deserves to face stiff penalties.",
                "If you have not noticed this is how the IDF rolls you have purposely not been paying attention.",
                "Every accusation is a confession",
                "\"Whoever fights monsters, should see to it that in the process he does not become a monster. And if you gaze long into an abyss, the abyss also gazes into you.\" Nietzsche",
                "“Accuse the other of what you are guilty of yourself.”",
                "They've been doing this forever there was that video of Israeli patrols strapping Palestinians to the hoods of their vehicles. \n\nIsrael is straight ghouls.  They operate at the same moral level as African warlords.",
                "Every accusation an admission. When the idf starts accusing hamas of applying “non-genocidal tactics”, you’ll know things have started moving in the right direction.",
                "This is why fundamentalism has been so successful for centuries, its one \"saving grace\" is that the true believers have no problem with killing themselves or others. They \"reason\" that if it is possible, it is God's will. So, if God doesn't approve of their actions, He will surely stop them.\n\nThey are cancer.",
                "So Israel was projecting the whole time? Who could've known, this isn't something they regularly do..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 3443,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "No worries for that guy. Trump will pardon him.",
                "[removed]",
                "Are you sure he's arrested and not arriving as a \"refugee\"? If he is arrested, how long do you think before he gets pardoned?",
                "Trump imported White South Africans, Nazis are next on his list."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 1069,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/23/848bb1fe-05f0-4636-8209-5be198c5f672/thumbnail/1200x630/b16228493cbe4a2e3e4666ca78618bc9/6-reid-image-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "> The motive for the alleged attack is still unclear. Investigators say there were two butlers at the residence who would also be interviewed.\n\nWtf.\n\nI can't wait to hear the story behind this.",
                ">Woeltz is a crypto investor originally from Kentucky who rents an apartment in the home for between $30,000 and $40,000 per month.\n\nThat's a hell of a monthly expense, and with that kind of money you'd think he'd want to stay under the radar.",
                "I don't know how many times we have to say cryptoworld is full of criminals.",
                "Good to have a sideline, in case the crypto thing doesn't work out.",
                "He'll probably find some loose change, buy an audience at one of DJT's dinners, come in disguise 🥸, and get out next day with 5 million USD for calomny. ",
                "This guy's just going to pay Trump to get a pardon.",
                "It's always the people most likely to do it.",
                "\"crypto investor\" you mean money launderer",
                "Is crypto used anywhere that isn’t a legit scam? Feels like it’s pretend money only for laundering and ripping off other people.",
                "Wait - I though they cancelled 'Start up'? Didn't expect a new season..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 1079,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "I can’t even imagine losing your children like this. Just utter depravity.",
                "“The IDF is finally conducting a campaign against the civilian rule of ⁦‪Hamas‬⁩ and not just focusing on the military infrastructure. We are eliminating ministers, officials, money changers, and elements of the economic and governmental system”\n\nIsraeli defense minister Smotrich a few days ago. Expect more targeted assassinations of healthcare workers and their families.",
                "Evil",
                "They learnt lessons from the Nazis; why bother with concentration camps when you can skip straight to the ethnic cleansing?",
                "\"we thought there were more\" - Israel when asked why they killed 9 children ",
                "At this point, there is never going to be accountability, there will never be ramifications of what has been done, there is never turning back to the children who have lost limbs, lives, parents, relatives because they see nothing but revenge. So the cycle will continue, the cause for freedom will continue, in forms of terror, in forms of violence, exactly what those in power need to fuel their desire for power and money to feed their military doctrines.\n\nPeace is only going to be a thought, condemnation will come and go, stern words will be thrown out. But the victim card that Israel holds, unfortunately, over the world is heavy, because 6 million plus lives were lost, and the loss of innocence is being used as a tool to say \"never again\" fueld with violence, and desire to stay in power.\n\nAt the end only innocence will suffer, only innocence will be stolen, only tears that will be cared for, will be the ones who are privileged and not the impoverished. \n\nSadly because rich tears are far more valuable than the poor ones for the world to do something and care.",
                "Everyone is Hamas, so no genocide. - Israel\n\nBibi belongs in jail!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Actor Jussie Smollett to pay $50,000 to Chicago charity",
            "external_url": "https://www.bbc.com/news/articles/c2lke8l980no",
            "upvotes": 170,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0455/live/9af94a90-37c1-11f0-8c61-1388b061cbbc.jpg",
            "top_comments": [
                ">Chicago police had wanted Smollett to pay $130,000 to cover the investigation costs, but on Thursday, Chicago's law department confirmed that the donation will be made instead.\n\nIs that the end of it? I haven't been following the criminal case any more. Was that resolved entirely?",
                "*The money will go to Building Brighter Futures Center for the Arts, an organisation that supports Chicago's underprivileged youth.*\n\nNice--but who gets to pay the 130,000 in investigative costs?  Did I hear \"Chicago tax payers.\"",
                "He’s a useless waste of space and energy",
                "Hope he doesn’t get mugged by those guys on his way to the charity. ",
                "Is this that French actor Dave Chappelle was talking about? :)",
                "Really hoping normal black people outweigh black activists when it comes to this loser and he never works again.",
                "I'm a liberal and I don't want to hear about this schmuck anymore.",
                "For only $7.99, you could rent his new movie The Lost Holiday ",
                "I'll believe it when I see it.",
                "What does Ja think about this?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Sabotage suspected as power cut hits Cannes Film Festival",
            "external_url": "https://www.bbc.com/news/articles/c4gel3g84q0o",
            "upvotes": 929,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5cb/live/84b16460-38cb-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">\"Cannes is in a total slowdown, meltdown, there's no coffee anywhere, and I think the town has run out of croissants, so this is like crisis territory.\"\n\nA man with priorities.",
                "It's the cannes! He hates these cannes! ",
                "A saboteur at Cannes?\n\nThis is so Inspector Clouseau coded.",
                "I can't stand it. I know you planned it.",
                "Man the Catholic League is protesting Dogma again!?",
                "This article is light on details. Where is the information about sabotage coming from? Why is sabotage suspected? What is the motive?",
                "You must construct additional pylons.",
                "I Cannes ‘tand it, I know you planned it",
                "Kevin Spacey has claimed responsibility for this act of terrorism.",
                "I can't stand it, I know you planned it\n\nI'm gonna set it straight, this Watergate\n\nI can't stand rocking when I'm in here\n\n'Cause your crystal ball ain't so crystal clear\n\nSo while you sit back and wonder why\n\nI got this fucking thorn in my side\n\nOh my God, it's a mirage\n\nI'm tellin' y'all…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 3070,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "How the fuck is lead introduced into baby food? Are they using lead mixing bowls? Why is lead anywhere near a baby food processing facility? Please explain to me, I don’t understand.",
                "Fox News is outraged that Publix is preventing future Fox news watchers.",
                "Good thing Trumpster is ditching all of our food regulations. Before long, Pubix can just shrug it off because no government body will be able to hold them to account, and no private citizen will be able to afford suing them.",
                "So thankful the FDA is being gutted, can’t say there’s lead in the food if no one is checking 🤷‍♂️",
                "How dare they test for lead in baby food?!? Where is RFK?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 8164,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditors whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "If I had the money to leave I’d already be out",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "I have UK citizenship, so that's an option for me...but it's not that simple to just pack your entire life up, lose your home and job, thousands of things you have to deal with...but on the other hand, by the time it becomes super worth it to leave, maybe you can't anymore.",
                "My fiancé works completely remote, and we were considering the 'digital nomad' lifestyle, it's just *insanely* expensive in the UK compared to where we currently live. We also considered New Zealand, but it's too difficult to get in.",
                "Took almost 200 years but it's time to go home."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 4271,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly ~~what he voted for~~ the policy he supports. He just didn't think it would happen to him \\[because he's white\\].",
                "And there won’t be any Medicaid for his 5 anchor babies after he’s deported.  His wife voted for Trump, he stumped for Trump.  When he had an expired green card. \n\n#FAFO",
                "Amazing that conservatives can say \"we just want people to come here the legal way\" when the \"legal way\" is so damn complicated that it's this easy to screw up one little thing.",
                "The social media accounts of Kasper Eriksen show him to be a rabid Trump MAGA supporter. He’s having the day he deserves.",
                "Mississippi, blue collar, 4 kids and pregnant wife.  \n\nI bet all of his friends and probably his wife voted for Trump.",
                "The party of law and order really seems to hate law and order. Like, literally trying to subvert the courts and prevent them from doing their job, while people are trying to comply with the law at the courthouse.",
                "I'm not saying that any of these detentions are justified. But it has been common practice for years to send people in his position to immigration court for removal proceedings. He was required by law to apply for removal of conditions on his residence at the two-year mark. With children and a life together with his USC spouse, it would have been an easy approval, might not have even required an interview. When he didn't file the petition that is required of *everyone* in his position, he opened himself up to this possibility. It's a three-page application. Now a judge has to sort it out while his family is in limbo."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/25/2025 00:49:47 UTC"
}