{
    "posts": [
        {
            "category": "HOT",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 12437,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "Revoked over…a 3-year old traffic stop. Wow.",
                "[Kristi Noem has had 20 speeding tickets, three stop-sign violations, two seat-belt violations and a citation for driving with no driver’s license. She has also been issued six court notices for failure to appear and two arrest warrants.](https://thehill.com/blogs/blog-briefing-room/news/169901-s-d-gop-candidate-cited-for-numerous-traffic-violations/)",
                "How much money has this administration, Noem, wasted on this kind of horse shit..... Enough. tRumps band of idiots can't find the 11 million illegals he claimed were in the US illegally so they've been creating them. Revoking visas for bullshit traffic infractions is childish and a complete waste of tax dollars. tRumps administration has been a clusterfuck from day one!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump agrees deal for UAE to build largest AI campus outside US",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/trump-artificial-intelligence-uae?utm_source=chatgpt.com",
            "upvotes": 1648,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d366b3b21608957ff04add867d3343c8969fe6b/339_0_3331_2666/master/3331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10b67d750a6bab2874750f7a5e73a7e8",
            "top_comments": [
                "Bringing jobs back to . . . . Make Arabia Great Again?",
                "Bringing those jobs back to the US I see",
                "This entire trip so far has been such a disgrace to America and its people",
                "That's a bad location for data centers that need a lot of constant cooling.",
                "Has anyone tried explaining to “conservatives” that if we switch away from fossil fuels that it will hurt brown people who live halfway across the world and have a religion that differs from theirs? I know it’s not bombing civilians and starving babies to death but they still won’t like it. ",
                "Ah, Nice plane for him, no US jobs and a foreign nation having access to our AI research. So much winning!",
                "So, make UAE great again.",
                "You flash money at him he'll do anything for any foreign country. The US is for sale.",
                "Trump on tour to line his own pockets.",
                "It's going to be really sad when we spend all this time and money with the UAE to get a new AI model, and then China open sources a better one the next day. \n\nThe current view on AI by people like Trump and Musk is really a zero sum game for humanity, it's just that the 1% gains all the benefits at the cost to the 99%"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Verizon ending DEI programs as it seeks US approval for Frontier deal",
            "external_url": "https://www.reuters.com/sustainability/society-equity/verizon-ending-dei-programs-it-seeks-us-approval-frontier-deal-2025-05-16/",
            "upvotes": 1742,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Verizon Communications said Friday it is ending diversity, equity and inclusion programs after the Trump administration opened a probe and as the U.S. telecom carrier seeks approval to purchase Frontier Communications”\n\nInteresting timing to say the least",
                "Our government just engages in extortion now.  Really making America great again.",
                "Time to switch carriers.",
                "It's this why everyone's bill had to go up $5 last month, even though we got nothing new/better in return?",
                "And another takes the knee and swears fealty to “The Party”. Sad, but it is the times we live in and the regime we live under.",
                "And now I want to cancel my Verizon plan and go with someone else.  They want to kneel to fascists and racists?  Then they don't need my money.",
                "If anyone is delusional enough to think corporations care more about morality rather than chasing the profit think again. It is another proof that those DEI policies were just for the show and PR.",
                "I’ve seen a lot of examples of companies bending to extortion but this one is awful. Just “fuck diversity, we were just pretending anyway”",
                "Can you hear me now, Daddy?",
                "Damnit and I just switched to Verizon after Tmobiles ad with a Nazi's company. FFS."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police investigate disappearance of Melania Trump's statue in her native Slovenia",
            "external_url": "https://apnews.com/article/melania-trump-statue-slovenia-9440b43a0a6771256522290fb219efce",
            "upvotes": 1266,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I really don’t care. Do you?",
                "LOL. There’s a fucking statue of this woman that achieved absolutely nothing of significance whatsoever?\n\nSlovenia: “Hey, we’re commissioning you to make a sculpture for our town square”\n\nSculptor: “Wow! One our olympians perhaps? One of many scientists or scholars? Maybe Fritz Pregl, Nobel Prize winner?”\n\nSlovenia: “Mmmmm, not exactly, no”",
                ">The [life-size sculpture](https://apnews.com/general-news-fa29ec746c9200c33033177ac3a1d146) was unveiled in 2020 during President Donald Trump’s first term in office near Sevnica in central Slovenia, where Melanija Knavs was born in 1970. It replaced a wooden statue that had been set on fire earlier that year.\n\nI guess statues of Melania aren't too popular in Slovenia!",
                "Just like the real Melania, the statue disappeared shortly after the election…",
                "Your home must be pretty sad if the big figure they build a statue in honor of is a foreigners mail order bride.",
                "The Qatari jet is getting a new hood ornament.",
                "\"And here's our statue of what we're told is a beautiful woman who spread her legs for the promise of a comfortable life!\"",
                "Why was there even a statue of this woman in the first place?",
                "What about her disappearance as the First Lady of the United States.",
                "It was a hilariously shitty statue everyone laughed at passing by on trains. It was entertaining, at least. lol."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Older people in crosshairs as government restarts Social Security garnishment on student loans",
            "external_url": "https://apnews.com/article/student-loans-debt-social-security-67a3a50a90aee3e6dda1ae4428094f97",
            "upvotes": 629,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Huh. I’d be very curious to see if these people who are now very concerned about their social security payments being garnished to pay for student loans has any issues with *other* people getting loan forgiveness - and voted agains their own interests.",
                "> Farro’s loans date back 40 years. She was a single mother when she got a bachelor’s degree in developmental psychology and when she discovered she couldn’t earn enough to pay off her loans, she went back to school and got a master’s degree. Her salary never caught up. Things only got worse.\nAround 2008, when she consolidated her loans, she was paying $1,000 a month, but years of missed payments and piled-on interest meant she was barely putting a dent in a bill that had ballooned to $250,000. When she sought help to resolve her debt, she says the loan company had just one suggestion.\n“They said, ‘Move to a cheaper state,’” says Farro, who rents a 400-square-foot casita from a friend. “I realized I was living in a different reality than they were.”\n\nI think most people agree with their original obligation to pay their student loans. The problem is the debt often becomes predatory and they've barely made a dent in the principal after decades. That's when people start seeing education debt as a major issue in need of reform.",
                "College used to be ticket for better secure life but no longer as the cost skyrocketed and many degrees failed to generate leaving the borrowers in the lurch.",
                "Can someone explain to me why we made it so student loan debt can’t be discharged in bankruptcy.",
                "A college education should be free. What's more important to invest in than our kids' education?",
                "Hey, Maga, this what you voted for? Owning the libs now?",
                "Why the fuck is this administration so full of assholes?",
                "I encourage anyone who has been deemed to have \"total and permanent disability\" to apply to have your student loans forgiven. I'm not longer able to work and had mine forgiven. ",
                "That’ll teach grandpa to get that degree in women’s studies.",
                "good. retirees love wringing their bread from the sweat of other folk's faces while voting for politicians who leave the rest with scraps."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "NYU withholds diploma of student who condemned Israel in graduation speech",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/nyu-withholds-diploma-israel-gaza-speech",
            "upvotes": 15992,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/50a8b417bb29a67d134561adaf29dd02e7aca775/570_0_5700_4562/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c34e9eea0a814065090f92fa9f029a1",
            "top_comments": [
                "this will be an interesting one for the courts.\n\n\nfederal law [prevents colleges from withholding diplomas for disciplinary issues](https://registrar.lmu.edu/ferpa-rightsandprivacyact/#:~:text=FERPA%20requires%20that%20education%20records,on%20release%20of%20directory%20information.) to prevent this exact situation, a graduate isnt liked by someone on the schools board, so they choose to withhold their diploma. withholding one against federal law can lead to your school losing accreditation, which is a death sentence for a college because ALL diplomas issued by them become worthless in every career field.\n\n\nthey can only withhold it if you owe them money, or they believe you committed fraud to get your degree. the fraud claim requires an academic court ruling to withhold diplomas or honors",
                "Ah, this sounds like the free speech Musk and Vance have been ranting about.",
                "The use of the term anti-governmental to describe the USAID speech a month ago was the sign of how fascist NYU already was. Anti-governmental is completely valid speech in the US. Just say Anti-regime you fucking cowards. I'm sure a lawyer will volunteer to inform NYU of their inability to withold the degree and this will be quietly resolved.",
                "They are drawing so much more attention to this than they need to. Some textbook Streisand Effect going on.",
                "What's this American infatuation with Israel? I just don't seem to understand.",
                "What the hell kind of reality are we living in?!",
                "[removed]",
                "I feel like my whole country is built on lies.  Free speech first among them.",
                "The only proper response to something like this is simply to ask who your attorney should contact if your diploma isn't returned posthaste.",
                ">Rozos went on to say: “The genocide currently occurring is supported politically and militarily by the United States, is paid for by our tax dollars and has been livestreamed to our phones for the past 18 months. And that I do not wish to speak only to my own politics today, but to speak for all people of conscience, and all people who feel the moral injury of this atrocity.”\n\n>\n\nThink about it.\n\nWhy is it so important to Democrats and Republicans that Americans or  foreigners in America support a Far Right Wing fascist foreign Government like Israel?  Free speech exists in America to support or condemn any country we want, to protect unpopular speech.   This is another person who was viewed as an \"Anti-semite\" for criticizing the Israel Government or Zionist that operate that government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 561,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "[removed]",
                "Amazing how fast they move when it's them being threatened.",
                "She’s the same one that had the sling after the handshake…",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "So, the trans person is responding after having her life threatened *repeatedly by the same group of people*. Got it.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "Don’t threaten people’s lives guys. Not cool. \nBut also fuck you Nancy Mace.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Coinbase says hackers bribed staff to steal customer data and are demanding $20 million ransom",
            "external_url": "https://www.cnbc.com/2025/05/15/coinbase-says-hackers-bribed-staff-to-steal-customer-data-and-are-demanding-20-million-ransom.html",
            "upvotes": 1246,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108146289-1747336602924-gettyimages-1312540542-_dsc9048.jpeg?v=1747416924&w=1920&h=1080",
            "top_comments": [
                "This is becoming increasingly common with overseas support companies where the agents are being offered over 1 month's worth of salary for inside knowledge on user accounts. They've also been targeting internal employees and offering significantly more due to their deeper access. \n\nAnd it's easy to do. The lower wages, the easy ability to get jobs, the lack of security to get in/out of buildings, and the constant rotation of new employees make it too easy to bribe these folks. They'll just go end up working for another company afterwards and do the same thing.",
                "This would explain why I keep getting so many scam texts about my coinbase account",
                "\"All your coinbase are belong to us\"",
                "Coinbase sent out emails to anyone that had their data leaked.  It's a big deal because one of things that was leaked was images of people's ID's they used to verify their identity with Coinbase.",
                "S&P 500 company behavior.",
                "This is what happens when you sublet large swaths of your company to India. Plenty of insurance companies are in the process of replacing their staff with remote Indian workers, this will only get worse and more common.",
                "Annnnd this is why INFOSEC and anything with database shouldn't be send oversea just because it is \"cheaper\".",
                "This is the kind of quality hiring and compliance that investors should expect with S&P 500 companies.",
                "Offshoring the people who have admin access to your stuff was a great idea\n👍",
                "I can't freaking wait for the crypto market to crash."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Rushdie attacker sentenced to 25 years in prison",
            "external_url": "https://www.bbc.com/news/articles/cp85kg527p9o",
            "upvotes": 1036,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8e53/live/985dea60-328b-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                ">\"Salman Rushdie wants to disrespect other people,\" said Matar, clad in white-striped jail clothing and wearing handcuffs. \"He wants to be a bully, he wants to bully other people. I don't agree with that.\"\n\nSir, you *stabbed* people. You don't get to call anyone a bully.",
                "Is that all? The man tried to kill someone because they made fun of the book he likes to read.\n\nSomething like that, I forget the details.\n\nSeems like a poor reason to try and murder someone.",
                "Man attempted the murder at a seminar hosted by the Chautauqua institution in New York. You have to be a special kind of stupid to try and stab someone to death at an event with a minimum of 5 doctors and 8 surgeons in the audience.",
                "“Two nights before the attack, Salman Rushdie dreamed he was stabbed onstage. Today, his attacker has been sentenced to 25 years in prison.\n\nRead more: NPR Article”\n\nMan who stabbed Salman Rushdie convicted of attempted murder \n\nhttps://www.npr.org/2025/02/21/nx-s1-5305184/hadi-matar-salman-rushdie-stabbing-verdict\n\n> Speaking to NPR's Fresh Air about the book, Rushdie said he had a dream that he was publicly stabbed just two nights prior to the incident, and he almost cancelled the event where he was then attacked.",
                "All aboard the peace train…\n\nHey, wait a minute!",
                "We really need to get rid of religion, this dude gonna waste a third of his life in prison because he stabbed someone over his imaginary friend... that is legit insane.",
                "I feel like Islam is the religion least likely to be able to take a joke 😂",
                "Proving once again how ridiculous religion is in a sane world.",
                "Rushdie wrote a book after this attack and it's amazing. His descriptions of the trauma from the attack are really personal. It's appropriately called Knife Meditations.",
                "How can you fuck up murdering someone after stabbing them 15 times?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Gaza children are sent back to war zone following medical care after Jordan rejects requests to stay",
            "external_url": "https://apnews.com/article/jordan-gaza-sick-children-israel-hamas-war-f656a459121033118c98b4d3e13fbd2b",
            "upvotes": 480,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why did Jordan reject their requests to stay?",
                "It's completely understandable why Jordan wouldn't want more Palestinian refugees, again, but it's sad to see.",
                "You’re all missing the plot. \n\nIf Jordan accepts them as refugees, then Israel will keep hammering them to force more of them to leave. \n\nThere is an Arab resistance to relocating them, as it opens the door for Israel’s complete takeover of Gaza",
                "I wonder if the State Department will send a plane to pick them up.",
                "Which is ironic, considering the vast majority of historical \"Palestine\" sits within the borders of Jordan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "BioLab closing Rockdale County plant after fallout from 2024 chemical fire",
            "external_url": "https://www.atlantanewsfirst.com/2025/05/16/biolab-ending-manufacturing-conyers-plant-following-2024-chemical-fire/",
            "upvotes": 10,
            "date": "05/16/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/L4M4JWHZRBAWVPNCXLQTXCAT3U.jpg?auth=36dc19c0cc11c40af4d15ddfb801f9df297568568024860be684258f7030ec82&width=1200&height=600&smart=true",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Boeing crash victims’ families say Justice Department set to drop criminal case, decry decision as ‘morally repugnant’",
            "external_url": "https://www.cnn.com/2025/05/16/business/boeing-justice-drop-criminal-case-morally-repugnant",
            "upvotes": 132,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1247998567-20250516162540038.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> will instead reach a non-criminal settlement with the company. The new settlement will include an additional $444.5 million into a crash victims’ fund that would be divided evenly per crash victim.\n\nYes a slap on the wrist. Take half of their profits after paying the employees. Fine each of the executive team half of their wages. Cancel half of their thank you contracts. Make it hurt so much that they will never do it again.",
                "Who wants to bet someone at DOJ bought a bunch of Boeing stock recently?",
                "But they settled the case the family of the dead quality control engineer levied against them.\n\nSeems they are able to admit fault. They should appeal!!!\n\nDon't forget John Barnett and Josh Dean!",
                "Repugnant and very Trumpy.",
                "*\"This is morally repugnant. It is a slap on the wrist. And it feels like a bribe,\" said Sanjiv Singh, an attorney who represents 16 victims in the 2018 crash of a Lion Air Boeing 737 Max.*\n\nIn 2018 and 2019 there were 346 people killed in two Boeing crashes.",
                "Gotta get free maintenance for a flying palace.",
                "Well yeah, do you think citizens get compensated when AeroFloat has airplane crashes?",
                "Morally repugnant is all of the current administration."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'Miraculous': 2-year-old survives fall from 15th floor of apartment building",
            "external_url": "https://abcnews.go.com/US/miraculous-2-year-survives-fall-15th-floor-apartment/story?id=121869490",
            "upvotes": 35,
            "date": "05/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/9b613615-b84e-4648-9c3c-c6892c823421/child-fall-building-wjla-jef-250516_1747398809155_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">\"The child hit the bushes and landed in mulch, softening the impact.\"\n\n>The child suffered \"traumatic\" injuries and went with a parent to a local hospital, according to the Montgomery County Fire and Rescue Service.\n\nThe kid is still in the hospital in an unknown condition according to the article.",
                "> The fall occurred Thursday afternoon from the apartment's private balcony, which has protective glass, not a railing, according to Montgomery County police spokesperson Shiera Goff. Adults were home at the time, Goff told ABC News.\n\nFrom the photos of the balcony style, did the glass break? Or was there something on the patio that allowed the child to climb over the glass barriers? Another article has fellow residents state that the glass barriers are relatively high. An absolutely terrifying thing for a child to experience."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 558,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "[removed]",
                "Amazing how fast they move when it's them being threatened.",
                "She’s the same one that had the sling after the handshake…",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "So, the trans person is responding after having her life threatened *repeatedly by the same group of people*. Got it.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "Don’t threaten people’s lives guys. Not cool. \nBut also fuck you Nancy Mace.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Gabbard fires 2 top intelligence officials and will shift office that preps Trump’s daily brief",
            "external_url": "https://apnews.com/article/national-intelligence-council-gabbard-trump-cia-2bc7d2dab2ab067b276d6b8b31a5dea7",
            "upvotes": 200,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cool, so he's gonna get feel good affirmations instead of actual intelligence briefings. the enemies of the united states couldn't ask for a better deal.",
                "The fired officials failed to provide briefings at a fifth grade level.  This annoyed both Trump **and** Gabbard.",
                "Last time he was the POTUS they needed to not only keep the briefs VERY short, but they realized they needed to insert his fucking name into every paragraph or so - or he [couldn't/wouldn't pay attention](https://www.buzzfeednews.com/article/davidmack/donald-j-trump). And that was nearly a decade ago. \n\nOur president is a demented idiot child.",
                "Gabbard wants 0 actual intelligence and instead wants 100% propaganda, as Trump demands.",
                "Honestly it's not like he listen to the briefings anyways. He literally just does what Putin tells him to",
                "That one guy who called me racist and sexist when I called Gabbard a danger a few years back. Believe me yet?",
                "ONLY GOOD NEWS, GUYS! How much clearly do we have to say it!?",
                "I imagine this is being done to hide how rarely he actually attends these meetings.",
                "Will they make McDonald’s kids menu sheets and provide crayons for the briefings now?",
                "At this point it’s just to keep him smiling. Trump is going off the rails and everyone is: “no keep him happy because we still need him.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Older people in crosshairs as government restarts Social Security garnishment on student loans",
            "external_url": "https://apnews.com/article/student-loans-debt-social-security-67a3a50a90aee3e6dda1ae4428094f97",
            "upvotes": 630,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Huh. I’d be very curious to see if these people who are now very concerned about their social security payments being garnished to pay for student loans has any issues with *other* people getting loan forgiveness - and voted agains their own interests.",
                "> Farro’s loans date back 40 years. She was a single mother when she got a bachelor’s degree in developmental psychology and when she discovered she couldn’t earn enough to pay off her loans, she went back to school and got a master’s degree. Her salary never caught up. Things only got worse.\nAround 2008, when she consolidated her loans, she was paying $1,000 a month, but years of missed payments and piled-on interest meant she was barely putting a dent in a bill that had ballooned to $250,000. When she sought help to resolve her debt, she says the loan company had just one suggestion.\n“They said, ‘Move to a cheaper state,’” says Farro, who rents a 400-square-foot casita from a friend. “I realized I was living in a different reality than they were.”\n\nI think most people agree with their original obligation to pay their student loans. The problem is the debt often becomes predatory and they've barely made a dent in the principal after decades. That's when people start seeing education debt as a major issue in need of reform.",
                "College used to be ticket for better secure life but no longer as the cost skyrocketed and many degrees failed to generate leaving the borrowers in the lurch.",
                "Can someone explain to me why we made it so student loan debt can’t be discharged in bankruptcy.",
                "A college education should be free. What's more important to invest in than our kids' education?",
                "Hey, Maga, this what you voted for? Owning the libs now?",
                "Why the fuck is this administration so full of assholes?",
                "I encourage anyone who has been deemed to have \"total and permanent disability\" to apply to have your student loans forgiven. I'm not longer able to work and had mine forgiven. ",
                "That’ll teach grandpa to get that degree in women’s studies.",
                "good. retirees love wringing their bread from the sweat of other folk's faces while voting for politicians who leave the rest with scraps."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bahama Breeze just closed more than one-third of its locations",
            "external_url": "https://www.cnn.com/2025/05/16/food/bahama-breeze-closures",
            "upvotes": 48,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-801501090.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I don't think I ever saw one of these stores out in the wild. Maybe once in Florida years ago.",
                "More than 1/3? What is that, 2 stores?",
                "Odd thought they went out with the Elephant bar like 15 years ago",
                "Crappy over priced food.",
                "Oh no. My widowed group loved the one in Southcenter in Washington. I hope it survives.",
                "The only location I was aware of had been closed for years."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "WHO declares polio outbreak in Papua New Guinea",
            "external_url": "https://www.bbc.com/news/articles/cvg9men89yvo",
            "upvotes": 216,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/aae3/live/0f13d210-3213-11f0-be45-61e3c2f49cfe.jpg",
            "top_comments": [
                ">Papua New Guinea was said to be polio-free since 2000, until an outbreak in 2018, which was contained within the same year.\n\n>Health Minister Elias Kapavore has vowed to achieve 100% polio immunisation in the country by the end of this year\n\nMust be nice to have a health minister overreacting in the best possible way. \n\n>Polio has staged a comeback elsewhere in Asia in recent years. Pakistan saw 74 cases of the disease last year, while Afghanistan recorded 24 cases.\n\nI really hope they get ahead of this.",
                "We better air drop JRK Jr there immediately. No time for a parachute. ",
                "Send Secretary Kennedy",
                "My grandma got polio back in the 50s but luckily she lived in Minnesota and went to the Sister Kenny Institute.  My dad lived with an relatives until she came back  She was able to move around with her \"sticks\" (wooden forearm crutches) until she was much older.  It makes me sick that this disease is popping up again and most likely come back to the US.  America is quickly becoming a shithole country.",
                "> We have to make maximum effort to get 100% [vaccination] coverage,\" Dr Huseynova said at a media conference on Thursday.\n\"Polio knows no borders.\"\n\nA mindset that is dying at an alarming rate here in the US. Sadly, those that are paying the price of it are typically young children.",
                "Just for you to know. When you have a bacteria or virus almost extinct, but you don't competely wipe them out, you end up with the most adaptable and survivor strains spreading their genetic information.\n\nThis is what makes super bacteria. The most resilient ones spread and evolve, so it will make our vaccines and antibiotics less efficient over time.\n\nAllowing these people to give a second opportunity to those almost extinct illnesses is much much more dangerous and evil than what it looks like. One day, a mutation of these surviving strains will jump into a vaccinated person succesfully and then, most of the vaccinated people will be in danger as well.\n\n\nThis is a matter of survival, not just 4 crazy people punching themselves.",
                "Wait how did that happen?? Isn’t there like one guy left in an iron lung with polio?",
                "Wait…quick check. Where’s RFK, Jr. on this one?\n\nOh he’s not a doctor? Huh.",
                "So let’s all be real for a second. This is highly concerning.  The US (thanks Dump) has pulled funding for the WHO and those responsible for vaccinating at risk populations.  When a deadly, highly contagious disease surges in a third world country (no joke, people believe this is not our problem) soon becomes a problem when it is transmitted to someone traveling to the US or anywhere for that matter.  It is only a matter of time when “their” problem becomes our problem!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "2 officers hurt in brawl that will end public access to Dauphin County football scrimmage",
            "external_url": "https://www.pennlive.com/crime/2025/05/2-officers-hurt-in-brawl-that-will-end-public-access-to-dauphin-county-football-scrimmage.html",
            "upvotes": 42,
            "date": "05/16/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/DJ45WPMB4BAJPA77NCLRAORQN4.jpg?auth=c883a24b8ead7db4ea24331cf87c8468a74c8e37ede412c61cdca4ff1f81834b&width=1280&quality=90",
            "top_comments": [
                "OK, so basically a tryout on the field, and the redneck combine in the bleachers.",
                "I doubt the college scouts were impressed by this mess."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "On the run for 21 years, U.S. fugitive 'psychic' arrested in Toronto | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/toronto/florida-fugitive-arrested-toronto-1.7534663",
            "upvotes": 421,
            "date": "05/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7534738.1747238722!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/patrick-lutts-jr.jpg?im=Resize%3D620",
            "top_comments": [
                "Should’ve seen that coming",
                "He looks like that guy from The Mentalist who was hypnotized to bring a dead body into a police precinct. From season 1 I think?",
                "DUI death of two teens and didn't want to take responsibilty. They should give him at least 21 years in jail",
                "He ain't no Miss Cleo.",
                "So how do you avoid authorities for over 2 decades in foreign country?",
                "You could say he was a medium at large. If he is short then he was a small medium at large",
                "So left the country and went to the most populated city in our neighbors to the North and still avoided authorities for 2 decades? It's impressive how dumb that is on all fronts",
                "21 years is a good run. Maybe he saw himself on the run for 21 years but getting caught now.",
                "But how tall are they?\n\nWere they a small medium at large?",
                "He didn’t see this coming?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Older people in crosshairs as government restarts Social Security garnishment on student loans",
            "external_url": "https://apnews.com/article/student-loans-debt-social-security-67a3a50a90aee3e6dda1ae4428094f97",
            "upvotes": 628,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Huh. I’d be very curious to see if these people who are now very concerned about their social security payments being garnished to pay for student loans has any issues with *other* people getting loan forgiveness - and voted agains their own interests.",
                "> Farro’s loans date back 40 years. She was a single mother when she got a bachelor’s degree in developmental psychology and when she discovered she couldn’t earn enough to pay off her loans, she went back to school and got a master’s degree. Her salary never caught up. Things only got worse.\nAround 2008, when she consolidated her loans, she was paying $1,000 a month, but years of missed payments and piled-on interest meant she was barely putting a dent in a bill that had ballooned to $250,000. When she sought help to resolve her debt, she says the loan company had just one suggestion.\n“They said, ‘Move to a cheaper state,’” says Farro, who rents a 400-square-foot casita from a friend. “I realized I was living in a different reality than they were.”\n\nI think most people agree with their original obligation to pay their student loans. The problem is the debt often becomes predatory and they've barely made a dent in the principal after decades. That's when people start seeing education debt as a major issue in need of reform.",
                "College used to be ticket for better secure life but no longer as the cost skyrocketed and many degrees failed to generate leaving the borrowers in the lurch.",
                "Can someone explain to me why we made it so student loan debt can’t be discharged in bankruptcy.",
                "A college education should be free. What's more important to invest in than our kids' education?",
                "Hey, Maga, this what you voted for? Owning the libs now?",
                "Why the fuck is this administration so full of assholes?",
                "I encourage anyone who has been deemed to have \"total and permanent disability\" to apply to have your student loans forgiven. I'm not longer able to work and had mine forgiven. ",
                "That’ll teach grandpa to get that degree in women’s studies.",
                "good. retirees love wringing their bread from the sweat of other folk's faces while voting for politicians who leave the rest with scraps."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 567,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "[removed]",
                "Amazing how fast they move when it's them being threatened.",
                "She’s the same one that had the sling after the handshake…",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "So, the trans person is responding after having her life threatened *repeatedly by the same group of people*. Got it.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "Don’t threaten people’s lives guys. Not cool. \nBut also fuck you Nancy Mace.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Gaza children are sent back to war zone following medical care after Jordan rejects requests to stay",
            "external_url": "https://apnews.com/article/jordan-gaza-sick-children-israel-hamas-war-f656a459121033118c98b4d3e13fbd2b",
            "upvotes": 478,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why did Jordan reject their requests to stay?",
                "It's completely understandable why Jordan wouldn't want more Palestinian refugees, again, but it's sad to see.",
                "You’re all missing the plot. \n\nIf Jordan accepts them as refugees, then Israel will keep hammering them to force more of them to leave. \n\nThere is an Arab resistance to relocating them, as it opens the door for Israel’s complete takeover of Gaza",
                "I wonder if the State Department will send a plane to pick them up.",
                "Which is ironic, considering the vast majority of historical \"Palestine\" sits within the borders of Jordan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Gabbard fires 2 top intelligence officials and will shift office that preps Trump’s daily brief",
            "external_url": "https://apnews.com/article/national-intelligence-council-gabbard-trump-cia-2bc7d2dab2ab067b276d6b8b31a5dea7",
            "upvotes": 197,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cool, so he's gonna get feel good affirmations instead of actual intelligence briefings. the enemies of the united states couldn't ask for a better deal.",
                "The fired officials failed to provide briefings at a fifth grade level.  This annoyed both Trump **and** Gabbard.",
                "Last time he was the POTUS they needed to not only keep the briefs VERY short, but they realized they needed to insert his fucking name into every paragraph or so - or he [couldn't/wouldn't pay attention](https://www.buzzfeednews.com/article/davidmack/donald-j-trump). And that was nearly a decade ago. \n\nOur president is a demented idiot child.",
                "Gabbard wants 0 actual intelligence and instead wants 100% propaganda, as Trump demands.",
                "Honestly it's not like he listen to the briefings anyways. He literally just does what Putin tells him to",
                "That one guy who called me racist and sexist when I called Gabbard a danger a few years back. Believe me yet?",
                "ONLY GOOD NEWS, GUYS! How much clearly do we have to say it!?",
                "I imagine this is being done to hide how rarely he actually attends these meetings.",
                "Will they make McDonald’s kids menu sheets and provide crayons for the briefings now?",
                "At this point it’s just to keep him smiling. Trump is going off the rails and everyone is: “no keep him happy because we still need him.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WHO declares polio outbreak in Papua New Guinea",
            "external_url": "https://www.bbc.com/news/articles/cvg9men89yvo",
            "upvotes": 215,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/aae3/live/0f13d210-3213-11f0-be45-61e3c2f49cfe.jpg",
            "top_comments": [
                ">Papua New Guinea was said to be polio-free since 2000, until an outbreak in 2018, which was contained within the same year.\n\n>Health Minister Elias Kapavore has vowed to achieve 100% polio immunisation in the country by the end of this year\n\nMust be nice to have a health minister overreacting in the best possible way. \n\n>Polio has staged a comeback elsewhere in Asia in recent years. Pakistan saw 74 cases of the disease last year, while Afghanistan recorded 24 cases.\n\nI really hope they get ahead of this.",
                "We better air drop JRK Jr there immediately. No time for a parachute. ",
                "Send Secretary Kennedy",
                "My grandma got polio back in the 50s but luckily she lived in Minnesota and went to the Sister Kenny Institute.  My dad lived with an relatives until she came back  She was able to move around with her \"sticks\" (wooden forearm crutches) until she was much older.  It makes me sick that this disease is popping up again and most likely come back to the US.  America is quickly becoming a shithole country.",
                "> We have to make maximum effort to get 100% [vaccination] coverage,\" Dr Huseynova said at a media conference on Thursday.\n\"Polio knows no borders.\"\n\nA mindset that is dying at an alarming rate here in the US. Sadly, those that are paying the price of it are typically young children.",
                "Just for you to know. When you have a bacteria or virus almost extinct, but you don't competely wipe them out, you end up with the most adaptable and survivor strains spreading their genetic information.\n\nThis is what makes super bacteria. The most resilient ones spread and evolve, so it will make our vaccines and antibiotics less efficient over time.\n\nAllowing these people to give a second opportunity to those almost extinct illnesses is much much more dangerous and evil than what it looks like. One day, a mutation of these surviving strains will jump into a vaccinated person succesfully and then, most of the vaccinated people will be in danger as well.\n\n\nThis is a matter of survival, not just 4 crazy people punching themselves.",
                "Wait how did that happen?? Isn’t there like one guy left in an iron lung with polio?",
                "Wait…quick check. Where’s RFK, Jr. on this one?\n\nOh he’s not a doctor? Huh.",
                "So let’s all be real for a second. This is highly concerning.  The US (thanks Dump) has pulled funding for the WHO and those responsible for vaccinating at risk populations.  When a deadly, highly contagious disease surges in a third world country (no joke, people believe this is not our problem) soon becomes a problem when it is transmitted to someone traveling to the US or anywhere for that matter.  It is only a matter of time when “their” problem becomes our problem!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 12445,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "Revoked over…a 3-year old traffic stop. Wow.",
                "[Kristi Noem has had 20 speeding tickets, three stop-sign violations, two seat-belt violations and a citation for driving with no driver’s license. She has also been issued six court notices for failure to appear and two arrest warrants.](https://thehill.com/blogs/blog-briefing-room/news/169901-s-d-gop-candidate-cited-for-numerous-traffic-violations/)",
                "How much money has this administration, Noem, wasted on this kind of horse shit..... Enough. tRumps band of idiots can't find the 11 million illegals he claimed were in the US illegally so they've been creating them. Revoking visas for bullshit traffic infractions is childish and a complete waste of tax dollars. tRumps administration has been a clusterfuck from day one!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump agrees deal for UAE to build largest AI campus outside US",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/trump-artificial-intelligence-uae?utm_source=chatgpt.com",
            "upvotes": 1654,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d366b3b21608957ff04add867d3343c8969fe6b/339_0_3331_2666/master/3331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10b67d750a6bab2874750f7a5e73a7e8",
            "top_comments": [
                "Bringing jobs back to . . . . Make Arabia Great Again?",
                "Bringing those jobs back to the US I see",
                "This entire trip so far has been such a disgrace to America and its people",
                "That's a bad location for data centers that need a lot of constant cooling.",
                "Has anyone tried explaining to “conservatives” that if we switch away from fossil fuels that it will hurt brown people who live halfway across the world and have a religion that differs from theirs? I know it’s not bombing civilians and starving babies to death but they still won’t like it. ",
                "Ah, Nice plane for him, no US jobs and a foreign nation having access to our AI research. So much winning!",
                "So, make UAE great again.",
                "You flash money at him he'll do anything for any foreign country. The US is for sale.",
                "Trump on tour to line his own pockets.",
                "It's going to be really sad when we spend all this time and money with the UAE to get a new AI model, and then China open sources a better one the next day. \n\nThe current view on AI by people like Trump and Musk is really a zero sum game for humanity, it's just that the 1% gains all the benefits at the cost to the 99%"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Rushdie attacker sentenced to 25 years in prison",
            "external_url": "https://www.bbc.com/news/articles/cp85kg527p9o",
            "upvotes": 1037,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8e53/live/985dea60-328b-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                ">\"Salman Rushdie wants to disrespect other people,\" said Matar, clad in white-striped jail clothing and wearing handcuffs. \"He wants to be a bully, he wants to bully other people. I don't agree with that.\"\n\nSir, you *stabbed* people. You don't get to call anyone a bully.",
                "Is that all? The man tried to kill someone because they made fun of the book he likes to read.\n\nSomething like that, I forget the details.\n\nSeems like a poor reason to try and murder someone.",
                "Man attempted the murder at a seminar hosted by the Chautauqua institution in New York. You have to be a special kind of stupid to try and stab someone to death at an event with a minimum of 5 doctors and 8 surgeons in the audience.",
                "“Two nights before the attack, Salman Rushdie dreamed he was stabbed onstage. Today, his attacker has been sentenced to 25 years in prison.\n\nRead more: NPR Article”\n\nMan who stabbed Salman Rushdie convicted of attempted murder \n\nhttps://www.npr.org/2025/02/21/nx-s1-5305184/hadi-matar-salman-rushdie-stabbing-verdict\n\n> Speaking to NPR's Fresh Air about the book, Rushdie said he had a dream that he was publicly stabbed just two nights prior to the incident, and he almost cancelled the event where he was then attacked.",
                "All aboard the peace train…\n\nHey, wait a minute!",
                "We really need to get rid of religion, this dude gonna waste a third of his life in prison because he stabbed someone over his imaginary friend... that is legit insane.",
                "I feel like Islam is the religion least likely to be able to take a joke 😂",
                "Proving once again how ridiculous religion is in a sane world.",
                "Rushdie wrote a book after this attack and it's amazing. His descriptions of the trauma from the attack are really personal. It's appropriately called Knife Meditations.",
                "How can you fuck up murdering someone after stabbing them 15 times?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Verizon ending DEI programs as it seeks US approval for Frontier deal",
            "external_url": "https://www.reuters.com/sustainability/society-equity/verizon-ending-dei-programs-it-seeks-us-approval-frontier-deal-2025-05-16/",
            "upvotes": 1740,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Verizon Communications said Friday it is ending diversity, equity and inclusion programs after the Trump administration opened a probe and as the U.S. telecom carrier seeks approval to purchase Frontier Communications”\n\nInteresting timing to say the least",
                "Our government just engages in extortion now.  Really making America great again.",
                "Time to switch carriers.",
                "It's this why everyone's bill had to go up $5 last month, even though we got nothing new/better in return?",
                "And another takes the knee and swears fealty to “The Party”. Sad, but it is the times we live in and the regime we live under.",
                "And now I want to cancel my Verizon plan and go with someone else.  They want to kneel to fascists and racists?  Then they don't need my money.",
                "If anyone is delusional enough to think corporations care more about morality rather than chasing the profit think again. It is another proof that those DEI policies were just for the show and PR.",
                "I’ve seen a lot of examples of companies bending to extortion but this one is awful. Just “fuck diversity, we were just pretending anyway”",
                "Can you hear me now, Daddy?",
                "Damnit and I just switched to Verizon after Tmobiles ad with a Nazi's company. FFS."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "On the run for 21 years, U.S. fugitive 'psychic' arrested in Toronto | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/toronto/florida-fugitive-arrested-toronto-1.7534663",
            "upvotes": 418,
            "date": "05/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7534738.1747238722!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/patrick-lutts-jr.jpg?im=Resize%3D620",
            "top_comments": [
                "Should’ve seen that coming",
                "He looks like that guy from The Mentalist who was hypnotized to bring a dead body into a police precinct. From season 1 I think?",
                "DUI death of two teens and didn't want to take responsibilty. They should give him at least 21 years in jail",
                "He ain't no Miss Cleo.",
                "So how do you avoid authorities for over 2 decades in foreign country?",
                "You could say he was a medium at large. If he is short then he was a small medium at large",
                "So left the country and went to the most populated city in our neighbors to the North and still avoided authorities for 2 decades? It's impressive how dumb that is on all fronts",
                "21 years is a good run. Maybe he saw himself on the run for 21 years but getting caught now.",
                "But how tall are they?\n\nWere they a small medium at large?",
                "He didn’t see this coming?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/16/2025 20:10:30 UTC"
}