{
    "posts": [
        {
            "category": "HOT",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 11145,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to kill people. \n\nGuaranteed.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Poison themselves to own the libs.",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Upton Sinclair is rolling in his grave.",
                "It's almost like they could have watched Brexit unfold, and then UK food exports plummet when they fail EU standards. But that would involve observing reality objectively, a lot to ask for.",
                "We can no longer import food thanks to Trump's tariffs, more and more people are being rounded up and disappeared, and now the FDA stops inspecting food to see what's in it or even what it is.\n\nWho's ready for some Soylent Green?",
                "Oh good I was hoping I would get worms in 2025",
                " You would think the “health expert” RFK would be all over this"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 6894,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "Anyone ok with this is complicit in the fascist takeover of the United States.  Republicans - your time to be on the right side of history is quickly running out."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Active shooter reported on Florida State University campus",
            "external_url": "https://www.cnn.com/2025/04/17/us/florida-state-university-active-shooter/index.html",
            "upvotes": 20640,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21552290-116331-746-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Suspect in custody\n1:05 p.m. – A Tallahassee police spokesperson confirmed that one person is in custody but could not confirm any deaths. There were, however, \"multiple injuries.\"\n\nA live update on another article.",
                "Shooter in custody according to CNN.",
                "6 patients, 1 in critical condition, the rest in serious condition \n\nhttps://www.tallahassee.com/story/news/local/2025/04/17/active-shooter-reported-at-fsu-shelter-in-place-alert-sent-out/83139928007/\n\nEdit: as of 2p  law enforcement has not confirmed any deaths\n\n\nEdit 2: as of 2:32, NBC reporting one dead, 6 injured\n\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756\n\nEdit 3: 4:35p according to press conference, 2 dead (not students), 5 injured, they have ID'd the shooter, 20 yo son of sheriff deputy, I did not catch the name, he had access to one of her weapons which was found at the scene",
                "Reminder that FSU had a similar event back in 2014 when a gunmen went into the library and started shooting kids.",
                "Yesterday was 18 years since the Virginia Tech shooting 😢",
                "CNN says the suspect used his mom's gun, and that the suspect's mom was a sheriff deputy.",
                "Sad to think some of these kids are graduates of Stoneman, and most likely experienced their second school shooting of their life. Unreal and awful.",
                "I live right off campus. My friend is in the midst of it right now. Horrifying situation. Seems like there are some injured, possibly dead. Really really sad and just hoping it’s over soon. We get alerts pretty consistently and there has yet to be an all clear. ",
                "Actually briefly forgot about mass shootings at schools. Sigh.",
                "His IG just got taken down, was already private, all I saw was the Bio. Bio was just a quote from Jeremiah: \"You are my war club, my weapon for battle— with you I shatter nations, with you I destroy kingdoms\""
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "2 Defense Department officials, including senior adviser to Pete Hegseth, put on leave amid leak investigation",
            "external_url": "https://www.cbsnews.com/news/dan-caldwell-pentagon-leak-investigation-on-leave/",
            "upvotes": 24636,
            "date": "04/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/37068e63-d5d8-44de-a1f5-d962712cccf3/thumbnail/1200x630/18120fcbb01fc5c0cb9650e2ab0af4fe/gettyimages-2203658198.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                ">A source familiar says Caldwell is accused of sharing classified documents with reporters.\n\nOh, is that a problem for Hegseth now?",
                "Such a mess. 0 Professionalism",
                "What about Hegseth? Shouldn't he be on leave too?",
                "WHISKEY LEAKS\nRemember: Trump only hires the best. ",
                "Damn, I got excited when I misread \"including Pete hegseth\"... then I remembered he's already at the top of that chain",
                "Every top official on that chat knew it was illegal to use for classified information. All of them, including the VP, needs to be impeached, removed from office, and prosecuted.",
                "This DEI-less experiment seems to be a disaster.  Can we go back to being really good at things again?",
                "Imagine being the one in the chat, leaking information, and then it's your assistant that gets suspended...Much accountability, much wow.",
                "It's three of them now. https://www.politico.com/news/2025/04/16/pentagon-official-suspended-leak-investigation-00293473",
                "Just over 3 months in and this administration is a shitshow. Totally expected but hey at least we are Making America Great Again lol  /s"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Hamas says it is ready to release all remaining hostages for an end to Gaza war",
            "external_url": "https://www.reuters.com/world/middle-east/hamas-is-ready-release-all-remaining-hostages-return-an-end-gaza-war-hamas-gaza-2025-04-17/",
            "upvotes": 2548,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How many are still alive?",
                "I'll believe it when I see it.",
                "Haven't they said this before, then continued to pile on additional conditions or delayed the release?",
                "I don't see Israel stopping for anything at this point; they've clearly decided that they're going to \"solve\" the Palestinian situation once and for all.",
                "Deceptive headline. Hamas wants every palestinian prisoner in Israel released in exchange for the hostages. They arent suing for peace it’s just world stage headline manipulation so the pro pallies can say “see? Israel doesnt wanna end the war muh genocide waaaaaaaaaah”",
                "Hamas also needs to disarm.\n\nPalastine needs to form some type of union with the goal of building a nation. If their only goal is to destroy Isreal, they will only get destruction in return.",
                ">Instead, Hayya said Hamas was ready to immediately engage in “comprehensive package negotiations” to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\n\nAh, another day, another delusional “offer” from Hamas. Good thing they can count on their Reddit supporters to only read the headlines.",
                "Oh yeah. After all of Gaza is in ruins… now they are willing. Perfect negotiating skills right there",
                "Hamas needs to cease to exist for anything to go forward.",
                "\"Instead, Hayya said Hamas was ready to immediately engage in \"comprehensive package negotiations\" to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\"\n\nlol the delusion"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 2083,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Well at least we're rounding up immigrants to stop this nonsense.",
                "Someone somewhere is blaming Biden",
                "He didn’t shoot up a Tesla so they’ll prolly let him off easy."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 1744,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Is it normal for this stuff to be federal in the US?",
                "This is going to be a shitshow.",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "Jury nullification. Keep repeating it.",
                "I hope his defense team subpoenas shady Mayor Adam's,  Given the slimey way he was arrested and statements made to the media.",
                "I have a feeling that even if the jury declared him innocent, Trump will still intervene and of course nobody will stop him",
                "So much for equal protection under the law.",
                "Are we allowed to comment on this? I never know..."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "MSU faculty join call for Big Ten 'mutual defense compact' against Trump administration",
            "external_url": "https://statenews.com/article/2025/04/msu-faculty-join-call-for-big-ten-mutual-defense-compact-against-trump-administration",
            "upvotes": 2771,
            "date": "04/17/2025",
            "thumbnail": "https://snworksceo.imgix.net/tsn/7ddde056-78e8-407a-8e1e-6c586c9b4ec9.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "Good. All colleges and universities should stand firm together (except may Liberty University). The legal defense will be the same for all of them.",
                "For those wondering why an athletics conference would care so much, keep in mind that the big ten's members are all highly invested in research, with all being AAU members (except Nebraska, who was a member but lost status).",
                "Just a reminder that while Harvard is getting all the headlines and people are grousing about their endowment, the NIH grant impoundments will affect virtually all universities including those without the resources to challenge the government in court.\n\nMoves like this are great.",
                "United we stand, divided we fall.  We are either all in against tyranny or we are slowly conquered one at a time.",
                "I go to OSU. We fully support this idea",
                "Fucking wild that universities need to form defensive alliances to defend themselves from the president of the united states.",
                "Note this is just the faculty senate and not the administration, ie the employees who wouldn’t interact with governmental officials and not senior leadership who would interact with state and federal officials.",
                "It's got to be the Big Ten because they certainly aren't getting the SEC.",
                "U. of M. graduate here, and I endorse this.",
                "This should've been done the minute trump announced a second term."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "UnitedHealth shares crash after surprise earnings miss, cuts to forecast",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-lowers-annual-profit-forecast-higher-costs-2025-04-17/",
            "upvotes": 3038,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Looks like its time to deny more claims and bump up rates to make the shareholders happy.",
                "How is it a surprise?  Everyone hates UHC.  Id guess a lot of companies dumped them when those stories came out about AI denying 90% of claims.",
                "I got new insurance recently. Ambetter Health through the marketplace. I avoided anything connected to UHC the best I could. Ambetter Health is owned by Centene Corporation. I recently had some surgery, 25k worth. They covered all but $900 of it. I was so relieved. My work supplies Aflac, and they sent me a check for $1100 for the time I missed work.\n\nFuck United, avoid them at all costs.",
                "You know who didn’t miss?",
                "I guess they didn't kill enough customers this quarter?   \n\nI am sure Optum Labs will tweak their AI algorithm because their CEO needs another few million dollars in bonuses this year.",
                "Unfortunately, this means layoffs for regular employees while the folks at the top will continue to make bank.",
                "Looks like their profits got shot all to hell",
                "You can invest in these instead. A little more morally correct, and still decent options.\n\n1. Merck & Co. (NYSE: MRK)\nRanked #1 on Newsweek’s America’s Most Responsible Companies 2025 for excellence across environmental, social and governance pillars. \n\n\n2. General Mills, Inc. (NYSE: GIS)\nPlaced #2, recognized for sustainable sourcing and strong community programs. \n\n\n3. Illumina, Inc. (NASDAQ: ILMN)\nAt #3 for its role in advancing accessible healthcare and robust governance. \n\n\n4. Cisco Systems, Inc. (NASDAQ: CSCO)\nIncluded in S&P Global’s Sustainability Yearbook—top 10% globally—thanks to its carbon‑reduction targets and inclusive corporate culture.",
                "They just denied my shit last week so fuck em.",
                "Excellent! Stop killing people, United Health."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "US judge finds Google holds illegal online ad tech monopolies",
            "external_url": "https://www.reuters.com/technology/us-judge-finds-google-holds-illegal-online-ad-tech-monopolies-2025-04-17/",
            "upvotes": 3875,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kinda hard to get upset at this stage considering we've just let every mega corporation buy each other the last two decades. There is only like one competitor and it's meta for online ads, yeah? I mean Bing exists but.. It's Bing.",
                "I sense a completely unrelated trip to Mar-a-Lago and then things will get 'sorted' out.",
                "Predictable follow up headline, they get a $700m fine which sounds crazy but is actually the amount of money they make in 1 day.",
                "Why innovate when you can just buy the competition?",
                "There are judges and law in the US?",
                "I predict this will go away after a trip to maraloago",
                "Time for Sundar Pichai to buy Clarence Thomas a new house.",
                "Every day is groundhogs day from 2016 on",
                "Yeah no shit. Now do Meta.",
                "Wow, this is one of those things that we won't really understand the full ramifications of till decades later. Like, it's good, but it's also hard to wrap my head around what this could mean going forward. It's that wild."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 234,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "Note this is also after the US FDA suspends over 40,000 workers and food safety checks according to Reuters. [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.",
                "Was Iowa a state? My mom (MAGA) recently had a near-death incident with e-coli. I did tell her it was likely since we were no longer reporting on these outbreaks...",
                "**Censorship by omission**",
                "This government actively wants us dead. \"Reducing the surplus population\" I guess, not that Trump would understand what that means.",
                "It literally never lists the 15 states in the entire article.",
                "This was under the Biden administration. Imagine how bad it’ll be now with this group of incompetents."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Impose a pipeline on Indigenous nations? Not so fast, say Indigenous rights lawyers | CBC News",
            "external_url": "https://www.cbc.ca/news/indigenous/leaders-french-debate-indigenous-pipelines-1.7513421?__vfz=medium%3Dsharebar",
            "upvotes": 61,
            "date": "04/18/2025",
            "thumbnail": "https://i.cbc.ca/1.7512471.1744846333!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/fedelxn-debates-20250416.jpg?im=Resize%3D620",
            "top_comments": [
                "*\"You cannot impose. As a leader of the federal government, you have constitutional obligations. It's well developed under Canadian law that you have to respect Indigenous rights.\"*\n\nThis is a critical part of Canadian law, but.... but the manufacturing of consent has happened...  how many times?  And many related to pipelines from the north to parts south and east."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 486,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mom should be held culpable.",
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "That articles shows a lot of photos of students hanging around outside during an active shooting. \n\nIf you’re ever anywhere where this is happening, get inside anywhere and lock the door until you get word about an all clear.",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "Well, he's either going to be sent to an El Salvadorian concentration camp, or be made into the next Homeland Security Secretary. Given that he's a white male Republican whose expressed anger towards Democrats, I'll assume the latter.",
                "Every time something like this happens in America, there's a common thread and it's not the guns.\n\nIt's LEO's shitting the bed and letting it happen.",
                "Seems we can save lots of lives by not arming law enforcement.",
                "The war on the educated is starting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "American citizen hijacks small plane in Belize, 3 injured",
            "external_url": "https://abcnews.go.com/International/american-citizen-hijacks-small-plane-belize-3-injured/story?id=120916154",
            "upvotes": 107,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26df2c2b-0032-4b7f-b673-0cafd853ce3c/belize-plane-04-ht-jt-250417_1744916656230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"hijacked a small plane at knifepoint \"\n\n\"The hijacker was fatally shot in the chest by a passenger who had a licensed firearm\"\n\nWell, that is what happen when you bring a knife to a gun fight. A rare case when the day is saved by the good guy with a gun.",
                "Filibusters (in the original sense) coming back into fashion?? \n\n> ... a mercenary who travelled illegally in an organized group **from the United States to a country in Central America** or the Spanish West Indies in the mid-19th century seeking economic and political benefits through **armed force.**\n\nhttps://en.wiktionary.org/wiki/filibuster#Noun",
                "Not sending their best.",
                "US airlines have become so unsafe under Trump’s FAA that terrorists have to go to other countries just to hijack a plane."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 1743,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Is it normal for this stuff to be federal in the US?",
                "This is going to be a shitshow.",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "Jury nullification. Keep repeating it.",
                "I hope his defense team subpoenas shady Mayor Adam's,  Given the slimey way he was arrested and statements made to the media.",
                "I have a feeling that even if the jury declared him innocent, Trump will still intervene and of course nobody will stop him",
                "So much for equal protection under the law.",
                "Are we allowed to comment on this? I never know..."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 2085,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Well at least we're rounding up immigrants to stop this nonsense.",
                "Someone somewhere is blaming Biden",
                "He didn’t shoot up a Tesla so they’ll prolly let him off easy."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Hamas says it is ready to release all remaining hostages for an end to Gaza war",
            "external_url": "https://www.reuters.com/world/middle-east/hamas-is-ready-release-all-remaining-hostages-return-an-end-gaza-war-hamas-gaza-2025-04-17/",
            "upvotes": 2555,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How many are still alive?",
                "I'll believe it when I see it.",
                "Haven't they said this before, then continued to pile on additional conditions or delayed the release?",
                "I don't see Israel stopping for anything at this point; they've clearly decided that they're going to \"solve\" the Palestinian situation once and for all.",
                "Deceptive headline. Hamas wants every palestinian prisoner in Israel released in exchange for the hostages. They arent suing for peace it’s just world stage headline manipulation so the pro pallies can say “see? Israel doesnt wanna end the war muh genocide waaaaaaaaaah”",
                "Hamas also needs to disarm.\n\nPalastine needs to form some type of union with the goal of building a nation. If their only goal is to destroy Isreal, they will only get destruction in return.",
                ">Instead, Hayya said Hamas was ready to immediately engage in “comprehensive package negotiations” to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\n\nAh, another day, another delusional “offer” from Hamas. Good thing they can count on their Reddit supporters to only read the headlines.",
                "Oh yeah. After all of Gaza is in ruins… now they are willing. Perfect negotiating skills right there",
                "Hamas needs to cease to exist for anything to go forward.",
                "\"Instead, Hayya said Hamas was ready to immediately engage in \"comprehensive package negotiations\" to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\"\n\nlol the delusion"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 6922,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "Anyone ok with this is complicit in the fascist takeover of the United States.  Republicans - your time to be on the right side of history is quickly running out."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 11132,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to kill people. \n\nGuaranteed.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Poison themselves to own the libs.",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Upton Sinclair is rolling in his grave.",
                "It's almost like they could have watched Brexit unfold, and then UK food exports plummet when they fail EU standards. But that would involve observing reality objectively, a lot to ask for.",
                "We can no longer import food thanks to Trump's tariffs, more and more people are being rounded up and disappeared, and now the FDA stops inspecting food to see what's in it or even what it is.\n\nWho's ready for some Soylent Green?",
                "Oh good I was hoping I would get worms in 2025",
                " You would think the “health expert” RFK would be all over this"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "MSU faculty join call for Big Ten 'mutual defense compact' against Trump administration",
            "external_url": "https://statenews.com/article/2025/04/msu-faculty-join-call-for-big-ten-mutual-defense-compact-against-trump-administration",
            "upvotes": 2770,
            "date": "04/17/2025",
            "thumbnail": "https://snworksceo.imgix.net/tsn/7ddde056-78e8-407a-8e1e-6c586c9b4ec9.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "Good. All colleges and universities should stand firm together (except may Liberty University). The legal defense will be the same for all of them.",
                "For those wondering why an athletics conference would care so much, keep in mind that the big ten's members are all highly invested in research, with all being AAU members (except Nebraska, who was a member but lost status).",
                "Just a reminder that while Harvard is getting all the headlines and people are grousing about their endowment, the NIH grant impoundments will affect virtually all universities including those without the resources to challenge the government in court.\n\nMoves like this are great.",
                "United we stand, divided we fall.  We are either all in against tyranny or we are slowly conquered one at a time.",
                "I go to OSU. We fully support this idea",
                "Fucking wild that universities need to form defensive alliances to defend themselves from the president of the united states.",
                "Note this is just the faculty senate and not the administration, ie the employees who wouldn’t interact with governmental officials and not senior leadership who would interact with state and federal officials.",
                "It's got to be the Big Ten because they certainly aren't getting the SEC.",
                "U. of M. graduate here, and I endorse this.",
                "This should've been done the minute trump announced a second term."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 238,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "Note this is also after the US FDA suspends over 40,000 workers and food safety checks according to Reuters. [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.",
                "Was Iowa a state? My mom (MAGA) recently had a near-death incident with e-coli. I did tell her it was likely since we were no longer reporting on these outbreaks...",
                "**Censorship by omission**",
                "This government actively wants us dead. \"Reducing the surplus population\" I guess, not that Trump would understand what that means.",
                "It literally never lists the 15 states in the entire article.",
                "This was under the Biden administration. Imagine how bad it’ll be now with this group of incompetents."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 6918,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "Anyone ok with this is complicit in the fascist takeover of the United States.  Republicans - your time to be on the right side of history is quickly running out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 484,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mom should be held culpable.",
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "That articles shows a lot of photos of students hanging around outside during an active shooting. \n\nIf you’re ever anywhere where this is happening, get inside anywhere and lock the door until you get word about an all clear.",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "Well, he's either going to be sent to an El Salvadorian concentration camp, or be made into the next Homeland Security Secretary. Given that he's a white male Republican whose expressed anger towards Democrats, I'll assume the latter.",
                "Every time something like this happens in America, there's a common thread and it's not the guns.\n\nIt's LEO's shitting the bed and letting it happen.",
                "Seems we can save lots of lives by not arming law enforcement.",
                "The war on the educated is starting."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 11140,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to kill people. \n\nGuaranteed.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Poison themselves to own the libs.",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Upton Sinclair is rolling in his grave.",
                "It's almost like they could have watched Brexit unfold, and then UK food exports plummet when they fail EU standards. But that would involve observing reality objectively, a lot to ask for.",
                "We can no longer import food thanks to Trump's tariffs, more and more people are being rounded up and disappeared, and now the FDA stops inspecting food to see what's in it or even what it is.\n\nWho's ready for some Soylent Green?",
                "Oh good I was hoping I would get worms in 2025",
                " You would think the “health expert” RFK would be all over this"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 1744,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Is it normal for this stuff to be federal in the US?",
                "This is going to be a shitshow.",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "Jury nullification. Keep repeating it.",
                "I hope his defense team subpoenas shady Mayor Adam's,  Given the slimey way he was arrested and statements made to the media.",
                "I have a feeling that even if the jury declared him innocent, Trump will still intervene and of course nobody will stop him",
                "So much for equal protection under the law.",
                "Are we allowed to comment on this? I never know..."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "MSU faculty join call for Big Ten 'mutual defense compact' against Trump administration",
            "external_url": "https://statenews.com/article/2025/04/msu-faculty-join-call-for-big-ten-mutual-defense-compact-against-trump-administration",
            "upvotes": 2770,
            "date": "04/17/2025",
            "thumbnail": "https://snworksceo.imgix.net/tsn/7ddde056-78e8-407a-8e1e-6c586c9b4ec9.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "Good. All colleges and universities should stand firm together (except may Liberty University). The legal defense will be the same for all of them.",
                "For those wondering why an athletics conference would care so much, keep in mind that the big ten's members are all highly invested in research, with all being AAU members (except Nebraska, who was a member but lost status).",
                "Just a reminder that while Harvard is getting all the headlines and people are grousing about their endowment, the NIH grant impoundments will affect virtually all universities including those without the resources to challenge the government in court.\n\nMoves like this are great.",
                "United we stand, divided we fall.  We are either all in against tyranny or we are slowly conquered one at a time.",
                "I go to OSU. We fully support this idea",
                "Fucking wild that universities need to form defensive alliances to defend themselves from the president of the united states.",
                "Note this is just the faculty senate and not the administration, ie the employees who wouldn’t interact with governmental officials and not senior leadership who would interact with state and federal officials.",
                "It's got to be the Big Ten because they certainly aren't getting the SEC.",
                "U. of M. graduate here, and I endorse this.",
                "This should've been done the minute trump announced a second term."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Hamas says it is ready to release all remaining hostages for an end to Gaza war",
            "external_url": "https://www.reuters.com/world/middle-east/hamas-is-ready-release-all-remaining-hostages-return-an-end-gaza-war-hamas-gaza-2025-04-17/",
            "upvotes": 2552,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How many are still alive?",
                "I'll believe it when I see it.",
                "Haven't they said this before, then continued to pile on additional conditions or delayed the release?",
                "I don't see Israel stopping for anything at this point; they've clearly decided that they're going to \"solve\" the Palestinian situation once and for all.",
                "Deceptive headline. Hamas wants every palestinian prisoner in Israel released in exchange for the hostages. They arent suing for peace it’s just world stage headline manipulation so the pro pallies can say “see? Israel doesnt wanna end the war muh genocide waaaaaaaaaah”",
                "Hamas also needs to disarm.\n\nPalastine needs to form some type of union with the goal of building a nation. If their only goal is to destroy Isreal, they will only get destruction in return.",
                ">Instead, Hayya said Hamas was ready to immediately engage in “comprehensive package negotiations” to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\n\nAh, another day, another delusional “offer” from Hamas. Good thing they can count on their Reddit supporters to only read the headlines.",
                "Oh yeah. After all of Gaza is in ruins… now they are willing. Perfect negotiating skills right there",
                "Hamas needs to cease to exist for anything to go forward.",
                "\"Instead, Hayya said Hamas was ready to immediately engage in \"comprehensive package negotiations\" to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\"\n\nlol the delusion"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 2085,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Well at least we're rounding up immigrants to stop this nonsense.",
                "Someone somewhere is blaming Biden",
                "He didn’t shoot up a Tesla so they’ll prolly let him off easy."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "US judge finds Google holds illegal online ad tech monopolies",
            "external_url": "https://www.reuters.com/technology/us-judge-finds-google-holds-illegal-online-ad-tech-monopolies-2025-04-17/",
            "upvotes": 3871,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kinda hard to get upset at this stage considering we've just let every mega corporation buy each other the last two decades. There is only like one competitor and it's meta for online ads, yeah? I mean Bing exists but.. It's Bing.",
                "I sense a completely unrelated trip to Mar-a-Lago and then things will get 'sorted' out.",
                "Predictable follow up headline, they get a $700m fine which sounds crazy but is actually the amount of money they make in 1 day.",
                "Why innovate when you can just buy the competition?",
                "There are judges and law in the US?",
                "I predict this will go away after a trip to maraloago",
                "Time for Sundar Pichai to buy Clarence Thomas a new house.",
                "Every day is groundhogs day from 2016 on",
                "Yeah no shit. Now do Meta.",
                "Wow, this is one of those things that we won't really understand the full ramifications of till decades later. Like, it's good, but it's also hard to wrap my head around what this could mean going forward. It's that wild."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "UnitedHealth shares crash after surprise earnings miss, cuts to forecast",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-lowers-annual-profit-forecast-higher-costs-2025-04-17/",
            "upvotes": 3040,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Looks like its time to deny more claims and bump up rates to make the shareholders happy.",
                "How is it a surprise?  Everyone hates UHC.  Id guess a lot of companies dumped them when those stories came out about AI denying 90% of claims.",
                "I got new insurance recently. Ambetter Health through the marketplace. I avoided anything connected to UHC the best I could. Ambetter Health is owned by Centene Corporation. I recently had some surgery, 25k worth. They covered all but $900 of it. I was so relieved. My work supplies Aflac, and they sent me a check for $1100 for the time I missed work.\n\nFuck United, avoid them at all costs.",
                "You know who didn’t miss?",
                "I guess they didn't kill enough customers this quarter?   \n\nI am sure Optum Labs will tweak their AI algorithm because their CEO needs another few million dollars in bonuses this year.",
                "Unfortunately, this means layoffs for regular employees while the folks at the top will continue to make bank.",
                "Looks like their profits got shot all to hell",
                "You can invest in these instead. A little more morally correct, and still decent options.\n\n1. Merck & Co. (NYSE: MRK)\nRanked #1 on Newsweek’s America’s Most Responsible Companies 2025 for excellence across environmental, social and governance pillars. \n\n\n2. General Mills, Inc. (NYSE: GIS)\nPlaced #2, recognized for sustainable sourcing and strong community programs. \n\n\n3. Illumina, Inc. (NASDAQ: ILMN)\nAt #3 for its role in advancing accessible healthcare and robust governance. \n\n\n4. Cisco Systems, Inc. (NASDAQ: CSCO)\nIncluded in S&P Global’s Sustainability Yearbook—top 10% globally—thanks to its carbon‑reduction targets and inclusive corporate culture.",
                "They just denied my shit last week so fuck em.",
                "Excellent! Stop killing people, United Health."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "04/18/2025 00:41:19 UTC"
}