{
    "posts": [
        {
            "category": "HOT",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 23155,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speak and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great.",
                "And we're only 2 months in.",
                "Just a shithole country."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 36882,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Trump, contrary to polls, is very bad for our economy.",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Already tired of all this … winning?",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "just to be clear, when Biden left office we had +2.3% GDP growth. Trump has been in office less than two months and we are now projected to have -2.8%. in TWO FUCKING MONTHS he destroyed 5% GDP. fuck you if you voted for this fascist dictator.",
                "Thought he was against transitioning"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Washington Post editor resigns after accusing CEO of killing column",
            "external_url": "https://www.nbcnews.com/news/us-news/washington-post-editor-ruth-marcus-resigns-accusing-ceo-killing-column-rcna195634",
            "upvotes": 21941,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241025-the-washington-post-newspaper-building-ew-1249p-551ccb.jpg",
            "top_comments": [
                "“Will’s decision to not run the column that I wrote respectfully dissenting from Jeff’s edict — something that I have not experienced in almost two decades of column-writing — underscores that the traditional freedom of columnists to select topics they wish to address and say what they think has been dangerously eroded,” Marcus wrote in her resignation, according to The New York Times.",
                "If I've said it once, I've said it a thousand times. \n\nThe true value of owning a newspaper is controlling the narrative and silencing opposition.\n\nIt doesn't matter to Jeff Bezos how many subscribers or ad clicks he has. He can *lose* money on the newspaper and it's still more valuable than not owning it. This way, he gets to drive a specific narrative specific to his own agenda while attaching a (formerly) prestigious publication to it. \n\nHe doesn't care about journalism. He cares about his money and power.\n\nThe days of legacy Journalism are over.",
                ">Bezos, the Amazon founder who purchased the venerable publication in 2013, told the staff last month that the opinion section would take a radical turn by \"writing every day in support and defense” of “personal liberties and free markets.\"\n\n\"From now on you'll print *my* opinion - daily\" - American oligarch and owner of the Washington Post",
                "People need to cancel, there is no way one can trust anything from the Washington post now",
                "I regret that I HAD only one Washington Post subscription to cancel for my country.",
                "Nothing to see here, just the conservative billionaires who control the media killing anything that doesn't support their narratives.",
                "WP credibility shot to pieces .",
                "If only there was a way to cancel my subscription multiple times. ",
                ">Democracy Dies In Darkness\n\nIt used to be a warning, but it's become just a description...",
                "The part where they discredit everything so nobody knows what to believe.\n\nThe ultimate objective aims for America's transformation into a diminished power: A nation too internally divided to project global influence, democratic institutions that exist in form but not function, *a population skeptical of all information sources*, alliances fractured beyond effective cooperation, economic systems vulnerable to external pressure, cultural divisions preventing unified national purpose. It succeeds not through conquest but conversion - turning America's strengths into vulnerabilities and its systems against itself. The most devastating aspect is its plausible deniability, with each action justifiable through other motives, the pattern only visible when viewed as a whole.\n\nThis portrays an operation of remarkable scope and patience, turning America's openness, individualism, and democratic processes into vectors for its decline. The genius of this operation is its self-sustaining nature - once set in motion, America's own dynamics continue the process without continued external direction."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Germany Concerned Over F-35 ‘Kill Switch’ Amid US Policy Shifts",
            "external_url": "https://eutoday.net/germany-concerned-over-f-35-kill-switch/",
            "upvotes": 2376,
            "date": "03/11/2025",
            "thumbnail": "https://i0.wp.com/eutoday.net/wp-content/uploads/2025/03/PGNHXKCKQFFBVHCK5TRYCWEHFI.jfif_-1.jpeg",
            "top_comments": [
                "I think quite a few allies are going to realize they need to stay away from US manufacturing completely.",
                "Everything is moving to a subscription model",
                "Not a good 4 years to be a Lockheed Martin sales rep.",
                "This whole F-35 \"kill switch\" debate is just another reminder that Europe's reliance on American defence tech comes with serious strings attached. If the US can effectively shut down fighter jets at will, that is not just a security risk but a direct challenge to sovereignty. And with Trump openly using military aid as a bargaining chip, it is not some far-fetched conspiracy theory.\n\nThe bigger issue is that Europe keeps putting itself in this position. We are perfectly capable of building world-class fighter jets, but we still end up going cap in hand to the US, only to be reminded later that they call the shots. If Germany is genuinely worried, maybe it is time to invest properly in homegrown defence projects instead of buying American hardware and hoping for the best.",
                "Trump has truly screwed the US economy like no president before!",
                "Ah yes, nothing like giving Putin control over NATO air forces thanks to krasnov.",
                "Similar problem with UK Trident nukes which can only be maintained by the US.",
                "The U.S. does not share the full source code with F-35 operators, even allies like the UK, Italy, or Japan. This prevents modifications without U.S. approval ! \n\nWhy buy something you can't operate independently? Unbelievable! When you already have airplanes MADE IN EUROPE.",
                "Trump/musk must be shorting defense us companies again this week.",
                "This is scary news. US - European cooperation could unravel in ways that have huge implications for security and economics."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Musk calls Senator Mark Kelly a Traitor Over Ukraine Trip; Kelly pushes back",
            "external_url": "https://kyivindependent.com/musk-calls-sen-mark-kelly-a-traitor-over-ukraine-trip-kelly-pushes-back/",
            "upvotes": 1517,
            "date": "03/11/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/09/GettyImages-1674560753.jpg",
            "top_comments": [
                "South Africa had conscription when Elon Musk lived there. He managed to get out of serving his country and moved to Canada.\n\n\nNow he's calling an American veteran, who served America in the Gulf War.... a traitor? All because Mark Kelly actually upholds American values by supporting our ally Ukraine?\n\n\n\n\nElon Musk is just a PoS.  ",
                "Why anyone gives a crap what Nazi ass musk thinks is beyond reason. \n\nMusk should crawl back into the gate of hell he crawled out of.",
                "Who the fuck voted for this asshole?",
                "> \"Traitor? Elon, if you don't understand that defending freedom is a basic tenet of what makes America great and keeps us safe, maybe you should leave it to those of us who do,\" he wrote on March 10.\n\nRespect to Kelly, and Musk is such a POS for calling Kelly a traitor. The man has dedicated his life to serving his country, unlike Musk who only serves himself.",
                "He's just jealous cuz Kelly is a real astronaut",
                "Every. Accusation. Is. Projection. [https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports](https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports)",
                "Fighter pilot war vet -> test pilot -> astronaut -> democratically elected senator. \n\nThis dude is actually captain America.\n\nAnd piss pants elon is such a loser he spends is days down a k hole because even with all the money in the world he can’t find anyone who actually likes him.",
                "How long until this administration turns on veterans that took part in operations that run counter to the new narrative? \n\nAre we going to penalize past responsibilities the way anyone that had EEO or DEI in their job descriptions? Is this government going to find fault in the records of service members who, as part of their duties, aided allies? It's not insane to imagine.",
                "Where is the right wing outrage over this cunt Musk attacking American Veterans?",
                "Navy veteran, fighter pilot…and elon? I know who’s the better man."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Judge temporarily blocks effort to deport Palestinian activist who helped lead Columbia student protests | CNN",
            "external_url": "https://www.cnn.com/2025/03/10/us/mahmoud-khalil-columbia-university-israel-hnk/index.html",
            "upvotes": 2699,
            "date": "03/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150126.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The DHS agents said the US Department of State revoked Khalil’s student visa, although he does not have a student visa, but rather a green card, and is a lawful permanent resident, WAWOG said. When Khalil’s wife, who is eight months pregnant, showed the agents his green card, “one agent was visibly confused and said on the phone, ‘He has a green card’,” according to the news release. \n\nWhat an absolute shitshow.",
                "This is an illegal detainment. This is pure authoritarianism.",
                "The attempt at the federal government silencing someone and removing them is explicitly against the 1st Amendment.  If you don't see that our government is explicitly unconstitutional by now, you aren't looking.",
                "This is the kind of thing that should alarm any American. Our government planning to punish and silence people who are using constitutionally protected rights. It's a really slippery slope that leads to nobody being allowed to criticize the government. It's something we consider abhorrent when other countries do it.",
                "Good. The notion that someone who is legally in the country can be detained and punished for legally protesting the government is bullshit. \n\nFrom the “party of free speech and against cancel culture!”\n\nAnd the excuse is bullshit too. “Might support hamas” my puckered ass.",
                "There's going to be a lot of exhausted judges for the next 4 years. Hopefully it's only 4 years.",
                "The state department can’t revoke a green card.  They also can’t revoke somebody’s authorized stay once they’ve entered the country.",
                "I remember saying to multiple people that this exact thing would happen, and was told that I was exaggerating and catastrophizing.\n\nAnd people wonder why I don't take Republicans seriously anymore.",
                "> Khalil, who helped lead Columbia University’s student protest movement demanding a ceasefire in Gaza, was arrested Saturday night by federal immigration authorities who said they were acting on a State Department order to revoke his green card, according to his attorney.\n\n>On March 9, 2025, in support of President Trump’s executive orders prohibiting anti-Semitism, and in coordination with the Department of State, U.S. Immigration and Customs Enforcement arrested Mahmoud Khalil, a former Columbia University graduate student. Khalil led activities aligned to Hamas, a designated terrorist organization,” the U.S. Department of Homeland Security said in a post on X Sunday night\n\nNote: they found a person they could target, designed a reason to revoke his card.\n\nBy saying that a ceasefire is aligned with Hamas the Trump admin is defacto saying the only solution is war. That and the $4b  in aid they rushed over to bibi and his friends.\n\nWar is their only answer, we all see through you anti Ukraine pro trump fuckwits. That red you wrap yourself in isn't the red of our American flag. It's not the red of our men and women who bled for this country.",
                "One of the basic, and most important rights, that we have in America is that Constitutional rights apply to all people within America. There is a reason why Bush sent terrorist to Gitmo and not an American prison on the mainland. The idea that we disagree with someone’s political view, despite their immigration stance, and want to deport them is both illegal and contrary to our laws. Hell, one of John Adam’s first famous acts was being the defense lawyer for the british soldiers in the Boston massacre. He did it not because he agreed with their actions but that our laws are universal or they are worthless. You don’t pick and choose when you want laws to apply. And before down votes happen. Imagine a democratic president doing the same thing to a conservative person. I’m sure that would go down just as smootgly."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Secretary of State Rubio says purge of USAID programs complete, with 83% of agency's programs gone",
            "external_url": "https://apnews.com/article/trump-musk-rubio-usaid-foreign-aid-bf442d62af67918a6fc5eee839074601",
            "upvotes": 17066,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "well surely with 83% being gone, we'll get some fraud arrests any day now...",
                "So where's all the extra money going?",
                "How is that fucking legal? The founds were approved by congress",
                "So we killed soft power infrastructure in Africa while China is building ports and making new trade deals there. \n\n\nWhat is the end goal here? Sounds more like make China great again. ",
                "This election is destroying my faith in American democracy. If the winning party can destroy so many government institutions in the first three months of their term, it is not a stable system.",
                "So, hey, maybe it doesn't matter, but, you know, it's not actually legal for the Secretary of State to get up one day and say 83% of what a government department does is not going to get done anymore because he (or Elon) doesn't feel like it should be done.",
                ">\"Welp, Jesus did say we'd always have poor people.\"\n\n>-Some conservative, misinterpreting yet another passage in the Bible.",
                "Wonder how it feels to brag about killing children, starving villages and helping terrorists? All while breaking American farmers. Good job marc.",
                "The same guy who praised USA Aid in his book.",
                "They do this creating a vacuum. Who is going to fill it. Guess the Russian and Chinese. American good will and influence years building are gone."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
            "external_url": "https://apnews.com/article/china-tariffs-trump-agriculture-farms-midwest-247a85e2cf5b1fd54de4afbf2a30de64",
            "upvotes": 6101,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "U.S. farmers keep on winning",
                "Get the farm bail out money ready to go. While everyone else suffers this stupid trade war they will get bailed out even though the majority of them voted for this mess.",
                "“i VoTeD fOr PeAcE & PrOsPeRiTY”",
                "Who could have seen this coming?\n\n[Us. We saw it coming.](https://www.bbc.com/news/business-51025464)",
                "Come on you lazy US farmers, Just sell your soy to Americans. Tell them RFK says it causes weight loss or something.",
                "Speed run recession any % run.",
                "This and If they have to pay more for Canadian potash US farmers are in for a really tough year.",
                "The Republican recession is going to be long and painful",
                "You would think a farmer would understand the phrase “you reap what you sow” but not in America",
                "Hopefully the hick fucks will learn, but I'm sure they'll blame Mexicans and trans folks before voting down ballot for Rs again"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "3-year-old boy covered in bruises dies after being dumped outside Brooklyn hospital: sources",
            "external_url": "https://www.nbcnewyork.com/brooklyn/brooklyn-baby-dead-outside-hospital/6179120/",
            "upvotes": 5230,
            "date": "03/10/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/03/bk_hospital.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Poor little angel. \n\nStuff like this makes me hope there is an after life so there are still kind, nurturing moments for him. I can’t imagine the fear he felt, and who knows for how long.\n\nI hope they find whoever did this.",
                "That’s horrible poor little guy",
                "Remember when a CEO got shot and the entire NYPD was immediately tasked with tracking down the killer? \n\nI wonder if this child will get the same effort.",
                "[removed]",
                "wtf is wrong with people\n\nThat’s horrific \n\nNo child deserves that",
                "Oh fuck that’s depressing. R.I.P. little one.",
                "JFC... it's like we are living in medieval times still.",
                "[removed]",
                "As someone that has a 3 year old - fuck those people! Disgusting assholes. People that torture and abuse children should be sentenced to death and die in agony and fear. The same fear that they caused those poor children, who were looking to them to be protected.",
                "\"Your table for two is reserved in Hell.\""
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Russia warns Australia of grave consequences if peacekeepers join coalition forces in Ukraine",
            "external_url": "https://www.abc.net.au/news/2025-03-10/australia-warned-of-grave-consequences/105034468",
            "upvotes": 1075,
            "date": "03/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/99e8e0324525e41b7717f16868465c40?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=119&width=862&height=485&imformat=generic",
            "top_comments": [
                "Grave consequences as soon as Putin figures out a way to ship 100 donkeys to Australia",
                "Always the threats never the action.",
                "Everything on land and in the ocean is trying to kill Australians, you think they’re afraid of Putin?",
                "Once Australia deploys the tactical assault emus Russia will eat their words.",
                "Like Australia give 2 fux what Russia says",
                "Russian can barely push a T-72 next door.  They aren't invading an Island thousands of miles away.",
                "There’s an entire subreddit of things that Russia has ominously warned about. R/ russiawarns",
                "Let the world not forget 37 Australian were among the 298 crew and passengers who perished during the tragedy of MH17. The perpetrators got absolutely f all consequences.",
                "DJ Dump has blocked shipment of older Australian tanks being sent to support Ukraine, Albo should be calling for them back immediately",
                "Russia can't even beat Ukraine. What are they going to do to a proper western military?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US rebrands immigration app to CBP Home with ‘self-deport’ function",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/10/us-self-deport-app-cbp-home-immigration",
            "upvotes": 6,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6f794a259755f8a3a9d533a1fc5e5f514f2e1414/0_171_6365_3822/master/6365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4326e55c252ad9c4a6524d97c7a29fd1",
            "top_comments": [
                "This is only Trump’s second month. At this rate in one year nobody wants to move to the U.S. or stay here anyway",
                "I can say with nearly 100% confidence that a self-deport function was another one of Elon's ketamine-fueled ideas",
                "We are living in an episode of black mirror."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Musk calls Senator Mark Kelly a Traitor Over Ukraine Trip; Kelly pushes back",
            "external_url": "https://kyivindependent.com/musk-calls-sen-mark-kelly-a-traitor-over-ukraine-trip-kelly-pushes-back/",
            "upvotes": 1535,
            "date": "03/11/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/09/GettyImages-1674560753.jpg",
            "top_comments": [
                "South Africa had conscription when Elon Musk lived there. He managed to get out of serving his country and moved to Canada.\n\n\nNow he's calling an American veteran, who served America in the Gulf War.... a traitor? All because Mark Kelly actually upholds American values by supporting our ally Ukraine?\n\n\n\n\nElon Musk is just a PoS.  ",
                "Why anyone gives a crap what Nazi ass musk thinks is beyond reason. \n\nMusk should crawl back into the gate of hell he crawled out of.",
                "Who the fuck voted for this asshole?",
                "> \"Traitor? Elon, if you don't understand that defending freedom is a basic tenet of what makes America great and keeps us safe, maybe you should leave it to those of us who do,\" he wrote on March 10.\n\nRespect to Kelly, and Musk is such a POS for calling Kelly a traitor. The man has dedicated his life to serving his country, unlike Musk who only serves himself.",
                "He's just jealous cuz Kelly is a real astronaut",
                "Every. Accusation. Is. Projection. [https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports](https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports)",
                "Fighter pilot war vet -> test pilot -> astronaut -> democratically elected senator. \n\nThis dude is actually captain America.\n\nAnd piss pants elon is such a loser he spends is days down a k hole because even with all the money in the world he can’t find anyone who actually likes him.",
                "How long until this administration turns on veterans that took part in operations that run counter to the new narrative? \n\nAre we going to penalize past responsibilities the way anyone that had EEO or DEI in their job descriptions? Is this government going to find fault in the records of service members who, as part of their duties, aided allies? It's not insane to imagine.",
                "Where is the right wing outrage over this cunt Musk attacking American Veterans?",
                "Navy veteran, fighter pilot…and elon? I know who’s the better man."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Top US health agency makes $25,000 buyout offer to most of its employees &#x2d; WTOP News",
            "external_url": "https://wtop.com/government/2025/03/top-us-health-agency-makes-25000-buyout-offer-to-most-of-its-employees/",
            "upvotes": 87,
            "date": "03/11/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2025/03/Trump_Speech_59561-scaled.jpg",
            "top_comments": [
                "Surely this will truly make america healthy again",
                "How the heck can they do this without funding it?  Government runs out of money this Friday..  Happy St Patty's Day!!",
                "You’re own you own, America. Best of luck! Oh and you’re not getting your money back. Any savings are already used up for tax cuts for guys like Trump and Musk.",
                "Sounds like bio chem war is going to happen in few years when Trump is done his term.",
                "“I have a list in my head,” Kennedy said of potential firings at the agency. \n\nAnd here I thought all he had was a worm in his head. ",
                "This is how he gets the vaccine research to say it causes autism. Just hire a bunch of nut jobs in their place.",
                "It’s the economic equivalent of a pizza party.",
                "I like how some people pretend that the cost of our wellbeing is “paid for by the government” as if those agencies aren’t funded by all taxpayers, for the benefit of the taxpayers.  The President, all the way down to your local small town mayor, are taxpayer employees, who are there to efficiently administer all of the taxpayer dollars for the benefit of the taxpayers.  We don’t owe any politician any allegiance or fealty.  They are not our overlords or kings.  Tax money isn’t their discretion, although some politicians are allowed a small stipend for discretionary funds.  When programs are paid for to benefit taxpayers, it isn’t some grand benevolence; that’s the actual purpose of the tax dollars.  The rich like to call it “welfare” because they want to make you think entitlement is a bad word.  Yes, people are entitled to enjoy the benefits for which their tax dollars are purposed.   Tax dollars were never meant to exist to further enrich already-wealthy citizens.  Period.",
                "When will this cleansing of govt agencies end.  It's so menacing... such scary business"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Russia warns Australia of grave consequences if peacekeepers join coalition forces in Ukraine",
            "external_url": "https://www.abc.net.au/news/2025-03-10/australia-warned-of-grave-consequences/105034468",
            "upvotes": 1074,
            "date": "03/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/99e8e0324525e41b7717f16868465c40?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=119&width=862&height=485&imformat=generic",
            "top_comments": [
                "Grave consequences as soon as Putin figures out a way to ship 100 donkeys to Australia",
                "Always the threats never the action.",
                "Everything on land and in the ocean is trying to kill Australians, you think they’re afraid of Putin?",
                "Once Australia deploys the tactical assault emus Russia will eat their words.",
                "Like Australia give 2 fux what Russia says",
                "Russian can barely push a T-72 next door.  They aren't invading an Island thousands of miles away.",
                "There’s an entire subreddit of things that Russia has ominously warned about. R/ russiawarns",
                "Let the world not forget 37 Australian were among the 298 crew and passengers who perished during the tragedy of MH17. The perpetrators got absolutely f all consequences.",
                "DJ Dump has blocked shipment of older Australian tanks being sent to support Ukraine, Albo should be calling for them back immediately",
                "Russia can't even beat Ukraine. What are they going to do to a proper western military?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Germany Concerned Over F-35 ‘Kill Switch’ Amid US Policy Shifts",
            "external_url": "https://eutoday.net/germany-concerned-over-f-35-kill-switch/",
            "upvotes": 2379,
            "date": "03/11/2025",
            "thumbnail": "https://i0.wp.com/eutoday.net/wp-content/uploads/2025/03/PGNHXKCKQFFBVHCK5TRYCWEHFI.jfif_-1.jpeg",
            "top_comments": [
                "I think quite a few allies are going to realize they need to stay away from US manufacturing completely.",
                "Everything is moving to a subscription model",
                "Not a good 4 years to be a Lockheed Martin sales rep.",
                "This whole F-35 \"kill switch\" debate is just another reminder that Europe's reliance on American defence tech comes with serious strings attached. If the US can effectively shut down fighter jets at will, that is not just a security risk but a direct challenge to sovereignty. And with Trump openly using military aid as a bargaining chip, it is not some far-fetched conspiracy theory.\n\nThe bigger issue is that Europe keeps putting itself in this position. We are perfectly capable of building world-class fighter jets, but we still end up going cap in hand to the US, only to be reminded later that they call the shots. If Germany is genuinely worried, maybe it is time to invest properly in homegrown defence projects instead of buying American hardware and hoping for the best.",
                "Trump has truly screwed the US economy like no president before!",
                "Ah yes, nothing like giving Putin control over NATO air forces thanks to krasnov.",
                "Similar problem with UK Trident nukes which can only be maintained by the US.",
                "The U.S. does not share the full source code with F-35 operators, even allies like the UK, Italy, or Japan. This prevents modifications without U.S. approval ! \n\nWhy buy something you can't operate independently? Unbelievable! When you already have airplanes MADE IN EUROPE.",
                "Trump/musk must be shorting defense us companies again this week.",
                "This is scary news. US - European cooperation could unravel in ways that have huge implications for security and economics."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Microplastics Are Messing with Photosynthesis in Plants",
            "external_url": "https://www.scientificamerican.com/article/microplastic-pollution-is-messing-with-photosynthesis-in-plants/",
            "upvotes": 469,
            "date": "03/10/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/46e06e82bdca0207/original/Plastic-sheeting-surrounds-crops.jpg?m=1741634378.369&w=1200",
            "top_comments": [
                "We have filled every corner of the planet with plastic, and now it is sabotaging the very process that keeps life going, photosynthesis. If plants and algae struggle to convert sunlight into energy, we are looking at lower crop yields, collapsing marine ecosystems, and yet another hit to our ability to capture carbon.\n\nThe fact that a mere 13 per cent reduction in plastic pollution could significantly slow this damage makes it even more infuriating. We have known for decades that plastic breaks down into microplastics, yet international talks keep stalling. If we do not act soon, \"plastic planet\" will stop being a metaphor and start being a reality.",
                "*They’re being detected everywhere researchers look, from Antarctic sea ice to* [*human brains*](https://www.scientificamerican.com/podcast/episode/how-are-microplastics-getting-into-our-brain/)*....   Scientists are  just beginning to understand how these pollutants affect one of the most essential and widespread kingdoms of life on Earth: plants.*\n\nPhotosynthesis is cut from 7-12% which means a similar loss of production.  (add in strokes, heart problems, Alzheimers in people)",
                "This is not something that plants crave.",
                "The plastics industry really set-off a global long-term dirty bomb didn't they. Price of progress I guess 🤷",
                "The majority of plastics in the ocean come from 10 rivers in Asia / Africa\n[https://www.scientificamerican.com/article/stemming-the-plastic-tide-10-rivers-contribute-most-of-the-plastic-in-the-oceans/](https://www.scientificamerican.com/article/stemming-the-plastic-tide-10-rivers-contribute-most-of-the-plastic-in-the-oceans/)",
                "Well, maybe the plants should think about finally eliminating plastic from their lives.",
                "God, we’re so boned.\n\nI can’t wait for whatever radical idea is proposed to “fix” this that actually makes things so much worse.",
                "Plastic, it's what plants crave",
                "What little things can I do to help? Genuine question.",
                "No, there is the possibility that they *could*. I read the story. Still cause for general concern but no need for fear mongering as some are doing elsewhere."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man accidentally shot self in foot while attempting to kill cockroach",
            "external_url": "https://wlos.com/news/offbeat/accidental-shooting-cockroach-self-foot-shot-accidentally-man-wheelchair-wheel-chair-bug-insect-kill-killed-tried-attempting-shoe-threw-throw-bullet-toe-conditions-table-attack-roach-cockroaches",
            "upvotes": 678,
            "date": "03/10/2025",
            "thumbnail": "https://wlos.com/resources/media2/16x9/5472/986/0x285/90/7d3d82a0-3b86-4eb2-bb7d-1056051a09c7-GettyImages1222070833.jpg",
            "top_comments": [
                "> He took off his shoe and threw it at the bug to kill it, but a revolver he had hidden in the shoe fell to the ground. Upon making contact with the floor, the gun discharged and the bullet hit the victim in the foot.\n\n\nlmao there are days and there are days",
                "Keeping a revolver in your shoe is pretty dumb.",
                "Well, he's already in a wheelchair, so it's not as bad as it could be!",
                "i can understand it 🪳, those MF'ers don't die. the roach is probably listening to Many Men by 50 Cent rn.",
                "That's bringing a gun to a boric acid tablet fight...",
                "I call BS. He did not have his shoes on at all. He tried shooting the cockroach and hit his foot instead. Made up the story regarding the gun in his shoe to cover his ass with the authorities.",
                "As a non gun owner or user, can someone ELI5 that one to me? Do revolvers not have a safety? Do people store firearms with live round and the safety turned off?",
                "Who throws a shoe? Honestly?!",
                "This is dumb. He is breeding bullet resistant cockroaches.",
                "And another Darwin award goes to man in Flori…Detroit?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 23171,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speak and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great.",
                "And we're only 2 months in.",
                "Just a shithole country."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Judge temporarily blocks effort to deport Palestinian activist who helped lead Columbia student protests | CNN",
            "external_url": "https://www.cnn.com/2025/03/10/us/mahmoud-khalil-columbia-university-israel-hnk/index.html",
            "upvotes": 2699,
            "date": "03/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150126.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The DHS agents said the US Department of State revoked Khalil’s student visa, although he does not have a student visa, but rather a green card, and is a lawful permanent resident, WAWOG said. When Khalil’s wife, who is eight months pregnant, showed the agents his green card, “one agent was visibly confused and said on the phone, ‘He has a green card’,” according to the news release. \n\nWhat an absolute shitshow.",
                "This is an illegal detainment. This is pure authoritarianism.",
                "The attempt at the federal government silencing someone and removing them is explicitly against the 1st Amendment.  If you don't see that our government is explicitly unconstitutional by now, you aren't looking.",
                "This is the kind of thing that should alarm any American. Our government planning to punish and silence people who are using constitutionally protected rights. It's a really slippery slope that leads to nobody being allowed to criticize the government. It's something we consider abhorrent when other countries do it.",
                "Good. The notion that someone who is legally in the country can be detained and punished for legally protesting the government is bullshit. \n\nFrom the “party of free speech and against cancel culture!”\n\nAnd the excuse is bullshit too. “Might support hamas” my puckered ass.",
                "There's going to be a lot of exhausted judges for the next 4 years. Hopefully it's only 4 years.",
                "The state department can’t revoke a green card.  They also can’t revoke somebody’s authorized stay once they’ve entered the country.",
                "I remember saying to multiple people that this exact thing would happen, and was told that I was exaggerating and catastrophizing.\n\nAnd people wonder why I don't take Republicans seriously anymore.",
                "> Khalil, who helped lead Columbia University’s student protest movement demanding a ceasefire in Gaza, was arrested Saturday night by federal immigration authorities who said they were acting on a State Department order to revoke his green card, according to his attorney.\n\n>On March 9, 2025, in support of President Trump’s executive orders prohibiting anti-Semitism, and in coordination with the Department of State, U.S. Immigration and Customs Enforcement arrested Mahmoud Khalil, a former Columbia University graduate student. Khalil led activities aligned to Hamas, a designated terrorist organization,” the U.S. Department of Homeland Security said in a post on X Sunday night\n\nNote: they found a person they could target, designed a reason to revoke his card.\n\nBy saying that a ceasefire is aligned with Hamas the Trump admin is defacto saying the only solution is war. That and the $4b  in aid they rushed over to bibi and his friends.\n\nWar is their only answer, we all see through you anti Ukraine pro trump fuckwits. That red you wrap yourself in isn't the red of our American flag. It's not the red of our men and women who bled for this country.",
                "One of the basic, and most important rights, that we have in America is that Constitutional rights apply to all people within America. There is a reason why Bush sent terrorist to Gitmo and not an American prison on the mainland. The idea that we disagree with someone’s political view, despite their immigration stance, and want to deport them is both illegal and contrary to our laws. Hell, one of John Adam’s first famous acts was being the defense lawyer for the british soldiers in the Boston massacre. He did it not because he agreed with their actions but that our laws are universal or they are worthless. You don’t pick and choose when you want laws to apply. And before down votes happen. Imagine a democratic president doing the same thing to a conservative person. I’m sure that would go down just as smootgly."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Suspected cause of Long Island wildfires was a resident making s'mores: Police",
            "external_url": "https://abcnews.go.com/US/long-island-new-york-wildfires-suspected-cause/story?id=119629135",
            "upvotes": 674,
            "date": "03/10/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a1199ed2-c98f-4c94-bf61-f8cd85fa6154/li-fire-gty-bh-250310_1741616267303_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Suffolk County Police Commissioner Kevin Catalina said the \"operating theory\" is that a fire was started at about 9:30 a.m. ET Saturday when a resident used cardboard to start a fire to make s'mores, *a confection that includes toasted marshmallows and chocolate sandwiched between graham crackers.*\n\nI got to appreciate how the article took the time to dispassionately describe what a s'more is.",
                "At least it wasn't something dumb, like a gender reveal party.",
                "Have to say that if you start a wildfire while making s’mores you have failed epically.",
                "Who is making and eating s'mores at 9:30 in the morning?",
                ">Catalina said the department has 25 arson investigators probing the blaze to determine the exact cause of the fire, but added, \"So far, our investigation is pointing strongly toward an accidental origin for Saturday's fires.\"\n\nThey need a new category. Maybe the intent wasn't to start a forest fire, but \"accidental\" is a strong word for someone intentionally starting a fire in their backyard in dry, windy conditions. \n\nIt's not like someone's phone battery blew up, or they were jumping their car and the contacts sparked or something. *Those* are accidental.",
                "He has dishonored his marshmallow.",
                "Cardboard? Not even a proper little fire?\n\nGet a butane torch you guys. Or put a marshmallow on a fork and hold it over the toaster slot. Stove burner. Not hard!",
                "They should have raked the smorest",
                "“My pizza never killed nobody”",
                "Pro Tip: you can make s’mores in the microwave."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Musk calls Senator Mark Kelly a Traitor Over Ukraine Trip; Kelly pushes back",
            "external_url": "https://kyivindependent.com/musk-calls-sen-mark-kelly-a-traitor-over-ukraine-trip-kelly-pushes-back/",
            "upvotes": 1527,
            "date": "03/11/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/09/GettyImages-1674560753.jpg",
            "top_comments": [
                "South Africa had conscription when Elon Musk lived there. He managed to get out of serving his country and moved to Canada.\n\n\nNow he's calling an American veteran, who served America in the Gulf War.... a traitor? All because Mark Kelly actually upholds American values by supporting our ally Ukraine?\n\n\n\n\nElon Musk is just a PoS.  ",
                "Why anyone gives a crap what Nazi ass musk thinks is beyond reason. \n\nMusk should crawl back into the gate of hell he crawled out of.",
                "Who the fuck voted for this asshole?",
                "> \"Traitor? Elon, if you don't understand that defending freedom is a basic tenet of what makes America great and keeps us safe, maybe you should leave it to those of us who do,\" he wrote on March 10.\n\nRespect to Kelly, and Musk is such a POS for calling Kelly a traitor. The man has dedicated his life to serving his country, unlike Musk who only serves himself.",
                "He's just jealous cuz Kelly is a real astronaut",
                "Every. Accusation. Is. Projection. [https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports](https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports)",
                "Fighter pilot war vet -> test pilot -> astronaut -> democratically elected senator. \n\nThis dude is actually captain America.\n\nAnd piss pants elon is such a loser he spends is days down a k hole because even with all the money in the world he can’t find anyone who actually likes him.",
                "How long until this administration turns on veterans that took part in operations that run counter to the new narrative? \n\nAre we going to penalize past responsibilities the way anyone that had EEO or DEI in their job descriptions? Is this government going to find fault in the records of service members who, as part of their duties, aided allies? It's not insane to imagine.",
                "Where is the right wing outrage over this cunt Musk attacking American Veterans?",
                "Navy veteran, fighter pilot…and elon? I know who’s the better man."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Judge temporarily blocks effort to deport Palestinian activist who helped lead Columbia student protests | CNN",
            "external_url": "https://www.cnn.com/2025/03/10/us/mahmoud-khalil-columbia-university-israel-hnk/index.html",
            "upvotes": 2700,
            "date": "03/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150126.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The DHS agents said the US Department of State revoked Khalil’s student visa, although he does not have a student visa, but rather a green card, and is a lawful permanent resident, WAWOG said. When Khalil’s wife, who is eight months pregnant, showed the agents his green card, “one agent was visibly confused and said on the phone, ‘He has a green card’,” according to the news release. \n\nWhat an absolute shitshow.",
                "This is an illegal detainment. This is pure authoritarianism.",
                "The attempt at the federal government silencing someone and removing them is explicitly against the 1st Amendment.  If you don't see that our government is explicitly unconstitutional by now, you aren't looking.",
                "This is the kind of thing that should alarm any American. Our government planning to punish and silence people who are using constitutionally protected rights. It's a really slippery slope that leads to nobody being allowed to criticize the government. It's something we consider abhorrent when other countries do it.",
                "Good. The notion that someone who is legally in the country can be detained and punished for legally protesting the government is bullshit. \n\nFrom the “party of free speech and against cancel culture!”\n\nAnd the excuse is bullshit too. “Might support hamas” my puckered ass.",
                "There's going to be a lot of exhausted judges for the next 4 years. Hopefully it's only 4 years.",
                "The state department can’t revoke a green card.  They also can’t revoke somebody’s authorized stay once they’ve entered the country.",
                "I remember saying to multiple people that this exact thing would happen, and was told that I was exaggerating and catastrophizing.\n\nAnd people wonder why I don't take Republicans seriously anymore.",
                "> Khalil, who helped lead Columbia University’s student protest movement demanding a ceasefire in Gaza, was arrested Saturday night by federal immigration authorities who said they were acting on a State Department order to revoke his green card, according to his attorney.\n\n>On March 9, 2025, in support of President Trump’s executive orders prohibiting anti-Semitism, and in coordination with the Department of State, U.S. Immigration and Customs Enforcement arrested Mahmoud Khalil, a former Columbia University graduate student. Khalil led activities aligned to Hamas, a designated terrorist organization,” the U.S. Department of Homeland Security said in a post on X Sunday night\n\nNote: they found a person they could target, designed a reason to revoke his card.\n\nBy saying that a ceasefire is aligned with Hamas the Trump admin is defacto saying the only solution is war. That and the $4b  in aid they rushed over to bibi and his friends.\n\nWar is their only answer, we all see through you anti Ukraine pro trump fuckwits. That red you wrap yourself in isn't the red of our American flag. It's not the red of our men and women who bled for this country.",
                "One of the basic, and most important rights, that we have in America is that Constitutional rights apply to all people within America. There is a reason why Bush sent terrorist to Gitmo and not an American prison on the mainland. The idea that we disagree with someone’s political view, despite their immigration stance, and want to deport them is both illegal and contrary to our laws. Hell, one of John Adam’s first famous acts was being the defense lawyer for the british soldiers in the Boston massacre. He did it not because he agreed with their actions but that our laws are universal or they are worthless. You don’t pick and choose when you want laws to apply. And before down votes happen. Imagine a democratic president doing the same thing to a conservative person. I’m sure that would go down just as smootgly."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Russia warns Australia of grave consequences if peacekeepers join coalition forces in Ukraine",
            "external_url": "https://www.abc.net.au/news/2025-03-10/australia-warned-of-grave-consequences/105034468",
            "upvotes": 1074,
            "date": "03/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/99e8e0324525e41b7717f16868465c40?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=119&width=862&height=485&imformat=generic",
            "top_comments": [
                "Grave consequences as soon as Putin figures out a way to ship 100 donkeys to Australia",
                "Always the threats never the action.",
                "Everything on land and in the ocean is trying to kill Australians, you think they’re afraid of Putin?",
                "Once Australia deploys the tactical assault emus Russia will eat their words.",
                "Like Australia give 2 fux what Russia says",
                "Russian can barely push a T-72 next door.  They aren't invading an Island thousands of miles away.",
                "There’s an entire subreddit of things that Russia has ominously warned about. R/ russiawarns",
                "Let the world not forget 37 Australian were among the 298 crew and passengers who perished during the tragedy of MH17. The perpetrators got absolutely f all consequences.",
                "DJ Dump has blocked shipment of older Australian tanks being sent to support Ukraine, Albo should be calling for them back immediately",
                "Russia can't even beat Ukraine. What are they going to do to a proper western military?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 23131,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speak and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great.",
                "And we're only 2 months in.",
                "Just a shithole country."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Germany Concerned Over F-35 ‘Kill Switch’ Amid US Policy Shifts",
            "external_url": "https://eutoday.net/germany-concerned-over-f-35-kill-switch/",
            "upvotes": 2381,
            "date": "03/11/2025",
            "thumbnail": "https://i0.wp.com/eutoday.net/wp-content/uploads/2025/03/PGNHXKCKQFFBVHCK5TRYCWEHFI.jfif_-1.jpeg",
            "top_comments": [
                "I think quite a few allies are going to realize they need to stay away from US manufacturing completely.",
                "Everything is moving to a subscription model",
                "Not a good 4 years to be a Lockheed Martin sales rep.",
                "This whole F-35 \"kill switch\" debate is just another reminder that Europe's reliance on American defence tech comes with serious strings attached. If the US can effectively shut down fighter jets at will, that is not just a security risk but a direct challenge to sovereignty. And with Trump openly using military aid as a bargaining chip, it is not some far-fetched conspiracy theory.\n\nThe bigger issue is that Europe keeps putting itself in this position. We are perfectly capable of building world-class fighter jets, but we still end up going cap in hand to the US, only to be reminded later that they call the shots. If Germany is genuinely worried, maybe it is time to invest properly in homegrown defence projects instead of buying American hardware and hoping for the best.",
                "Trump has truly screwed the US economy like no president before!",
                "Ah yes, nothing like giving Putin control over NATO air forces thanks to krasnov.",
                "Similar problem with UK Trident nukes which can only be maintained by the US.",
                "The U.S. does not share the full source code with F-35 operators, even allies like the UK, Italy, or Japan. This prevents modifications without U.S. approval ! \n\nWhy buy something you can't operate independently? Unbelievable! When you already have airplanes MADE IN EUROPE.",
                "Trump/musk must be shorting defense us companies again this week.",
                "This is scary news. US - European cooperation could unravel in ways that have huge implications for security and economics."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Microplastics Are Messing with Photosynthesis in Plants",
            "external_url": "https://www.scientificamerican.com/article/microplastic-pollution-is-messing-with-photosynthesis-in-plants/",
            "upvotes": 476,
            "date": "03/10/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/46e06e82bdca0207/original/Plastic-sheeting-surrounds-crops.jpg?m=1741634378.369&w=1200",
            "top_comments": [
                "We have filled every corner of the planet with plastic, and now it is sabotaging the very process that keeps life going, photosynthesis. If plants and algae struggle to convert sunlight into energy, we are looking at lower crop yields, collapsing marine ecosystems, and yet another hit to our ability to capture carbon.\n\nThe fact that a mere 13 per cent reduction in plastic pollution could significantly slow this damage makes it even more infuriating. We have known for decades that plastic breaks down into microplastics, yet international talks keep stalling. If we do not act soon, \"plastic planet\" will stop being a metaphor and start being a reality.",
                "*They’re being detected everywhere researchers look, from Antarctic sea ice to* [*human brains*](https://www.scientificamerican.com/podcast/episode/how-are-microplastics-getting-into-our-brain/)*....   Scientists are  just beginning to understand how these pollutants affect one of the most essential and widespread kingdoms of life on Earth: plants.*\n\nPhotosynthesis is cut from 7-12% which means a similar loss of production.  (add in strokes, heart problems, Alzheimers in people)",
                "This is not something that plants crave.",
                "The plastics industry really set-off a global long-term dirty bomb didn't they. Price of progress I guess 🤷",
                "The majority of plastics in the ocean come from 10 rivers in Asia / Africa\n[https://www.scientificamerican.com/article/stemming-the-plastic-tide-10-rivers-contribute-most-of-the-plastic-in-the-oceans/](https://www.scientificamerican.com/article/stemming-the-plastic-tide-10-rivers-contribute-most-of-the-plastic-in-the-oceans/)",
                "Well, maybe the plants should think about finally eliminating plastic from their lives.",
                "God, we’re so boned.\n\nI can’t wait for whatever radical idea is proposed to “fix” this that actually makes things so much worse.",
                "Plastic, it's what plants crave",
                "What little things can I do to help? Genuine question.",
                "No, there is the possibility that they *could*. I read the story. Still cause for general concern but no need for fear mongering as some are doing elsewhere."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
            "external_url": "https://apnews.com/article/china-tariffs-trump-agriculture-farms-midwest-247a85e2cf5b1fd54de4afbf2a30de64",
            "upvotes": 6094,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "U.S. farmers keep on winning",
                "Get the farm bail out money ready to go. While everyone else suffers this stupid trade war they will get bailed out even though the majority of them voted for this mess.",
                "“i VoTeD fOr PeAcE & PrOsPeRiTY”",
                "Who could have seen this coming?\n\n[Us. We saw it coming.](https://www.bbc.com/news/business-51025464)",
                "Come on you lazy US farmers, Just sell your soy to Americans. Tell them RFK says it causes weight loss or something.",
                "Speed run recession any % run.",
                "This and If they have to pay more for Canadian potash US farmers are in for a really tough year.",
                "The Republican recession is going to be long and painful",
                "You would think a farmer would understand the phrase “you reap what you sow” but not in America",
                "Hopefully the hick fucks will learn, but I'm sure they'll blame Mexicans and trans folks before voting down ballot for Rs again"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Suspected cause of Long Island wildfires was a resident making s'mores: Police",
            "external_url": "https://abcnews.go.com/US/long-island-new-york-wildfires-suspected-cause/story?id=119629135",
            "upvotes": 678,
            "date": "03/10/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a1199ed2-c98f-4c94-bf61-f8cd85fa6154/li-fire-gty-bh-250310_1741616267303_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Suffolk County Police Commissioner Kevin Catalina said the \"operating theory\" is that a fire was started at about 9:30 a.m. ET Saturday when a resident used cardboard to start a fire to make s'mores, *a confection that includes toasted marshmallows and chocolate sandwiched between graham crackers.*\n\nI got to appreciate how the article took the time to dispassionately describe what a s'more is.",
                "At least it wasn't something dumb, like a gender reveal party.",
                "Have to say that if you start a wildfire while making s’mores you have failed epically.",
                "Who is making and eating s'mores at 9:30 in the morning?",
                ">Catalina said the department has 25 arson investigators probing the blaze to determine the exact cause of the fire, but added, \"So far, our investigation is pointing strongly toward an accidental origin for Saturday's fires.\"\n\nThey need a new category. Maybe the intent wasn't to start a forest fire, but \"accidental\" is a strong word for someone intentionally starting a fire in their backyard in dry, windy conditions. \n\nIt's not like someone's phone battery blew up, or they were jumping their car and the contacts sparked or something. *Those* are accidental.",
                "He has dishonored his marshmallow.",
                "Cardboard? Not even a proper little fire?\n\nGet a butane torch you guys. Or put a marshmallow on a fork and hold it over the toaster slot. Stove burner. Not hard!",
                "They should have raked the smorest",
                "“My pizza never killed nobody”",
                "Pro Tip: you can make s’mores in the microwave."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Man accidentally shot self in foot while attempting to kill cockroach",
            "external_url": "https://wlos.com/news/offbeat/accidental-shooting-cockroach-self-foot-shot-accidentally-man-wheelchair-wheel-chair-bug-insect-kill-killed-tried-attempting-shoe-threw-throw-bullet-toe-conditions-table-attack-roach-cockroaches",
            "upvotes": 679,
            "date": "03/10/2025",
            "thumbnail": "https://wlos.com/resources/media2/16x9/5472/986/0x285/90/7d3d82a0-3b86-4eb2-bb7d-1056051a09c7-GettyImages1222070833.jpg",
            "top_comments": [
                "> He took off his shoe and threw it at the bug to kill it, but a revolver he had hidden in the shoe fell to the ground. Upon making contact with the floor, the gun discharged and the bullet hit the victim in the foot.\n\n\nlmao there are days and there are days",
                "Keeping a revolver in your shoe is pretty dumb.",
                "Well, he's already in a wheelchair, so it's not as bad as it could be!",
                "i can understand it 🪳, those MF'ers don't die. the roach is probably listening to Many Men by 50 Cent rn.",
                "That's bringing a gun to a boric acid tablet fight...",
                "I call BS. He did not have his shoes on at all. He tried shooting the cockroach and hit his foot instead. Made up the story regarding the gun in his shoe to cover his ass with the authorities.",
                "As a non gun owner or user, can someone ELI5 that one to me? Do revolvers not have a safety? Do people store firearms with live round and the safety turned off?",
                "Who throws a shoe? Honestly?!",
                "This is dumb. He is breeding bullet resistant cockroaches.",
                "And another Darwin award goes to man in Flori…Detroit?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Panama releases dozens of detained deportees from U.S. into limbo following human rights criticism",
            "external_url": "https://www.nbcnews.com/world/latin-america/panama-releases-dozens-detained-deportees-us-limbo-human-rights-critic-rcna195526",
            "upvotes": 933,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250309-panama-migrants-vl-1034a-daf9a6.jpg",
            "top_comments": [
                "Time to leave X. Musk is out of control",
                "What I do not understand is why did Panama strip them of their phones when they entered the camps.  They want them out of the country but they simultaneously removed the ability to make the arrangements.",
                "All I can say is that ketamine *will* exacerbate *psychotic* symptoms in predisposed patients.",
                "Trump and his minions going to The Hague, keeps me going.",
                "I guess the ovens weren't ready yet.",
                "This is an American problem not only a Musk and Elon. Americans need to grow up and take some responsibility for what their country is doing."
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/11/2025 02:57:59 UTC"
}