{
    "posts": [
        {
            "category": "HOT",
            "title": "Satanist leader’s attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests",
            "external_url": "https://www.cnn.com/2025/03/29/us/kansas-satanist-protest-arrests-hnk/index.html",
            "upvotes": 24120,
            "date": "03/30/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25087823019751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“When we saw that nobody was doing anything — I guess just in the moment of it — it was like, ‘He’s not supposed to be allowed to do this,’ so we tried to stop him,” she said.\n\nThe party of free speech, everybody...",
                "Where’s the don’t tread on me crowd?",
                "The Government of the United States gives to bigotry no sanction, to persecution no assistance. Require only that they who live under its protection should demean themselves as good citizens, in giving it on all occasions their effectual support.\n\n-George Washington\n\n\n\t“We the General Assembly of Virginia… do enact that no man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burdened in his body or goods, nor shall otherwise suffer on account of his religious opinions or belief.”\n\n-Thomas Jefferson\n\n\n\n\t“The civil rights of none shall be abridged on account of religious belief or worship.”\n\n-James Madison",
                "They should have all worn Tesla logos. Then anyone attacking them would have been classified as domestic terrorists. : )",
                "They say “chaos” but it was positively uneventful compared to what they apparently expected to happen. It was amazing how much of an overreaction there was to this. (Of course hindsight is 20/20). They had police cars surrounding the capitol. An acquaintance who works in the capitol told me they  had SWAT on every floor and hid all the tables and chairs so they couldn’t be used as weapons. They gave all the state workers administrative leave that day too, so they wouldn’t be caught up in anything downtown.\n\nAnd yet despite all the worry about mass violence, there were a ton of children amongst the counter protesters, all dressed in their Sunday best.",
                "I love that Satanist’s don’t even believe in Satan. It’s the Christians that do.",
                "*trying to remember if there are any photos or evidence of satanists burning an inverted pentagram in front of a black family's house.",
                "Christians always really struggle to understand that Satanists are a political activist group pointing out the hypocrisy of our government bias towards Christianity, not literal worshipers of Satan. \n\nIt would take less than 5 minutes of googling to understand this. The only ones at that protest who actually believe in Satan are the Christians.",
                "The rational next step is to do a bigger one.",
                "The original permit allowed them into the rotunda and in a horrifying display of religious persecution, legislators stepped in to edit the permit at the last second. The Satanists went ahead with their ceremony and were assaulted.   \nI don't understand why the leader was arrested. This is ridiculous."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 4889,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "I think back often to an interview I heard with an anesthesiologist, a very philosophical man who took great pride in his work.  He said that his job was essentially to kill his patients and then bring them back to life.  Anesthesia involves processes that would otherwise cause the body to die, but with him there, was his role to manual manage the functions of the body that would otherwise cease.\n\nIt's serious shit.",
                "Just tragic\n\nHer poor family too",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "When my sons needed more invasive dental work and needed to fully go under, they had to first pass a physical exam by their pediatricians, and the procedure was done in an actual HOSPITAL, with a pediatric anesthesia specialist overseeing the surgery and plenty of help immediately hand in case anything went wrong."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Minnesota officials seek answers in case of graduate student detained by ICE",
            "external_url": "https://apnews.com/article/university-of-minnesota-graduate-student-detained-38e5ac3681b3d5e2c9d82ae40f9ae7f9",
            "upvotes": 2087,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kidnapped. She was kidnapped.",
                "but u/shoggies, you said she was a member of Hamas and that the government confirmed this! How come that doesn't seem to be the case?",
                "This is like the Red Scare, where if you protest against Israel military action in Gaza, or are at some protest where someone says \"from the river to the sea\" that gets turned into \"you support Hamas\"\n\nNo one knows why this person is detained, but that's the basic theme lately",
                "\"seeking answers\" seems like way too mild a response.",
                "I feel like these peaceful protests are going to get a lot less peaceful",
                "Tomorrow's headline: \"Minnesota Officials Detained By ICE\".",
                "Party of free speech moment.\n\nI’m guessing the student wrote an article about Palestinians being bombed and said it’s bad. That’s basically being a member of hamas though according to what the pretty lady on fox said.",
                "If you have a green card you can legally purchase a firearm. Could come in handy when unidentified masked people try and kidnap you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Magnitude-7.1 earthquake hits Tonga, tsunami threat issued",
            "external_url": "https://www.abc.net.au/news/2025-03-31/magnitude-7-earthquake-hits-tonga-tsunami-threat-issued/105114840",
            "upvotes": 5597,
            "date": "03/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/b9a5cf82d345f4121ba437e1a6894ca9?impolicy=wcms_watermark_news&cropH=480&cropW=853&xPos=0&yPos=62&width=862&height=485&imformat=generic",
            "top_comments": [
                "ring of fire really doing its thing this week\n\n(i say with resignation while sitting on a major fault line)",
                "Tsunami warning has been cancelled according to the same source.",
                "are two different 7+ quakes that close together in terms of timeframe unusual?",
                "Tonga, the place where a large volcano recently detonated? That Tonga?",
                "Oh boy…the population is only 100,000. I hope they stay safe. ",
                "“The US Tsunami Warning Centre says…”  Good job making DOGE aware of your existence. Layoffs coming Monday.",
                "The California corner of the Pacific plate seems *WAY* overdue for a big one unfortunately. The other three corners have suffered from massive earthquakes over the last decade or so.",
                "[https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive)",
                "*Inserts this is fine gif*",
                "Dang this weekend has been crazy"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "United Airlines Flight Hit by Kite Near Washington DC",
            "external_url": "https://aviationa2z.com/index.php/2025/03/30/united-airlines-flight-hit-by-kite-near-washington-dc/",
            "upvotes": 814,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm going to go out on a limb here and say that I don't think this was a smart thing for the kite flyer to do.",
                "What ISN’T hitting airplanes right now? Besides submarines.",
                "There was a kite festival for the cherry blossoms and some idiot must have not felt like fighting the traffic to get over to the Washington Monument… it’s impossible to not know that Gravelly Point is a terrible place to fly a kite.",
                "[United CEO this week.](https://youtu.be/lm8fYf53SMg)",
                "I would have thought the plane hit the kite as opposed to the kite hitting the plane. Also can’t imagine there was much left of the kite to be returned to the kite flyer and family.",
                "Why’s it always DC? I have to fly there soon. I’d rather fly into a nearby state and just drive over",
                "So guess the lesson of the year thus far is don’t fly into DC, right?",
                "I'm pretty sure there was a kite festival in DC this weekend",
                "That’s got to be a really long piece of string.",
                "Charlie Brown, you blockhead!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. Army says recovering 4 soldiers missing in Lithuania \"will be a long and difficult\" operation",
            "external_url": "https://www.cbsnews.com/news/us-soldiers-missing-lithuania-army-m88-hercules-long-difficult-operation/",
            "upvotes": 3436,
            "date": "03/30/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/f7a8a787-ed5d-45be-b008-00d6abbc4d39/thumbnail/1200x630/26472697efa33e738651b8b54845ef3c/lithuania-us-soldiers-2206633876.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "No soldiers left behind. Unless the Secretary of Defense is busy getting horrible tattoos that ruin the flag.",
                "I’m sure the US VP, or defense has already visited the site and offered support. I’m so proud of the US /s",
                "They cut off the, “and we don’t think it’s worth it.” /s",
                "As difficult as finding those who went missing in El Salvador, isn't it?",
                "Maybe Vance would have been better off to go to Lithuania to show support for the USA military instead of harassing an ally about military take over!",
                "wait are they still alive?",
                "Well zero news coverage sooo no big deal to the government apparently👎🏼",
                "I hope the drunk weekend Fox News host adds Rachel Maddow to the mission Snapchat.",
                "Condolences on the loss of these soldiers, they layed down their life on a NATO mission",
                "\"suckers\" and \"losers\" Donald Trump"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "US immigration officials look to expand social media data collection",
            "external_url": "https://apnews.com/article/social-media-immigration-applicants-handles-dhs-f67b480abebff7e451056be17572593d",
            "upvotes": 1501,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was reading a thing about 'misbeliefs Gen X has', and it said my generation was foolish because we believed more in anonymity whereas modern generations put themselves out there fully on the net.\n\nReminds me of the joke.. Do you know who the greatest hacker in the world is? *Of course not, if you did they wouldn't be the greatest hacker in the world.*",
                "Hey social media CEOs, remember when you were all about free speech? Wanna do something about that and tell the government to take a hike? Or are you gonna tell us that content moderation by a private company is infringing on free speech but the government literally persecuting people for their opinions isn’t?",
                "Friends it is time to kill social media. It's been dying for years but let's all do the right thing and kill it dead.",
                "Get off X. I’m telling ya….",
                "Ah, just like the Chinese Social Credit system.",
                "This is how the OG nokia brick phone makes a comeback.",
                "Couldn’t u just delete ask your apps n take a burner phone",
                "What was that?  Sorry, I can't hear you over the sound of my use of Mastodon instead of Facebook!",
                "Maybe we should all stop using social media until those companies lobby the govt to not collect our data on our behalf. ",
                "Backup your phone.  Delete all histories and app.  Then restore when through immigration.  Trump is copying china and russia.  "
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 22064,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "This is unfucking believable.",
                "I think when one can buy democracy at that point democracy is dead.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "First orbital rocket launched from mainland Europe crashes after takeoff",
            "external_url": "https://www.theguardian.com/science/2025/mar/30/first-orbital-rocket-launched-europe-crashes-launch-spectrum",
            "upvotes": 563,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10060b8d3fc912884211933a8e0d4e3414dbec4c/0_58_2295_1377/master/2295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0fed1f6a50b7888b86e7980e0e245afc",
            "top_comments": [
                "Leon would call this a \"successful test\".  Celebrations all around.\n\n“This allowed the company to gather a substantial amount of flight data and experience to apply on future missions,” Isar said in a statement. “After the flight was terminated at T+30 seconds, the launch vehicle fell into the sea in a controlled manner.”\n\nChance of Germany Succeeding Next Time: Pretty Damn Good\n\nChance of Germany Consulting or Engaging Musk / USA : ZERO",
                "\"Isar Aerospace, which had warned the initial launch could end prematurely, said the test produced extensive data that its team could learn from.\"\n\nNow hire some experts leaving the US (more rights for employees, yay!), add European precision (well, maybe more pricey than Space X processes/materials?), and this may look pretty good pretty soon.",
                "The juxtaposition between this and the threads about the delayed SpaceX launch are kind of amazing.",
                "My main question after watching that is if not self-destructing and allowing it to blow up on the ground was on purpose.",
                "Question:\n\nWhy do so many rockets blow up at launch or mid-flight? It happens quite frequently. Is it so difficult to build a 100% working space rocket, even for those big brain engineers?",
                "no worries\n\nMusk has been trying a lot longer and he still blows up",
                "Looks like guidance/stability issues.  That engine was gimbaling like a motherfucker before it swapped ends and became a lawn dart.",
                "When is attempt number 2?",
                "> First orbital rocket launched from mainland Europe\n\n\nYAY!\n\n\n> crashes after takeoff \n\n\noh no",
                "German rocket. Bummer, but at least we Europeans try and make progress in this regard. Now learn from the mistakes and do it again."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 8654,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "Isn't this a privately funded nonprofit? Why the fuck is the DC Police invading a nonprofit? It's like invading a food bank. WTF."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "United Airlines Flight Hit by Kite Near Washington DC",
            "external_url": "https://aviationa2z.com/index.php/2025/03/30/united-airlines-flight-hit-by-kite-near-washington-dc/",
            "upvotes": 816,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm going to go out on a limb here and say that I don't think this was a smart thing for the kite flyer to do.",
                "What ISN’T hitting airplanes right now? Besides submarines.",
                "There was a kite festival for the cherry blossoms and some idiot must have not felt like fighting the traffic to get over to the Washington Monument… it’s impossible to not know that Gravelly Point is a terrible place to fly a kite.",
                "[United CEO this week.](https://youtu.be/lm8fYf53SMg)",
                "I would have thought the plane hit the kite as opposed to the kite hitting the plane. Also can’t imagine there was much left of the kite to be returned to the kite flyer and family.",
                "Why’s it always DC? I have to fly there soon. I’d rather fly into a nearby state and just drive over",
                "So guess the lesson of the year thus far is don’t fly into DC, right?",
                "I'm pretty sure there was a kite festival in DC this weekend",
                "That’s got to be a really long piece of string.",
                "Charlie Brown, you blockhead!"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "UAW Supports Trump Auto Tariffs",
            "external_url": "https://www.wsj.com/livecoverage/stock-market-today-dow-nasdaq-sp500-03-27-2025/card/the-uaw-cheers-trump-s-tariffs-on-auto-imports-pfllnNZIBcEWSdeSuDA4",
            "upvotes": 0,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unions supporting the most anti-union president ever is pure irony.",
                "Union under the childishly dumb impression that this will result in more union jobs rather than more union busting.",
                "Can't wait to hear them cry when they eventually get screwed over.",
                "I mean, you can tariff the hell out of imports all you want, I ain’t buying a car made by the UAW at this point.",
                "The UAW deserves whatever trouble it gets into next. These tariffs are unnecessary for everything being brought into the U.S.",
                "No editorialized titles; Title must match article title",
                "Biden should have let them drown instead of saving their pensions with an $83 billion bail out. Just a bunch of white men doing what 64% of them do and that is vote conservative.",
                "was this the one where the leadership was maga and the locals were mostly not?",
                "Doesn't matter to me. I can't afford a new car anyway.",
                "Breaking working business models in order to make change quickly is a recipe for disaster."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Minnesota officials seek answers in case of graduate student detained by ICE",
            "external_url": "https://apnews.com/article/university-of-minnesota-graduate-student-detained-38e5ac3681b3d5e2c9d82ae40f9ae7f9",
            "upvotes": 2082,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kidnapped. She was kidnapped.",
                "but u/shoggies, you said she was a member of Hamas and that the government confirmed this! How come that doesn't seem to be the case?",
                "This is like the Red Scare, where if you protest against Israel military action in Gaza, or are at some protest where someone says \"from the river to the sea\" that gets turned into \"you support Hamas\"\n\nNo one knows why this person is detained, but that's the basic theme lately",
                "\"seeking answers\" seems like way too mild a response.",
                "I feel like these peaceful protests are going to get a lot less peaceful",
                "Tomorrow's headline: \"Minnesota Officials Detained By ICE\".",
                "Party of free speech moment.\n\nI’m guessing the student wrote an article about Palestinians being bombed and said it’s bad. That’s basically being a member of hamas though according to what the pretty lady on fox said.",
                "If you have a green card you can legally purchase a firearm. Could come in handy when unidentified masked people try and kidnap you."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 4888,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "I think back often to an interview I heard with an anesthesiologist, a very philosophical man who took great pride in his work.  He said that his job was essentially to kill his patients and then bring them back to life.  Anesthesia involves processes that would otherwise cause the body to die, but with him there, was his role to manual manage the functions of the body that would otherwise cease.\n\nIt's serious shit.",
                "Just tragic\n\nHer poor family too",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "When my sons needed more invasive dental work and needed to fully go under, they had to first pass a physical exam by their pediatricians, and the procedure was done in an actual HOSPITAL, with a pediatric anesthesia specialist overseeing the surgery and plenty of help immediately hand in case anything went wrong."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "First orbital rocket launched from mainland Europe crashes after takeoff",
            "external_url": "https://www.theguardian.com/science/2025/mar/30/first-orbital-rocket-launched-europe-crashes-launch-spectrum",
            "upvotes": 559,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10060b8d3fc912884211933a8e0d4e3414dbec4c/0_58_2295_1377/master/2295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0fed1f6a50b7888b86e7980e0e245afc",
            "top_comments": [
                "Leon would call this a \"successful test\".  Celebrations all around.\n\n“This allowed the company to gather a substantial amount of flight data and experience to apply on future missions,” Isar said in a statement. “After the flight was terminated at T+30 seconds, the launch vehicle fell into the sea in a controlled manner.”\n\nChance of Germany Succeeding Next Time: Pretty Damn Good\n\nChance of Germany Consulting or Engaging Musk / USA : ZERO",
                "\"Isar Aerospace, which had warned the initial launch could end prematurely, said the test produced extensive data that its team could learn from.\"\n\nNow hire some experts leaving the US (more rights for employees, yay!), add European precision (well, maybe more pricey than Space X processes/materials?), and this may look pretty good pretty soon.",
                "The juxtaposition between this and the threads about the delayed SpaceX launch are kind of amazing.",
                "My main question after watching that is if not self-destructing and allowing it to blow up on the ground was on purpose.",
                "Question:\n\nWhy do so many rockets blow up at launch or mid-flight? It happens quite frequently. Is it so difficult to build a 100% working space rocket, even for those big brain engineers?",
                "no worries\n\nMusk has been trying a lot longer and he still blows up",
                "Looks like guidance/stability issues.  That engine was gimbaling like a motherfucker before it swapped ends and became a lawn dart.",
                "When is attempt number 2?",
                "> First orbital rocket launched from mainland Europe\n\n\nYAY!\n\n\n> crashes after takeoff \n\n\noh no",
                "German rocket. Bummer, but at least we Europeans try and make progress in this regard. Now learn from the mistakes and do it again."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "US immigration officials look to expand social media data collection",
            "external_url": "https://apnews.com/article/social-media-immigration-applicants-handles-dhs-f67b480abebff7e451056be17572593d",
            "upvotes": 1503,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was reading a thing about 'misbeliefs Gen X has', and it said my generation was foolish because we believed more in anonymity whereas modern generations put themselves out there fully on the net.\n\nReminds me of the joke.. Do you know who the greatest hacker in the world is? *Of course not, if you did they wouldn't be the greatest hacker in the world.*",
                "Hey social media CEOs, remember when you were all about free speech? Wanna do something about that and tell the government to take a hike? Or are you gonna tell us that content moderation by a private company is infringing on free speech but the government literally persecuting people for their opinions isn’t?",
                "Friends it is time to kill social media. It's been dying for years but let's all do the right thing and kill it dead.",
                "Get off X. I’m telling ya….",
                "Ah, just like the Chinese Social Credit system.",
                "This is how the OG nokia brick phone makes a comeback.",
                "Couldn’t u just delete ask your apps n take a burner phone",
                "What was that?  Sorry, I can't hear you over the sound of my use of Mastodon instead of Facebook!",
                "Maybe we should all stop using social media until those companies lobby the govt to not collect our data on our behalf. ",
                "Backup your phone.  Delete all histories and app.  Then restore when through immigration.  Trump is copying china and russia.  "
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "U.S. Army says recovering 4 soldiers missing in Lithuania \"will be a long and difficult\" operation",
            "external_url": "https://www.cbsnews.com/news/us-soldiers-missing-lithuania-army-m88-hercules-long-difficult-operation/",
            "upvotes": 3444,
            "date": "03/30/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/f7a8a787-ed5d-45be-b008-00d6abbc4d39/thumbnail/1200x630/26472697efa33e738651b8b54845ef3c/lithuania-us-soldiers-2206633876.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "No soldiers left behind. Unless the Secretary of Defense is busy getting horrible tattoos that ruin the flag.",
                "I’m sure the US VP, or defense has already visited the site and offered support. I’m so proud of the US /s",
                "They cut off the, “and we don’t think it’s worth it.” /s",
                "As difficult as finding those who went missing in El Salvador, isn't it?",
                "Maybe Vance would have been better off to go to Lithuania to show support for the USA military instead of harassing an ally about military take over!",
                "wait are they still alive?",
                "Well zero news coverage sooo no big deal to the government apparently👎🏼",
                "I hope the drunk weekend Fox News host adds Rachel Maddow to the mission Snapchat.",
                "Condolences on the loss of these soldiers, they layed down their life on a NATO mission",
                "\"suckers\" and \"losers\" Donald Trump"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Magnitude-7.1 earthquake hits Tonga, tsunami threat issued",
            "external_url": "https://www.abc.net.au/news/2025-03-31/magnitude-7-earthquake-hits-tonga-tsunami-threat-issued/105114840",
            "upvotes": 5604,
            "date": "03/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/b9a5cf82d345f4121ba437e1a6894ca9?impolicy=wcms_watermark_news&cropH=480&cropW=853&xPos=0&yPos=62&width=862&height=485&imformat=generic",
            "top_comments": [
                "ring of fire really doing its thing this week\n\n(i say with resignation while sitting on a major fault line)",
                "Tsunami warning has been cancelled according to the same source.",
                "are two different 7+ quakes that close together in terms of timeframe unusual?",
                "Tonga, the place where a large volcano recently detonated? That Tonga?",
                "Oh boy…the population is only 100,000. I hope they stay safe. ",
                "“The US Tsunami Warning Centre says…”  Good job making DOGE aware of your existence. Layoffs coming Monday.",
                "The California corner of the Pacific plate seems *WAY* overdue for a big one unfortunately. The other three corners have suffered from massive earthquakes over the last decade or so.",
                "[https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive)",
                "*Inserts this is fine gif*",
                "Dang this weekend has been crazy"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Marine Le Pen’s future to be decided as embezzlement verdict arrives | Marine Le Pen",
            "external_url": "https://www.theguardian.com/world/2025/mar/30/marine-le-pen-alleged-embezzlement-verdict",
            "upvotes": 885,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/58bc467ff40e9de6aeda2a793b5dfee2227854d7/0_154_5625_3375/master/5625.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b13b135841c319ae6e5d0bde43caa396",
            "top_comments": [
                "Wasn’t expecting that. I love this for her.",
                "va te faire foutre fasciste.  Fuck Le Pen and RN",
                "Please, just this once, let justice be done and this fascist criminal be put behind bars. I'm tired of the bad guys winning.",
                "Good. She deserves to fade into irrelevance",
                "Le Penis not mightier!\n\n\nGood to see corruption actually coming to trial. I don't know what the odds are on the verdict, but it seems guilty could bar her from office. Anyone else follow the case more closely and has an idea of where it'll go?",
                "I hope she rots in jail",
                "On espère que la justice triomphe.",
                "5 years is too lenient, these people don't reform and they are politicians, they should be example for the nation, and not of how you mustn't behave. Politicians like that show to people it's alright to do it since THEY get away with it.",
                "It’s always far right that has corruption surrounding them… bolsonaro, milei, trump, lepen… they’re all the same",
                "Could it be that all this right wing extremism is just a giant grift?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Satanist leader’s attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests",
            "external_url": "https://www.cnn.com/2025/03/29/us/kansas-satanist-protest-arrests-hnk/index.html",
            "upvotes": 24126,
            "date": "03/30/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25087823019751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“When we saw that nobody was doing anything — I guess just in the moment of it — it was like, ‘He’s not supposed to be allowed to do this,’ so we tried to stop him,” she said.\n\nThe party of free speech, everybody...",
                "Where’s the don’t tread on me crowd?",
                "The Government of the United States gives to bigotry no sanction, to persecution no assistance. Require only that they who live under its protection should demean themselves as good citizens, in giving it on all occasions their effectual support.\n\n-George Washington\n\n\n\t“We the General Assembly of Virginia… do enact that no man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burdened in his body or goods, nor shall otherwise suffer on account of his religious opinions or belief.”\n\n-Thomas Jefferson\n\n\n\n\t“The civil rights of none shall be abridged on account of religious belief or worship.”\n\n-James Madison",
                "They should have all worn Tesla logos. Then anyone attacking them would have been classified as domestic terrorists. : )",
                "They say “chaos” but it was positively uneventful compared to what they apparently expected to happen. It was amazing how much of an overreaction there was to this. (Of course hindsight is 20/20). They had police cars surrounding the capitol. An acquaintance who works in the capitol told me they  had SWAT on every floor and hid all the tables and chairs so they couldn’t be used as weapons. They gave all the state workers administrative leave that day too, so they wouldn’t be caught up in anything downtown.\n\nAnd yet despite all the worry about mass violence, there were a ton of children amongst the counter protesters, all dressed in their Sunday best.",
                "I love that Satanist’s don’t even believe in Satan. It’s the Christians that do.",
                "*trying to remember if there are any photos or evidence of satanists burning an inverted pentagram in front of a black family's house.",
                "Christians always really struggle to understand that Satanists are a political activist group pointing out the hypocrisy of our government bias towards Christianity, not literal worshipers of Satan. \n\nIt would take less than 5 minutes of googling to understand this. The only ones at that protest who actually believe in Satan are the Christians.",
                "The rational next step is to do a bigger one.",
                "The original permit allowed them into the rotunda and in a horrifying display of religious persecution, legislators stepped in to edit the permit at the last second. The Satanists went ahead with their ceremony and were assaulted.   \nI don't understand why the leader was arrested. This is ridiculous."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Minnesota officials seek answers in case of graduate student detained by ICE",
            "external_url": "https://apnews.com/article/university-of-minnesota-graduate-student-detained-38e5ac3681b3d5e2c9d82ae40f9ae7f9",
            "upvotes": 2087,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kidnapped. She was kidnapped.",
                "but u/shoggies, you said she was a member of Hamas and that the government confirmed this! How come that doesn't seem to be the case?",
                "This is like the Red Scare, where if you protest against Israel military action in Gaza, or are at some protest where someone says \"from the river to the sea\" that gets turned into \"you support Hamas\"\n\nNo one knows why this person is detained, but that's the basic theme lately",
                "\"seeking answers\" seems like way too mild a response.",
                "I feel like these peaceful protests are going to get a lot less peaceful",
                "Tomorrow's headline: \"Minnesota Officials Detained By ICE\".",
                "Party of free speech moment.\n\nI’m guessing the student wrote an article about Palestinians being bombed and said it’s bad. That’s basically being a member of hamas though according to what the pretty lady on fox said.",
                "If you have a green card you can legally purchase a firearm. Could come in handy when unidentified masked people try and kidnap you."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "United Airlines Flight Hit by Kite Near Washington DC",
            "external_url": "https://aviationa2z.com/index.php/2025/03/30/united-airlines-flight-hit-by-kite-near-washington-dc/",
            "upvotes": 815,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm going to go out on a limb here and say that I don't think this was a smart thing for the kite flyer to do.",
                "What ISN’T hitting airplanes right now? Besides submarines.",
                "There was a kite festival for the cherry blossoms and some idiot must have not felt like fighting the traffic to get over to the Washington Monument… it’s impossible to not know that Gravelly Point is a terrible place to fly a kite.",
                "[United CEO this week.](https://youtu.be/lm8fYf53SMg)",
                "I would have thought the plane hit the kite as opposed to the kite hitting the plane. Also can’t imagine there was much left of the kite to be returned to the kite flyer and family.",
                "Why’s it always DC? I have to fly there soon. I’d rather fly into a nearby state and just drive over",
                "So guess the lesson of the year thus far is don’t fly into DC, right?",
                "I'm pretty sure there was a kite festival in DC this weekend",
                "That’s got to be a really long piece of string.",
                "Charlie Brown, you blockhead!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 4884,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "I think back often to an interview I heard with an anesthesiologist, a very philosophical man who took great pride in his work.  He said that his job was essentially to kill his patients and then bring them back to life.  Anesthesia involves processes that would otherwise cause the body to die, but with him there, was his role to manual manage the functions of the body that would otherwise cease.\n\nIt's serious shit.",
                "Just tragic\n\nHer poor family too",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "When my sons needed more invasive dental work and needed to fully go under, they had to first pass a physical exam by their pediatricians, and the procedure was done in an actual HOSPITAL, with a pediatric anesthesia specialist overseeing the surgery and plenty of help immediately hand in case anything went wrong."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US immigration officials look to expand social media data collection",
            "external_url": "https://apnews.com/article/social-media-immigration-applicants-handles-dhs-f67b480abebff7e451056be17572593d",
            "upvotes": 1510,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was reading a thing about 'misbeliefs Gen X has', and it said my generation was foolish because we believed more in anonymity whereas modern generations put themselves out there fully on the net.\n\nReminds me of the joke.. Do you know who the greatest hacker in the world is? *Of course not, if you did they wouldn't be the greatest hacker in the world.*",
                "Hey social media CEOs, remember when you were all about free speech? Wanna do something about that and tell the government to take a hike? Or are you gonna tell us that content moderation by a private company is infringing on free speech but the government literally persecuting people for their opinions isn’t?",
                "Friends it is time to kill social media. It's been dying for years but let's all do the right thing and kill it dead.",
                "Get off X. I’m telling ya….",
                "Ah, just like the Chinese Social Credit system.",
                "This is how the OG nokia brick phone makes a comeback.",
                "Couldn’t u just delete ask your apps n take a burner phone",
                "What was that?  Sorry, I can't hear you over the sound of my use of Mastodon instead of Facebook!",
                "Maybe we should all stop using social media until those companies lobby the govt to not collect our data on our behalf. ",
                "Backup your phone.  Delete all histories and app.  Then restore when through immigration.  Trump is copying china and russia.  "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "U.S. Army says recovering 4 soldiers missing in Lithuania \"will be a long and difficult\" operation",
            "external_url": "https://www.cbsnews.com/news/us-soldiers-missing-lithuania-army-m88-hercules-long-difficult-operation/",
            "upvotes": 3438,
            "date": "03/30/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/f7a8a787-ed5d-45be-b008-00d6abbc4d39/thumbnail/1200x630/26472697efa33e738651b8b54845ef3c/lithuania-us-soldiers-2206633876.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "No soldiers left behind. Unless the Secretary of Defense is busy getting horrible tattoos that ruin the flag.",
                "I’m sure the US VP, or defense has already visited the site and offered support. I’m so proud of the US /s",
                "They cut off the, “and we don’t think it’s worth it.” /s",
                "As difficult as finding those who went missing in El Salvador, isn't it?",
                "Maybe Vance would have been better off to go to Lithuania to show support for the USA military instead of harassing an ally about military take over!",
                "wait are they still alive?",
                "Well zero news coverage sooo no big deal to the government apparently👎🏼",
                "I hope the drunk weekend Fox News host adds Rachel Maddow to the mission Snapchat.",
                "Condolences on the loss of these soldiers, they layed down their life on a NATO mission",
                "\"suckers\" and \"losers\" Donald Trump"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Magnitude-7.1 earthquake hits Tonga, tsunami threat issued",
            "external_url": "https://www.abc.net.au/news/2025-03-31/magnitude-7-earthquake-hits-tonga-tsunami-threat-issued/105114840",
            "upvotes": 5599,
            "date": "03/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/b9a5cf82d345f4121ba437e1a6894ca9?impolicy=wcms_watermark_news&cropH=480&cropW=853&xPos=0&yPos=62&width=862&height=485&imformat=generic",
            "top_comments": [
                "ring of fire really doing its thing this week\n\n(i say with resignation while sitting on a major fault line)",
                "Tsunami warning has been cancelled according to the same source.",
                "are two different 7+ quakes that close together in terms of timeframe unusual?",
                "Tonga, the place where a large volcano recently detonated? That Tonga?",
                "Oh boy…the population is only 100,000. I hope they stay safe. ",
                "“The US Tsunami Warning Centre says…”  Good job making DOGE aware of your existence. Layoffs coming Monday.",
                "The California corner of the Pacific plate seems *WAY* overdue for a big one unfortunately. The other three corners have suffered from massive earthquakes over the last decade or so.",
                "[https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive)",
                "*Inserts this is fine gif*",
                "Dang this weekend has been crazy"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "First orbital rocket launched from mainland Europe crashes after takeoff",
            "external_url": "https://www.theguardian.com/science/2025/mar/30/first-orbital-rocket-launched-europe-crashes-launch-spectrum",
            "upvotes": 560,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10060b8d3fc912884211933a8e0d4e3414dbec4c/0_58_2295_1377/master/2295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0fed1f6a50b7888b86e7980e0e245afc",
            "top_comments": [
                "Leon would call this a \"successful test\".  Celebrations all around.\n\n“This allowed the company to gather a substantial amount of flight data and experience to apply on future missions,” Isar said in a statement. “After the flight was terminated at T+30 seconds, the launch vehicle fell into the sea in a controlled manner.”\n\nChance of Germany Succeeding Next Time: Pretty Damn Good\n\nChance of Germany Consulting or Engaging Musk / USA : ZERO",
                "\"Isar Aerospace, which had warned the initial launch could end prematurely, said the test produced extensive data that its team could learn from.\"\n\nNow hire some experts leaving the US (more rights for employees, yay!), add European precision (well, maybe more pricey than Space X processes/materials?), and this may look pretty good pretty soon.",
                "The juxtaposition between this and the threads about the delayed SpaceX launch are kind of amazing.",
                "My main question after watching that is if not self-destructing and allowing it to blow up on the ground was on purpose.",
                "Question:\n\nWhy do so many rockets blow up at launch or mid-flight? It happens quite frequently. Is it so difficult to build a 100% working space rocket, even for those big brain engineers?",
                "no worries\n\nMusk has been trying a lot longer and he still blows up",
                "Looks like guidance/stability issues.  That engine was gimbaling like a motherfucker before it swapped ends and became a lawn dart.",
                "When is attempt number 2?",
                "> First orbital rocket launched from mainland Europe\n\n\nYAY!\n\n\n> crashes after takeoff \n\n\noh no",
                "German rocket. Bummer, but at least we Europeans try and make progress in this regard. Now learn from the mistakes and do it again."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Satanist leader’s attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests",
            "external_url": "https://www.cnn.com/2025/03/29/us/kansas-satanist-protest-arrests-hnk/index.html",
            "upvotes": 24128,
            "date": "03/30/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25087823019751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“When we saw that nobody was doing anything — I guess just in the moment of it — it was like, ‘He’s not supposed to be allowed to do this,’ so we tried to stop him,” she said.\n\nThe party of free speech, everybody...",
                "Where’s the don’t tread on me crowd?",
                "The Government of the United States gives to bigotry no sanction, to persecution no assistance. Require only that they who live under its protection should demean themselves as good citizens, in giving it on all occasions their effectual support.\n\n-George Washington\n\n\n\t“We the General Assembly of Virginia… do enact that no man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burdened in his body or goods, nor shall otherwise suffer on account of his religious opinions or belief.”\n\n-Thomas Jefferson\n\n\n\n\t“The civil rights of none shall be abridged on account of religious belief or worship.”\n\n-James Madison",
                "They should have all worn Tesla logos. Then anyone attacking them would have been classified as domestic terrorists. : )",
                "They say “chaos” but it was positively uneventful compared to what they apparently expected to happen. It was amazing how much of an overreaction there was to this. (Of course hindsight is 20/20). They had police cars surrounding the capitol. An acquaintance who works in the capitol told me they  had SWAT on every floor and hid all the tables and chairs so they couldn’t be used as weapons. They gave all the state workers administrative leave that day too, so they wouldn’t be caught up in anything downtown.\n\nAnd yet despite all the worry about mass violence, there were a ton of children amongst the counter protesters, all dressed in their Sunday best.",
                "I love that Satanist’s don’t even believe in Satan. It’s the Christians that do.",
                "*trying to remember if there are any photos or evidence of satanists burning an inverted pentagram in front of a black family's house.",
                "Christians always really struggle to understand that Satanists are a political activist group pointing out the hypocrisy of our government bias towards Christianity, not literal worshipers of Satan. \n\nIt would take less than 5 minutes of googling to understand this. The only ones at that protest who actually believe in Satan are the Christians.",
                "The rational next step is to do a bigger one.",
                "The original permit allowed them into the rotunda and in a horrifying display of religious persecution, legislators stepped in to edit the permit at the last second. The Satanists went ahead with their ceremony and were assaulted.   \nI don't understand why the leader was arrested. This is ridiculous."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 22066,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "This is unfucking believable.",
                "I think when one can buy democracy at that point democracy is dead.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 8661,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "Isn't this a privately funded nonprofit? Why the fuck is the DC Police invading a nonprofit? It's like invading a food bank. WTF."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "03/31/2025 00:43:49 UTC"
}