{
    "posts": [
        {
            "category": "HOT",
            "title": "Marine Le Pen is barred from seeking public office for embezzlement",
            "external_url": "https://apnews.com/article/marine-le-pen-france-far-right-trial-verdict-f3da0614e9a6fc24c87eb33d5b873409",
            "upvotes": 4397,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "amazing how other democracies have no problem holding former politicians to account. the US system is absolutely paralyzed if you try and accuse a former president who may run again of literally any crime.",
                "[removed]",
                "A criminal barred from public office? America you see what they do in France. Convicted criminals can't run for public office.",
                "Good. I hope she rots into obscurity.",
                "Consequences,  well done France",
                "Looks like the populist right has reached a critical mass of stupid and is now coming apart at the seams.",
                "Having claimed expenses on behalf of UK MEPs for several years in the European Parliament, I can say with some authority having looked at the circumstances of this case, that it was pretty obvious embezzlement and would have been obviously wrong to the people who carried it out. I've just read Bardella's comments on X that French democracy has been 'executed' (which in English can actually mean 'carried out', but I assume he means the other meaning... that it's dead!). My reaction to him is that if you believe in the rule of law, you can't support Le Pen or the other convicted people with a straight face. And if you don't believe in the rule of law, you shouldn't be running for office.",
                "She would be labeled a \"patriot\" here in the US. I'm willing to bet there will be a post on Social media by a certain president today claiming she is being \"persecuted\" by the left.",
                "So it can happen. To bad it hasn’t in the states",
                "Fascists don’t belong in public office."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin Supreme Court rejects effort to block Musk's $1M giveaways",
            "external_url": "https://abcnews.go.com/US/wisconsin-supreme-court-rejects-effort-block-musks-1m/story?id=120319945",
            "upvotes": 23107,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8185a658-62ad-4477-94cb-3632d33c8c22/GettyImages-2207708465_1743393303641_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "The money has already won.",
                "Can’t give a bottle of water to someone waiting in line to vote in Georgia.  I hate this country",
                "Has the decision been published somewhere? I'm struggling to understand how the court would rule this way.",
                "Money is a hell of a drug",
                "So the George Soros shit no actual proof, but when it actually happens with Elon, silence from Republicans.  Sounds about right.",
                "Fuck that guy. Money doesn't make you right, Ellen.",
                "What stops from democrats doing this? They should go ahead.",
                "They love purchased elections.",
                "Musk is spending that money in an effort to influence the election of Wisconsin supreme court justices.  Talk about a conflict of interest.  I hope that Wisconsin voters won't allow that corruption to prevail.",
                "It’s time to put an end to this shit. I can’t believe he bought a presidency, and now he’s buying states elections. **WHAT THE FUCK???**"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr. to gut vaccine promotion and HIV prevention office, sources say",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-to-gut-vaccine-promotion-and-hiv-prevention-office-sources-say/",
            "upvotes": 9011,
            "date": "03/31/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/12/3e63165d-7ccb-4b61-a050-cc125f93736d/thumbnail/1200x630/f07246da884c5f45f976525f454cebad/gettyimages-2196040392-1.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "It's just insane.  People are going to die because of the wholesale incompetence of Trump and his merry band of lunatics.",
                "Makes sense to stop promoting vaccines when you're going to ban them all inevitably.\n\nBut hey, baby coffin stocks are up! God's plan!",
                "The wrong Kennedy was lobotomized.\n\nEdit: Just an FYI - this is not a joke about JFK. See Rosemary Kennedy for more details.",
                "Fucking brain worms Kennedy. \nAnd seriously,\n Elon musk is a bitch.\n\nFuck that guy. ",
                "Kinda sounds like Republicans are trying  to remove themselves from the equation lol. Antivaxxers are pretty overwhelmingly conservative right?\n\nWhat the fuck angle are they even trying to push?",
                "Those who fail to learn from history -- something, something\n\n\"It’s true that (Mike) Pence faced an HIV outbreak while he was the governor, and that he eventually allowed a needle exchange. But his revisionist history misrepresents his role in what transpired in the small town of Austin, Indiana five years ago, where over 200 people were infected with HIV. What happened is that Pence failed to act in response to increasingly urgent signs of a significant HIV outbreak, and he delayed implementation of vital public health measures. Among public health experts, the Indiana outbreak is considered a failure of state response, and an example of how poor political leadership can actually make a crisis worse.\" 🏌️‍♂️⛳",
                "Everyone just be careful. We’re dealing with massive amounts of misinformation and lack of education, it’s going to get ugly. Do what you can to keep you and yours safe. ",
                "Hates vaccines but stuck dirty heroin needles in his fucking arm for a decade and a half.\n\nWhy is he our secretary of health again?",
                "I'm honestly worried that this is going to mean that vaccines are going to become ridiculously expensive, and even people with insurance are going to have to pay out of pocket because they aren't covered anymore. \n\nPoor people aren't going to be able to qualify to have their kids vaccinated for free or at a reduced rate.",
                "A fucking moron shouldn't be allowed to make medical decisions"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "England to make the morning-after pill free over the counter in pharmacies",
            "external_url": "https://www.abc.net.au/news/2025-03-31/morning-after-pill-to-be-made-free-in-england-pharmacies/105116292",
            "upvotes": 3923,
            "date": "03/31/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/70a1620bfe1fbe5e102d83232cfb9d53?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=229&width=862&height=485&imformat=generic",
            "top_comments": [
                "These are actual \"freedom seeds\". Bravo UK.\n\nEdit: A word",
                "Amazingly great news! The seems to actually realize this is a health issue for women! Geez",
                "This rampant subsidising of medicine or making it free, currently happening in the UK and Australia (and hopefully elsewhere) must be driving the CEOs of American big pharma absolutely bananas. Will someone please think of the rich people for once!",
                "It's been free and over-the-counter in France for a good long while now. It's a step in the right direction but there are still, after all this time, quite a few stories running around of pharmacist trying to shame women who needs it when they ask for it or pharmacist dropping nice little holier-than-you speeches about how this is not a contraception method, etc.",
                "Smart. A lot safer and cheaper than abortion. Like many preventative programs, this should become cost effective even with a small number of prevented cases.",
                "Good cheaper than kids no one wants and people on benefits",
                "there's no reason this shouldn't be freely available everywhere.",
                "Surplus humanity prevention",
                "IT should be free at every hourly motel",
                "I wish Prep and Aciclovir was over the counter where I live."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Health insurance CEO fired after admitting to hiring private investigators to dig up dirt",
            "external_url": "https://news4sanantonio.com/news/local/health-insurance-ceo-fired-after-admitting-to-hiring-private-investigators-to-dig-up-dirt-austin-texas-house-committee-ken-paxton-background-checks",
            "upvotes": 3927,
            "date": "03/31/2025",
            "thumbnail": "https://news4sanantonio.com/resources/media2/16x9/1086/986/0x25/90/6f857249-5724-499e-80fc-66b9ad5e8aef-sanders.jpg",
            "top_comments": [
                "Only got fired because he spoke about hiring private investigators and not the action it self.",
                ">AUSTIN, Texas - Mark Sanders, the CEO of Superior HealthPlan, was dismissed from his position following revelations that his company had hired private investigators to gather personal information on customers, journalists, and even lawmakers.\n\n>The dismissal came just days after Sanders testified before the Texas House Committee on the Delivery of Government Efficiency, where he confirmed that private investigators had been hired to surveil individuals with the goal of uncovering sensitive details.\n\n>In a statement to The Dallas Morning News, Centene Corporation, the parent company of Superior HealthPlan, expressed its disapproval of the actions taken by Sanders.\n\n>“The conduct highlighted during the Texas House Committee hearing is not reflective of our values, nor is it a practice Centene’s current leadership condones,” the statement read. “To this end, Mark Sanders is no longer with our organization.”\n\n>Following Sanders’ testimony, Texas Attorney General Ken Paxton’s office confirmed that an investigation into the matter had been launched.\n\n>The controversy erupted during a meeting of the House Committee on the Delivery of Government Efficiency, which was initially focused on the state’s procurement process for managed care organizations like Superior HealthPlan. Committee Chair Giovanni Capriglione, a Republican from Southlake, was quick to confront Sanders about the company’s use of taxpayer funds to hire private investigators.\n\n>“I don’t think what any of us expected was for a health insurance company, funded mostly by Texas taxpayer dollars, to use some of those funds to hire private investigators,” Capriglione said. He pointed to one particular instance in which investigators were allegedly hired to follow a mother whose child had been denied medical care, exacerbating the child’s condition.\n\n>When Capriglione asked Sanders directly if investigators had been employed to dig into the backgrounds of customers, government officials, and even a reporter, Sanders admitted to the practice. He explained that the goal was to learn more about the individuals with whom the company interacted, a justification that was met with scorn from Representative Matt Tinderholt.\n\n>“You wanted leverage, and you thought that you were going to use it,” Tinderholt responded, adding, “I dare you to investigate me. Do it, and bring it.”\n\n>In a subsequent press release, Attorney General Paxton’s office suggested that the actions might amount to potential blackmail intended to secure state contracts or avoid paying legitimate medical claims. The investigation, Paxton stated, would determine if any illegal activity had occurred.\n\nSaved you a click",
                "*“You wanted leverage, and you thought that you were going to use it,” Tinderholt responded, adding, “I dare you to investigate me. Bring it on.\"* \n\nThe company that is funded, in large part, by tax payers, hires private detectives to spy on patients so that it doesn't have to pay out their medical claims.",
                "I wish I was surprised - there are no limits to which disgusting people won't sink for money",
                "Good on the Texas politicians for calling out this s°°t.\n\nIf you're a corrupt rich businessman you know you done f°°°°d up when even the government officials of a very solid red, right wing, pro-business state quickly call you out on your BS and promise to investigate you for corruption.",
                "When health insurance is motivated by profit and increasing value to shareholders, then the good and health of the patients goes by the wayside. This is why we need universal healthcare.",
                "He just got caught. His actions are not an exception.",
                "Not what I expect from a committee with that name in that state under that leadership, but good on them.",
                "Things went really bad when greedy socialpaths became the new norm quite a while back for ceo",
                "They're in precarious positions"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "France's Le Pen found guilty in graft trial, awaits decision on potential ban from politics",
            "external_url": "https://www.reuters.com/world/europe/frances-le-pen-faces-crunch-day-graft-trial-that-could-kill-her-presidential-2025-03-31/",
            "upvotes": 403,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rightwingers world wide will coalesce around her as a victim of some liberal conspiracy or use this as an example of judicial tyranny.",
                "Sadly, I have to get my consequences for illegal behavior fixes from stories OUTSIDE of the US these days.",
                "Why can't the US do this to like 80% of sitting politicians, especially Dorito Man",
                "A right wing politician embezzling tax money? I'm shocked! Shocked!",
                "France holds their crooked politicians accountable, here we elect them!",
                "Again as i said yesterday VA TE FAIRE FOUTRE FASCITE.",
                "When you're an Oligarchy this doesn't happen hence the US has a felon destroying the country",
                "NOW soon to be on a lecture circuit in the USA at the invite of President  Musk",
                "I’m glad other countries prosecute this. Where is the USA?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "'Sobering statistic:' One-fifth of pollinators in North America at extinction risk",
            "external_url": "https://www.thecanadianpressnews.ca/national/sobering-statistic-one-fifth-of-pollinators-in-north-america-at-extinction-risk/article_d800e96c-3487-527c-8f0d-85d8067dae5d.html",
            "upvotes": 1197,
            "date": "03/31/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/9/20/9207af32-056c-5808-a73c-bea834ef9860/67e924471c9e8.image.jpg?crop=1400%2C735%2C0%2C88&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If you have a yard, planting things that are native to your area makes a huge difference.\n\nNative flowers feed native bees, and native leafy plants feed native caterpillars. Plus, you can grow a beautiful garden in the process.",
                "I’m from the middle east, and just recently spoke to a 20 something person who was never stung, and didn’t ever had significant contact with bees. I knew bees populations were declining, but it just shows how much the basic experience changed over a few decades. \n\nJust think about it, some people had no experience with bees and only know about them from the bee movie memes.",
                "Honeybees are not the pollinators the wilderness needs, they are cattle who partially takeover after the native bees are decimated.",
                "I think it's mites killing the bees and not enough natural mite toxic plants around for bees to crawl on. I have to get a new queen this year... and I am going to plant lots of Lavender and Thyme around the hive. My hope is that the bees track enough of the oils from these plants through the hive that they will have fewer mites.",
                "We need a Fertilization President to fix this ",
                "For start: How about fully banning neonicotinoids ?",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Minnesota officials seek answers in case of graduate student detained by ICE",
            "external_url": "https://apnews.com/article/university-of-minnesota-graduate-student-detained-38e5ac3681b3d5e2c9d82ae40f9ae7f9",
            "upvotes": 3820,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kidnapped. She was kidnapped.",
                "[removed]",
                "This is like the Red Scare, where if you protest against Israel military action in Gaza, or are at some protest where someone says \"from the river to the sea\" that gets turned into \"you support Hamas\"\n\nNo one knows why this person is detained, but that's the basic theme lately",
                "I feel like these peaceful protests are going to get a lot less peaceful",
                "Last time these kind of thing happened in my country, next thing is dead bodies suddenly appear in the dead of night, abandoned in public square to intimidate people or being fond decade later in mass graves, not saying this will happen in US but it never end well for anyone.",
                "\"seeking answers\" seems like way too mild a response.",
                "Tomorrow's headline: \"Minnesota Officials Detained By ICE\".",
                "You want a brain-drain?  This is how you get one.  And considering how shit our own homegrown students are, we just fucked ourselves really badly.",
                "Party of free speech moment.\n\nI’m guessing the student wrote an article about Palestinians being bombed and said it’s bad. That’s basically being a member of hamas though according to what the pretty lady on fox said.",
                "If you have a green card you can legally purchase a firearm. Could come in handy when unidentified masked people try and kidnap you."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "United Airlines Flight Hit by Kite Near Washington DC",
            "external_url": "https://aviationa2z.com/index.php/2025/03/30/united-airlines-flight-hit-by-kite-near-washington-dc/",
            "upvotes": 2117,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm going to go out on a limb here and say that I don't think this was a smart thing for the kite flyer to do.",
                "What ISN’T hitting airplanes right now? Besides submarines.",
                "There was a kite festival for the cherry blossoms and some idiot must have not felt like fighting the traffic to get over to the Washington Monument… it’s impossible to not know that Gravelly Point is a terrible place to fly a kite.",
                "[United CEO this week.](https://youtu.be/lm8fYf53SMg)",
                "So guess the lesson of the year thus far is don’t fly into DC, right?",
                "I would have thought the plane hit the kite as opposed to the kite hitting the plane. Also can’t imagine there was much left of the kite to be returned to the kite flyer and family.",
                "Why’s it always DC? I have to fly there soon. I’d rather fly into a nearby state and just drive over",
                "> Witnesses, including travel analyst Jamie Larounis, observed multiple kites in the air before the incident.\n\nDC is absolute chaos right now for cherry blossom season, so I'm not surprised.",
                "Charlie Brown, you blockhead!",
                "Folks always fly kites there. I’m surprised it hasn’t happened before."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 7098,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "When my sons needed more invasive dental work and needed to fully go under, they had to first pass a physical exam by their pediatricians, and the procedure was done in an actual HOSPITAL, with a pediatric anesthesia specialist overseeing the surgery and plenty of help immediately hand in case anything went wrong.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "I think back often to an interview I heard with an anesthesiologist, a very philosophical man who took great pride in his work.  He said that his job was essentially to kill his patients and then bring them back to life.  Anesthesia involves processes that would otherwise cause the body to die, but with him there, was his role to manual manage the functions of the body that would otherwise cease.\n\nIt's serious shit.",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "Just tragic\n\nHer poor family too"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Marine Le Pen is barred from seeking public office for embezzlement",
            "external_url": "https://apnews.com/article/marine-le-pen-france-far-right-trial-verdict-f3da0614e9a6fc24c87eb33d5b873409",
            "upvotes": 4396,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "amazing how other democracies have no problem holding former politicians to account. the US system is absolutely paralyzed if you try and accuse a former president who may run again of literally any crime.",
                "[removed]",
                "A criminal barred from public office? America you see what they do in France. Convicted criminals can't run for public office.",
                "Good. I hope she rots into obscurity.",
                "Consequences,  well done France",
                "Looks like the populist right has reached a critical mass of stupid and is now coming apart at the seams.",
                "Having claimed expenses on behalf of UK MEPs for several years in the European Parliament, I can say with some authority having looked at the circumstances of this case, that it was pretty obvious embezzlement and would have been obviously wrong to the people who carried it out. I've just read Bardella's comments on X that French democracy has been 'executed' (which in English can actually mean 'carried out', but I assume he means the other meaning... that it's dead!). My reaction to him is that if you believe in the rule of law, you can't support Le Pen or the other convicted people with a straight face. And if you don't believe in the rule of law, you shouldn't be running for office.",
                "She would be labeled a \"patriot\" here in the US. I'm willing to bet there will be a post on Social media by a certain president today claiming she is being \"persecuted\" by the left.",
                "So it can happen. To bad it hasn’t in the states",
                "Fascists don’t belong in public office."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "France's Le Pen found guilty in graft trial, awaits decision on potential ban from politics",
            "external_url": "https://www.reuters.com/world/europe/frances-le-pen-faces-crunch-day-graft-trial-that-could-kill-her-presidential-2025-03-31/",
            "upvotes": 408,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rightwingers world wide will coalesce around her as a victim of some liberal conspiracy or use this as an example of judicial tyranny.",
                "Sadly, I have to get my consequences for illegal behavior fixes from stories OUTSIDE of the US these days.",
                "Why can't the US do this to like 80% of sitting politicians, especially Dorito Man",
                "A right wing politician embezzling tax money? I'm shocked! Shocked!",
                "France holds their crooked politicians accountable, here we elect them!",
                "Again as i said yesterday VA TE FAIRE FOUTRE FASCITE.",
                "When you're an Oligarchy this doesn't happen hence the US has a felon destroying the country",
                "NOW soon to be on a lecture circuit in the USA at the invite of President  Musk",
                "I’m glad other countries prosecute this. Where is the USA?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Power outages impact over 315,000 northern Michigan residents during weekend storms",
            "external_url": "https://www.cbsnews.com/detroit/news/power-outages-northern-michigan-weekend-storms/",
            "upvotes": 151,
            "date": "03/31/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/30/22e31cb4-fa1c-4c8d-a4bb-d2db28921303/thumbnail/1200x630/c8f40deafa0caf172ec6c3450a4d2d53/gettyimages-469039723.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "https://poweroutage.us/",
                "Not quite as bad as December 2013, a million DTE customers (half of the DTE's total customers) were without power for many days.  Still a lot of storm damage around Michigan. Some roads were blocked from fallen tree and power line\n\nI am in Ohio for a funeral and I won't know how my farm fared until I get back."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "'Sobering statistic:' One-fifth of pollinators in North America at extinction risk",
            "external_url": "https://www.thecanadianpressnews.ca/national/sobering-statistic-one-fifth-of-pollinators-in-north-america-at-extinction-risk/article_d800e96c-3487-527c-8f0d-85d8067dae5d.html",
            "upvotes": 1197,
            "date": "03/31/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/9/20/9207af32-056c-5808-a73c-bea834ef9860/67e924471c9e8.image.jpg?crop=1400%2C735%2C0%2C88&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If you have a yard, planting things that are native to your area makes a huge difference.\n\nNative flowers feed native bees, and native leafy plants feed native caterpillars. Plus, you can grow a beautiful garden in the process.",
                "I’m from the middle east, and just recently spoke to a 20 something person who was never stung, and didn’t ever had significant contact with bees. I knew bees populations were declining, but it just shows how much the basic experience changed over a few decades. \n\nJust think about it, some people had no experience with bees and only know about them from the bee movie memes.",
                "Honeybees are not the pollinators the wilderness needs, they are cattle who partially takeover after the native bees are decimated.",
                "I think it's mites killing the bees and not enough natural mite toxic plants around for bees to crawl on. I have to get a new queen this year... and I am going to plant lots of Lavender and Thyme around the hive. My hope is that the bees track enough of the oils from these plants through the hive that they will have fewer mites.",
                "We need a Fertilization President to fix this ",
                "For start: How about fully banning neonicotinoids ?",
                "[removed]"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "England to make the morning-after pill free over the counter in pharmacies",
            "external_url": "https://www.abc.net.au/news/2025-03-31/morning-after-pill-to-be-made-free-in-england-pharmacies/105116292",
            "upvotes": 3925,
            "date": "03/31/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/70a1620bfe1fbe5e102d83232cfb9d53?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=229&width=862&height=485&imformat=generic",
            "top_comments": [
                "These are actual \"freedom seeds\". Bravo UK.\n\nEdit: A word",
                "Amazingly great news! The seems to actually realize this is a health issue for women! Geez",
                "This rampant subsidising of medicine or making it free, currently happening in the UK and Australia (and hopefully elsewhere) must be driving the CEOs of American big pharma absolutely bananas. Will someone please think of the rich people for once!",
                "It's been free and over-the-counter in France for a good long while now. It's a step in the right direction but there are still, after all this time, quite a few stories running around of pharmacist trying to shame women who needs it when they ask for it or pharmacist dropping nice little holier-than-you speeches about how this is not a contraception method, etc.",
                "Smart. A lot safer and cheaper than abortion. Like many preventative programs, this should become cost effective even with a small number of prevented cases.",
                "Good cheaper than kids no one wants and people on benefits",
                "there's no reason this shouldn't be freely available everywhere.",
                "Surplus humanity prevention",
                "IT should be free at every hourly motel",
                "I wish Prep and Aciclovir was over the counter where I live."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr. to gut vaccine promotion and HIV prevention office, sources say",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-to-gut-vaccine-promotion-and-hiv-prevention-office-sources-say/",
            "upvotes": 9002,
            "date": "03/31/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/12/3e63165d-7ccb-4b61-a050-cc125f93736d/thumbnail/1200x630/f07246da884c5f45f976525f454cebad/gettyimages-2196040392-1.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "It's just insane.  People are going to die because of the wholesale incompetence of Trump and his merry band of lunatics.",
                "Makes sense to stop promoting vaccines when you're going to ban them all inevitably.\n\nBut hey, baby coffin stocks are up! God's plan!",
                "The wrong Kennedy was lobotomized.\n\nEdit: Just an FYI - this is not a joke about JFK. See Rosemary Kennedy for more details.",
                "Fucking brain worms Kennedy. \nAnd seriously,\n Elon musk is a bitch.\n\nFuck that guy. ",
                "Kinda sounds like Republicans are trying  to remove themselves from the equation lol. Antivaxxers are pretty overwhelmingly conservative right?\n\nWhat the fuck angle are they even trying to push?",
                "Those who fail to learn from history -- something, something\n\n\"It’s true that (Mike) Pence faced an HIV outbreak while he was the governor, and that he eventually allowed a needle exchange. But his revisionist history misrepresents his role in what transpired in the small town of Austin, Indiana five years ago, where over 200 people were infected with HIV. What happened is that Pence failed to act in response to increasingly urgent signs of a significant HIV outbreak, and he delayed implementation of vital public health measures. Among public health experts, the Indiana outbreak is considered a failure of state response, and an example of how poor political leadership can actually make a crisis worse.\" 🏌️‍♂️⛳",
                "Everyone just be careful. We’re dealing with massive amounts of misinformation and lack of education, it’s going to get ugly. Do what you can to keep you and yours safe. ",
                "Hates vaccines but stuck dirty heroin needles in his fucking arm for a decade and a half.\n\nWhy is he our secretary of health again?",
                "I'm honestly worried that this is going to mean that vaccines are going to become ridiculously expensive, and even people with insurance are going to have to pay out of pocket because they aren't covered anymore. \n\nPoor people aren't going to be able to qualify to have their kids vaccinated for free or at a reduced rate.",
                "A fucking moron shouldn't be allowed to make medical decisions"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Health insurance CEO fired after admitting to hiring private investigators to dig up dirt",
            "external_url": "https://news4sanantonio.com/news/local/health-insurance-ceo-fired-after-admitting-to-hiring-private-investigators-to-dig-up-dirt-austin-texas-house-committee-ken-paxton-background-checks",
            "upvotes": 3927,
            "date": "03/31/2025",
            "thumbnail": "https://news4sanantonio.com/resources/media2/16x9/1086/986/0x25/90/6f857249-5724-499e-80fc-66b9ad5e8aef-sanders.jpg",
            "top_comments": [
                "Only got fired because he spoke about hiring private investigators and not the action it self.",
                ">AUSTIN, Texas - Mark Sanders, the CEO of Superior HealthPlan, was dismissed from his position following revelations that his company had hired private investigators to gather personal information on customers, journalists, and even lawmakers.\n\n>The dismissal came just days after Sanders testified before the Texas House Committee on the Delivery of Government Efficiency, where he confirmed that private investigators had been hired to surveil individuals with the goal of uncovering sensitive details.\n\n>In a statement to The Dallas Morning News, Centene Corporation, the parent company of Superior HealthPlan, expressed its disapproval of the actions taken by Sanders.\n\n>“The conduct highlighted during the Texas House Committee hearing is not reflective of our values, nor is it a practice Centene’s current leadership condones,” the statement read. “To this end, Mark Sanders is no longer with our organization.”\n\n>Following Sanders’ testimony, Texas Attorney General Ken Paxton’s office confirmed that an investigation into the matter had been launched.\n\n>The controversy erupted during a meeting of the House Committee on the Delivery of Government Efficiency, which was initially focused on the state’s procurement process for managed care organizations like Superior HealthPlan. Committee Chair Giovanni Capriglione, a Republican from Southlake, was quick to confront Sanders about the company’s use of taxpayer funds to hire private investigators.\n\n>“I don’t think what any of us expected was for a health insurance company, funded mostly by Texas taxpayer dollars, to use some of those funds to hire private investigators,” Capriglione said. He pointed to one particular instance in which investigators were allegedly hired to follow a mother whose child had been denied medical care, exacerbating the child’s condition.\n\n>When Capriglione asked Sanders directly if investigators had been employed to dig into the backgrounds of customers, government officials, and even a reporter, Sanders admitted to the practice. He explained that the goal was to learn more about the individuals with whom the company interacted, a justification that was met with scorn from Representative Matt Tinderholt.\n\n>“You wanted leverage, and you thought that you were going to use it,” Tinderholt responded, adding, “I dare you to investigate me. Do it, and bring it.”\n\n>In a subsequent press release, Attorney General Paxton’s office suggested that the actions might amount to potential blackmail intended to secure state contracts or avoid paying legitimate medical claims. The investigation, Paxton stated, would determine if any illegal activity had occurred.\n\nSaved you a click",
                "*“You wanted leverage, and you thought that you were going to use it,” Tinderholt responded, adding, “I dare you to investigate me. Bring it on.\"* \n\nThe company that is funded, in large part, by tax payers, hires private detectives to spy on patients so that it doesn't have to pay out their medical claims.",
                "I wish I was surprised - there are no limits to which disgusting people won't sink for money",
                "Good on the Texas politicians for calling out this s°°t.\n\nIf you're a corrupt rich businessman you know you done f°°°°d up when even the government officials of a very solid red, right wing, pro-business state quickly call you out on your BS and promise to investigate you for corruption.",
                "When health insurance is motivated by profit and increasing value to shareholders, then the good and health of the patients goes by the wayside. This is why we need universal healthcare.",
                "He just got caught. His actions are not an exception.",
                "Not what I expect from a committee with that name in that state under that leadership, but good on them.",
                "Things went really bad when greedy socialpaths became the new norm quite a while back for ceo",
                "They're in precarious positions"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin Supreme Court rejects effort to block Musk's $1M giveaways",
            "external_url": "https://abcnews.go.com/US/wisconsin-supreme-court-rejects-effort-block-musks-1m/story?id=120319945",
            "upvotes": 23108,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8185a658-62ad-4477-94cb-3632d33c8c22/GettyImages-2207708465_1743393303641_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "The money has already won.",
                "Can’t give a bottle of water to someone waiting in line to vote in Georgia.  I hate this country",
                "Has the decision been published somewhere? I'm struggling to understand how the court would rule this way.",
                "Money is a hell of a drug",
                "So the George Soros shit no actual proof, but when it actually happens with Elon, silence from Republicans.  Sounds about right.",
                "Fuck that guy. Money doesn't make you right, Ellen.",
                "What stops from democrats doing this? They should go ahead.",
                "They love purchased elections.",
                "Musk is spending that money in an effort to influence the election of Wisconsin supreme court justices.  Talk about a conflict of interest.  I hope that Wisconsin voters won't allow that corruption to prevail.",
                "It’s time to put an end to this shit. I can’t believe he bought a presidency, and now he’s buying states elections. **WHAT THE FUCK???**"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "United Airlines Flight Hit by Kite Near Washington DC",
            "external_url": "https://aviationa2z.com/index.php/2025/03/30/united-airlines-flight-hit-by-kite-near-washington-dc/",
            "upvotes": 2115,
            "date": "03/30/2025",
            "thumbnail": "https://aviationa2z.com/wp-content/uploads/2024/01/image-153.png",
            "top_comments": [
                "I'm going to go out on a limb here and say that I don't think this was a smart thing for the kite flyer to do.",
                "What ISN’T hitting airplanes right now? Besides submarines.",
                "There was a kite festival for the cherry blossoms and some idiot must have not felt like fighting the traffic to get over to the Washington Monument… it’s impossible to not know that Gravelly Point is a terrible place to fly a kite.",
                "[United CEO this week.](https://youtu.be/lm8fYf53SMg)",
                "So guess the lesson of the year thus far is don’t fly into DC, right?",
                "I would have thought the plane hit the kite as opposed to the kite hitting the plane. Also can’t imagine there was much left of the kite to be returned to the kite flyer and family.",
                "Why’s it always DC? I have to fly there soon. I’d rather fly into a nearby state and just drive over",
                "> Witnesses, including travel analyst Jamie Larounis, observed multiple kites in the air before the incident.\n\nDC is absolute chaos right now for cherry blossom season, so I'm not surprised.",
                "Charlie Brown, you blockhead!",
                "Folks always fly kites there. I’m surprised it hasn’t happened before."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "UAW Supports Trump Auto Tariffs",
            "external_url": "https://www.wsj.com/livecoverage/stock-market-today-dow-nasdaq-sp500-03-27-2025/card/the-uaw-cheers-trump-s-tariffs-on-auto-imports-pfllnNZIBcEWSdeSuDA4",
            "upvotes": 30,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unions supporting the most anti-union president ever is pure irony.",
                "Union under the childishly dumb impression that this will result in more union jobs rather than more union busting.",
                "Not only will the coming trump recession reduce cars sales, but wait until their jobs are replaced by non-union workers or child labor like florida is proposing. 😂",
                "The UAW deserves whatever trouble it gets into next. These tariffs are unnecessary for everything being brought into the U.S.",
                "Doesn't matter to me. I can't afford a new car anyway.",
                "I mean, you can tariff the hell out of imports all you want, I ain’t buying a car made by the UAW at this point.",
                "Can't wait to hear them cry when they eventually get screwed over.",
                "The imports will be more expensive because of the trump tax and domestic cars will be more expensive because they can raise the price to match the imports. The real losers are the consumers who can't afford to buy a car.",
                "well then when they lose their jobs i won’t feel bad.",
                "Biden should have let them drown instead of saving their pensions with an $83 billion bail out. Just a bunch of white men doing what 64% of them do and that is vote conservative."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Marine Le Pen is barred from seeking public office for embezzlement",
            "external_url": "https://apnews.com/article/marine-le-pen-france-far-right-trial-verdict-f3da0614e9a6fc24c87eb33d5b873409",
            "upvotes": 4359,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "amazing how other democracies have no problem holding former politicians to account. the US system is absolutely paralyzed if you try and accuse a former president who may run again of literally any crime.",
                "[removed]",
                "A criminal barred from public office? America you see what they do in France. Convicted criminals can't run for public office.",
                "Good. I hope she rots into obscurity.",
                "Consequences,  well done France",
                "Looks like the populist right has reached a critical mass of stupid and is now coming apart at the seams.",
                "Having claimed expenses on behalf of UK MEPs for several years in the European Parliament, I can say with some authority having looked at the circumstances of this case, that it was pretty obvious embezzlement and would have been obviously wrong to the people who carried it out. I've just read Bardella's comments on X that French democracy has been 'executed' (which in English can actually mean 'carried out', but I assume he means the other meaning... that it's dead!). My reaction to him is that if you believe in the rule of law, you can't support Le Pen or the other convicted people with a straight face. And if you don't believe in the rule of law, you shouldn't be running for office.",
                "She would be labeled a \"patriot\" here in the US. I'm willing to bet there will be a post on Social media by a certain president today claiming she is being \"persecuted\" by the left.",
                "So it can happen. To bad it hasn’t in the states",
                "Fascists don’t belong in public office."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "France's Le Pen found guilty in graft trial, awaits decision on potential ban from politics",
            "external_url": "https://www.reuters.com/world/europe/frances-le-pen-faces-crunch-day-graft-trial-that-could-kill-her-presidential-2025-03-31/",
            "upvotes": 408,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rightwingers world wide will coalesce around her as a victim of some liberal conspiracy or use this as an example of judicial tyranny.",
                "Sadly, I have to get my consequences for illegal behavior fixes from stories OUTSIDE of the US these days.",
                "Why can't the US do this to like 80% of sitting politicians, especially Dorito Man",
                "A right wing politician embezzling tax money? I'm shocked! Shocked!",
                "France holds their crooked politicians accountable, here we elect them!",
                "Again as i said yesterday VA TE FAIRE FOUTRE FASCITE.",
                "When you're an Oligarchy this doesn't happen hence the US has a felon destroying the country",
                "NOW soon to be on a lecture circuit in the USA at the invite of President  Musk",
                "I’m glad other countries prosecute this. Where is the USA?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "England to make the morning-after pill free over the counter in pharmacies",
            "external_url": "https://www.abc.net.au/news/2025-03-31/morning-after-pill-to-be-made-free-in-england-pharmacies/105116292",
            "upvotes": 3925,
            "date": "03/31/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/70a1620bfe1fbe5e102d83232cfb9d53?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=229&width=862&height=485&imformat=generic",
            "top_comments": [
                "These are actual \"freedom seeds\". Bravo UK.\n\nEdit: A word",
                "Amazingly great news! The seems to actually realize this is a health issue for women! Geez",
                "This rampant subsidising of medicine or making it free, currently happening in the UK and Australia (and hopefully elsewhere) must be driving the CEOs of American big pharma absolutely bananas. Will someone please think of the rich people for once!",
                "It's been free and over-the-counter in France for a good long while now. It's a step in the right direction but there are still, after all this time, quite a few stories running around of pharmacist trying to shame women who needs it when they ask for it or pharmacist dropping nice little holier-than-you speeches about how this is not a contraception method, etc.",
                "Smart. A lot safer and cheaper than abortion. Like many preventative programs, this should become cost effective even with a small number of prevented cases.",
                "Good cheaper than kids no one wants and people on benefits",
                "there's no reason this shouldn't be freely available everywhere.",
                "Surplus humanity prevention",
                "IT should be free at every hourly motel",
                "I wish Prep and Aciclovir was over the counter where I live."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "'Sobering statistic:' One-fifth of pollinators in North America at extinction risk",
            "external_url": "https://www.thecanadianpressnews.ca/national/sobering-statistic-one-fifth-of-pollinators-in-north-america-at-extinction-risk/article_d800e96c-3487-527c-8f0d-85d8067dae5d.html",
            "upvotes": 1194,
            "date": "03/31/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/9/20/9207af32-056c-5808-a73c-bea834ef9860/67e924471c9e8.image.jpg?crop=1400%2C735%2C0%2C88&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If you have a yard, planting things that are native to your area makes a huge difference.\n\nNative flowers feed native bees, and native leafy plants feed native caterpillars. Plus, you can grow a beautiful garden in the process.",
                "I’m from the middle east, and just recently spoke to a 20 something person who was never stung, and didn’t ever had significant contact with bees. I knew bees populations were declining, but it just shows how much the basic experience changed over a few decades. \n\nJust think about it, some people had no experience with bees and only know about them from the bee movie memes.",
                "Honeybees are not the pollinators the wilderness needs, they are cattle who partially takeover after the native bees are decimated.",
                "I think it's mites killing the bees and not enough natural mite toxic plants around for bees to crawl on. I have to get a new queen this year... and I am going to plant lots of Lavender and Thyme around the hive. My hope is that the bees track enough of the oils from these plants through the hive that they will have fewer mites.",
                "We need a Fertilization President to fix this ",
                "For start: How about fully banning neonicotinoids ?",
                "[removed]"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "RISING",
            "title": "Health insurance CEO fired after admitting to hiring private investigators to dig up dirt",
            "external_url": "https://news4sanantonio.com/news/local/health-insurance-ceo-fired-after-admitting-to-hiring-private-investigators-to-dig-up-dirt-austin-texas-house-committee-ken-paxton-background-checks",
            "upvotes": 3926,
            "date": "03/31/2025",
            "thumbnail": "https://news4sanantonio.com/resources/media2/16x9/1086/986/0x25/90/6f857249-5724-499e-80fc-66b9ad5e8aef-sanders.jpg",
            "top_comments": [
                "Only got fired because he spoke about hiring private investigators and not the action it self.",
                ">AUSTIN, Texas - Mark Sanders, the CEO of Superior HealthPlan, was dismissed from his position following revelations that his company had hired private investigators to gather personal information on customers, journalists, and even lawmakers.\n\n>The dismissal came just days after Sanders testified before the Texas House Committee on the Delivery of Government Efficiency, where he confirmed that private investigators had been hired to surveil individuals with the goal of uncovering sensitive details.\n\n>In a statement to The Dallas Morning News, Centene Corporation, the parent company of Superior HealthPlan, expressed its disapproval of the actions taken by Sanders.\n\n>“The conduct highlighted during the Texas House Committee hearing is not reflective of our values, nor is it a practice Centene’s current leadership condones,” the statement read. “To this end, Mark Sanders is no longer with our organization.”\n\n>Following Sanders’ testimony, Texas Attorney General Ken Paxton’s office confirmed that an investigation into the matter had been launched.\n\n>The controversy erupted during a meeting of the House Committee on the Delivery of Government Efficiency, which was initially focused on the state’s procurement process for managed care organizations like Superior HealthPlan. Committee Chair Giovanni Capriglione, a Republican from Southlake, was quick to confront Sanders about the company’s use of taxpayer funds to hire private investigators.\n\n>“I don’t think what any of us expected was for a health insurance company, funded mostly by Texas taxpayer dollars, to use some of those funds to hire private investigators,” Capriglione said. He pointed to one particular instance in which investigators were allegedly hired to follow a mother whose child had been denied medical care, exacerbating the child’s condition.\n\n>When Capriglione asked Sanders directly if investigators had been employed to dig into the backgrounds of customers, government officials, and even a reporter, Sanders admitted to the practice. He explained that the goal was to learn more about the individuals with whom the company interacted, a justification that was met with scorn from Representative Matt Tinderholt.\n\n>“You wanted leverage, and you thought that you were going to use it,” Tinderholt responded, adding, “I dare you to investigate me. Do it, and bring it.”\n\n>In a subsequent press release, Attorney General Paxton’s office suggested that the actions might amount to potential blackmail intended to secure state contracts or avoid paying legitimate medical claims. The investigation, Paxton stated, would determine if any illegal activity had occurred.\n\nSaved you a click",
                "*“You wanted leverage, and you thought that you were going to use it,” Tinderholt responded, adding, “I dare you to investigate me. Bring it on.\"* \n\nThe company that is funded, in large part, by tax payers, hires private detectives to spy on patients so that it doesn't have to pay out their medical claims.",
                "I wish I was surprised - there are no limits to which disgusting people won't sink for money",
                "Good on the Texas politicians for calling out this s°°t.\n\nIf you're a corrupt rich businessman you know you done f°°°°d up when even the government officials of a very solid red, right wing, pro-business state quickly call you out on your BS and promise to investigate you for corruption.",
                "When health insurance is motivated by profit and increasing value to shareholders, then the good and health of the patients goes by the wayside. This is why we need universal healthcare.",
                "He just got caught. His actions are not an exception.",
                "Not what I expect from a committee with that name in that state under that leadership, but good on them.",
                "Things went really bad when greedy socialpaths became the new norm quite a while back for ceo",
                "They're in precarious positions"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr. to gut vaccine promotion and HIV prevention office, sources say",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-to-gut-vaccine-promotion-and-hiv-prevention-office-sources-say/",
            "upvotes": 9008,
            "date": "03/31/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/12/3e63165d-7ccb-4b61-a050-cc125f93736d/thumbnail/1200x630/f07246da884c5f45f976525f454cebad/gettyimages-2196040392-1.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "It's just insane.  People are going to die because of the wholesale incompetence of Trump and his merry band of lunatics.",
                "Makes sense to stop promoting vaccines when you're going to ban them all inevitably.\n\nBut hey, baby coffin stocks are up! God's plan!",
                "The wrong Kennedy was lobotomized.\n\nEdit: Just an FYI - this is not a joke about JFK. See Rosemary Kennedy for more details.",
                "Fucking brain worms Kennedy. \nAnd seriously,\n Elon musk is a bitch.\n\nFuck that guy. ",
                "Kinda sounds like Republicans are trying  to remove themselves from the equation lol. Antivaxxers are pretty overwhelmingly conservative right?\n\nWhat the fuck angle are they even trying to push?",
                "Those who fail to learn from history -- something, something\n\n\"It’s true that (Mike) Pence faced an HIV outbreak while he was the governor, and that he eventually allowed a needle exchange. But his revisionist history misrepresents his role in what transpired in the small town of Austin, Indiana five years ago, where over 200 people were infected with HIV. What happened is that Pence failed to act in response to increasingly urgent signs of a significant HIV outbreak, and he delayed implementation of vital public health measures. Among public health experts, the Indiana outbreak is considered a failure of state response, and an example of how poor political leadership can actually make a crisis worse.\" 🏌️‍♂️⛳",
                "Everyone just be careful. We’re dealing with massive amounts of misinformation and lack of education, it’s going to get ugly. Do what you can to keep you and yours safe. ",
                "Hates vaccines but stuck dirty heroin needles in his fucking arm for a decade and a half.\n\nWhy is he our secretary of health again?",
                "I'm honestly worried that this is going to mean that vaccines are going to become ridiculously expensive, and even people with insurance are going to have to pay out of pocket because they aren't covered anymore. \n\nPoor people aren't going to be able to qualify to have their kids vaccinated for free or at a reduced rate.",
                "A fucking moron shouldn't be allowed to make medical decisions"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin Supreme Court rejects effort to block Musk's $1M giveaways",
            "external_url": "https://abcnews.go.com/US/wisconsin-supreme-court-rejects-effort-block-musks-1m/story?id=120319945",
            "upvotes": 23106,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8185a658-62ad-4477-94cb-3632d33c8c22/GettyImages-2207708465_1743393303641_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "The money has already won.",
                "Can’t give a bottle of water to someone waiting in line to vote in Georgia.  I hate this country",
                "Has the decision been published somewhere? I'm struggling to understand how the court would rule this way.",
                "Money is a hell of a drug",
                "So the George Soros shit no actual proof, but when it actually happens with Elon, silence from Republicans.  Sounds about right.",
                "Fuck that guy. Money doesn't make you right, Ellen.",
                "What stops from democrats doing this? They should go ahead.",
                "They love purchased elections.",
                "Musk is spending that money in an effort to influence the election of Wisconsin supreme court justices.  Talk about a conflict of interest.  I hope that Wisconsin voters won't allow that corruption to prevail.",
                "It’s time to put an end to this shit. I can’t believe he bought a presidency, and now he’s buying states elections. **WHAT THE FUCK???**"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Minnesota officials seek answers in case of graduate student detained by ICE",
            "external_url": "https://apnews.com/article/university-of-minnesota-graduate-student-detained-38e5ac3681b3d5e2c9d82ae40f9ae7f9",
            "upvotes": 3812,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kidnapped. She was kidnapped.",
                "[removed]",
                "This is like the Red Scare, where if you protest against Israel military action in Gaza, or are at some protest where someone says \"from the river to the sea\" that gets turned into \"you support Hamas\"\n\nNo one knows why this person is detained, but that's the basic theme lately",
                "I feel like these peaceful protests are going to get a lot less peaceful",
                "Last time these kind of thing happened in my country, next thing is dead bodies suddenly appear in the dead of night, abandoned in public square to intimidate people or being fond decade later in mass graves, not saying this will happen in US but it never end well for anyone.",
                "\"seeking answers\" seems like way too mild a response.",
                "Tomorrow's headline: \"Minnesota Officials Detained By ICE\".",
                "You want a brain-drain?  This is how you get one.  And considering how shit our own homegrown students are, we just fucked ourselves really badly.",
                "Party of free speech moment.\n\nI’m guessing the student wrote an article about Palestinians being bombed and said it’s bad. That’s basically being a member of hamas though according to what the pretty lady on fox said.",
                "If you have a green card you can legally purchase a firearm. Could come in handy when unidentified masked people try and kidnap you."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "United Airlines Flight Hit by Kite Near Washington DC",
            "external_url": "https://aviationa2z.com/index.php/2025/03/30/united-airlines-flight-hit-by-kite-near-washington-dc/",
            "upvotes": 2115,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm going to go out on a limb here and say that I don't think this was a smart thing for the kite flyer to do.",
                "What ISN’T hitting airplanes right now? Besides submarines.",
                "There was a kite festival for the cherry blossoms and some idiot must have not felt like fighting the traffic to get over to the Washington Monument… it’s impossible to not know that Gravelly Point is a terrible place to fly a kite.",
                "[United CEO this week.](https://youtu.be/lm8fYf53SMg)",
                "So guess the lesson of the year thus far is don’t fly into DC, right?",
                "I would have thought the plane hit the kite as opposed to the kite hitting the plane. Also can’t imagine there was much left of the kite to be returned to the kite flyer and family.",
                "Why’s it always DC? I have to fly there soon. I’d rather fly into a nearby state and just drive over",
                "> Witnesses, including travel analyst Jamie Larounis, observed multiple kites in the air before the incident.\n\nDC is absolute chaos right now for cherry blossom season, so I'm not surprised.",
                "Charlie Brown, you blockhead!",
                "Folks always fly kites there. I’m surprised it hasn’t happened before."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 7100,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "When my sons needed more invasive dental work and needed to fully go under, they had to first pass a physical exam by their pediatricians, and the procedure was done in an actual HOSPITAL, with a pediatric anesthesia specialist overseeing the surgery and plenty of help immediately hand in case anything went wrong.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "I think back often to an interview I heard with an anesthesiologist, a very philosophical man who took great pride in his work.  He said that his job was essentially to kill his patients and then bring them back to life.  Anesthesia involves processes that would otherwise cause the body to die, but with him there, was his role to manual manage the functions of the body that would otherwise cease.\n\nIt's serious shit.",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "Just tragic\n\nHer poor family too"
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "03/31/2025 12:16:07 UTC"
}