{
    "posts": [
        {
            "category": "HOT",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 14694,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/14bf/live/25cd65b0-ff4c-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "The sinking of a boat was what got the US involved in both world wars. \n\nA shame the only balls Trump has are the set in his mouth, attached to Putin.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "I’m no conspiracy theorist but the coincidences here are astounding. Hope this guy doesn’t mysteriously die in custody.",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Trump is going to pardon him and send him on his way to Russia.  Also a nice apology letter for wrecking a Russian ship.",
                "Russians and boats don’t seem to mix well."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 2138,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Good. Republicans are getting what they voted for. If they don’t like it maybe pay attention to politics in the future.",
                "I’d love it if California could create its own trade agreements with the EU. Not sure if that’s possible but if we can we should",
                "Please, all, may we have some more? Fuck the red states.",
                "Heheh… take that Florida and Idaho and Iowa.",
                "Grab ‘em by the Republicans.",
                "The problem is that the more you punish them, the more they want to make it miserable for everyone else in the country. That’s what we’re up against. People who are in shitty circumstances (whether their own making or not), and instead of wanting to improve their own situation, they want to tear others down to their level. These tariffs will make them more miserable, thus they’ll want to see everyone else feel that way too."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "US Military cancels climate change studies that Pentagon chief calls 'crap'",
            "external_url": "https://www.reuters.com/world/us/us-military-cancels-climate-change-studies-that-pentagon-chief-calls-crap-2025-03-10/",
            "upvotes": 9789,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Pretty sure for 2 decades or so DoD has said climate change is one of our biggest threats.",
                "It's fine, it's not like climate change ruins crop growth, which fluffs up food production, which elevates food prices, which causes civil unrest, which causes social-political collapse, which overthrows regimes.\nEG Syria.",
                "A Secretary of Defense that achieved a high rank in the military would have finished required studies and known how important this issue is towards geopolitics going forward.  Our country is run my idiots that think they know everything.",
                "Save 30 million, lose 100 billion. Math is mathing.\n\n\n\"In 2023, the United States experienced 28 separate weather or climate disasters that each resulted in at least $1 billion in damages. Damages from the 2023 disasters totaled $92.9 billion.\"",
                "\"If you ignore the problem, it will just go away.\"\n\n- Alberto Einstein",
                "I'm sure he came to that conclusion based on a thorough review of the available literature, conference proceedings, analysis of the raw data, and discussion with academic experts who have spent decades studying the topic.",
                "Most unqualified Sec of Defense in history.",
                "In the future, any Americans devastated due to climate change have full rights to pillage the homes of rich fucks who denied it.",
                "Literally a DEI hire generic white dude lmao",
                "it's truly one of the most pathetic sins of our species that the global powers seemed to, in as brief of a space as about five years, go from denying climate change-- to saying it's real but admitting they simply wont be doing anything."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "upvotes": 2088,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c4d/live/c42f5a20-ff32-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "\"Scrutiny is growing over whether flying thousands of them across the world, and the infrastructure required to host them, is undermining the cause.\"\n\nNo shit.",
                "Genius idea. Absolutely flawless with the PR and optics on this one. \n\nAlmost if you could had this meeting, literally anywhere else with road access but no, let’s build a brand new road and destroy trees and the eco system.\n\nSome times I could swear people have their last two brain cells fighting it out for third place.",
                "I thought this was posted in r/nottheonion",
                "Remind me why people can't just zoom or video call to these things? Why do they HAVE to be there physically?",
                "A road paved with irony.",
                "How do these people know when to inhale and exhale?",
                "Just as bad when everyone flies their private jets to a climate summit and not just do a zoom meeting.",
                "Sacrifice and rules and laws and limits for the littles and the poors, for those on the 'commanding heights' only the most opulent consumption, destruction, waste and gluttony.  \n\nThere should be - but aren't - real karmic-level consequences and cost to this kind of hypocrisy and and betrayal for those who perpetrate it and those who profit from it.  \n\nMost of the actual agenda and action I see on 'climate change' and 'sustainability' is focused on profiting from it while consolidating power and wealth and resources.  \n\nShame and retribution!  ",
                "🤦‍♂️We are speedrunning the demise of life on this planet",
                "anytime I hear climate summit or like g20 meeting or paris accord or whatever...I just feel like taxpayers pay a bunch of douchebags to fly somewhere and waste their time and our money then do absolutely nothing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 39144,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "From the contacts I know at the Dept of Ed, the compliance department has been more or less decimated, and the ombudsman's office has also taken a massive hit if not completely destroyed as well. \n\nThese departments served as guide rails, keeping people on track and providing accountability. Things are going to get very very messy.\n\nDepts with firings: \n\n • National Center for Education Statistics\n\n • Institute of Education Sciences\n\n • Federal Student Aid\n\n • Office for Civil Rights\n\n • Office of Postsecondary Education \n\n • Office of General Counsel Ethics Division\n\nBoston, New York, Atlanta, Chicago, Cleveland, Dallas, San Francisco have been abolished.  The offices spared are Denver, Kansas City, Seattle and DC Metro. DOED Office for Civil Rights\n\nOver 1800 people gone. \n\nThis is gonna have a MASSIVE down stream impact on K-12, Hs, and college level Education, data, compliance, and special education programs. \n\nPeople aren't really aware of what this will do. It's like being on a plane 20000ft jn the air and ripping out random wires because you dont think you need them.",
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "Time out. Less than 4000 people work at DOE?",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "I didn’t realize the Ed Dept was that small, less than 4,000 people? You always hear about how the DoD is 1.3 million civilians and the VA is 435,000. But the entire Ed Dept is 4,000 people? TIL."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 567,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "Exhibit ‘too many to count’ why I’ll never support death penalty",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy.",
                "Idiot prosecution. Very unfortunate for her.\n\n\nBut killing a man and shoving a lamp down his throat? Can that really be self defense? He was probably unconscious when she lamped him. Why not just walk out when he is unconscious?",
                "Wow... Usually Texas can't wait to kill prisoners. You'd swear it's a fetish the way they make such liberal use of the death penalty. Plenty of executed inmates have later been proven to be innocent as the cherry on top. Cops and prosecutors hiding evidence from the defense is pretty much to be expected in Texas. \n\nFor this woman to have survived almost 30 years, and then managed to get the 5th Circuit, known for making shit up whole cloth to justify decisions, to overturn her conviction are two very impressive feats. Her lawyer must be damn good.",
                "Holy shit, 27 years... So much for a speedy trial and execution."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Australia will not be imposing reciprocal tariffs on the US, says PM Anthony Albanese",
            "external_url": "https://www.sbs.com.au/news/article/australia-wont-be-exempt-from-us-tariffs-on-steel-and-aluminium-exports/oos69k7eq",
            "upvotes": 4714,
            "date": "03/12/2025",
            "thumbnail": "https://images.sbs.com.au/dims4/default/5703497/2147483647/strip/true/crop/4907x2760+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F64%2Fd0%2Fa2287b944dff82c452ee8dffe4d6%2F20241213183308566713-original.jpg",
            "top_comments": [
                "Watch out, that’s like an open invitation for annexation",
                "In 2024, the United States imported $16.7 billion worth of goods from Australia, with the top commodities being agricultural products, stone, glass, metals, and pearls, and chemicals, plastics, rubber, and leather goods. The U.S. has a trade surplus with Australia, meaning it exports more goods and services to Australia than it imports. \n\nThere are no incentives for Australians to add tariffs.",
                "Probably because he knows it isn’t worth it. Australia isn’t like Canada, who can actually do some damage in a trade war with the U.S. Australia’s economy isn’t as interlinked with the U.S.",
                "Just ban Tesla sales for national security, or impose huge tariffs on them. Ooh and make a big show of banning Trump from visiting outside of official duties effective in 4 years (or do whatever you want, I'm just spit balling here)",
                "When I googled \"what does Australia export to the usa\"\n\nAustralia's largest exports to the US are financial services, gold, sheep/goat meat, transportations services and vaccines. US direct investment in Australia is more than in any other country in the Indo-Pacific.\n\nI think Australia will be fine.",
                "I get it that Australia has to keep Trump happy because they’re hanging on to this sliver of hope that the US will protect them if China attacks. But as a Canadian I couldn’t be happier with how our government on all levels has responded, straight aggression, none of this appeasement shit.",
                "Careful Australia. Give Trump an inch and he takes it all.",
                "Why have tariffs when you can just boycott American goods like the rest of us?",
                "No need to reciprocate when you can get everything you need elsewhere.",
                "Right. No Bluey for you. Two years."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Musk launches appeal to restore $56 billion Tesla payday",
            "external_url": "https://www.reuters.com/business/autos-transportation/musk-launches-appeal-restore-56-billion-tesla-payday-2025-03-11/",
            "upvotes": 26119,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I would like you to pay me 56 billion dollars while I am actively tanking the company's value\" is an interesting pitch ...",
                "> Musk has said that he wants a greater stake in Tesla or he might develop products outside of the company.   \n   \nAh yes, threatening your own company.",
                "They should ask him to name 5 things he did for the company last week.",
                "Hey guys I’m gonna need that money before I completely destroy the brand with my evil actions",
                "Has he seen the stock price?",
                "He admitted that while running Doge, he is running his companies with \"great difficulty\"\n\nWhy would shareholders reward a CEO who is having \"great difficulty\" running their company?",
                "I highly doubt shareholders would support him now if they were to vote on it again. He's lost the shareholders billions.",
                "Elon, do you little salute again, maybe that will fix things",
                ">When Elon Musk came to the White House asking me for help on all of his many subsidized projects, whether it's electric cars that don't drive long enough, driverless cars that crash, or rocket ships to nowhere, without which subsidies he'd be worthless and telling me how he was a big Trump fan and Republican, I could have said, 'drop to your knees and beg,' and he would have done it…\n\n[Donald Trump, Jul 12, 2022.](https://www.google.com/search?q=%22When%20Elon%20Musk%20came%20to%20the%20White%20House%20asking%20me%20for%20help%20on%20all%20of%20his%20many%20subsidized%20projects%2C%20whether%20it%27s%20electric%20cars%20that%20don%27t%20drive%20long%20enough%2C%20driverless%20cars%20that%20crash%2C%20or%20rocket%20ships%20to%20nowhere%2C%20without%20which%20subsidies%20he%27d%20be%20worthless%20and%20telling%20me%20how%20he%20was%20a%20big%20Trump%20fan%20and%20Republican%2C%20I%20could%20have%20said%2C%20%27drop%20to%20your%20knees%20and%20beg%2C%27%20and%20he%20would%20have%20done%20it%E2%80%A6%22%20-Donald%20Trump)",
                "He should not buy a Tesla unless it’s in Canada and he buys two a minute"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 4715,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "If there is a hell Andrew Wakefield will feel the pain of every single disease his bogus \"research\" caused",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "A plague hitting the Bible belt is peak 2025 irony"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "China, Russia, Iran to hold nuclear talks in Beijing on Friday",
            "external_url": "https://www.reuters.com/world/china-hold-meeting-with-russia-iran-iranian-nuclear-issue-2025-03-12/",
            "upvotes": 816,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well it's a good thing we killed our own nuclear agreement with Iran so that they could find a new agreement with more stable regimes. \n\nThis started off as sarcasm but I don't know what's parody and what's real life anymore.",
                "Poland and Germany are also looking to start their nuclear programs to deter Russia. \n\n\nCountries that get nukes don't get invaded. ",
                "Nightmare blunt rotation.",
                "One piece of journalism I didn’t wish to hear today.",
                "Trump mad yet that Putin didn't invite him?",
                "Lol first getting booted from the nato table for talking shit and now friendzoned by the new buddies. \n\nI think they don‘t like the US proposal to half all military spending.",
                "Trumps so mad he’s not invited.",
                "There we go - Trump is already cut out of his new super cool friends club. \n\nDumb fuck. No surprise here. ",
                "Oh that's just China and Russia flexing their new world order and showing that big bad USA has been broken and is now just a marginalized country with no friends that can be ignored and brushed aside when making decisions about how the global order is going to be run.",
                "Trump's America is shunned by everyone."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "German spy agency concluded COVID virus likely leaked from lab, papers say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/german-spy-agency-concluded-covid-virus-likely-leaked-lab-papers-say-2025-03-12/",
            "upvotes": 9,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cheating scandal shocks ski jumping, topples Olympic champions and shakes Norway's lofty reputation",
            "external_url": "https://apnews.com/article/ski-jumping-norway-cheating-scandal-fb1e88e41298a917f9d80406bfeb2bc0",
            "upvotes": 10,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 44,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. "
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Astronauts launching to space will finally relieve the pair who flew on Boeing's troubled capsule",
            "external_url": "https://www.nbcnews.com/science/space/astronauts-space-station-launch-nasa-boeing-return-rcna194880",
            "upvotes": 203,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250307-spacex-nasa-ISS-crew-10-mn-0905-582721.jpg",
            "top_comments": [
                "will “hopefully” relieve\n\nI have zero faith in any of these groups anymore.",
                "They're *still* up there?",
                "I cannot imagine anyone thinking space travel is a good idea with Trump in office and President Musk bulldozing our institutions.  What happens when NASA ceases to function, with no funding and no leadership, while these people are living in a failing structure miles from Earth?  \n\nYeah.  This sounds like a failure waiting to happen.",
                "Standing by for what happens when they return to Earth. I expect Trump will brag he had to rescue them because Biden had stranded them on purpose. Now, when the decision was made for them to extend their stay and return the malfunctioning Boeing brick unmanned, it was stated at  that time they would return in March 2025.",
                "These astronauts did not Boeing back to Earth. ",
                "With Space X being involved.... anyone else concerned about the whole, Space X launches keep exploding... issue?",
                "Yeah, SpaceX is doing it. \n\nMeaning, in some way, shape, or form, Elson Mursk can take credit for this.",
                "I just want to know the financial compensation",
                "Biden admiralty didn’t allow Elon to rescue them because it would have been a political win for them candidate Trump.   That’s criminal and disgusting",
                "Good call but timing is suspicious with Space X  being involved after 9 months ,"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 569,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "Exhibit ‘too many to count’ why I’ll never support death penalty",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy.",
                "Idiot prosecution. Very unfortunate for her.\n\n\nBut killing a man and shoving a lamp down his throat? Can that really be self defense? He was probably unconscious when she lamped him. Why not just walk out when he is unconscious?",
                "Wow... Usually Texas can't wait to kill prisoners. You'd swear it's a fetish the way they make such liberal use of the death penalty. Plenty of executed inmates have later been proven to be innocent as the cherry on top. Cops and prosecutors hiding evidence from the defense is pretty much to be expected in Texas. \n\nFor this woman to have survived almost 30 years, and then managed to get the 5th Circuit, known for making shit up whole cloth to justify decisions, to overturn her conviction are two very impressive feats. Her lawyer must be damn good.",
                "Holy shit, 27 years... So much for a speedy trial and execution."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump administration halts $1 billion program that keeps aging affordable housing livable",
            "external_url": "https://apnews.com/article/trump-doge-affordable-housing-preservation-crisis-de27d7846271779157550fcec0a78ea6",
            "upvotes": 121,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Remember that cruelty is the point. Or, in the aims of Project 2025, to enshittify the infrastructure to the point that people clamor for private services to take over. And at that point private services will charge more for an inferior service.",
                "Step 1:  let affordable housing degrade so badly that it becomes unlivable.\n\nStep 2:  come out and say how badly government is at maintaining such housing.\n\nStep 3:  evict everyone out of said housing because it is not livable.\n\nStep 4:  sell to private equity real estate firms for pennies on the dollar.\n\nStep 5:  convert to low-end apartments and charge a fortune for rent.",
                "When the economy takes the nosedive its expected to, this bullshit austerity will hurt a whole lot more.",
                "Are groceries cheaper yet?",
                "HUD is such a woefully underfunded and maligned Department as it is. And they’re hacking away at it. \n\nThey’re taking crumbs off a dude’s stale crust.",
                "I don't see an issue.  Weren't we all born to rich parents who paid for our education and giving us millions to live on?",
                "We are going to be in an apocalyptic wasteland. MAGA will still be riding around with trump flags and still yelling about the (now all deceased/enslaved) liberals."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Oklahoma State Department of Health reports first 2 measles cases",
            "external_url": "https://www.kosu.org/health/2025-03-11/oklahoma-state-department-of-health-reports-first-two-measles-cases",
            "upvotes": 96,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oklahoma. Tornadoes, dust storms and now measles! Not to mention, flat as a board with no topography at all. Exciting state! ( This message brought to you by Oklahoma dept of tourism)",
                "Red states - 2\n\nBlue states - 0\n\nI have seen this movie before",
                "Don't worry folks, they'll pray the measles away...",
                "According to RFk, we should all get measles. So this is all according to plan with this new administration",
                "I'm getting 2020 vibes\\*\n\n  \n^(\\*1 star, would not recommend..)",
                "Idiocy is self regulating."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 2134,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Good. Republicans are getting what they voted for. If they don’t like it maybe pay attention to politics in the future.",
                "I’d love it if California could create its own trade agreements with the EU. Not sure if that’s possible but if we can we should",
                "Please, all, may we have some more? Fuck the red states.",
                "Heheh… take that Florida and Idaho and Iowa.",
                "Grab ‘em by the Republicans.",
                "The problem is that the more you punish them, the more they want to make it miserable for everyone else in the country. That’s what we’re up against. People who are in shitty circumstances (whether their own making or not), and instead of wanting to improve their own situation, they want to tear others down to their level. These tariffs will make them more miserable, thus they’ll want to see everyone else feel that way too."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "US annual inflation rate in February remains relatively stable at 2.8%",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/februrary-inflation-rate",
            "upvotes": 435,
            "date": "03/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e84a87963931440eadb434b71cd5fc183568b25d/0_63_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d1a602151fbbf6453ca3092e3248922f",
            "top_comments": [
                "Tariffs just got implemented today. I expect the next CPI report will show inflation ticking up.",
                "No one is buying anything in case the economy crashes.  With the tariffs no one is buying a car so inflation may not jump how we expect.",
                "March's report will be fun.",
                "Thank you, President Biden, for turning the economy around during your 4 years.",
                "The CPI comes from the Bureau of Labor Statistics. Shouldn't we be looking at any figures coming from a federal bureau with deep skepticism at this point?",
                "How long til they start cooking the books though?",
                "Any word on all the Republicans who gnashed their teeth for 4 years about how prices needed to be lowered back to what they were in 2019?",
                "Lame street media hides the detail inside the article. “Relatively stable” in the headline. \n\nHeadline could have also said that inflation has dropped from the same time last year since that’s what the underlying article states.",
                "I work for a company that does logistics and warehouse management globally. In a call with executives just yesterday we were told we're being asked by our customers if we can decrease our prices to help the increase in cost of operations they are seeing and they expect from tariffs. March and April will be ugly numbers-wise.",
                "The report also indicated that the current and future tariffs do not factor in to the February numbers."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "upvotes": 2092,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c4d/live/c42f5a20-ff32-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "\"Scrutiny is growing over whether flying thousands of them across the world, and the infrastructure required to host them, is undermining the cause.\"\n\nNo shit.",
                "Genius idea. Absolutely flawless with the PR and optics on this one. \n\nAlmost if you could had this meeting, literally anywhere else with road access but no, let’s build a brand new road and destroy trees and the eco system.\n\nSome times I could swear people have their last two brain cells fighting it out for third place.",
                "I thought this was posted in r/nottheonion",
                "Remind me why people can't just zoom or video call to these things? Why do they HAVE to be there physically?",
                "A road paved with irony.",
                "How do these people know when to inhale and exhale?",
                "Just as bad when everyone flies their private jets to a climate summit and not just do a zoom meeting.",
                "Sacrifice and rules and laws and limits for the littles and the poors, for those on the 'commanding heights' only the most opulent consumption, destruction, waste and gluttony.  \n\nThere should be - but aren't - real karmic-level consequences and cost to this kind of hypocrisy and and betrayal for those who perpetrate it and those who profit from it.  \n\nMost of the actual agenda and action I see on 'climate change' and 'sustainability' is focused on profiting from it while consolidating power and wealth and resources.  \n\nShame and retribution!  ",
                "🤦‍♂️We are speedrunning the demise of life on this planet",
                "anytime I hear climate summit or like g20 meeting or paris accord or whatever...I just feel like taxpayers pay a bunch of douchebags to fly somewhere and waste their time and our money then do absolutely nothing."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 2136,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Good. Republicans are getting what they voted for. If they don’t like it maybe pay attention to politics in the future.",
                "I’d love it if California could create its own trade agreements with the EU. Not sure if that’s possible but if we can we should",
                "Please, all, may we have some more? Fuck the red states.",
                "Heheh… take that Florida and Idaho and Iowa.",
                "Grab ‘em by the Republicans.",
                "The problem is that the more you punish them, the more they want to make it miserable for everyone else in the country. That’s what we’re up against. People who are in shitty circumstances (whether their own making or not), and instead of wanting to improve their own situation, they want to tear others down to their level. These tariffs will make them more miserable, thus they’ll want to see everyone else feel that way too."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Astronauts launching to space will finally relieve the pair who flew on Boeing's troubled capsule",
            "external_url": "https://www.nbcnews.com/science/space/astronauts-space-station-launch-nasa-boeing-return-rcna194880",
            "upvotes": 204,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250307-spacex-nasa-ISS-crew-10-mn-0905-582721.jpg",
            "top_comments": [
                "will “hopefully” relieve\n\nI have zero faith in any of these groups anymore.",
                "They're *still* up there?",
                "I cannot imagine anyone thinking space travel is a good idea with Trump in office and President Musk bulldozing our institutions.  What happens when NASA ceases to function, with no funding and no leadership, while these people are living in a failing structure miles from Earth?  \n\nYeah.  This sounds like a failure waiting to happen.",
                "Standing by for what happens when they return to Earth. I expect Trump will brag he had to rescue them because Biden had stranded them on purpose. Now, when the decision was made for them to extend their stay and return the malfunctioning Boeing brick unmanned, it was stated at  that time they would return in March 2025.",
                "These astronauts did not Boeing back to Earth. ",
                "With Space X being involved.... anyone else concerned about the whole, Space X launches keep exploding... issue?",
                "Yeah, SpaceX is doing it. \n\nMeaning, in some way, shape, or form, Elson Mursk can take credit for this.",
                "I just want to know the financial compensation",
                "Biden admiralty didn’t allow Elon to rescue them because it would have been a political win for them candidate Trump.   That’s criminal and disgusting",
                "Good call but timing is suspicious with Space X  being involved after 9 months ,"
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "RISING",
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "upvotes": 2092,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c4d/live/c42f5a20-ff32-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "\"Scrutiny is growing over whether flying thousands of them across the world, and the infrastructure required to host them, is undermining the cause.\"\n\nNo shit.",
                "Genius idea. Absolutely flawless with the PR and optics on this one. \n\nAlmost if you could had this meeting, literally anywhere else with road access but no, let’s build a brand new road and destroy trees and the eco system.\n\nSome times I could swear people have their last two brain cells fighting it out for third place.",
                "I thought this was posted in r/nottheonion",
                "Remind me why people can't just zoom or video call to these things? Why do they HAVE to be there physically?",
                "A road paved with irony.",
                "How do these people know when to inhale and exhale?",
                "Just as bad when everyone flies their private jets to a climate summit and not just do a zoom meeting.",
                "Sacrifice and rules and laws and limits for the littles and the poors, for those on the 'commanding heights' only the most opulent consumption, destruction, waste and gluttony.  \n\nThere should be - but aren't - real karmic-level consequences and cost to this kind of hypocrisy and and betrayal for those who perpetrate it and those who profit from it.  \n\nMost of the actual agenda and action I see on 'climate change' and 'sustainability' is focused on profiting from it while consolidating power and wealth and resources.  \n\nShame and retribution!  ",
                "🤦‍♂️We are speedrunning the demise of life on this planet",
                "anytime I hear climate summit or like g20 meeting or paris accord or whatever...I just feel like taxpayers pay a bunch of douchebags to fly somewhere and waste their time and our money then do absolutely nothing."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 570,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "Exhibit ‘too many to count’ why I’ll never support death penalty",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy.",
                "Idiot prosecution. Very unfortunate for her.\n\n\nBut killing a man and shoving a lamp down his throat? Can that really be self defense? He was probably unconscious when she lamped him. Why not just walk out when he is unconscious?",
                "Wow... Usually Texas can't wait to kill prisoners. You'd swear it's a fetish the way they make such liberal use of the death penalty. Plenty of executed inmates have later been proven to be innocent as the cherry on top. Cops and prosecutors hiding evidence from the defense is pretty much to be expected in Texas. \n\nFor this woman to have survived almost 30 years, and then managed to get the 5th Circuit, known for making shit up whole cloth to justify decisions, to overturn her conviction are two very impressive feats. Her lawyer must be damn good.",
                "Holy shit, 27 years... So much for a speedy trial and execution."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "China, Russia, Iran to hold nuclear talks in Beijing on Friday",
            "external_url": "https://www.reuters.com/world/china-hold-meeting-with-russia-iran-iranian-nuclear-issue-2025-03-12/",
            "upvotes": 819,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well it's a good thing we killed our own nuclear agreement with Iran so that they could find a new agreement with more stable regimes. \n\nThis started off as sarcasm but I don't know what's parody and what's real life anymore.",
                "Poland and Germany are also looking to start their nuclear programs to deter Russia. \n\n\nCountries that get nukes don't get invaded. ",
                "Nightmare blunt rotation.",
                "One piece of journalism I didn’t wish to hear today.",
                "Trump mad yet that Putin didn't invite him?",
                "Lol first getting booted from the nato table for talking shit and now friendzoned by the new buddies. \n\nI think they don‘t like the US proposal to half all military spending.",
                "Trumps so mad he’s not invited.",
                "There we go - Trump is already cut out of his new super cool friends club. \n\nDumb fuck. No surprise here. ",
                "Oh that's just China and Russia flexing their new world order and showing that big bad USA has been broken and is now just a marginalized country with no friends that can be ignored and brushed aside when making decisions about how the global order is going to be run.",
                "Trump's America is shunned by everyone."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US annual inflation rate in February remains relatively stable at 2.8%",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/februrary-inflation-rate",
            "upvotes": 436,
            "date": "03/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e84a87963931440eadb434b71cd5fc183568b25d/0_63_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d1a602151fbbf6453ca3092e3248922f",
            "top_comments": [
                "Tariffs just got implemented today. I expect the next CPI report will show inflation ticking up.",
                "No one is buying anything in case the economy crashes.  With the tariffs no one is buying a car so inflation may not jump how we expect.",
                "March's report will be fun.",
                "Thank you, President Biden, for turning the economy around during your 4 years.",
                "The CPI comes from the Bureau of Labor Statistics. Shouldn't we be looking at any figures coming from a federal bureau with deep skepticism at this point?",
                "How long til they start cooking the books though?",
                "Any word on all the Republicans who gnashed their teeth for 4 years about how prices needed to be lowered back to what they were in 2019?",
                "Lame street media hides the detail inside the article. “Relatively stable” in the headline. \n\nHeadline could have also said that inflation has dropped from the same time last year since that’s what the underlying article states.",
                "I work for a company that does logistics and warehouse management globally. In a call with executives just yesterday we were told we're being asked by our customers if we can decrease our prices to help the increase in cost of operations they are seeing and they expect from tariffs. March and April will be ugly numbers-wise.",
                "The report also indicated that the current and future tariffs do not factor in to the February numbers."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 14704,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/14bf/live/25cd65b0-ff4c-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "The sinking of a boat was what got the US involved in both world wars. \n\nA shame the only balls Trump has are the set in his mouth, attached to Putin.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "I’m no conspiracy theorist but the coincidences here are astounding. Hope this guy doesn’t mysteriously die in custody.",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Trump is going to pardon him and send him on his way to Russia.  Also a nice apology letter for wrecking a Russian ship.",
                "Russians and boats don’t seem to mix well."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US Military cancels climate change studies that Pentagon chief calls 'crap'",
            "external_url": "https://www.reuters.com/world/us/us-military-cancels-climate-change-studies-that-pentagon-chief-calls-crap-2025-03-10/",
            "upvotes": 9790,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Pretty sure for 2 decades or so DoD has said climate change is one of our biggest threats.",
                "It's fine, it's not like climate change ruins crop growth, which fluffs up food production, which elevates food prices, which causes civil unrest, which causes social-political collapse, which overthrows regimes.\nEG Syria.",
                "A Secretary of Defense that achieved a high rank in the military would have finished required studies and known how important this issue is towards geopolitics going forward.  Our country is run my idiots that think they know everything.",
                "Save 30 million, lose 100 billion. Math is mathing.\n\n\n\"In 2023, the United States experienced 28 separate weather or climate disasters that each resulted in at least $1 billion in damages. Damages from the 2023 disasters totaled $92.9 billion.\"",
                "\"If you ignore the problem, it will just go away.\"\n\n- Alberto Einstein",
                "I'm sure he came to that conclusion based on a thorough review of the available literature, conference proceedings, analysis of the raw data, and discussion with academic experts who have spent decades studying the topic.",
                "Most unqualified Sec of Defense in history.",
                "In the future, any Americans devastated due to climate change have full rights to pillage the homes of rich fucks who denied it.",
                "Literally a DEI hire generic white dude lmao",
                "it's truly one of the most pathetic sins of our species that the global powers seemed to, in as brief of a space as about five years, go from denying climate change-- to saying it's real but admitting they simply wont be doing anything."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Russia sceptical of US 30-day Ukraine ceasefire idea, sources say",
            "external_url": "https://www.reuters.com/world/europe/russian-lawmaker-says-any-ukraine-deal-will-be-moscows-terms-not-washingtons-2025-03-12/",
            "upvotes": 696,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hmmm....almost like Russia doesn't want to negotiate...despite Trump's constant glazing.",
                "Russia says they dont want a short term ceasefire, but even if they agree to a long term truce…what reason is there to trust them to abide by it?",
                "Ukrainians called their bluff.",
                "What's the 30 days for? I thought he'd have it solved in 24 hours?",
                "Russia preparing there suspicions for when they break the ceasefire. I feel this forced pause is just so orange man can say he found peace. Russia can rearm when trump removes sanctions, and then when it all kicks off again, trump will blame ukraine for the end to the cease fire in some false flag, then Russia will attempt to roll over ukraine again with a rearmed force.",
                "Question: Why would Russia agree to anything at this point? The more they just sit back and keep doing their little invasion, the more Trump will destabilize the entire world, which helps them. \n\nI haven’t seen one single thing Trump has done that would push Russia to the negotiating table. He’s put all the pressure on Ukraine, and glazed Russia at every possible opportunity.",
                "*Skeptical\n\nSceptic is something else entirely.",
                "Ukraine will not accept any deal that doesn't give them long-term GUARANTEED protection AND land returned. Russia will not accept any deal that gives Ukraine long-term protection and land returned. So, there will never be a deal. \n\nThe quickest way to get to some kind of solution is for the US to send a large number of \"peace keeping\" troops to move into currently held Russian areas and see what the Russians do. If they pull back, then we know they don't want that land enough to fight the US for it. If they don't pull back, then the US has its answer and can go from there. But until we know exactly what Russia is willing to do to keep that territory, we cannot negotiate with them to give anything up. They're committed to the dumbest idea ever with no exit strategy.",
                "I’m shocked. Shocked! Well not that shocked",
                "My guess is Trump will offer to remove sanctions on Russia to sweeten the deal..."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "A 4-year-old’s mom ate his ice cream. He called the cops",
            "external_url": "https://www.cnn.com/2025/03/11/us/wisconsin-boy-911-ice-cream-hnk/index.html",
            "upvotes": 344,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21448863-154124-236-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I'm so sorry, ma'am. You've raised a narc.",
                "There were no survivors.",
                "And then the kids doughnuts went missing after the cops showed up.\n\nThe case was never solved.",
                "My kid wrote a sign that said MOM JAIL when he was 3. He put it on me. My crime was telling him he did in fact have to go to bed. He then proceeded to tell me that there are no toys in jail and I would have to bring my own food. \n\nKids are savage",
                "CNN blurred the child's face in the video, but they forgot to edit the thumbnail. Idiots.",
                "She needs life without parole for that one.",
                "\"Two days later the officers obliged, surprising the young whistleblower with two scoops of ice cream topped with blue sprinkles.\".  \n\nI'm shocked it ended like this",
                "So basically they’re teaching this child that being a baby Karen brat means you get to be on TV and get ice cream. ",
                "Kid's been watching too much copaganda like paw patrol or something.",
                "So they rewarded him for calling the police for a non-emergency? I remember growing up being taught the importance of calling 911 only for an emergency and that there were consequences for wasting the police’s time with frivolous calls."
            ],
            "aggregate_sentiment": 82.0
        }
    ],
    "last_updated": "03/12/2025 18:31:06 UTC"
}