{
    "posts": [
        {
            "category": "HOT",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 6092,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "hell, the US has two doing the same thing- can they take them too?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                ">plotting sabotage\n\nIsn't that technically an act of war?",
                "was it JD and Little Marco?",
                "> the main aim was to undermine military support given by Germany to Ukraine\n\n> bombing and arson attacks on infrastructure used by the military and industrial sites in Germany\n\nHow would that undermine military support Ukraine? It would rather do the opposite and justify opposition to Russia because that kind of terrorism would be hard to defend even for Russia apologists in Germany.",
                "I bet they were in Kegseth's Signal group.",
                "In America we pronounce it “republican”",
                "We would arrest many Russian assets in the United States if we were the slightest bit interested in doing that.",
                "Sounds familiar. hmmm",
                "You mean Trump and Vance have been arrested?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 3010,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "As I said, the population may well be halved after the purges.",
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "I'm confused. I thought simply marrying an American made you a citizen? Is this a certain amount of time after marriage?",
                "What’s happening with this country?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 7404,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 7457,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "[removed]",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Literally every headline and every decision coming out of this administration is the wrong one.",
                "Due process doesn't exist for enemies of the regime"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 838,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">written before it sank\n\nI'd be more impressed if it was written on the Titanic *after* it sank",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "\"Looks cool, I'll update after I use it.\"  - Titanic review April 10, 1912.",
                "Amazing!",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "“Delete my browser history”"
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "HOT",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 1775,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Don't they own a colour printer?",
                "Trash is what you can get away with",
                "So these artworks were Banksy'd.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 7707,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Who would've thought using cheaper ingredients and charging more for them wasn't a sustainable long term business model",
                "They fucked up Del Taco. Quality plummeted when they took over, to the point where even Taco Bell is using better quality ingredients. Carl's Jr did the same shit with Green Burrito, but they never sold it they just let it completely die out. Hopefully someone buys Del Taco and puts some effort into saving them.",
                "With the loss of traditional car antenna's, it was only a matter of when",
                ">In a statement, Jack in the Box CEO Lance Tucker said, “In my time thus far as CEO, I have worked quickly with our teams to conclude that Jack in the Box operates at its best, and maximizes shareholder return potential, within a simplified and asset-light business model. Our actions today focus on three main areas: addressing our balance sheet to accelerate cash flow and pay down debt, while preserving growth-oriented capital investments related to technology and restaurant reimage; closing underperforming restaurants to position ourselves for consistent net unit growth and competitive unit economics; and, an overall return to simplicity for the Jack in the Box business model and investor story.”\n\nHe sounds like he'd be fun at parties. Fuck maximizing shareholder return. Make fucking good fast food that is affordable.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "[removed]",
                "I’ve always preferred Del Taco over Taco Bell. They better not be shutting down Del Tacos next.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "So they bought Del Taco, took the thing I liked off the menu, then sold them? This feels personal"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1030,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "But Pakistan had cancelled all trade with India a few days back.",
                "Well that’s not great.",
                "Trump: “They never would have clashed if I was president!”",
                "Don't they normally use sticks? Or was that against China?  Not joking except for the fact they used sticks is funny"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 61087,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                "God this world feels so hopeless right now. Rest in peace, Virginia.",
                "The bad guys are winning.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 1596,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> State TV said \"negligence in handling flammable materials was a contributing factor\" in the explosion.\n\nWell they aren’t claiming any sort of attack, so there’s an end to any of that kind of speculation given they’re not likely to lie or downplay such an incident otherwise.",
                "Wonder if it’s a fertilizer mishandle like Beirut?",
                "I'm going to assume it was ammonium nitrate. It's always ammonium nitrate.",
                "Smoking near rocket fuel?",
                "“The blast occurred as Iran began a third round of nuclear talks with the United States in Oman, although the cause of the explosion was not immediately clear”. Here’s a completely unrelated thing that is also happening in the region that we  added to the article for absolutely no reason. The media sucks",
                "Beirut? And 2015 China? Do no one learn from their lesson about storing and handling of chemicals at the ports??",
                "If they are so incredibly incompetent with basic explosives imagine what their gross incompetence could do with nuclear weapons",
                "\"It was just a crate of fireworks.\" \n\n-Iran regime",
                "No chance it’s a USA attack or we would have seen the slack channel about it first",
                "Hopefully it puts a dent in drone production and shipments"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Buffalo SVU detective accuses Buffalo Public Schools officials of failing to report abuse",
            "external_url": "https://www.wkbw.com/buffalo-svu-detective-accuses-buffalo-public-schools-officials-of-failing-to-report-abuse-in-viral-youtube-podcast",
            "upvotes": 52,
            "date": "04/27/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/4b1a376/2147483647/strip/true/crop/1368x718+0+28/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcf.cdn.uplynk.com%2Fause1%2Fslices%2F935%2F1020d6d1597347248f5d62c059a4c7e3%2F935a4793bee149e3988cf9f5ea5d450f%2Fposter_ec1f41d4352e412b8287ceac54cb7303.png",
            "top_comments": [
                "[This same officer was investigated by the AG for multitudes of incidents including shoving and choking teenagers](https://www.investigativepost.org/2025/02/13/richard-hy-update/?fbclid=IwY2xjawJ6fHBleHRuA2FlbQIxMQABHlnpVHfyAhMJ6gJizjHCcuggLMtjLkvZO5PFWEj0gBXxU1H37ZwvC-ike2Ll_aem_w3dH7CGfLFejt3hYY9lwMw) - he's not a credible person nor does he give a single ounce of care about \"the children.\" \n\nThe entire video and both examples he gives are nonsense with the only evidence being \"I cried on video so this is real.\" He has all of the incentive in the world to both make money from YouTube and get ahead of whatever legal issues or other repercussions coming his way so then he can claim he was persecuted for this video.",
                "the actual video mentioned the the article, [is fucking heartbreaking to watch...](https://youtu.be/4WxAfnpqvhQ?si=F1y9HaLU74l7yk3I&t=256)",
                "Buffalo detectives buffalo Buffalo Public Schools officials of failing to report buffalo"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 3011,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "As I said, the population may well be halved after the purges.",
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "I'm confused. I thought simply marrying an American made you a citizen? Is this a certain amount of time after marriage?",
                "What’s happening with this country?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Centennial considering hiring Abram Lucabaugh, ex-Central Bucks admin",
            "external_url": "https://www.phillyburbs.com/story/news/local/2025/04/25/central-bucks-centennial-school-abram-lucabaugh-moms-for-liberty-superintendent-dana-bedden-district/83276658007/",
            "upvotes": 0,
            "date": "04/27/2025",
            "thumbnail": "https://www.phillyburbs.com/gcdn/presto/2021/08/05/NBCC/12fcc409-2f96-4b46-8f14-f5e2632dfc5b-Lucabaugh_A_CBSD.jpg?crop=1499,844,x0,y420&width=1499&height=844&format=pjpg&auto=webp",
            "top_comments": [
                "You read it that way for a second too...\n\nJust admit it."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 841,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">written before it sank\n\nI'd be more impressed if it was written on the Titanic *after* it sank",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "\"Looks cool, I'll update after I use it.\"  - Titanic review April 10, 1912.",
                "Amazing!",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "“Delete my browser history”"
            ],
            "aggregate_sentiment": 100.0
        },
        {
            "category": "NEW",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 6087,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "hell, the US has two doing the same thing- can they take them too?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                ">plotting sabotage\n\nIsn't that technically an act of war?",
                "was it JD and Little Marco?",
                "> the main aim was to undermine military support given by Germany to Ukraine\n\n> bombing and arson attacks on infrastructure used by the military and industrial sites in Germany\n\nHow would that undermine military support Ukraine? It would rather do the opposite and justify opposition to Russia because that kind of terrorism would be hard to defend even for Russia apologists in Germany.",
                "I bet they were in Kegseth's Signal group.",
                "In America we pronounce it “republican”",
                "We would arrest many Russian assets in the United States if we were the slightest bit interested in doing that.",
                "Sounds familiar. hmmm",
                "You mean Trump and Vance have been arrested?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1032,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "But Pakistan had cancelled all trade with India a few days back.",
                "Well that’s not great.",
                "Trump: “They never would have clashed if I was president!”",
                "Don't they normally use sticks? Or was that against China?  Not joking except for the fact they used sticks is funny"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 1778,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Don't they own a colour printer?",
                "Trash is what you can get away with",
                "So these artworks were Banksy'd.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 7399,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 7465,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "[removed]",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Literally every headline and every decision coming out of this administration is the wrong one.",
                "Due process doesn't exist for enemies of the regime"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 1594,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> State TV said \"negligence in handling flammable materials was a contributing factor\" in the explosion.\n\nWell they aren’t claiming any sort of attack, so there’s an end to any of that kind of speculation given they’re not likely to lie or downplay such an incident otherwise.",
                "Wonder if it’s a fertilizer mishandle like Beirut?",
                "I'm going to assume it was ammonium nitrate. It's always ammonium nitrate.",
                "Smoking near rocket fuel?",
                "“The blast occurred as Iran began a third round of nuclear talks with the United States in Oman, although the cause of the explosion was not immediately clear”. Here’s a completely unrelated thing that is also happening in the region that we  added to the article for absolutely no reason. The media sucks",
                "Beirut? And 2015 China? Do no one learn from their lesson about storing and handling of chemicals at the ports??",
                "If they are so incredibly incompetent with basic explosives imagine what their gross incompetence could do with nuclear weapons",
                "\"It was just a crate of fireworks.\" \n\n-Iran regime",
                "No chance it’s a USA attack or we would have seen the slack channel about it first",
                "Hopefully it puts a dent in drone production and shipments"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 3009,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "As I said, the population may well be halved after the purges.",
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "I'm confused. I thought simply marrying an American made you a citizen? Is this a certain amount of time after marriage?",
                "What’s happening with this country?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 6087,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "hell, the US has two doing the same thing- can they take them too?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                ">plotting sabotage\n\nIsn't that technically an act of war?",
                "was it JD and Little Marco?",
                "> the main aim was to undermine military support given by Germany to Ukraine\n\n> bombing and arson attacks on infrastructure used by the military and industrial sites in Germany\n\nHow would that undermine military support Ukraine? It would rather do the opposite and justify opposition to Russia because that kind of terrorism would be hard to defend even for Russia apologists in Germany.",
                "I bet they were in Kegseth's Signal group.",
                "In America we pronounce it “republican”",
                "We would arrest many Russian assets in the United States if we were the slightest bit interested in doing that.",
                "Sounds familiar. hmmm",
                "You mean Trump and Vance have been arrested?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 838,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">written before it sank\n\nI'd be more impressed if it was written on the Titanic *after* it sank",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "\"Looks cool, I'll update after I use it.\"  - Titanic review April 10, 1912.",
                "Amazing!",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "“Delete my browser history”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 7393,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1036,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "But Pakistan had cancelled all trade with India a few days back.",
                "Well that’s not great.",
                "Trump: “They never would have clashed if I was president!”",
                "Don't they normally use sticks? Or was that against China?  Not joking except for the fact they used sticks is funny"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 1777,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Don't they own a colour printer?",
                "Trash is what you can get away with",
                "So these artworks were Banksy'd.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 7452,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "[removed]",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Literally every headline and every decision coming out of this administration is the wrong one.",
                "Due process doesn't exist for enemies of the regime"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 7705,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Who would've thought using cheaper ingredients and charging more for them wasn't a sustainable long term business model",
                "They fucked up Del Taco. Quality plummeted when they took over, to the point where even Taco Bell is using better quality ingredients. Carl's Jr did the same shit with Green Burrito, but they never sold it they just let it completely die out. Hopefully someone buys Del Taco and puts some effort into saving them.",
                "With the loss of traditional car antenna's, it was only a matter of when",
                ">In a statement, Jack in the Box CEO Lance Tucker said, “In my time thus far as CEO, I have worked quickly with our teams to conclude that Jack in the Box operates at its best, and maximizes shareholder return potential, within a simplified and asset-light business model. Our actions today focus on three main areas: addressing our balance sheet to accelerate cash flow and pay down debt, while preserving growth-oriented capital investments related to technology and restaurant reimage; closing underperforming restaurants to position ourselves for consistent net unit growth and competitive unit economics; and, an overall return to simplicity for the Jack in the Box business model and investor story.”\n\nHe sounds like he'd be fun at parties. Fuck maximizing shareholder return. Make fucking good fast food that is affordable.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "[removed]",
                "I’ve always preferred Del Taco over Taco Bell. They better not be shutting down Del Tacos next.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "So they bought Del Taco, took the thing I liked off the menu, then sold them? This feels personal"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 61083,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                "God this world feels so hopeless right now. Rest in peace, Virginia.",
                "The bad guys are winning.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 1595,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> State TV said \"negligence in handling flammable materials was a contributing factor\" in the explosion.\n\nWell they aren’t claiming any sort of attack, so there’s an end to any of that kind of speculation given they’re not likely to lie or downplay such an incident otherwise.",
                "Wonder if it’s a fertilizer mishandle like Beirut?",
                "I'm going to assume it was ammonium nitrate. It's always ammonium nitrate.",
                "Smoking near rocket fuel?",
                "“The blast occurred as Iran began a third round of nuclear talks with the United States in Oman, although the cause of the explosion was not immediately clear”. Here’s a completely unrelated thing that is also happening in the region that we  added to the article for absolutely no reason. The media sucks",
                "Beirut? And 2015 China? Do no one learn from their lesson about storing and handling of chemicals at the ports??",
                "If they are so incredibly incompetent with basic explosives imagine what their gross incompetence could do with nuclear weapons",
                "\"It was just a crate of fireworks.\" \n\n-Iran regime",
                "No chance it’s a USA attack or we would have seen the slack channel about it first",
                "Hopefully it puts a dent in drone production and shipments"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/27/2025 04:10:42 UTC"
}