{
    "posts": [
        {
            "category": "HOT",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 10738,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sights cost what is now up to over 20 lives.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience",
                "It's crazy, I have all this taxable income that I want to go towards helping the people affected by natural disasters\n\nBut conservatives would rather give that money to the rich because there's like ten trans kids that want to play sports \n\nOh well, maybe if we have actual elections in the coming years we can try to help. In the meantime I have to do my patriotic duty and pay more for groceries"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 1904,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/IMG_1494.jpg",
            "top_comments": [
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "Caused by someone who is \"pro life\"",
                "Christian Domestic Terrorism.",
                "Get this fucker on state charges so the dictator in chief can’t pardon him. ",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building is not in use?",
                "Oh, we're doing this again...fuck these psychopaths.",
                "Calling it now. Bet they won’t be prosecuted as terrorism under this administration.",
                "Anti-choice terrorists.",
                "Evangelical terrorists at it again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law.",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002?fbclid=IwQ0xDSwKVxCJleHRuA2FlbQIxMQABHm5qY4aqhQpTmu2gC7iwRlN8XMwYNpJLgGyKeVu9iPI324wxReuFViT1ZW9N_aem_3C36uCz5PQ89VNJdKB17eQ",
            "upvotes": 262,
            "date": "05/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                "Evil country. Not much to say besides that.",
                "Republicans:  \"How could we have possibly seen this coming???\"\n\nMorons.",
                "The family should not be forced to pay the cost of this ghastly science experiment.",
                "WTG republicans/ christians!  Your prayers have been answered. Dipshits!",
                "This is straight out of **The Handmaid’s Tale**, by the way. (S3E9 titled “Heroic”)\n\nAnd the family is being stuck with the hospital bill.",
                "this is just Fucked up no other words to describe it",
                "Simple solution... Just say they aren't paying and let the insurance thugs do  the rest.",
                "Quite misleading using a picture from her previous pregnancy IMO. She was only a few weeks along when she was declared brain dead.\n\nGod damn this is a fucking depressing situation.",
                "Just remember that this is what they wanted the states to have the right to decide to do to people.",
                "She was only 9 weeks pregnant. I don't know if there's any precedent on this, but it sounds like the fetus may not even be viable if it's growing that much with the mother's body being brain dead. They're just making this woman's family watch her body be puppeted by medical equipment and they can't bury her until she miscarries or delivers a stillborn child."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 405,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/005a/live/e82ac710-333b-11f0-9866-bb894c6ef040.jpg",
            "top_comments": [
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Ack. I imagine avalanche would be a horrible way to die.",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 39157,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                "Jesus….Alito and Thomas are human garbage",
                "> “Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS,” Trump wrote. “This is a bad and dangerous day for America!”\n\nTrump continues to rage against the existence of the Constitution itself.\n\nThe Constitution does not bind the conduct of individuals. It's a non-exhaustive enumeration of individual rights, which proscribe *the government* from certain actions. Even if you, Dear Leader, really, really want to.\n\nObviously. Dumbass.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "*“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a* [*post*](https://truthsocial.com/@realDonaldTrump/114519567610751944) *on Truth Social.*\n\nTrump trying to Intimidate the court.\n\n*Trump on Friday morning* [*vented frustration*](https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html) *toward the high court,* [*writing*](https://truthsocial.com/@realDonaldTrump/114517773720445162) *that it “IS BEING PLAYED BY THE RADICAL LEFT LOSERS” whose “ONLY HOPE IS THE INTIMIDATION OF THE COURT.”*\n\nTrump claiming the other side is trying to intimidate the court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 16283,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "Donald Trump is doing to America what he did to his casinos.",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either.",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Massive Explosion Near Desert Regional Hospital in Palm Springs Shakes City",
            "external_url": "https://channel2now.com/2025/05/17/article/news/local-news/massive-car-explosion-near-desert-regional-hospital-in-palm-springs-shakes-city-california-near-indian-canyon-drive/",
            "upvotes": 111,
            "date": "05/17/2025",
            "thumbnail": "https://channel2now.b-cdn.net/wp-content/uploads/2025/05/Massive-Car-Explosion-Near-Desert-Regional-Hospital-in-Palm-Springs-Shakes-City-California.png?v=1747506328",
            "top_comments": [
                "Aww yes the old abortions bad, but murder good. Evil fucking twats.",
                "The pro life party killing people with bombs",
                "Didn't the FBI (under Krash Patel) just downgrade domestic terror to the low priority list.  Guess like racism, it's mostly solved?",
                "Now they are going after fertility clinics?",
                "It's *always* conservatives.",
                "A very possible act of terrorism from the right--given the target.  (and the big boom)",
                "Oh crap, nothing is positive yet.\n\nThat being said they are thinking car bomb.   So I remember when freaks would try and firebomb women's health clinics but it's usually few and far between that one of the psychos learns to play with explosives.  And even if that was the case here.  Why an IVF clinic in the first place?",
                "Right-wing terrorists car bombing medical clinics. Complete trash.",
                "That site is ass cancer",
                "*massive terrorist attack"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 4077,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "Maga Christian nationalists ask themselves, what would Jesus do, then do the opposite.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "So. Much. Waste. What a disaster DOGE and donald are",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 757,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "***RFK has entered the chat***",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up.",
                "Where’s ace ventura when you need him?",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "Has anyone asked RFK jr about it? He does this kind of stuff!",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 6720,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She’s the same one that had the sling after the handshake…",
                "IF she can go after this person, why aren't they going after Noem for threatening standing congress members & judges?",
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "Amazing how fast they move when it's them being threatened.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "[removed]",
                "> “I’m going to assassinate Representative Nancy Mace with a gun and I’m being 100% dead ass,” the post said, according to Mace’s office.\n\nYup, jail.",
                "my fellow trans folks: don’t threaten to assassinate people.",
                "Violence doesn’t solve anything… unless the problem is war, or a bully, or someone that you don’t like, or someone saying something you don’t like, or…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Massive Explosion Near Desert Regional Hospital in Palm Springs Shakes City",
            "external_url": "https://channel2now.com/2025/05/17/article/news/local-news/massive-car-explosion-near-desert-regional-hospital-in-palm-springs-shakes-city-california-near-indian-canyon-drive/",
            "upvotes": 111,
            "date": "05/17/2025",
            "thumbnail": "https://channel2now.b-cdn.net/wp-content/uploads/2025/05/Massive-Car-Explosion-Near-Desert-Regional-Hospital-in-Palm-Springs-Shakes-City-California.png?v=1747506328",
            "top_comments": [
                "Aww yes the old abortions bad, but murder good. Evil fucking twats.",
                "The pro life party killing people with bombs",
                "Didn't the FBI (under Krash Patel) just downgrade domestic terror to the low priority list.  Guess like racism, it's mostly solved?",
                "Now they are going after fertility clinics?",
                "It's *always* conservatives.",
                "A very possible act of terrorism from the right--given the target.  (and the big boom)",
                "Oh crap, nothing is positive yet.\n\nThat being said they are thinking car bomb.   So I remember when freaks would try and firebomb women's health clinics but it's usually few and far between that one of the psychos learns to play with explosives.  And even if that was the case here.  Why an IVF clinic in the first place?",
                "Right-wing terrorists car bombing medical clinics. Complete trash.",
                "That site is ass cancer",
                "*massive terrorist attack"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Firefighters respond to explosion at building in Palm Springs",
            "external_url": "https://kesq.com/news/2025/05/17/firefighters-respond-to-explosion-at-building-in-palm-springs/",
            "upvotes": 27,
            "date": "05/17/2025",
            "thumbnail": "https://kesq.b-cdn.net/2025/05/xfrgdrgdthd.jpg",
            "top_comments": [
                "Abortion suicide bomber? Didn’t have that one on my radar today.",
                "Now they are going after fertility clinics?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law.",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002?fbclid=IwQ0xDSwKVxCJleHRuA2FlbQIxMQABHm5qY4aqhQpTmu2gC7iwRlN8XMwYNpJLgGyKeVu9iPI324wxReuFViT1ZW9N_aem_3C36uCz5PQ89VNJdKB17eQ",
            "upvotes": 264,
            "date": "05/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                "Evil country. Not much to say besides that.",
                "Republicans:  \"How could we have possibly seen this coming???\"\n\nMorons.",
                "The family should not be forced to pay the cost of this ghastly science experiment.",
                "WTG republicans/ christians!  Your prayers have been answered. Dipshits!",
                "This is straight out of **The Handmaid’s Tale**, by the way. (S3E9 titled “Heroic”)\n\nAnd the family is being stuck with the hospital bill.",
                "this is just Fucked up no other words to describe it",
                "Simple solution... Just say they aren't paying and let the insurance thugs do  the rest.",
                "Quite misleading using a picture from her previous pregnancy IMO. She was only a few weeks along when she was declared brain dead.\n\nGod damn this is a fucking depressing situation.",
                "Just remember that this is what they wanted the states to have the right to decide to do to people.",
                "She was only 9 weeks pregnant. I don't know if there's any precedent on this, but it sounds like the fetus may not even be viable if it's growing that much with the mother's body being brain dead. They're just making this woman's family watch her body be puppeted by medical equipment and they can't bury her until she miscarries or delivers a stillborn child."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 1917,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/IMG_1494.jpg",
            "top_comments": [
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "Caused by someone who is \"pro life\"",
                "Christian Domestic Terrorism.",
                "Get this fucker on state charges so the dictator in chief can’t pardon him. ",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building is not in use?",
                "Oh, we're doing this again...fuck these psychopaths.",
                "Calling it now. Bet they won’t be prosecuted as terrorism under this administration.",
                "Anti-choice terrorists.",
                "Evangelical terrorists at it again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 411,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/005a/live/e82ac710-333b-11f0-9866-bb894c6ef040.jpg",
            "top_comments": [
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Ack. I imagine avalanche would be a horrible way to die.",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 10741,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sights cost what is now up to over 20 lives.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience",
                "It's crazy, I have all this taxable income that I want to go towards helping the people affected by natural disasters\n\nBut conservatives would rather give that money to the rich because there's like ten trans kids that want to play sports \n\nOh well, maybe if we have actual elections in the coming years we can try to help. In the meantime I have to do my patriotic duty and pay more for groceries"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 759,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "***RFK has entered the chat***",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up.",
                "Where’s ace ventura when you need him?",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "Has anyone asked RFK jr about it? He does this kind of stuff!",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Gunman pleads guilty to murder of bank teller Monica Leech during 1997 robbery in Thousand Oaks",
            "external_url": "https://abc7.com/post/kevin-ray-james-pleads-guilty-murder-bank-teller-monica-leech-during-1997-robbery-thousand-oaks/16441601/",
            "upvotes": 315,
            "date": "05/17/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16441475_051625-kabc-4pm-monica-leech-vid.jpg?w=1600",
            "top_comments": [
                "Monica was a relative of mine. The effect this murder had on the family can't be understated. It doesnt bring her back, but Im glad there's justice",
                "I remember this but never realized no one was charged.  Crazy",
                "While it’s awful that this monster got to walk free for so long, I’m glad justice caught up to him.",
                "I was wondering why it took so long. Turns out the evidence was very recently obtained.\n\n>The case remained cold for more than 20 years until new forensic evidence and investigative leads identified James as one of the suspects. On March 13, 2023, he was charged with Leech's murder."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mother gets six years for Elkton townhouse fire that killed daughter, 10",
            "external_url": "https://www.cecildaily.com/news/mother-gets-six-years-for-elkton-townhouse-fire-that-killed-daughter-10/article_647550f6-966a-4fec-9f56-fab39f2a6afe.html",
            "upvotes": 665,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/cecildaily.com/content/tncms/assets/v3/editorial/d/db/ddbf8970-e4b3-42ad-a37e-95f201dcd39f/6824a54dc02fb.image.jpg?crop=770%2C404%2C0%2C279",
            "top_comments": [
                "Once again, though nobody’s also talking about the fact that this child and her two siblings should’ve been taken by social services, the school repeatedly reported that she was dirty and smelled like animal feces, and was being extremely neglected. One visit to the house would’ve shown that it’s not livable conditions for children. Social service has failed these kids as well.",
                "She created a hoarding situation, including pet hoarding, and overloaded electrical outlets. She created a dangerous situation and placed her daughter into it and now her girl is dead. It’s beyond negligence. I know it’s an accident and my heart goes out to the mom, but she is not blameless. It’s akin to driving drunk and getting your kid killed; you didn’t mean to do it, but you recklessly disregarded safety and now somebody is dead. Just tragic.",
                "It’s so sad to read that she had no friends at school, also due to the hoarding situation and hygiene. Her mother neglected her so badly, she kept this kid from having a happy, normal life.  And then she dies horribly too? I am heartbroken for this little girl. \nThe mother absolutely  deserves to be in prison. Don’t even get me started on the animal neglect.\n💜 Kyleigh 💐 🕊️",
                "Call me a POS for taking away from the girl's death or whatever but I find it disturbing that none of these articles comment on the outcome of all of the pets in the home.\n\nThey had **35** cats and dogs.  5 days prior to the fire, animal control took 18 of them.  How many of them were in crates or locked away while the adults of the house made their way to safety?",
                "I live a few miles from where this happened. The neighbors townhouse was also heavily damaged from the fire. There was a go fund me for her.",
                "Ahh Elkton. I have fond childhood memories of the Blue Beacon Truck Wash.",
                "*\"This is the exact definition of a difficult case. You have the tragic loss of a young person and there is zero intention for this to happen. It’s the nature of the charge.” (Judge Davis to the mother)*\n\nA terrible situation--35 pets in the house plus hoarding. But 6 years for involuntary manslaughter from a Judge that understands the mother's plight seems high.",
                "There is absolutely no mention of a father being held responsible for this as well. Was this child immaculately conceived?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 4 dead after tornado and severe storm batters St. Louis, mayor says",
            "external_url": "https://www.thestar.com/news/world/united-states/at-least-4-dead-after-tornado-and-severe-storm-batters-st-louis-mayor-says/article_94311dad-37e9-502b-bbdc-0633b37f4a3c.html",
            "upvotes": 687,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/c/28/c288a2cc-ed8e-5297-bcc0-abc33d3e87d2/682753d03ea3b.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Things are pretty bad. The tornado hit smack in the middle of the city and the wrecked havoc up through the north side which is an area already struggling.",
                "Title changed: At least 7 people dead and widespread damage left in the wake of severe Midwest storms \n\nJust in case the mod checks the title.",
                "*The storms were part of a severe weather system that spawned tornadoes in Wisconsin, downed trees, left thousands without power in the Great Lakes region and brought a punishing heat wave to Texas.*\n\nA weather system that includes every imaginable form of nasty weather.",
                "I'm down in Cape Girardeau/Sikeston and I saw a bunch of mobile homes near I-55 that got torn up driving home from work today. Also got some pretty nasty hail but luckily we weren't hit directly. From the sounds of it STL got the worst. Just awful.",
                "It’s going to be interesting if they need any help from FEMA. I wish them the best, we never (almost) see damaging tornadoes in my neck of the woods.",
                "Did anyone NOT get alerts on their phones this time? I did not. In Baltimore",
                "It looked like a warzone when I was driving home.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 1924,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/IMG_1494.jpg",
            "top_comments": [
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "Caused by someone who is \"pro life\"",
                "Christian Domestic Terrorism.",
                "Get this fucker on state charges so the dictator in chief can’t pardon him. ",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building is not in use?",
                "Oh, we're doing this again...fuck these psychopaths.",
                "Calling it now. Bet they won’t be prosecuted as terrorism under this administration.",
                "Anti-choice terrorists.",
                "Evangelical terrorists at it again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law.",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002?fbclid=IwQ0xDSwKVxCJleHRuA2FlbQIxMQABHm5qY4aqhQpTmu2gC7iwRlN8XMwYNpJLgGyKeVu9iPI324wxReuFViT1ZW9N_aem_3C36uCz5PQ89VNJdKB17eQ",
            "upvotes": 267,
            "date": "05/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                "Evil country. Not much to say besides that.",
                "Republicans:  \"How could we have possibly seen this coming???\"\n\nMorons.",
                "The family should not be forced to pay the cost of this ghastly science experiment.",
                "WTG republicans/ christians!  Your prayers have been answered. Dipshits!",
                "This is straight out of **The Handmaid’s Tale**, by the way. (S3E9 titled “Heroic”)\n\nAnd the family is being stuck with the hospital bill.",
                "this is just Fucked up no other words to describe it",
                "Simple solution... Just say they aren't paying and let the insurance thugs do  the rest.",
                "Quite misleading using a picture from her previous pregnancy IMO. She was only a few weeks along when she was declared brain dead.\n\nGod damn this is a fucking depressing situation.",
                "Just remember that this is what they wanted the states to have the right to decide to do to people.",
                "She was only 9 weeks pregnant. I don't know if there's any precedent on this, but it sounds like the fetus may not even be viable if it's growing that much with the mother's body being brain dead. They're just making this woman's family watch her body be puppeted by medical equipment and they can't bury her until she miscarries or delivers a stillborn child."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 410,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/005a/live/e82ac710-333b-11f0-9866-bb894c6ef040.jpg",
            "top_comments": [
                "Ack. I imagine avalanche would be a horrible way to die.",
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 10744,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sights cost what is now up to over 20 lives.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience",
                "It's crazy, I have all this taxable income that I want to go towards helping the people affected by natural disasters\n\nBut conservatives would rather give that money to the rich because there's like ten trans kids that want to play sports \n\nOh well, maybe if we have actual elections in the coming years we can try to help. In the meantime I have to do my patriotic duty and pay more for groceries"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 39157,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                "Jesus….Alito and Thomas are human garbage",
                "> “Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS,” Trump wrote. “This is a bad and dangerous day for America!”\n\nTrump continues to rage against the existence of the Constitution itself.\n\nThe Constitution does not bind the conduct of individuals. It's a non-exhaustive enumeration of individual rights, which proscribe *the government* from certain actions. Even if you, Dear Leader, really, really want to.\n\nObviously. Dumbass.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "*“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a* [*post*](https://truthsocial.com/@realDonaldTrump/114519567610751944) *on Truth Social.*\n\nTrump trying to Intimidate the court.\n\n*Trump on Friday morning* [*vented frustration*](https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html) *toward the high court,* [*writing*](https://truthsocial.com/@realDonaldTrump/114517773720445162) *that it “IS BEING PLAYED BY THE RADICAL LEFT LOSERS” whose “ONLY HOPE IS THE INTIMIDATION OF THE COURT.”*\n\nTrump claiming the other side is trying to intimidate the court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 16278,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "Donald Trump is doing to America what he did to his casinos.",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either.",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 4080,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "Maga Christian nationalists ask themselves, what would Jesus do, then do the opposite.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "So. Much. Waste. What a disaster DOGE and donald are",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Massive Explosion Near Desert Regional Hospital in Palm Springs Shakes City",
            "external_url": "https://channel2now.com/2025/05/17/article/news/local-news/massive-car-explosion-near-desert-regional-hospital-in-palm-springs-shakes-city-california-near-indian-canyon-drive/",
            "upvotes": 112,
            "date": "05/17/2025",
            "thumbnail": "https://channel2now.b-cdn.net/wp-content/uploads/2025/05/Massive-Car-Explosion-Near-Desert-Regional-Hospital-in-Palm-Springs-Shakes-City-California.png?v=1747506328",
            "top_comments": [
                "Aww yes the old abortions bad, but murder good. Evil fucking twats.",
                "The pro life party killing people with bombs",
                "Didn't the FBI (under Krash Patel) just downgrade domestic terror to the low priority list.  Guess like racism, it's mostly solved?",
                "Now they are going after fertility clinics?",
                "It's *always* conservatives.",
                "A very possible act of terrorism from the right--given the target.  (and the big boom)",
                "Oh crap, nothing is positive yet.\n\nThat being said they are thinking car bomb.   So I remember when freaks would try and firebomb women's health clinics but it's usually few and far between that one of the psychos learns to play with explosives.  And even if that was the case here.  Why an IVF clinic in the first place?",
                "Right-wing terrorists car bombing medical clinics. Complete trash.",
                "That site is ass cancer",
                "*massive terrorist attack"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 760,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "***RFK has entered the chat***",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up.",
                "Where’s ace ventura when you need him?",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "Has anyone asked RFK jr about it? He does this kind of stuff!",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 6728,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She’s the same one that had the sling after the handshake…",
                "IF she can go after this person, why aren't they going after Noem for threatening standing congress members & judges?",
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "Amazing how fast they move when it's them being threatened.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "[removed]",
                "> “I’m going to assassinate Representative Nancy Mace with a gun and I’m being 100% dead ass,” the post said, according to Mace’s office.\n\nYup, jail.",
                "my fellow trans folks: don’t threaten to assassinate people.",
                "Violence doesn’t solve anything… unless the problem is war, or a bully, or someone that you don’t like, or someone saying something you don’t like, or…."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/17/2025 20:09:25 UTC"
}