{
    "posts": [
        {
            "category": "HOT",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 7014,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Republicans are fake patriots",
                "Interestingly this is something we already have in parts of Canada. We have publicly funded Catholic schools in Ontario and Alberta, and in BC Catholic schools receive partial government funding.\n\nNot defending it, but pointing out this already exists in a country many progressives point to as being a better model to emulate."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 3312,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "What’s up with middle schoolers and being the worst people possible?",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "Genius kid-must have learned it from the parents",
                "Fucking ridiculous. Hope the bullies parents get a nice long investigation from child services.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 2331,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "They probably broke a bunch of their stuff too.",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "I can only imagine, the cruelty of this bunch is astounding.",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "That's the whole point; keep everyone in a constant state of fear. And I mean *everyone*; even the MAGA faithful need to be afraid, as all it'll take is one person doubting their loyalty and they're on the Regime's shitlist along with the rest of us.",
                "Cops will kill your dogs and ICE will traffick your daughters, Conservative Utopia in the Egg Nation 🥚🇺🇸"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 3804,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "He's getting arrested next..",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US Economy Contracts for First Time Since 2022 on Imports Surge",
            "external_url": "https://financialpost.com/pmn/business-pmn/us-economy-contracts-for-first-time-since-2022-on-imports-surge",
            "upvotes": 1774,
            "date": "04/30/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/US-GDP-gs0430.jpg",
            "top_comments": [
                "get ready for those imports to come to a crashing halt.  we are already seeing ports with 50% less traffic. and have yet to see the actual response from the tarrifs because of shipping lag. it will be another 2-3 weeks until the ships entering port would have left when the tarrifs where put into place.",
                "\"the most successful 100 days of any presidency as said by many many people\".\n\n\nHow is America still listening to these assholes?",
                "If this is \"winning\", I'm done with it.",
                "Welcome to the Trump Recession.",
                "Between George W and Trump x2, I'm wondering whether a good chunk of Republicans are just masochistic gluttons for economic punishment.",
                "But hey, at least a few trans kids can’t play sports now\n\n/s",
                "But Navarro said if you don't count the import raises, then the economy is surging like never seen before. So we're still good, right?",
                "There was a lot of preparation for the tariffs like investments and additional orders, which I suspect are really masking how bad the situation is. Next quarter should give us a good look at how things really sit with the economy. ",
                "Not only that but every other country announced great numbers.\n\nGood bye hegemony, say bye bye 👋",
                "The reason for contraction is actually interesting. If you see the GDP by components, personal consumption, private investment are positive and are up +5%pp and govt expenditure is negative but only -0.2%pp so total +4.8% growth. But then comes the net exports which is always negative as US is import over export country like most others. But because of Trump tariffs kicking in starting Apil, exporting countries rushed in too much export to US (it's import) draging the net export component of GDP to -5.1% thus overall negative growth rate by -0.3% y/y.\n\nThe surge in imports to US also evident by very high inventory numbers too. Let's see what Q2 goes."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 13237,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "Stickin' it to the man... In solidarity.",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "This is the way to do it.    \n\n**Nationwide.**"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 624,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "No one should receive scholarships after participating in hazing",
                "We still have hazing incidents?  WTF? They get what they deserve.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "Saying it was only some… something tells me all the upper classmen knew about this kind of thing, was hazed in some form, and those that didn’t partake in that particular incident chose to stay silent because “if I went through it, so can they”.",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "MAGA youth doing MAGA youth things"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "2 dead in Pennsylvania as severe weather events hit Midwest, Heartland and East",
            "external_url": "https://abcnews.go.com/US/2-dead-pennsylvania-severe-weather-events-hit-midwest/story?id=121309396",
            "upvotes": 665,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d8b8b6f3-8531-4039-bfab-afbe17a5357c/storm-3-ht-gmh-250430_1746026900253_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Pittsburgh took a rare direct hit, and most of the schools in the region are closed today due to a lack of power, in addition to a lot of people still without power. It was quite crazy and is still bad this morning since who has power and who doesn't is block by block. A lot of traffic lights are still out, making traffic quite fun.",
                "Surely we won't see an increase in deaths and injuries from storms like this moving forward, with all our cuts to the national weather service.  Those DOGE guys will be here helping with the recovery too, right? Right?",
                "I thought the Midwest was the heartland?\ninteresting they put it in the title like that.",
                "Get in line behind Arkansas, hold out one hand for federal assistance and shit in the other hand, ask Arkansas which hand will fill up first and they'll use their $19,000 super podium to tell you the answer. \n\nhttps://arktimes.com/arkansas-blog/2025/04/21/sanders-says-arkansas-in-dire-need-of-federal-assistance-but-trump-says-no\n\n#💩",
                "Several states with power outages: https://poweroutage.us/",
                "I got lucky with an near miss. The storm wasn't very wide yet when it passed here and the center part with the 80 mph winds passed about 10 miles north of me. Winds were probably only about 50 mph here. ",
                "it'll be fine because god will protect us\n\noh wait that's actually really fucking dumb",
                "Kiss my mother loving ass\n\nAsheville.  Month and a half without power. \n\nGod speed to y’all.",
                "Same storm system knocked out power to 70,000+ in Southwest Missouri Tuesday morning.",
                "It's a good thing FEMA is fully funded and ready to jump in and help.  /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 479,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "In case the title confused you into thinking this was about the other NHLer who was killed (Johnny Gaudreau and his brother who were killed by a drunk driver) and are now curious what happened to that drunk driver, he is definitely being charged and recently tried to argue that the brothers who were cycling at the time were at fault since [the brothers were drunker](https://www.cbc.ca/amp/1.7510461)",
                "[removed]",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Good, people were being downright silly, implying that this was some intentional act. Lots of embarrassing armchair detectives trying to float ridiculous hot takes. Perfect example of redditors being unable to manage their emotions.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 7708,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Some kids do need a leash.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Comments in the Independent article are pathetic."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 2330,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "They probably broke a bunch of their stuff too.",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "I can only imagine, the cruelty of this bunch is astounding.",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "That's the whole point; keep everyone in a constant state of fear. And I mean *everyone*; even the MAGA faithful need to be afraid, as all it'll take is one person doubting their loyalty and they're on the Regime's shitlist along with the rest of us.",
                "Cops will kill your dogs and ICE will traffick your daughters, Conservative Utopia in the Egg Nation 🥚🇺🇸"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 3310,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "What’s up with middle schoolers and being the worst people possible?",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "Genius kid-must have learned it from the parents",
                "Fucking ridiculous. Hope the bullies parents get a nice long investigation from child services.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 621,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "No one should receive scholarships after participating in hazing",
                "We still have hazing incidents?  WTF? They get what they deserve.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "Saying it was only some… something tells me all the upper classmen knew about this kind of thing, was hazed in some form, and those that didn’t partake in that particular incident chose to stay silent because “if I went through it, so can they”.",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "MAGA youth doing MAGA youth things"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "US Economy Contracts for First Time Since 2022 on Imports Surge",
            "external_url": "https://financialpost.com/pmn/business-pmn/us-economy-contracts-for-first-time-since-2022-on-imports-surge",
            "upvotes": 1772,
            "date": "04/30/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/US-GDP-gs0430.jpg",
            "top_comments": [
                "get ready for those imports to come to a crashing halt.  we are already seeing ports with 50% less traffic. and have yet to see the actual response from the tarrifs because of shipping lag. it will be another 2-3 weeks until the ships entering port would have left when the tarrifs where put into place.",
                "\"the most successful 100 days of any presidency as said by many many people\".\n\n\nHow is America still listening to these assholes?",
                "If this is \"winning\", I'm done with it.",
                "Welcome to the Trump Recession.",
                "Between George W and Trump x2, I'm wondering whether a good chunk of Republicans are just masochistic gluttons for economic punishment.",
                "But hey, at least a few trans kids can’t play sports now\n\n/s",
                "But Navarro said if you don't count the import raises, then the economy is surging like never seen before. So we're still good, right?",
                "There was a lot of preparation for the tariffs like investments and additional orders, which I suspect are really masking how bad the situation is. Next quarter should give us a good look at how things really sit with the economy. ",
                "Not only that but every other country announced great numbers.\n\nGood bye hegemony, say bye bye 👋",
                "The reason for contraction is actually interesting. If you see the GDP by components, personal consumption, private investment are positive and are up +5%pp and govt expenditure is negative but only -0.2%pp so total +4.8% growth. But then comes the net exports which is always negative as US is import over export country like most others. But because of Trump tariffs kicking in starting Apil, exporting countries rushed in too much export to US (it's import) draging the net export component of GDP to -5.1% thus overall negative growth rate by -0.3% y/y.\n\nThe surge in imports to US also evident by very high inventory numbers too. Let's see what Q2 goes."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 3804,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "He's getting arrested next..",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 7011,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Republicans are fake patriots",
                "Interestingly this is something we already have in parts of Canada. We have publicly funded Catholic schools in Ontario and Alberta, and in BC Catholic schools receive partial government funding.\n\nNot defending it, but pointing out this already exists in a country many progressives point to as being a better model to emulate."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 481,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "In case the title confused you into thinking this was about the other NHLer who was killed (Johnny Gaudreau and his brother who were killed by a drunk driver) and are now curious what happened to that drunk driver, he is definitely being charged and recently tried to argue that the brothers who were cycling at the time were at fault since [the brothers were drunker](https://www.cbc.ca/amp/1.7510461)",
                "[removed]",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Good, people were being downright silly, implying that this was some intentional act. Lots of embarrassing armchair detectives trying to float ridiculous hot takes. Perfect example of redditors being unable to manage their emotions.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "2 dead in Pennsylvania as severe weather events hit Midwest, Heartland and East",
            "external_url": "https://abcnews.go.com/US/2-dead-pennsylvania-severe-weather-events-hit-midwest/story?id=121309396",
            "upvotes": 670,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d8b8b6f3-8531-4039-bfab-afbe17a5357c/storm-3-ht-gmh-250430_1746026900253_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Pittsburgh took a rare direct hit, and most of the schools in the region are closed today due to a lack of power, in addition to a lot of people still without power. It was quite crazy and is still bad this morning since who has power and who doesn't is block by block. A lot of traffic lights are still out, making traffic quite fun.",
                "Surely we won't see an increase in deaths and injuries from storms like this moving forward, with all our cuts to the national weather service.  Those DOGE guys will be here helping with the recovery too, right? Right?",
                "I thought the Midwest was the heartland?\ninteresting they put it in the title like that.",
                "Get in line behind Arkansas, hold out one hand for federal assistance and shit in the other hand, ask Arkansas which hand will fill up first and they'll use their $19,000 super podium to tell you the answer. \n\nhttps://arktimes.com/arkansas-blog/2025/04/21/sanders-says-arkansas-in-dire-need-of-federal-assistance-but-trump-says-no\n\n#💩",
                "Several states with power outages: https://poweroutage.us/",
                "I got lucky with an near miss. The storm wasn't very wide yet when it passed here and the center part with the 80 mph winds passed about 10 miles north of me. Winds were probably only about 50 mph here. ",
                "it'll be fine because god will protect us\n\noh wait that's actually really fucking dumb",
                "Kiss my mother loving ass\n\nAsheville.  Month and a half without power. \n\nGod speed to y’all.",
                "Same storm system knocked out power to 70,000+ in Southwest Missouri Tuesday morning.",
                "It's a good thing FEMA is fully funded and ready to jump in and help.  /s"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 13230,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "Stickin' it to the man... In solidarity.",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "This is the way to do it.    \n\n**Nationwide.**"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Trial date set for father of suspected Apalachee High School shooter",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/30/trial-date-set-father-suspected-apalachee-high-school-shooter/",
            "upvotes": 812,
            "date": "04/30/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/MXB3DOKMQ5BWFPQRWU3M337X5U.png?auth=edeb083875ca993bd3a4b41f052a05dfecd759fc663a1b1f0d860da781d453a6&width=1200&height=600&smart=true",
            "top_comments": [
                "Charge the parents who provide the gun every fucking time and this will happen less often",
                "Not wanting to make fun of the horror and tragedy of the situation but the 1st 4 paragraphs of the article sound word for word like a John Grisham novel",
                "In many countries, criminally incompetent buffoon parents are incapable of enabling a school shooting. But hey it's America...blame the cops who didn't see the signs, blame the venue who didn't check in on the hotel room often enough, blame the parents who didn't want to believe their precious little angels would do something like this. Blame anything but the guns.",
                "So, they don't know if the kid was the school shooter? And they're charging his dad for something? Sounds like traditional American \"justice\", all right.",
                "''Suspected High School Shooter'' has me kind of stuck. Do they not know who did it?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 2330,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "They probably broke a bunch of their stuff too.",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "I can only imagine, the cruelty of this bunch is astounding.",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "That's the whole point; keep everyone in a constant state of fear. And I mean *everyone*; even the MAGA faithful need to be afraid, as all it'll take is one person doubting their loyalty and they're on the Regime's shitlist along with the rest of us.",
                "Cops will kill your dogs and ICE will traffick your daughters, Conservative Utopia in the Egg Nation 🥚🇺🇸"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 3801,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "He's getting arrested next..",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US Economy Contracts for First Time Since 2022 on Imports Surge",
            "external_url": "https://financialpost.com/pmn/business-pmn/us-economy-contracts-for-first-time-since-2022-on-imports-surge",
            "upvotes": 1774,
            "date": "04/30/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/US-GDP-gs0430.jpg",
            "top_comments": [
                "get ready for those imports to come to a crashing halt.  we are already seeing ports with 50% less traffic. and have yet to see the actual response from the tarrifs because of shipping lag. it will be another 2-3 weeks until the ships entering port would have left when the tarrifs where put into place.",
                "\"the most successful 100 days of any presidency as said by many many people\".\n\n\nHow is America still listening to these assholes?",
                "If this is \"winning\", I'm done with it.",
                "Welcome to the Trump Recession.",
                "Between George W and Trump x2, I'm wondering whether a good chunk of Republicans are just masochistic gluttons for economic punishment.",
                "But hey, at least a few trans kids can’t play sports now\n\n/s",
                "But Navarro said if you don't count the import raises, then the economy is surging like never seen before. So we're still good, right?",
                "There was a lot of preparation for the tariffs like investments and additional orders, which I suspect are really masking how bad the situation is. Next quarter should give us a good look at how things really sit with the economy. ",
                "Not only that but every other country announced great numbers.\n\nGood bye hegemony, say bye bye 👋",
                "The reason for contraction is actually interesting. If you see the GDP by components, personal consumption, private investment are positive and are up +5%pp and govt expenditure is negative but only -0.2%pp so total +4.8% growth. But then comes the net exports which is always negative as US is import over export country like most others. But because of Trump tariffs kicking in starting Apil, exporting countries rushed in too much export to US (it's import) draging the net export component of GDP to -5.1% thus overall negative growth rate by -0.3% y/y.\n\nThe surge in imports to US also evident by very high inventory numbers too. Let's see what Q2 goes."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 3309,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "What’s up with middle schoolers and being the worst people possible?",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "Genius kid-must have learned it from the parents",
                "Fucking ridiculous. Hope the bullies parents get a nice long investigation from child services.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 624,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "No one should receive scholarships after participating in hazing",
                "We still have hazing incidents?  WTF? They get what they deserve.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "Saying it was only some… something tells me all the upper classmen knew about this kind of thing, was hazed in some form, and those that didn’t partake in that particular incident chose to stay silent because “if I went through it, so can they”.",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "MAGA youth doing MAGA youth things"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 7019,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Republicans are fake patriots",
                "Interestingly this is something we already have in parts of Canada. We have publicly funded Catholic schools in Ontario and Alberta, and in BC Catholic schools receive partial government funding.\n\nNot defending it, but pointing out this already exists in a country many progressives point to as being a better model to emulate."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "2 dead in Pennsylvania as severe weather events hit Midwest, Heartland and East",
            "external_url": "https://abcnews.go.com/US/2-dead-pennsylvania-severe-weather-events-hit-midwest/story?id=121309396",
            "upvotes": 668,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d8b8b6f3-8531-4039-bfab-afbe17a5357c/storm-3-ht-gmh-250430_1746026900253_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Pittsburgh took a rare direct hit, and most of the schools in the region are closed today due to a lack of power, in addition to a lot of people still without power. It was quite crazy and is still bad this morning since who has power and who doesn't is block by block. A lot of traffic lights are still out, making traffic quite fun.",
                "Surely we won't see an increase in deaths and injuries from storms like this moving forward, with all our cuts to the national weather service.  Those DOGE guys will be here helping with the recovery too, right? Right?",
                "Get in line behind Arkansas, hold out one hand for federal assistance and shit in the other hand, ask Arkansas which hand will fill up first and they'll use their $19,000 super podium to tell you the answer. \n\nhttps://arktimes.com/arkansas-blog/2025/04/21/sanders-says-arkansas-in-dire-need-of-federal-assistance-but-trump-says-no\n\n#💩",
                "I thought the Midwest was the heartland?\ninteresting they put it in the title like that.",
                "Several states with power outages: https://poweroutage.us/",
                "I got lucky with an near miss. The storm wasn't very wide yet when it passed here and the center part with the 80 mph winds passed about 10 miles north of me. Winds were probably only about 50 mph here. ",
                "it'll be fine because god will protect us\n\noh wait that's actually really fucking dumb",
                "Kiss my mother loving ass\n\nAsheville.  Month and a half without power. \n\nGod speed to y’all.",
                "Same storm system knocked out power to 70,000+ in Southwest Missouri Tuesday morning.",
                "It's a good thing FEMA is fully funded and ready to jump in and help.  /s"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 481,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "In case the title confused you into thinking this was about the other NHLer who was killed (Johnny Gaudreau and his brother who were killed by a drunk driver) and are now curious what happened to that drunk driver, he is definitely being charged and recently tried to argue that the brothers who were cycling at the time were at fault since [the brothers were drunker](https://www.cbc.ca/amp/1.7510461)",
                "[removed]",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Good, people were being downright silly, implying that this was some intentional act. Lots of embarrassing armchair detectives trying to float ridiculous hot takes. Perfect example of redditors being unable to manage their emotions.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 13234,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "Stickin' it to the man... In solidarity.",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "This is the way to do it.    \n\n**Nationwide.**"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 7713,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Some kids do need a leash.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Comments in the Independent article are pathetic."
            ],
            "aggregate_sentiment": 73.0
        }
    ],
    "last_updated": "04/30/2025 20:10:17 UTC"
}