{
    "posts": [
        {
            "category": "HOT",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 5181,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "But but but....conservatives keep saying that *everyone* detained by ICE is automatically a criminal or gang member! /s\n\n🙄",
                "America is a dystopian nightmare.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "Document ICE actions especially identifying the officers involved. When Trump is gone, some of them will go to jail."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 23155,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "Its not corruption if its out in the open, right?",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "Can we collectively pay Trump to go fuck himself?",
                "Well, now you know how much a pardon costs.",
                "Oh and of course he's a nursing home executive. Might as well own a payday loan business.\n\nEdit: *and he shorted the healthcare workers' paychecks to buy himself a fucking yacht.*",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years.",
                "Republicans are for sale. I'm not surprised with these articles any longer and have come to expect this kind of behavior from them.",
                "Launch DOGE to find government fraud,  pardons a guy that committed actual tax fraud.  Makes sense"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 21111,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "[removed]",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "Let's see the double blind data from the peer reviewed study.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "Nobody should take medical advice from him according to his own words but he gets to dictate what medications are recommended to the general public 🤔"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 3967,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Delete Facebook. Delete Instagram. Delete Twitter. Sell $META.",
                "Show us your memes before you show up to class. This country is becoming a parody of itself.",
                "When the conservative loonies start cracking down on our civil rights, saying they are protecting us from international socialism, or the Chinese communist party, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start banning books and restricting the rights of queer people, saying they are protecting kids from pedophiles, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start cracking down on our students and protests, saying they are protecting us from antisemitism, the opposition… immediately takes this at face value and complains about how it’s really the Zionists who control the media and the world .\n\nisn’t that interesting",
                "Aka Taking away freedom of speech if it disagrees with them. This is against the constitution",
                "Remember folks, the slippery slope starts with student visas. \n\nWon't be long until YOUR social media is being \"vetted\"",
                "Blatently fascist and against the first amendment. Fucking remove this clown already.",
                "The GOP needs to be declared a terrorist organization and have their members be marked as suspected terrorists subject to enhanced interrogation. Time to start stuffing them and their families into unmarked vans and sent off to gulags. Thanks for teaching me how to govern Fuhrer Trump!\n\nMaybe we can also have a fake crisis to justify seizing wartime powers to round them all up. Trump has some really nice ideas."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 19140,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "All the $ and time wasted on lawsuits.",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "This is what they should be mentioning during pledge drives, I’d happily donate to sue the trump admin."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 14149,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "This is the most corrupt presidency in modern history.  Trump is a criminal, scumbag and everyone that supports him.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "so much for fighting against fraud, waste and abuse!!!!",
                "White collar fraudster pardons blue collar fraudster.",
                "Fat fuck frees fat fuck.",
                "States should prosecute irrespective of what the feds do so that this kind of thing doesn't happen anymore - at least so long as the dual sovereignty doctrine is still a thing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Alcohol-related brain damage could affect thousands, warns expert",
            "external_url": "https://www.bbc.com/news/articles/c3e551eqpgdo",
            "upvotes": 3286,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ff06/live/2e61e3f0-3592-11f0-8f95-179a79186756.jpg",
            "top_comments": [
                "Thousands? Only thousands?",
                "I'd be very concerned if alcohol hadn't destroyed my ability to ready this ",
                "The article is referring to people who have had roughly 2-3 drinks a day on average for years if anyone is concerned by the title.",
                "Recently watched my father in law suffer from alcohol related brain problems. It was really hard. Wet brain is nothing to shake a stick at.",
                "Mike, from Breaking Bad, is looking pretty good.",
                "My dad has been drinking for like 50 years now, he is far from the man I knew when I was growing up…",
                "Alcohol can make it difficult to uptake vitamins essential to the nervous system and brain.",
                "My father has this. Within a year he suddenly started losing his coordination and ability to walk. He is now wheelchair bound and can’t even go to the bathroom by himself. Hasn’t stopped drinking.",
                "35 units works out to about 2-3 drinks a day, 7 days a week. I would definitely lock in these numbers without even thinking about it nor feeling like I was abusing alcohol.",
                "I experienced 3 years of heavy alcoholism between 2017 and 2020 and I'm pretty convinced my ability to process information and retain that information has been reduced noticeably. It doesn't take long if it's a lot."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The Supreme Court rejects a plea to block a copper mine on land in Arizona that's sacred to Apaches",
            "external_url": "https://apnews.com/article/supreme-court-arizona-oak-flat-copper-mining-apache-64bb0d7c2bbf544f707ce3a421b67209",
            "upvotes": 2218,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I couldn't find It in the article, but which Justice is choosing to not hear the case? With Both Gorsuch, and Thomas saying this is a terrible outcome, was Kagan who oversees the 9th circuit, or was it Robert's that refused?",
                "There's a certain irony to being blatantly disrespectful to a truly indigenous group while simultaneously touting deportation for those who came only relatively slightly after we did.",
                "Arizona had way to many giant holes in the ground from abandoned copper mines already",
                "They just want the world to look like Blade Runner 2049.",
                "So weird that Gorsuch is such a die hard protector of Native rights (I’m here for it) while simultaneously being a POS on 99% of issues negativity affecting us Americans. A broken clock and all that I suppose.",
                "The last few years have really illuminated to those that didn’t experience the past as to why there was always a distrust in the American “way” from others. \n\nI’m not an old fart but getting close enough to that tenure to see that my studies in history, policy and politics were quality, spot on, and, well, bleak. I just really hope the young ones are tough enough to force the bright future for themselves and can guide this country to the become the place of promise that they were promised their whole lives. \n\nBe safe, youngins. As someone who lived through a bit of the good days, it’s worth fighting for. Now we know more and maybe rebuild a better way.",
                "From a link embedded in the article:\n\n>The family is Chiricahua Apache and Oak Flat, or Chi’chil Bildagoteel, is a consecrated place used for prayer and ritual by them and many other Native Americans in the region. Elders say the land was blessed by Usen, their Creator, and inhabited by Ga’an, the mountain spirits or angels who provide spiritual succor and guidance to seekers.\n\n>It is also here that Resolution Copper Mining, a joint subsidiary of British and Australian mining giants, Rio Tinto and BHP, wants to remove layers of rock to extract copper from deep underground. The in-demand metal is used for electric vehicle and cell phone manufacturing. In the works for nearly a decade, the project has stalled amid a legal fight between U.S. agencies and those trying to protect Oak Flat on religious grounds.\n\n>Resolution Copper President Vicky Peacey said the mine will be a “massive investment in rural Arizona” — creating 3,700 jobs over the course of the project and boosting state and local tax revenues by $88 million to $113 million a year. The company continues to “seek dialogue, to come to a collaboration and partnership,” said Tyson Nansel, a company spokesperson. “We need the copper. The town and the tribe need jobs,” Nansel said.\n\n\nIn other words, “Fuck your religion, we want money.”",
                "The primary function of government in a Capitalist society is to protect the interests of the bourgeoisie.",
                "This is a beautiful area used by many folks for recreation. A mine there will be awful. It’s a bad plan, and has been a bad plan for ages. I hope it never happens. It’ll be a loss that can’t be undone.",
                "Would they do this if it was on the Salt Lake Tabernacle land or on any christian church land.."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Supreme Court rejects case about student's 'There are only two genders' T-shirt",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-rejects-case-about-students-there-are-only-two-genders-t-shirt-2025-05-27/",
            "upvotes": 3989,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh no. His parent's get rich quick scam failed. \n\nSorry about that.",
                "So essentially a 12 year old was told to wear a shirt by his parents, and instead of accepting that the shirt is unreasonable and against policy, they decide to sue and use political discourse as a payday. \n\n  \nAbsolutely pathetic.",
                "That's about right. \n\nYou can't tie schools hands when enforcing dress codes. \n\nIF they had given this one a pass everyone and their brother could wear whatever offensive slogans and words they want in school and teachers would be powerless to enforce *any* sort of standards, or to make it clear that the school environment is not a place for political or civic disputes by immature teenage blowhards looking to pick a fight. \n\nThis shirt is no different then one that says \"African Americans are myth\" or \"there was no holocaust\", you can have those stupid and obviously asinine opinions, but when you are in school, administrators need to have the ability to keep you from inciting conflicts on school grounds... by wearing certain items *meant* to inflame and cause conflict.",
                "This is so bonkers, and manifestly done in bad faith.\n\nConservatives are the ones who WANT schools to be able to exercise greater-than-normal authority over students' speech.\n\n*Tinker v. Des Moines* in 1969 is the key controlling decision; in that case students sued their school after the school told them they could not wear black armbands to protest the Vietnam War. Guess which side the conservatives were on then? It wasn't the side that wants students to be able to wear political messages on their clothes in school!\n\nIn *Bethel School District v Frasier* in 1986, the Supreme Court held that schools have the right to restrict / prohibit student speech (in this case, vulgar innuendo in a commencement address). Again, conservatives would absolutely not want that student right restored / expanded.\n\nExcept but now we're supposed to believe that conservatives legitimately hold the opposite beliefs?\n\nCome on.\n\nOnce again, I resent how dumb and gullible right-wingers assume the rest of us are. The fucking nerve of these asswipes!",
                "Conservatives, just so I understand...\n\nIt's free speech to be on a government operated campus (public school) and denounce gender identity, but NOT free speech to be on a privately owned campus (a private college) and denounce Israel's handling of their war?\n\nThe latter is NOT free speech, but the former is?? Is that how this works?",
                "The \"I should be able to lie and insult anyone, anywhere, anytime\" free speech people.  \nThey create a Venn diagram that looks like a circle with the \"talking shit about Trump should land you in jail\" people. Very odd.",
                "> Morrison \"hoped to start a meaningful conversation on gender ideology\"\n\nPlease. There isn't a 12-year-old boy alive who wants to have a \"meaningful conversation\" about *anything*",
                "Always Alto and Thomas being shitheads together.",
                ">His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL oh bullshit, what does a 12 year old know about sex? This idiot isn't on some kind of enlightenment mission from a higher calling, he's a prop being used by his shit heel parents to cynically exploit a right-wing driven culture war issue.",
                ">Student Liam Morrison, along with his father and stepmother, sued officials at John T. Nichols Middle School and the town of Middleborough, seeking monetary damages.\n>While in seventh grade, Morrison wore the T-shirt reading \"There are only two genders\" to school in March 2023. His lawyers said in court papers he did so to \"share his view that gender and sex are identical, and there are only two sexes - male and female.\"\n>His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL. I'm sure that is why he wore it.  \nEven if you ignore transgender people, his statement is biologically, scientifically false. \n\nBut I'm sure a 7th grader is definitely looking to have a meaningful conversation about sex and gender identity.\n\nI hope he is sufficiently ostracized by the student population."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Multiple people shot at Brass Mill Center mall in Waterbury, police say",
            "external_url": "https://www.ctpost.com/waterbury/article/waterbury-brass-mill-center-mall-incident-police-20348031.php",
            "upvotes": 1273,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "WATERBURY — Waterbury police say multiple people were shot at Brass Mill Center mall on Union Street Tuesday afternoon.\n\nPolice said law enforcement is on the scene, and urged people to avoid the area to allow emergency personnel to respond. They said more information would be released as it becomes available.\n\nWitnesses on scene said about 45 police, fire and medical vehicles were on scene around 5:30 p.m. They saw city and state police enter the building with long rifles and K-9 units.\n\nPeople were being allowed to leave the mall in groups, a witness said.\n\nAn employee at Apple Cinemas Brass Mill said the shooting happened shortly before 4:40 p.m. They said they heard dozens of gunshots from the first floor of the mall in a matter of seconds, followed by screaming.\n\nFahd Syed's son was working inside the mall when the shooting occurred and he saw one of the injured victims on the floor screaming for help. Syed said his son couldn't help the woman \"because he didn't know if he was going to get shot himself.\"\n\nConnecticut State Police said troopers also responded to the incident, but directed any inquiries to the Waterbury Police Department.\n\nThis is a developing story and will be updated as information becomes available.\n\nReporters Andreas Yilma and Bruno Matarazzo contributed to this story.",
                "Took cops nearly an hour to enter. Most useless, they are only a clean up crew. \nYou are responsible for your own safety.",
                "Nothing solves an argument faster than gunfire.",
                "What country was this?  \n\nJust kidding.",
                "OK, what is this \"group on group\" stuff? It's been in this thread 3 times already. Is it the new talking point?",
                "Takes the police an hour to enter, at this point why even have the police show up, just wait and send in the morgue employees.",
                "Is there anything even open in that mall anymore?",
                "20 miles from Sandy Hook.",
                "If the shooting takes place at the mall or a park, the contents of what happened is pretty much known already. ",
                "More surprised people were at the mall than anyone was shot."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "X’s ‘Creator Revenue Sharing Program’ gets ‘totally pwned’ by Vietnamese click farm, lawsuit reveals",
            "external_url": "https://www.independent.co.uk/news/world/americas/elon-musk-x-vietnam-engagement-farming-b2756948.html",
            "upvotes": 13,
            "date": "05/28/2025",
            "thumbnail": "https://static.independent.co.uk/2025/05/23/19/37/Screenshot-2025-05-23-at-3-20-28-PM.png?trim=71,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 5 dead, 6 missing after China chemical plant blast",
            "external_url": "https://www.reuters.com/markets/emerging/large-blast-hits-chemical-plant-chinas-shandong-2025-05-27/",
            "upvotes": 189,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really hope we don't see \"boo yeah\" comments here. This is tragic, regardless of where it happens",
                "So at least eleven dead.",
                "Wow that's horrible",
                "[removed]",
                "China has low standards. Of course"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Grapevine Lake jet ski hit-and-run crash suspects arrested",
            "external_url": "https://www.fox4news.com/news/grapevine-lake-jet-ski-crash-suspect-arrested",
            "upvotes": 369,
            "date": "05/28/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/05/1280/720/jet-ski-suspects-and-victim.jpg?ve=1&tl=1",
            "top_comments": [
                "Glad they got em. Poor girl.\n\nNow Paxton and crew are gonna exploit the illegal immigrant part of the story and overshadow the tragedy. Ugh",
                "Haven't heard about it? How would I find out? ",
                "[deleted]",
                "House was blue. wtf? Why?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 5179,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "But but but....conservatives keep saying that *everyone* detained by ICE is automatically a criminal or gang member! /s\n\n🙄",
                "America is a dystopian nightmare.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "Document ICE actions especially identifying the officers involved. When Trump is gone, some of them will go to jail."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Multiple people shot at Brass Mill Center mall in Waterbury, police say",
            "external_url": "https://www.ctpost.com/waterbury/article/waterbury-brass-mill-center-mall-incident-police-20348031.php",
            "upvotes": 1266,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "WATERBURY — Waterbury police say multiple people were shot at Brass Mill Center mall on Union Street Tuesday afternoon.\n\nPolice said law enforcement is on the scene, and urged people to avoid the area to allow emergency personnel to respond. They said more information would be released as it becomes available.\n\nWitnesses on scene said about 45 police, fire and medical vehicles were on scene around 5:30 p.m. They saw city and state police enter the building with long rifles and K-9 units.\n\nPeople were being allowed to leave the mall in groups, a witness said.\n\nAn employee at Apple Cinemas Brass Mill said the shooting happened shortly before 4:40 p.m. They said they heard dozens of gunshots from the first floor of the mall in a matter of seconds, followed by screaming.\n\nFahd Syed's son was working inside the mall when the shooting occurred and he saw one of the injured victims on the floor screaming for help. Syed said his son couldn't help the woman \"because he didn't know if he was going to get shot himself.\"\n\nConnecticut State Police said troopers also responded to the incident, but directed any inquiries to the Waterbury Police Department.\n\nThis is a developing story and will be updated as information becomes available.\n\nReporters Andreas Yilma and Bruno Matarazzo contributed to this story.",
                "Took cops nearly an hour to enter. Most useless, they are only a clean up crew. \nYou are responsible for your own safety.",
                "Nothing solves an argument faster than gunfire.",
                "What country was this?  \n\nJust kidding.",
                "OK, what is this \"group on group\" stuff? It's been in this thread 3 times already. Is it the new talking point?",
                "Takes the police an hour to enter, at this point why even have the police show up, just wait and send in the morgue employees.",
                "Is there anything even open in that mall anymore?",
                "20 miles from Sandy Hook.",
                "If the shooting takes place at the mall or a park, the contents of what happened is pretty much known already. ",
                "More surprised people were at the mall than anyone was shot."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The Supreme Court rejects a plea to block a copper mine on land in Arizona that's sacred to Apaches",
            "external_url": "https://apnews.com/article/supreme-court-arizona-oak-flat-copper-mining-apache-64bb0d7c2bbf544f707ce3a421b67209",
            "upvotes": 2218,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I couldn't find It in the article, but which Justice is choosing to not hear the case? With Both Gorsuch, and Thomas saying this is a terrible outcome, was Kagan who oversees the 9th circuit, or was it Robert's that refused?",
                "There's a certain irony to being blatantly disrespectful to a truly indigenous group while simultaneously touting deportation for those who came only relatively slightly after we did.",
                "Arizona had way to many giant holes in the ground from abandoned copper mines already",
                "They just want the world to look like Blade Runner 2049.",
                "So weird that Gorsuch is such a die hard protector of Native rights (I’m here for it) while simultaneously being a POS on 99% of issues negativity affecting us Americans. A broken clock and all that I suppose.",
                "The last few years have really illuminated to those that didn’t experience the past as to why there was always a distrust in the American “way” from others. \n\nI’m not an old fart but getting close enough to that tenure to see that my studies in history, policy and politics were quality, spot on, and, well, bleak. I just really hope the young ones are tough enough to force the bright future for themselves and can guide this country to the become the place of promise that they were promised their whole lives. \n\nBe safe, youngins. As someone who lived through a bit of the good days, it’s worth fighting for. Now we know more and maybe rebuild a better way.",
                "From a link embedded in the article:\n\n>The family is Chiricahua Apache and Oak Flat, or Chi’chil Bildagoteel, is a consecrated place used for prayer and ritual by them and many other Native Americans in the region. Elders say the land was blessed by Usen, their Creator, and inhabited by Ga’an, the mountain spirits or angels who provide spiritual succor and guidance to seekers.\n\n>It is also here that Resolution Copper Mining, a joint subsidiary of British and Australian mining giants, Rio Tinto and BHP, wants to remove layers of rock to extract copper from deep underground. The in-demand metal is used for electric vehicle and cell phone manufacturing. In the works for nearly a decade, the project has stalled amid a legal fight between U.S. agencies and those trying to protect Oak Flat on religious grounds.\n\n>Resolution Copper President Vicky Peacey said the mine will be a “massive investment in rural Arizona” — creating 3,700 jobs over the course of the project and boosting state and local tax revenues by $88 million to $113 million a year. The company continues to “seek dialogue, to come to a collaboration and partnership,” said Tyson Nansel, a company spokesperson. “We need the copper. The town and the tribe need jobs,” Nansel said.\n\n\nIn other words, “Fuck your religion, we want money.”",
                "The primary function of government in a Capitalist society is to protect the interests of the bourgeoisie.",
                "This is a beautiful area used by many folks for recreation. A mine there will be awful. It’s a bad plan, and has been a bad plan for ages. I hope it never happens. It’ll be a loss that can’t be undone.",
                "Would they do this if it was on the Salt Lake Tabernacle land or on any christian church land.."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alcohol-related brain damage could affect thousands, warns expert",
            "external_url": "https://www.bbc.com/news/articles/c3e551eqpgdo",
            "upvotes": 3283,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ff06/live/2e61e3f0-3592-11f0-8f95-179a79186756.jpg",
            "top_comments": [
                "Thousands? Only thousands?",
                "I'd be very concerned if alcohol hadn't destroyed my ability to ready this ",
                "The article is referring to people who have had roughly 2-3 drinks a day on average for years if anyone is concerned by the title.",
                "Recently watched my father in law suffer from alcohol related brain problems. It was really hard. Wet brain is nothing to shake a stick at.",
                "Mike, from Breaking Bad, is looking pretty good.",
                "My dad has been drinking for like 50 years now, he is far from the man I knew when I was growing up…",
                "Alcohol can make it difficult to uptake vitamins essential to the nervous system and brain.",
                "My father has this. Within a year he suddenly started losing his coordination and ability to walk. He is now wheelchair bound and can’t even go to the bathroom by himself. Hasn’t stopped drinking.",
                "35 units works out to about 2-3 drinks a day, 7 days a week. I would definitely lock in these numbers without even thinking about it nor feeling like I was abusing alcohol.",
                "I experienced 3 years of heavy alcoholism between 2017 and 2020 and I'm pretty convinced my ability to process information and retain that information has been reduced noticeably. It doesn't take long if it's a lot."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 3971,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Delete Facebook. Delete Instagram. Delete Twitter. Sell $META.",
                "Show us your memes before you show up to class. This country is becoming a parody of itself.",
                "When the conservative loonies start cracking down on our civil rights, saying they are protecting us from international socialism, or the Chinese communist party, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start banning books and restricting the rights of queer people, saying they are protecting kids from pedophiles, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start cracking down on our students and protests, saying they are protecting us from antisemitism, the opposition… immediately takes this at face value and complains about how it’s really the Zionists who control the media and the world .\n\nisn’t that interesting",
                "Aka Taking away freedom of speech if it disagrees with them. This is against the constitution",
                "Remember folks, the slippery slope starts with student visas. \n\nWon't be long until YOUR social media is being \"vetted\"",
                "Blatently fascist and against the first amendment. Fucking remove this clown already.",
                "The GOP needs to be declared a terrorist organization and have their members be marked as suspected terrorists subject to enhanced interrogation. Time to start stuffing them and their families into unmarked vans and sent off to gulags. Thanks for teaching me how to govern Fuhrer Trump!\n\nMaybe we can also have a fake crisis to justify seizing wartime powers to round them all up. Trump has some really nice ideas."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 23166,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "Its not corruption if its out in the open, right?",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "Can we collectively pay Trump to go fuck himself?",
                "Well, now you know how much a pardon costs.",
                "Oh and of course he's a nursing home executive. Might as well own a payday loan business.\n\nEdit: *and he shorted the healthcare workers' paychecks to buy himself a fucking yacht.*",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years.",
                "Republicans are for sale. I'm not surprised with these articles any longer and have come to expect this kind of behavior from them.",
                "Launch DOGE to find government fraud,  pardons a guy that committed actual tax fraud.  Makes sense"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Victims in French Le Scouarnec child abuse trial shocked at public indifference",
            "external_url": "https://www.bbc.com/news/articles/cvg559zz3d8o",
            "upvotes": 1484,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8335/live/e448e4d0-3663-11f0-a2c9-cb3e24c16fff.jpg",
            "top_comments": [
                "Crazy that I haven't heard about this case. Thanks for posting it, it should be the top news story quite honestly. Any time a doctor uses their power and access for evil should be front page news. As a pediatrician it makes me absolutely sick.",
                "The fact that I have never heard of it till this article is why. It's telling I never heard of this but can tell you all about the conspiracy of kids hidden in Ikea furniture.",
                "read through to where the people complicit with this monster explain themselves:\n\n\"I was advised not to talk about such and such a person,\" said one doctor who'd tried to sound the alarm.\n\n\"There is a shortage of surgeons, and those who show up are welcomed like the messiah,\" explained a hospital director.\n\n\"I messed up, I admit it, like the whole hierarchy,\" a different administrator finally conceded.\n\nWow man... if they did and saidin the US they would fall under the \"manditory reporter law.\"  I guess that's not a thing in France?",
                ">She spoke of a patriarchal society in which men in respected positions like medicine remained almost beyond reproach and pointed to \"the silence of those who knew, those who looked the other way, and those who could have – should have – raised the alarm\".\n\nAlso, pedophilia has been pushed in France for decades--often by some big name French artists, film makers, and intellectuals.",
                "Yes. I've heard about it like, 2 years ago when the affair came out. It was horrific but some details were still hidden. Now that the trial is occurring and we finally know about this madness... \n\nMan can be profoundly corrupted. It's awful. It's this guy now, it was another yesterday and it will be another tomorrow. What else is there to say?? \n\nThe fact that the authorities failed to see and stop it doesn't surprise me. Our administration is tired.",
                "I am French and there’s a reason France is called pedoland. Weed will get you more jail time than abusing children",
                "As awful as this is I find it frustrating that the article is focused on attention rather than accountability. \n\nThe goal should be to hold the perpetrator(s) accountable through the legal system. Public outcry shouldn't be necessary to get that kind of legal accountability. If the general public doesn't have to be outraged about something that's a good thing. \n\nWhat's not clear from this article is who might not be held accountable in the current process. Le Scouarnec has pled guilty and will spend the rest of his life in prison. That may not be enough but it's the most that can be done to him.\n\nIf there are other people who should also be held accountable then it's not clear from the article who they might be.",
                "Maybe we shouldn’t be shocked. I mean one seems to care about or even mention the Catholic Church having covered up thousands upon thousands of child abuse cases. Hell, they’re still doing so, not to mention fighting for the right to continue doing so as I type. \n\n“Handling it internally” for the church turns out to mean “send this sexual predator to a new children’s bible school”. If people don’t care about that, how can we expect them to care about children being abused ever?\n\nI hope I don’t sound like too much of a cynical dickhead. It is not my intention, anyway. \n\nIt’s all so fucking fucked up. It makes my blood absolutely boil.",
                "They are too busy talking about Muslims and scarfs,\nwhile hundreds of kids have been abused in catholic schools and by this doctor.\nIf he was Arabic, it would’ve been another story",
                "There is only so much horrible stuff and general citizen can take in and then still opperate as society expects. The pelicot trial took most of that energy for the near future. Should have delayed the whole show for a year or so. Too much horrible stuff is currently happening. The minds are overfed."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 5184,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "But but but....conservatives keep saying that *everyone* detained by ICE is automatically a criminal or gang member! /s\n\n🙄",
                "America is a dystopian nightmare.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "Document ICE actions especially identifying the officers involved. When Trump is gone, some of them will go to jail."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The Supreme Court rejects a plea to block a copper mine on land in Arizona that's sacred to Apaches",
            "external_url": "https://apnews.com/article/supreme-court-arizona-oak-flat-copper-mining-apache-64bb0d7c2bbf544f707ce3a421b67209",
            "upvotes": 2221,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I couldn't find It in the article, but which Justice is choosing to not hear the case? With Both Gorsuch, and Thomas saying this is a terrible outcome, was Kagan who oversees the 9th circuit, or was it Robert's that refused?",
                "There's a certain irony to being blatantly disrespectful to a truly indigenous group while simultaneously touting deportation for those who came only relatively slightly after we did.",
                "Arizona had way to many giant holes in the ground from abandoned copper mines already",
                "They just want the world to look like Blade Runner 2049.",
                "So weird that Gorsuch is such a die hard protector of Native rights (I’m here for it) while simultaneously being a POS on 99% of issues negativity affecting us Americans. A broken clock and all that I suppose.",
                "The last few years have really illuminated to those that didn’t experience the past as to why there was always a distrust in the American “way” from others. \n\nI’m not an old fart but getting close enough to that tenure to see that my studies in history, policy and politics were quality, spot on, and, well, bleak. I just really hope the young ones are tough enough to force the bright future for themselves and can guide this country to the become the place of promise that they were promised their whole lives. \n\nBe safe, youngins. As someone who lived through a bit of the good days, it’s worth fighting for. Now we know more and maybe rebuild a better way.",
                "From a link embedded in the article:\n\n>The family is Chiricahua Apache and Oak Flat, or Chi’chil Bildagoteel, is a consecrated place used for prayer and ritual by them and many other Native Americans in the region. Elders say the land was blessed by Usen, their Creator, and inhabited by Ga’an, the mountain spirits or angels who provide spiritual succor and guidance to seekers.\n\n>It is also here that Resolution Copper Mining, a joint subsidiary of British and Australian mining giants, Rio Tinto and BHP, wants to remove layers of rock to extract copper from deep underground. The in-demand metal is used for electric vehicle and cell phone manufacturing. In the works for nearly a decade, the project has stalled amid a legal fight between U.S. agencies and those trying to protect Oak Flat on religious grounds.\n\n>Resolution Copper President Vicky Peacey said the mine will be a “massive investment in rural Arizona” — creating 3,700 jobs over the course of the project and boosting state and local tax revenues by $88 million to $113 million a year. The company continues to “seek dialogue, to come to a collaboration and partnership,” said Tyson Nansel, a company spokesperson. “We need the copper. The town and the tribe need jobs,” Nansel said.\n\n\nIn other words, “Fuck your religion, we want money.”",
                "The primary function of government in a Capitalist society is to protect the interests of the bourgeoisie.",
                "This is a beautiful area used by many folks for recreation. A mine there will be awful. It’s a bad plan, and has been a bad plan for ages. I hope it never happens. It’ll be a loss that can’t be undone.",
                "Would they do this if it was on the Salt Lake Tabernacle land or on any christian church land.."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Grapevine Lake jet ski hit-and-run crash suspects arrested",
            "external_url": "https://www.fox4news.com/news/grapevine-lake-jet-ski-crash-suspect-arrested",
            "upvotes": 364,
            "date": "05/28/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/05/1280/720/jet-ski-suspects-and-victim.jpg?ve=1&tl=1",
            "top_comments": [
                "Glad they got em. Poor girl.\n\nNow Paxton and crew are gonna exploit the illegal immigrant part of the story and overshadow the tragedy. Ugh",
                "Haven't heard about it? How would I find out? ",
                "[deleted]",
                "House was blue. wtf? Why?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 3971,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Delete Facebook. Delete Instagram. Delete Twitter. Sell $META.",
                "Show us your memes before you show up to class. This country is becoming a parody of itself.",
                "When the conservative loonies start cracking down on our civil rights, saying they are protecting us from international socialism, or the Chinese communist party, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start banning books and restricting the rights of queer people, saying they are protecting kids from pedophiles, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start cracking down on our students and protests, saying they are protecting us from antisemitism, the opposition… immediately takes this at face value and complains about how it’s really the Zionists who control the media and the world .\n\nisn’t that interesting",
                "Aka Taking away freedom of speech if it disagrees with them. This is against the constitution",
                "Remember folks, the slippery slope starts with student visas. \n\nWon't be long until YOUR social media is being \"vetted\"",
                "Blatently fascist and against the first amendment. Fucking remove this clown already.",
                "The GOP needs to be declared a terrorist organization and have their members be marked as suspected terrorists subject to enhanced interrogation. Time to start stuffing them and their families into unmarked vans and sent off to gulags. Thanks for teaching me how to govern Fuhrer Trump!\n\nMaybe we can also have a fake crisis to justify seizing wartime powers to round them all up. Trump has some really nice ideas."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 23153,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "Its not corruption if its out in the open, right?",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "Can we collectively pay Trump to go fuck himself?",
                "Well, now you know how much a pardon costs.",
                "Oh and of course he's a nursing home executive. Might as well own a payday loan business.\n\nEdit: *and he shorted the healthcare workers' paychecks to buy himself a fucking yacht.*",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years.",
                "Republicans are for sale. I'm not surprised with these articles any longer and have come to expect this kind of behavior from them.",
                "Launch DOGE to find government fraud,  pardons a guy that committed actual tax fraud.  Makes sense"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Multiple people shot at Brass Mill Center mall in Waterbury, police say",
            "external_url": "https://www.ctpost.com/waterbury/article/waterbury-brass-mill-center-mall-incident-police-20348031.php",
            "upvotes": 1265,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "WATERBURY — Waterbury police say multiple people were shot at Brass Mill Center mall on Union Street Tuesday afternoon.\n\nPolice said law enforcement is on the scene, and urged people to avoid the area to allow emergency personnel to respond. They said more information would be released as it becomes available.\n\nWitnesses on scene said about 45 police, fire and medical vehicles were on scene around 5:30 p.m. They saw city and state police enter the building with long rifles and K-9 units.\n\nPeople were being allowed to leave the mall in groups, a witness said.\n\nAn employee at Apple Cinemas Brass Mill said the shooting happened shortly before 4:40 p.m. They said they heard dozens of gunshots from the first floor of the mall in a matter of seconds, followed by screaming.\n\nFahd Syed's son was working inside the mall when the shooting occurred and he saw one of the injured victims on the floor screaming for help. Syed said his son couldn't help the woman \"because he didn't know if he was going to get shot himself.\"\n\nConnecticut State Police said troopers also responded to the incident, but directed any inquiries to the Waterbury Police Department.\n\nThis is a developing story and will be updated as information becomes available.\n\nReporters Andreas Yilma and Bruno Matarazzo contributed to this story.",
                "Took cops nearly an hour to enter. Most useless, they are only a clean up crew. \nYou are responsible for your own safety.",
                "Nothing solves an argument faster than gunfire.",
                "What country was this?  \n\nJust kidding.",
                "OK, what is this \"group on group\" stuff? It's been in this thread 3 times already. Is it the new talking point?",
                "Takes the police an hour to enter, at this point why even have the police show up, just wait and send in the morgue employees.",
                "Is there anything even open in that mall anymore?",
                "20 miles from Sandy Hook.",
                "If the shooting takes place at the mall or a park, the contents of what happened is pretty much known already. ",
                "More surprised people were at the mall than anyone was shot."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Alcohol-related brain damage could affect thousands, warns expert",
            "external_url": "https://www.bbc.com/news/articles/c3e551eqpgdo",
            "upvotes": 3284,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ff06/live/2e61e3f0-3592-11f0-8f95-179a79186756.jpg",
            "top_comments": [
                "Thousands? Only thousands?",
                "I'd be very concerned if alcohol hadn't destroyed my ability to ready this ",
                "The article is referring to people who have had roughly 2-3 drinks a day on average for years if anyone is concerned by the title.",
                "Recently watched my father in law suffer from alcohol related brain problems. It was really hard. Wet brain is nothing to shake a stick at.",
                "Mike, from Breaking Bad, is looking pretty good.",
                "My dad has been drinking for like 50 years now, he is far from the man I knew when I was growing up…",
                "Alcohol can make it difficult to uptake vitamins essential to the nervous system and brain.",
                "My father has this. Within a year he suddenly started losing his coordination and ability to walk. He is now wheelchair bound and can’t even go to the bathroom by himself. Hasn’t stopped drinking.",
                "35 units works out to about 2-3 drinks a day, 7 days a week. I would definitely lock in these numbers without even thinking about it nor feeling like I was abusing alcohol.",
                "I experienced 3 years of heavy alcoholism between 2017 and 2020 and I'm pretty convinced my ability to process information and retain that information has been reduced noticeably. It doesn't take long if it's a lot."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Victims in French Le Scouarnec child abuse trial shocked at public indifference",
            "external_url": "https://www.bbc.com/news/articles/cvg559zz3d8o",
            "upvotes": 1483,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8335/live/e448e4d0-3663-11f0-a2c9-cb3e24c16fff.jpg",
            "top_comments": [
                "Crazy that I haven't heard about this case. Thanks for posting it, it should be the top news story quite honestly. Any time a doctor uses their power and access for evil should be front page news. As a pediatrician it makes me absolutely sick.",
                "The fact that I have never heard of it till this article is why. It's telling I never heard of this but can tell you all about the conspiracy of kids hidden in Ikea furniture.",
                "read through to where the people complicit with this monster explain themselves:\n\n\"I was advised not to talk about such and such a person,\" said one doctor who'd tried to sound the alarm.\n\n\"There is a shortage of surgeons, and those who show up are welcomed like the messiah,\" explained a hospital director.\n\n\"I messed up, I admit it, like the whole hierarchy,\" a different administrator finally conceded.\n\nWow man... if they did and saidin the US they would fall under the \"manditory reporter law.\"  I guess that's not a thing in France?",
                ">She spoke of a patriarchal society in which men in respected positions like medicine remained almost beyond reproach and pointed to \"the silence of those who knew, those who looked the other way, and those who could have – should have – raised the alarm\".\n\nAlso, pedophilia has been pushed in France for decades--often by some big name French artists, film makers, and intellectuals.",
                "Yes. I've heard about it like, 2 years ago when the affair came out. It was horrific but some details were still hidden. Now that the trial is occurring and we finally know about this madness... \n\nMan can be profoundly corrupted. It's awful. It's this guy now, it was another yesterday and it will be another tomorrow. What else is there to say?? \n\nThe fact that the authorities failed to see and stop it doesn't surprise me. Our administration is tired.",
                "I am French and there’s a reason France is called pedoland. Weed will get you more jail time than abusing children",
                "As awful as this is I find it frustrating that the article is focused on attention rather than accountability. \n\nThe goal should be to hold the perpetrator(s) accountable through the legal system. Public outcry shouldn't be necessary to get that kind of legal accountability. If the general public doesn't have to be outraged about something that's a good thing. \n\nWhat's not clear from this article is who might not be held accountable in the current process. Le Scouarnec has pled guilty and will spend the rest of his life in prison. That may not be enough but it's the most that can be done to him.\n\nIf there are other people who should also be held accountable then it's not clear from the article who they might be.",
                "Maybe we shouldn’t be shocked. I mean one seems to care about or even mention the Catholic Church having covered up thousands upon thousands of child abuse cases. Hell, they’re still doing so, not to mention fighting for the right to continue doing so as I type. \n\n“Handling it internally” for the church turns out to mean “send this sexual predator to a new children’s bible school”. If people don’t care about that, how can we expect them to care about children being abused ever?\n\nI hope I don’t sound like too much of a cynical dickhead. It is not my intention, anyway. \n\nIt’s all so fucking fucked up. It makes my blood absolutely boil.",
                "They are too busy talking about Muslims and scarfs,\nwhile hundreds of kids have been abused in catholic schools and by this doctor.\nIf he was Arabic, it would’ve been another story",
                "There is only so much horrible stuff and general citizen can take in and then still opperate as society expects. The pelicot trial took most of that energy for the near future. Should have delayed the whole show for a year or so. Too much horrible stuff is currently happening. The minds are overfed."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Supreme Court rejects case about student's 'There are only two genders' T-shirt",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-rejects-case-about-students-there-are-only-two-genders-t-shirt-2025-05-27/",
            "upvotes": 3981,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh no. His parent's get rich quick scam failed. \n\nSorry about that.",
                "So essentially a 12 year old was told to wear a shirt by his parents, and instead of accepting that the shirt is unreasonable and against policy, they decide to sue and use political discourse as a payday. \n\n  \nAbsolutely pathetic.",
                "That's about right. \n\nYou can't tie schools hands when enforcing dress codes. \n\nIF they had given this one a pass everyone and their brother could wear whatever offensive slogans and words they want in school and teachers would be powerless to enforce *any* sort of standards, or to make it clear that the school environment is not a place for political or civic disputes by immature teenage blowhards looking to pick a fight. \n\nThis shirt is no different then one that says \"African Americans are myth\" or \"there was no holocaust\", you can have those stupid and obviously asinine opinions, but when you are in school, administrators need to have the ability to keep you from inciting conflicts on school grounds... by wearing certain items *meant* to inflame and cause conflict.",
                "This is so bonkers, and manifestly done in bad faith.\n\nConservatives are the ones who WANT schools to be able to exercise greater-than-normal authority over students' speech.\n\n*Tinker v. Des Moines* in 1969 is the key controlling decision; in that case students sued their school after the school told them they could not wear black armbands to protest the Vietnam War. Guess which side the conservatives were on then? It wasn't the side that wants students to be able to wear political messages on their clothes in school!\n\nIn *Bethel School District v Frasier* in 1986, the Supreme Court held that schools have the right to restrict / prohibit student speech (in this case, vulgar innuendo in a commencement address). Again, conservatives would absolutely not want that student right restored / expanded.\n\nExcept but now we're supposed to believe that conservatives legitimately hold the opposite beliefs?\n\nCome on.\n\nOnce again, I resent how dumb and gullible right-wingers assume the rest of us are. The fucking nerve of these asswipes!",
                "Conservatives, just so I understand...\n\nIt's free speech to be on a government operated campus (public school) and denounce gender identity, but NOT free speech to be on a privately owned campus (a private college) and denounce Israel's handling of their war?\n\nThe latter is NOT free speech, but the former is?? Is that how this works?",
                "The \"I should be able to lie and insult anyone, anywhere, anytime\" free speech people.  \nThey create a Venn diagram that looks like a circle with the \"talking shit about Trump should land you in jail\" people. Very odd.",
                "> Morrison \"hoped to start a meaningful conversation on gender ideology\"\n\nPlease. There isn't a 12-year-old boy alive who wants to have a \"meaningful conversation\" about *anything*",
                "Always Alto and Thomas being shitheads together.",
                ">His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL oh bullshit, what does a 12 year old know about sex? This idiot isn't on some kind of enlightenment mission from a higher calling, he's a prop being used by his shit heel parents to cynically exploit a right-wing driven culture war issue.",
                ">Student Liam Morrison, along with his father and stepmother, sued officials at John T. Nichols Middle School and the town of Middleborough, seeking monetary damages.\n>While in seventh grade, Morrison wore the T-shirt reading \"There are only two genders\" to school in March 2023. His lawyers said in court papers he did so to \"share his view that gender and sex are identical, and there are only two sexes - male and female.\"\n>His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL. I'm sure that is why he wore it.  \nEven if you ignore transgender people, his statement is biologically, scientifically false. \n\nBut I'm sure a 7th grader is definitely looking to have a meaningful conversation about sex and gender identity.\n\nI hope he is sufficiently ostracized by the student population."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 21120,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "[removed]",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "Let's see the double blind data from the peer reviewed study.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "Nobody should take medical advice from him according to his own words but he gets to dictate what medications are recommended to the general public 🤔"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/28/2025 04:14:04 UTC"
}