{
    "posts": [
        {
            "category": "HOT",
            "title": "British Columbia woman detained at U.S. border, sent to Arizona detention facility in chains",
            "external_url": "https://vancouversun.com/news/bc-woman-detained-at-us-border-sent-to-arizona-detention-facility",
            "upvotes": 9923,
            "date": "03/13/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/jasmine-mooney_294005028.jpg",
            "top_comments": [
                "\n#Canadian Woman Detained at US Border in Harrowing Ordeal\n\nA British Columbia woman has found herself trapped in a nightmare after being unexpectedly detained at the US border and transferred to an Arizona detention centre under conditions her family describes as inhumane.\n\nJasmine Mooney, a 35-year-old businesswoman from Abbotsford, was attempting to enter the United States through the San Ysidro border crossing between Mexico and San Diego on 3 March. She had hoped to apply for a Trade NAFTA (TN) work visa, but her paperwork was incomplete. Instead of being turned away or allowed to rectify the issue, she was arrested by US border officers and placed in detention.\n\nWhat followed has left her mother, Alexis Eagles, desperate for answers. After three nights at a San Diego detention centre, Mooney was handed over to US Immigration and Customs Enforcement. For a brief moment, her family thought she had been released when an online tracking system marked her as free. Then she vanished.\n\nPanic set in when hours turned into a full day with no word from her. Eventually, the family learned that Mooney and around thirty others had been pulled from their cells in the middle of the night and transported to the San Luis Detention Center in Arizona. There, according to reports from inside, she has been crammed into a concrete cell with no natural light, harsh fluorescent bulbs that never switch off, no proper bedding and limited bathroom facilities.\n\nMooney has not been charged with any crime. She has no criminal record. She has simply been caught in a bureaucratic nightmare that has left her in chains, awaiting a resolution that remains unclear.\n\nHer mother is not disputing the right of US authorities to refuse Mooney entry. She does, however, take issue with the treatment her daughter is enduring. Mooney herself, in text messages to a business partner, described the conditions as \"inhumane.\" The women in detention are sleeping on mats, the food is barely edible, and the lights make proper rest impossible. Despite the circumstances, Mooney has tried to stay strong, telling her friend that she is in a better position than others and must keep going.\n\nMooney is no stranger to hard work. She built a career in Vancouver’s hospitality industry after moving there from the Yukon in 2008, later expanding into the health and wellness sector. Her most recent work had her involved in Los Angeles, where she had previously been granted a TN work visa. That visa was revoked in November last year when she attempted to return to the US after a vacation. This time, hoping to secure another visa, she took the route that had worked for her before, crossing from Mexico. It was a decision that led to an ordeal beyond anything she could have imagined.\n\nHer business partner, BJ McCaslin, has been in touch with her through a prison communication app and is deeply concerned. He does not understand why she remains detained when there is no evidence of wrongdoing.\n\nGlobal Affairs Canada has acknowledged Mooney's detention and confirmed that consular officials are in contact with US authorities. Beyond that, they say little can be done. While governments may express concern, they rarely intervene when another country enforces its own immigration rules.\n\nThat leaves Mooney and her family in an agonising state of limbo. They are not asking for special treatment, only basic human decency. For now, all they can do is wait, and hope that her ordeal does not stretch on indefinitely.",
                "THIS is another reason for Canadians to avoid all US travel.",
                "Perhaps countries should issue travel advisories for the U.S.",
                "And the other people in her situation don't even have a resourceful Canadian mom to get attention to their cause, so even if the poor woman who in no way deserves this random act of cruelty by the US regime is released the problem remains",
                "Why not just turn her back? There’s no reason to lock her up. I hope they get the ACLU involved. She has constitutional rights and they’re being violated.",
                "The Terror begins. To be clear, this woman was detained because her application to renew her work visa was incomplete. That's it. That's all she did and she ended up in a cell for a week with nothing but a mat and rotten food.",
                "How're the US supposed to host the world cup next year if they're putting loads of people in chains??\n\nI have a feeling foreigners may want to stay away and stadiums will be empty af",
                "So I’ve been reading a book recently (When Mckinsey comes to town) and it says during the first Trump admiration many ICE employees had begun to find the work distasteful based on the orders coming from the government at that time, as well as bad press. As a result ICE was struggling to find and retain employees. The solution? Change hiring practices to recruit neckbeards who get a kick out of having the power to detain and arrest people. Basically adult Eric Cartmans demanding “respect ma authoritah!” It’s all Trump loyalists now. Same goes for many police forces.",
                "> “We eventually learned that about 30 people, including Jasmine, were removed from their cells at 3 a.m. and transferred to the San Luis Detention Center in Arizona. They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.\"\n\n So she tried to go to the border with a new job offer and visa paperwork. This was the process she'd followed before, and she was trying to follow the laws to the best of her understanding. Instead they put her in chains and did this to her. People in our prison system are treated with more dignity than this.",
                "This isn't about security—it's about cruelty. And the worst part? There’s no accountability. ICE can do whatever they want, and people like Mooney are left in limbo. America’s broken system strikes again."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Ayo Edebiri ‘got insane death threats’ after Elon Musk shared fake report about Pirates of the Caribbean casting | Movies",
            "external_url": "https://www.theguardian.com/film/2025/mar/12/ayo-edebiri-got-insane-death-threats-after-elon-musk-shared-fake-report-about-pirates-of-the-caribbean-casting",
            "upvotes": 3058,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f177e2f93bdfbad4a59315adf7ca12135d9e10d0/0_0_3828_2297/master/3828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6c37eab200b27b17b52533c0edb15ce",
            "top_comments": [
                "> The Bear actor called Musk a fascist and an idiot after his reaction to a post from a rightwing account that claimed she was replacing Johnny Depp.\n\nThis man needs to lose another hundred billion+ in net worth and fade into obscurity. We also need to stop ignoring the severity of online harassment.",
                "> Responding to Edebiri’s post on Wednesday, the owner of the original account said: “I clearly stated ‘reportedly’ because it was the latest information coming from credible Hollywood sources. And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.\n\nSome people are fucking cultish and weird",
                "[removed]",
                "A dark-skinned person in the Caribbean? Who would have thought?",
                "Now that the government is a goner well never get this but boy do we need to start revamping how society treats digital threata in general and especially anonymous digital threats.",
                "She is fucking Caribbean!! People are insane.",
                "Why can’t the x outage be more permanent!?",
                "Elon about to clarify: \"This is Ukraine's fault\".",
                "I remember in the 90s and early 2000s there was serious concern about online cyber bullying and death threats. There was a lot of talk about passing laws to stop it and most closely regulate these platforms. \n\nThen big tech got into bed with the government and everyone became “free speech absolutists”. \n\nNo other culture at no other point in history would allow this sort of shit to persist like we have.",
                "The owner of the X account said, \"And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.” \n\nI can't even.."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 50553,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "It's always the ones you most suspect. ",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "It's sad that it took 40+ years for him to face justice. The article says the accuser tried getting the rapist to pay for therapy in 2007 but she wouldn't sign an NDA so he wouldn't. \n\nThat means for atleast 18 years (probably more) she has been actively trying to get justice. All while he probably made millions of dollars and most likely abused others. \n\n>Morris was a member of President Donald Trump's spiritual advisory committee during his first term.\n\nWow. Of course the guy who raped a 12 year old was in Trump's cabinet.",
                "This is the free space on the BINGO card",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 11799,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "i think that's illegal",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "They may have condemned the kid to death basically. Heart breaking. I live in the area where they were living so this hits home"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Baby wombat-snatching US influencer at risk of losing Australian visa",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/13/sam-jones-us-influencer-baby-wombat-stolen-from-mother-ntwnfb",
            "upvotes": 4328,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0560f44a8da1ddb4f316428666c2344dcc6a6aa1/632_287_1104_662/master/1104.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b6e7d88616efb53cb511458b3581440d",
            "top_comments": [
                "Good.  Kick her ass out.  I had just watched the video of her doing this.",
                "Stupid influencers are the absolute cancer of society!",
                "What an absolute piece of trash.",
                ">The Australian prime minister, Anthony Albanese, said it was “an outrage” Jones had separated the joey from its mother.\n\n>“Maybe she might try some other Australian animals,” he said at a press conference, when asked about the incident. “Take a baby crocodile from its mother and see how you go there. Take another animal that can actually fight back rather than stealing a baby wombat from its mother. See how you go there.”\n\nYou guys are the best over there!",
                "Who's the fuckwit with her? Should bloody know better, but clearly doesn't give a shit.",
                "I’d rather she sit in jail for a while and then get deported,  but losing her visa and being banned from the country would be a decent next alternative",
                "“I can’t wait to see the back of this individual,” the home affairs minister, Tony Burke\n\nSo is booting actually one of their proudest traditions?",
                "She has 1.1k subs on YouTube and 1.8k followers on IG.  Does this count as an influencer?",
                "Animal cruelity, fucking psychopath. \n\nThrow her in prison, then throw out and ban this this piece of shit.",
                "Learn from S.Korea, throw these dummies in jail, and publicly shame them."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Ex-Barclays boss Jes Staley admits having sex with member of Jeffrey Epstein staff",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/prince-andrew-was-told-epstein-saw-staley-as-close-friend-court-hears",
            "upvotes": 1820,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/04e2750c268e7207cf2fb69e13bf809f2fafa13d/0_48_1342_805/master/1342.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cf0f7fb1861542bab5330e2f6706c8",
            "top_comments": [
                "I love how the thumbnail to this article is Prince Andrew - despite him having nothing to do with the story. \n\nI guess he’s just the placeholder face of anything to do with Epstein.",
                "In the article:\n\n>***The former chief executive of Barclays, Jes Staley, has admitted to having sex with a member of Jeffrey Epstein’s staff in an apartment owned by the child sex offender’s brother in New York, a court has heard.***\n\n>*Staley made the admission at the end of a testy day of cross-examination at the upper tribunal, but maintained that his friendship with Epstein was not personal and had always been based on business.*\n\n>***The former Barclays boss, who resigned in 2021, is trying to overturn the regulator’s decision to ban him from taking any senior roles in the UK financial sector for allegedly lying about the depth of his relationship with Epstein. Barclays declared to the*** [***Financial Conduct Authority***](https://www.theguardian.com/business/financial-conduct-authority) ***(FCA) in a letter in 2019 that the two men “did not have a close relationship”.***\n\n>***The FCA’s lawyer Leigh-Ann Mulcahy KC handed documents to Staley and tribunal judges without presenting them to the public, before asking Staley: “Do you accept that you had sexual intercourse with a woman at Mr Epstein’s brother’s apartment?”***\n\n>***“Yes,” Staley said. The former CEO, who is married and has two daughters, acknowledged he met the woman through Epstein, but while he told the court “she was part of his staff”, he claimed Epstein did not know they had sex.***\n\n>*“How did it come about that you had sexual intercourse with a woman who worked for him at an apartment, owned by his brother, without him knowing?” Mulcahy asked.*\n\n>*Staley said: “Oftentimes I would go to Epstein’s apartment and he would be late, and she and I got the chance to know each other.” This led to sexual intercourse, he said, “much to my embarrassment today”.*\n\n>*The ex-banker agreed with Mulcahy that he would describe the intercourse as “consensual”. The date of the encounter and the age of the woman were not disclosed in court. The FCA stated that the property was owned by Epstein’s brother.*\n\n>*Mulcahy also put to Staley that the staff member “appeared to have carved you out of a settlement with the Epstein estate”. Staley replied he was “not aware of that”.*\n\n>*The ex-Barclays boss also maintained that he did not remember the context for a separate, and now notorious, exchange with Epstein in 2010 referring to Disney princesses.*",
                "*\"Oftentimes I would go to Epstein’s apartment and he would be late\"* yeah that sounds like a purely \"business\" relationship",
                "“The date of the encounter and age of the woman were not discussed in court” \n\nShe was a minor. Court talking about “maybe we shouldn’t give him a high ranking position in the UK” \n\nwtf?! This creep needs to be tossed off the top of a high rise",
                "It’s good to know all these disgusting people work together in the banking industry. I’m sure they would never break rules or laws at work",
                "Epstein’s “staff” = underaged girls",
                "The Disney Princess thing should be evidence enough of his involvement in sex trafficking.\n\n\nThrow the dirty beast in jail. ",
                "His wife and daughters must be proud...",
                "Kinda like trying to meet somewhere in the middle... \n\n\"Okay I was on the island... But I only got with the waitress !\" \n\n\n....\n\nThe waitress happens to be a 14 yr old... \n\n\nEveryone needs to be thrown under the bus.",
                "He schtupped Prince Andrew?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 17100,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Well, it's better than having the rocket blow up.",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "What he would be sending up is a new capsule with replacements and supplies. They already have a dragon capsule up there if they need to leave the station but it would only leave the Russian portion manned.",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 6247,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "So glad we elected Trump to Make America Healthy Again",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane.",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "“We don’t need trees from Canada, we have National Parks”"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Trump Family Has Held Deal Talks With Binance Following Crypto Exchange’s Guilty Plea",
            "external_url": "https://www.wsj.com/finance/currencies/trump-family-has-held-deal-talks-with-binance-following-crypto-exchanges-guilty-plea-05b029fa?mod=hp_lead_pos1",
            "upvotes": 396,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grifters helping grifters, Making Amazing Grifts Always.",
                "tHe bIdEN crImE FaMiLy",
                "Crypto and crime: a winning combination",
                "The weirdest thing is MAGA has somehow convinced a large percentage of the US population that everything is corrupt except Trump and the random drug addict that is destroying the US government is somehow uncovering corruption and fraud. ",
                "Silver lining: A global recession will destroy crypto.",
                "*So how do we get into this grift?*",
                "Sounds legit. Nothing to see here. Something something trans Canadian DEI."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Canada hits U.S. with dollar-for-dollar retaliation for Trump’s steel and aluminum tariffs",
            "external_url": "https://www.ctvnews.ca/world/trumps-tariffs/article/canada-to-announce-298-billion-in-retaliatory-tariffs-on-us-official-tells-reuters/",
            "upvotes": 3315,
            "date": "03/13/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/O2Z3R2AGDRBHPAVMLPWN67KEVU.JPG?smart=true&auth=d37064364955204825c361d2b31d8e8e2ee31af7d9968a7e20c781659e87a7af&width=1200&height=630",
            "top_comments": [
                "What's crazy is even Trump still doesn't seem to understand he's taxing Americans.",
                "If only someone could have seen this coming...",
                ">According to the federal government, the list of additional products affected by counter-tariffs includes tools, computers and servers, display monitors, water heaters, sport equipment, and cast-iron products.  \n  \nThe full list of fresh items slated to face tariffs as of Thursday, was issued late Wednesday afternoon. It includes jewelry, watches, tricycles, video game consoles, smartphones, umbrellas, gongs, golf clubs, fishing poles, and lighters.\n\nI wished there was a better way to see the products being tariffed. Even the video game consoles info gave me:\n\n>Video game consoles and machines, table or parlour games, including pintables, billiards, special tables for casino games and automatic bowling equipment, amusement machines operated by coins, bank notes, bank cards, tokens or by any other means of payment.",
                "Wait until tomorrow I bet Lutnick will make a fool of himself with Ford",
                "I was telling my wife last night maybe it’s just a huge insider trading scheme crash the stock market buy a shit ton dirt cheap then step back and take away the tariffs he’s not trying to make the country rich he’s trying to get richer",
                "A serious question \n\n\nIs it possible to \"tariff\" US big tech operating in Canada?\n\n\nOr it would be illegal or impossible because they are Canadian entities?",
                "Don't mess with Canada ",
                "it really seems that he never considered that anyone would retaliate, he’s bewildered! that’s not how i thought it would go, they’re all being so mean to me",
                "God damn Obama and Biden! Look what they're doing.",
                "Band for Band, shooter for shooter"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Rain set to hit Southern California amid flood warnings",
            "external_url": "https://www.latimes.com/california/story/2025-03-12/southern-california-storm-evacuation-warnings-flood-debris-flow",
            "upvotes": 1,
            "date": "03/13/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/090134b/2147483647/strip/true/crop/8192x4301+0+582/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdc%2F9e%2F394547d04c6f92d365534aac1d4f%2F1497952-me-0311-laweather-march-storm-gem-002.jpg",
            "top_comments": [
                "Evacuation orders are being given elsewhere: https://www.msn.com/en-us/weather/topstories/flooding-debris-flow-possible-as-rain-slams-la-evacuation-orders-issued/ar-AA1AR2cZ?ocid=BingNewsBrowse\n\nStay safe, stay prepared out there."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Canadians who visit US for more than 30 days will be fingerprinted",
            "external_url": "https://www.theguardian.com/world/2025/mar/13/canada-fingerprint-visit-us",
            "upvotes": 10,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ba10c375cb1e5b1586ed64ae5133e0ac2597c5f2/0_120_3600_2161/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=668367ca2ae33ce304afbb4d7814f743",
            "top_comments": [
                "Surprised they weren’t.   This is fine really."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Report of gunman at Loma Linda Hospital believed to be swatting call that prompted 100+ officer response",
            "external_url": "https://www.sbsun.com/2025/03/12/sheriffs-deputies-work-to-clear-loma-linda-hospital-after-reports-of-man-with-gun/",
            "upvotes": 24,
            "date": "03/13/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2025/03/SBS-L-HOSPITAL-0313-01-1.jpg?w=1024&h=681",
            "top_comments": [
                "We’ve gotta develop better tools for tracking down swatters, i know they take a lot of steps to obfuscate their location and who they are\n\nBut if nothing is done the problems are just gonna get worse, bc streaming has brought even more attention than there used to be to swatting",
                "Finally, guys! We can use all these weapons for the purpose they were made for! \n\nPeople called it a waste of money when we could have spent it on social services, on domestic violence counseling - but we waited for this day!\n\nAnd now we can do what we’ve always dreamed of when we put on the blue uniform- raising a hospital with over 100 people to shoot sick people! \n\nGo police unions and qualified community! Remember what to say - “That bald cancer kid looked at me and I was scared for my life so I shot them!”\n\nNow let’s go, guys!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "USDA ends program that helped schools serve food from local farmers",
            "external_url": "https://apnews.com/article/school-lunch-usda-trump-c1485f824573913fe9a734bbf1273e26",
            "upvotes": 67,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That’ll make America great again",
                "Total waste.  Buying fresh food from local farmers to feed children.  FRAUD!\n\n\n/s obviously",
                "Damaging the health of children. Hampering their ability to learn and also under cutting the business of farmers. All with subsequent harm to the wider society and economy. \n\nTrump scores!",
                "All the good things.\n\nWhy not go after the bad things? Oh wait…",
                "If there is anything that Republicans love more than hurting brown people, it's hurting children and farmers.",
                "I’m glad the farmers got exactly what they voted for. It’s sad the children have to suffer."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Keir Starmer to abolish NHS England and bring health service back under 'democratic control' - live updates",
            "external_url": "https://www.bbc.co.uk/news/live/cx29lrl826rt",
            "upvotes": 131,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cd3a/live/3f9391e0-001e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Headline can be misinterpreted.\n\nNHS England is a body set up to administer NHS services in England. The government is not abolishing the NHS, just moving the administration of the service under direct ministerial control.",
                "Brits is this good or bad?",
                "I've browsed social media and as expected Reform voters are everywhere saying the NHS is abolished, that Starmer has pulled the plug...they haven't a clue NHS England is a separate thing.",
                "It really is fascinating watching the rest of the world move in the exact opposite direction as my country.",
                "Who, exactly, was controlling the NHS so far?!",
                "I love that employee attrition is a universal problem and not just the bane of one type of economic system.",
                "Keir, chosen one, Keir"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Hundreds of Shoes, Personal Items and a List of Victims Found In Cartel Crematorium in Mexico",
            "external_url": "https://www.latintimes.com/hundreds-shoes-personal-items-list-victims-found-cartel-crematorium-mexico-578008",
            "upvotes": 169,
            "date": "03/13/2025",
            "thumbnail": "https://d.latintimes.com/en/full/572166/rancho-izaguirre.png",
            "top_comments": [
                "“Cartel crematorium” that’s terrifying. Guess we know where all the missing people in Mexico have gone.",
                "Remember who arms the cartels, who buys their shit and takes their bribes.",
                "This. This is what makes me ok with declaring Cartels Terrorists. People are talking about all the ways they aren’t.\n\nScrew Trump. But if that isn’t a campaign of terror I don’t know what is.",
                "People don't understand how bad the cartel is. They make their own problems dissappear.  They have people everywhere they need people to be and crematoriums where they can't get people.",
                "This is one of many reasons we need to secure of southern border."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Gambling charges laid against longtime Hells Angel, associate after investigation into Burnaby cafe",
            "external_url": "https://vancouversun.com/news/gambling-charges-laid-against-long-time-hells-angel-and-associate-burnaby-cafe",
            "upvotes": 65,
            "date": "03/13/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2020/11/png1125n-big-shot-cafe.jpg",
            "top_comments": [
                "lmaoooooo\n\nThis place has been so obviously a front for organized crime for years and years, it was obvious on my first (and only) time going here.\n\nIf you ever walk into a cafe and they give you a confused look as if they're wondering why someone would come in, you're about to get either the best or worst latte of your life."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump Family Has Held Deal Talks With Binance Following Crypto Exchange’s Guilty Plea",
            "external_url": "https://www.wsj.com/finance/currencies/trump-family-has-held-deal-talks-with-binance-following-crypto-exchanges-guilty-plea-05b029fa?mod=hp_lead_pos1",
            "upvotes": 394,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grifters helping grifters, Making Amazing Grifts Always.",
                "tHe bIdEN crImE FaMiLy",
                "Crypto and crime: a winning combination",
                "The weirdest thing is MAGA has somehow convinced a large percentage of the US population that everything is corrupt except Trump and the random drug addict that is destroying the US government is somehow uncovering corruption and fraud. ",
                "Silver lining: A global recession will destroy crypto.",
                "*So how do we get into this grift?*",
                "Sounds legit. Nothing to see here. Something something trans Canadian DEI."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Ayo Edebiri ‘got insane death threats’ after Elon Musk shared fake report about Pirates of the Caribbean casting | Movies",
            "external_url": "https://www.theguardian.com/film/2025/mar/12/ayo-edebiri-got-insane-death-threats-after-elon-musk-shared-fake-report-about-pirates-of-the-caribbean-casting",
            "upvotes": 3053,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f177e2f93bdfbad4a59315adf7ca12135d9e10d0/0_0_3828_2297/master/3828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6c37eab200b27b17b52533c0edb15ce",
            "top_comments": [
                "> The Bear actor called Musk a fascist and an idiot after his reaction to a post from a rightwing account that claimed she was replacing Johnny Depp.\n\nThis man needs to lose another hundred billion+ in net worth and fade into obscurity. We also need to stop ignoring the severity of online harassment.",
                "> Responding to Edebiri’s post on Wednesday, the owner of the original account said: “I clearly stated ‘reportedly’ because it was the latest information coming from credible Hollywood sources. And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.\n\nSome people are fucking cultish and weird",
                "[removed]",
                "A dark-skinned person in the Caribbean? Who would have thought?",
                "Now that the government is a goner well never get this but boy do we need to start revamping how society treats digital threata in general and especially anonymous digital threats.",
                "She is fucking Caribbean!! People are insane.",
                "Why can’t the x outage be more permanent!?",
                "Elon about to clarify: \"This is Ukraine's fault\".",
                "I remember in the 90s and early 2000s there was serious concern about online cyber bullying and death threats. There was a lot of talk about passing laws to stop it and most closely regulate these platforms. \n\nThen big tech got into bed with the government and everyone became “free speech absolutists”. \n\nNo other culture at no other point in history would allow this sort of shit to persist like we have.",
                "The owner of the X account said, \"And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.” \n\nI can't even.."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "In wake of scandal, Google clamps down on Chrome shopping extensions",
            "external_url": "https://www.pcworld.com/article/2634912/in-wake-of-scandal-google-clamps-down-on-chrome-shopping-extensions.html",
            "upvotes": 298,
            "date": "03/13/2025",
            "thumbnail": "https://www.pcworld.com/wp-content/uploads/2025/03/Chrome-app-icon-on-laptop-screen-with-other-app-icons-around-it.jpg?quality=50&strip=all&w=1024",
            "top_comments": [
                "For those who don't know, a web browser extension called Honey performed something similar to a \"Man in the Middle Attack\" intercepting and replacing data related to transactions wherever it could, siphoning money away from everyone, including those who promoted it. By replacing the \"affiliate\" or sponsorship link code in the URL, the long bit of website stuff after the websites name, during checkout, with it's own. This is called \"Cookie Stuffing\" but it is essentially just a man in the middle attack. Honey is owned by ***PayPal.***\n\nEdit: More context, they also \"probably\" prevented millions of transactions from using the best discount codes available, by making backroom \"deals (read as extortion)\" with people, where by they did not use your discount code if you did not pay them, even if the code was free, available, and better than what they had. So, they ripped everyone off, in every way they could. They were often not the best deal, or utilizing the best available codes.",
                "The internet biggest scam or whatever people called it went quiet real fast, the youtuber who exposed it haven't released the second video and what about the lawsuit too ?",
                "In wake of sucking, users clamp down on Chrome usage at all, and have moved to other browsers",
                "Google also fucked over Ublock recently so it no longer worked. I finally said enough, because I was sick of constantly going into flags, fixing updates for a week, only to have the flag removed entirely, on top of all the other concerns.\n\n\nFirefox has been nice.",
                "it took this long, so I guess google never really cared until it made them look bad for supporting it",
                "It’s always gonna be a no to chromium for me. I will stick with alternatives. No way I’m using anything chrome based or google owned",
                "What on the internet will big daddy google ban next?\n\nBing/hotmail\n\nCompetitive monetization\n\nsites that don't use sign in with google?",
                "A big meh from me. YouTube personalities hock all kinds of garbage for years but as soon as one of their scams takes advantage of them it's a five alarm fire.",
                "It's good to see Google taking action to protect users from potentially harmful extensions."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ayo Edebiri ‘got insane death threats’ after Elon Musk shared fake report about Pirates of the Caribbean casting | Movies",
            "external_url": "https://www.theguardian.com/film/2025/mar/12/ayo-edebiri-got-insane-death-threats-after-elon-musk-shared-fake-report-about-pirates-of-the-caribbean-casting",
            "upvotes": 3060,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f177e2f93bdfbad4a59315adf7ca12135d9e10d0/0_0_3828_2297/master/3828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6c37eab200b27b17b52533c0edb15ce",
            "top_comments": [
                "> The Bear actor called Musk a fascist and an idiot after his reaction to a post from a rightwing account that claimed she was replacing Johnny Depp.\n\nThis man needs to lose another hundred billion+ in net worth and fade into obscurity. We also need to stop ignoring the severity of online harassment.",
                "> Responding to Edebiri’s post on Wednesday, the owner of the original account said: “I clearly stated ‘reportedly’ because it was the latest information coming from credible Hollywood sources. And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.\n\nSome people are fucking cultish and weird",
                "[removed]",
                "A dark-skinned person in the Caribbean? Who would have thought?",
                "Now that the government is a goner well never get this but boy do we need to start revamping how society treats digital threata in general and especially anonymous digital threats.",
                "She is fucking Caribbean!! People are insane.",
                "Why can’t the x outage be more permanent!?",
                "Elon about to clarify: \"This is Ukraine's fault\".",
                "I remember in the 90s and early 2000s there was serious concern about online cyber bullying and death threats. There was a lot of talk about passing laws to stop it and most closely regulate these platforms. \n\nThen big tech got into bed with the government and everyone became “free speech absolutists”. \n\nNo other culture at no other point in history would allow this sort of shit to persist like we have.",
                "The owner of the X account said, \"And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.” \n\nI can't even.."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "British Columbia woman detained at U.S. border, sent to Arizona detention facility in chains",
            "external_url": "https://vancouversun.com/news/bc-woman-detained-at-us-border-sent-to-arizona-detention-facility",
            "upvotes": 9957,
            "date": "03/13/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/jasmine-mooney_294005028.jpg",
            "top_comments": [
                "\n#Canadian Woman Detained at US Border in Harrowing Ordeal\n\nA British Columbia woman has found herself trapped in a nightmare after being unexpectedly detained at the US border and transferred to an Arizona detention centre under conditions her family describes as inhumane.\n\nJasmine Mooney, a 35-year-old businesswoman from Abbotsford, was attempting to enter the United States through the San Ysidro border crossing between Mexico and San Diego on 3 March. She had hoped to apply for a Trade NAFTA (TN) work visa, but her paperwork was incomplete. Instead of being turned away or allowed to rectify the issue, she was arrested by US border officers and placed in detention.\n\nWhat followed has left her mother, Alexis Eagles, desperate for answers. After three nights at a San Diego detention centre, Mooney was handed over to US Immigration and Customs Enforcement. For a brief moment, her family thought she had been released when an online tracking system marked her as free. Then she vanished.\n\nPanic set in when hours turned into a full day with no word from her. Eventually, the family learned that Mooney and around thirty others had been pulled from their cells in the middle of the night and transported to the San Luis Detention Center in Arizona. There, according to reports from inside, she has been crammed into a concrete cell with no natural light, harsh fluorescent bulbs that never switch off, no proper bedding and limited bathroom facilities.\n\nMooney has not been charged with any crime. She has no criminal record. She has simply been caught in a bureaucratic nightmare that has left her in chains, awaiting a resolution that remains unclear.\n\nHer mother is not disputing the right of US authorities to refuse Mooney entry. She does, however, take issue with the treatment her daughter is enduring. Mooney herself, in text messages to a business partner, described the conditions as \"inhumane.\" The women in detention are sleeping on mats, the food is barely edible, and the lights make proper rest impossible. Despite the circumstances, Mooney has tried to stay strong, telling her friend that she is in a better position than others and must keep going.\n\nMooney is no stranger to hard work. She built a career in Vancouver’s hospitality industry after moving there from the Yukon in 2008, later expanding into the health and wellness sector. Her most recent work had her involved in Los Angeles, where she had previously been granted a TN work visa. That visa was revoked in November last year when she attempted to return to the US after a vacation. This time, hoping to secure another visa, she took the route that had worked for her before, crossing from Mexico. It was a decision that led to an ordeal beyond anything she could have imagined.\n\nHer business partner, BJ McCaslin, has been in touch with her through a prison communication app and is deeply concerned. He does not understand why she remains detained when there is no evidence of wrongdoing.\n\nGlobal Affairs Canada has acknowledged Mooney's detention and confirmed that consular officials are in contact with US authorities. Beyond that, they say little can be done. While governments may express concern, they rarely intervene when another country enforces its own immigration rules.\n\nThat leaves Mooney and her family in an agonising state of limbo. They are not asking for special treatment, only basic human decency. For now, all they can do is wait, and hope that her ordeal does not stretch on indefinitely.",
                "THIS is another reason for Canadians to avoid all US travel.",
                "Perhaps countries should issue travel advisories for the U.S.",
                "And the other people in her situation don't even have a resourceful Canadian mom to get attention to their cause, so even if the poor woman who in no way deserves this random act of cruelty by the US regime is released the problem remains",
                "Why not just turn her back? There’s no reason to lock her up. I hope they get the ACLU involved. She has constitutional rights and they’re being violated.",
                "The Terror begins. To be clear, this woman was detained because her application to renew her work visa was incomplete. That's it. That's all she did and she ended up in a cell for a week with nothing but a mat and rotten food.",
                "How're the US supposed to host the world cup next year if they're putting loads of people in chains??\n\nI have a feeling foreigners may want to stay away and stadiums will be empty af",
                "So I’ve been reading a book recently (When Mckinsey comes to town) and it says during the first Trump admiration many ICE employees had begun to find the work distasteful based on the orders coming from the government at that time, as well as bad press. As a result ICE was struggling to find and retain employees. The solution? Change hiring practices to recruit neckbeards who get a kick out of having the power to detain and arrest people. Basically adult Eric Cartmans demanding “respect ma authoritah!” It’s all Trump loyalists now. Same goes for many police forces.",
                "> “We eventually learned that about 30 people, including Jasmine, were removed from their cells at 3 a.m. and transferred to the San Luis Detention Center in Arizona. They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.\"\n\n So she tried to go to the border with a new job offer and visa paperwork. This was the process she'd followed before, and she was trying to follow the laws to the best of her understanding. Instead they put her in chains and did this to her. People in our prison system are treated with more dignity than this.",
                "This isn't about security—it's about cruelty. And the worst part? There’s no accountability. ICE can do whatever they want, and people like Mooney are left in limbo. America’s broken system strikes again."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Trump Family Has Held Deal Talks With Binance Following Crypto Exchange’s Guilty Plea",
            "external_url": "https://www.wsj.com/finance/currencies/trump-family-has-held-deal-talks-with-binance-following-crypto-exchanges-guilty-plea-05b029fa?mod=hp_lead_pos1",
            "upvotes": 394,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grifters helping grifters, Making Amazing Grifts Always.",
                "tHe bIdEN crImE FaMiLy",
                "Crypto and crime: a winning combination",
                "The weirdest thing is MAGA has somehow convinced a large percentage of the US population that everything is corrupt except Trump and the random drug addict that is destroying the US government is somehow uncovering corruption and fraud. ",
                "Silver lining: A global recession will destroy crypto.",
                "*So how do we get into this grift?*",
                "Sounds legit. Nothing to see here. Something something trans Canadian DEI."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Baby wombat-snatching US influencer at risk of losing Australian visa",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/13/sam-jones-us-influencer-baby-wombat-stolen-from-mother-ntwnfb",
            "upvotes": 4318,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0560f44a8da1ddb4f316428666c2344dcc6a6aa1/632_287_1104_662/master/1104.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b6e7d88616efb53cb511458b3581440d",
            "top_comments": [
                "Good.  Kick her ass out.  I had just watched the video of her doing this.",
                "Stupid influencers are the absolute cancer of society!",
                "What an absolute piece of trash.",
                ">The Australian prime minister, Anthony Albanese, said it was “an outrage” Jones had separated the joey from its mother.\n\n>“Maybe she might try some other Australian animals,” he said at a press conference, when asked about the incident. “Take a baby crocodile from its mother and see how you go there. Take another animal that can actually fight back rather than stealing a baby wombat from its mother. See how you go there.”\n\nYou guys are the best over there!",
                "Who's the fuckwit with her? Should bloody know better, but clearly doesn't give a shit.",
                "I’d rather she sit in jail for a while and then get deported,  but losing her visa and being banned from the country would be a decent next alternative",
                "“I can’t wait to see the back of this individual,” the home affairs minister, Tony Burke\n\nSo is booting actually one of their proudest traditions?",
                "She has 1.1k subs on YouTube and 1.8k followers on IG.  Does this count as an influencer?",
                "Animal cruelity, fucking psychopath. \n\nThrow her in prison, then throw out and ban this this piece of shit.",
                "Learn from S.Korea, throw these dummies in jail, and publicly shame them."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "The Associated Press: Russia says it has retaken Sudzha, the biggest town in the Kursk region controlled by Ukraine",
            "external_url": "https://apnews.com/article/russia-ukraine-war-kursk-sudzhba-military-occupation-17cebbc24642ab56d78112eba7eb7509",
            "upvotes": 520,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That investment in Donald Trump certainly keeps paying dividends.",
                "Is this why Donnie shut off intel to Ukraine for a couple days?",
                "So Ukraine signed a cease fire while Russia takes land. Art of the deal?",
                "Does anyone else wonder if the U.S. suddenly giving Ukraine intelligence data again consists of false data to give the Russians a boost?",
                "Literally just commented on a post re Putin's sudden appearance in military garb for photo opportunities having me concerned. Then I scroll down and see this. Putin would only put his face out there if something big were about to happen.",
                "The fact that the smaller nation of Ukraine even invaded and held onto Russian territory for that long during a war (special military operation) that was only supposed to last a month at most is still a massive blow to their pride and military prestige.",
                "[deleted]",
                "Imagine if Trump and his yapping purse dog brought in Putin to the Oval Office and berated him.  \n\nI get it, Trump owes Putin the election so he’s in his debt. But Trump also owes millions of Republicans the election and he screwed over every single one of them so why not take down Russia too? Instead of pretending to be a tough guy and attacking our friends in Canada or the peaceful people of Greenland, go after a wounded lion and pretend that you are the new King of the Jungle.\n\nIn the end, America looks just as weak as Russia and now the world hates both of us.",
                "This territorial advance in an illegal war of conquest was brought to you by the MAGA cult halting military intelligence to Ukraine on orders of the Kremlin.",
                "How’s those peace talks working out Rubio 🤥?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Ex-Barclays boss Jes Staley admits having sex with member of Jeffrey Epstein staff",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/prince-andrew-was-told-epstein-saw-staley-as-close-friend-court-hears",
            "upvotes": 1816,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/04e2750c268e7207cf2fb69e13bf809f2fafa13d/0_48_1342_805/master/1342.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cf0f7fb1861542bab5330e2f6706c8",
            "top_comments": [
                "I love how the thumbnail to this article is Prince Andrew - despite him having nothing to do with the story. \n\nI guess he’s just the placeholder face of anything to do with Epstein.",
                "In the article:\n\n>***The former chief executive of Barclays, Jes Staley, has admitted to having sex with a member of Jeffrey Epstein’s staff in an apartment owned by the child sex offender’s brother in New York, a court has heard.***\n\n>*Staley made the admission at the end of a testy day of cross-examination at the upper tribunal, but maintained that his friendship with Epstein was not personal and had always been based on business.*\n\n>***The former Barclays boss, who resigned in 2021, is trying to overturn the regulator’s decision to ban him from taking any senior roles in the UK financial sector for allegedly lying about the depth of his relationship with Epstein. Barclays declared to the*** [***Financial Conduct Authority***](https://www.theguardian.com/business/financial-conduct-authority) ***(FCA) in a letter in 2019 that the two men “did not have a close relationship”.***\n\n>***The FCA’s lawyer Leigh-Ann Mulcahy KC handed documents to Staley and tribunal judges without presenting them to the public, before asking Staley: “Do you accept that you had sexual intercourse with a woman at Mr Epstein’s brother’s apartment?”***\n\n>***“Yes,” Staley said. The former CEO, who is married and has two daughters, acknowledged he met the woman through Epstein, but while he told the court “she was part of his staff”, he claimed Epstein did not know they had sex.***\n\n>*“How did it come about that you had sexual intercourse with a woman who worked for him at an apartment, owned by his brother, without him knowing?” Mulcahy asked.*\n\n>*Staley said: “Oftentimes I would go to Epstein’s apartment and he would be late, and she and I got the chance to know each other.” This led to sexual intercourse, he said, “much to my embarrassment today”.*\n\n>*The ex-banker agreed with Mulcahy that he would describe the intercourse as “consensual”. The date of the encounter and the age of the woman were not disclosed in court. The FCA stated that the property was owned by Epstein’s brother.*\n\n>*Mulcahy also put to Staley that the staff member “appeared to have carved you out of a settlement with the Epstein estate”. Staley replied he was “not aware of that”.*\n\n>*The ex-Barclays boss also maintained that he did not remember the context for a separate, and now notorious, exchange with Epstein in 2010 referring to Disney princesses.*",
                "*\"Oftentimes I would go to Epstein’s apartment and he would be late\"* yeah that sounds like a purely \"business\" relationship",
                "“The date of the encounter and age of the woman were not discussed in court” \n\nShe was a minor. Court talking about “maybe we shouldn’t give him a high ranking position in the UK” \n\nwtf?! This creep needs to be tossed off the top of a high rise",
                "It’s good to know all these disgusting people work together in the banking industry. I’m sure they would never break rules or laws at work",
                "Epstein’s “staff” = underaged girls",
                "The Disney Princess thing should be evidence enough of his involvement in sex trafficking.\n\n\nThrow the dirty beast in jail. ",
                "His wife and daughters must be proud...",
                "Kinda like trying to meet somewhere in the middle... \n\n\"Okay I was on the island... But I only got with the waitress !\" \n\n\n....\n\nThe waitress happens to be a 14 yr old... \n\n\nEveryone needs to be thrown under the bus.",
                "He schtupped Prince Andrew?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 11806,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "i think that's illegal",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "They may have condemned the kid to death basically. Heart breaking. I live in the area where they were living so this hits home"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "In wake of scandal, Google clamps down on Chrome shopping extensions",
            "external_url": "https://www.pcworld.com/article/2634912/in-wake-of-scandal-google-clamps-down-on-chrome-shopping-extensions.html",
            "upvotes": 296,
            "date": "03/13/2025",
            "thumbnail": "https://www.pcworld.com/wp-content/uploads/2025/03/Chrome-app-icon-on-laptop-screen-with-other-app-icons-around-it.jpg?quality=50&strip=all&w=1024",
            "top_comments": [
                "For those who don't know, a web browser extension called Honey performed something similar to a \"Man in the Middle Attack\" intercepting and replacing data related to transactions wherever it could, siphoning money away from everyone, including those who promoted it. By replacing the \"affiliate\" or sponsorship link code in the URL, the long bit of website stuff after the websites name, during checkout, with it's own. This is called \"Cookie Stuffing\" but it is essentially just a man in the middle attack. Honey is owned by ***PayPal.***\n\nEdit: More context, they also \"probably\" prevented millions of transactions from using the best discount codes available, by making backroom \"deals (read as extortion)\" with people, where by they did not use your discount code if you did not pay them, even if the code was free, available, and better than what they had. So, they ripped everyone off, in every way they could. They were often not the best deal, or utilizing the best available codes.",
                "The internet biggest scam or whatever people called it went quiet real fast, the youtuber who exposed it haven't released the second video and what about the lawsuit too ?",
                "In wake of sucking, users clamp down on Chrome usage at all, and have moved to other browsers",
                "Google also fucked over Ublock recently so it no longer worked. I finally said enough, because I was sick of constantly going into flags, fixing updates for a week, only to have the flag removed entirely, on top of all the other concerns.\n\n\nFirefox has been nice.",
                "it took this long, so I guess google never really cared until it made them look bad for supporting it",
                "It’s always gonna be a no to chromium for me. I will stick with alternatives. No way I’m using anything chrome based or google owned",
                "What on the internet will big daddy google ban next?\n\nBing/hotmail\n\nCompetitive monetization\n\nsites that don't use sign in with google?",
                "A big meh from me. YouTube personalities hock all kinds of garbage for years but as soon as one of their scams takes advantage of them it's a five alarm fire.",
                "It's good to see Google taking action to protect users from potentially harmful extensions."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "FTC asks judge to delay Amazon trial due to resource constraints",
            "external_url": "https://apnews.com/article/amazon-ftc-trial-date-df069a0a71d9627800a72cf07b6cf5de",
            "upvotes": 255,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a signal to all of corporate America that they are free to rip off and scam their customers at will and this administration will rip the teeth out of any enforcement of laws that prevent it.",
                "No wonder Bezos was sitting in the front row at the inauguration. Can't prosecute a case if they fire all the prosecutors.",
                "Canceled my Kindle account, canceled my Prime Visa, uninstalled all my Amazon apps. Been a customer since practically the beginning. Fuck Amazon.",
                "Some of these lawyers that are getting threatened by the MAGA cult show volunteer to help the FCC.",
                "Anyone know whether a judge could order the government to spend whatever's necessary to put on their case regardless? Sort of like how they can prevent a lawyer from dropping a client right before trial if the client hasn't paid their lawyer's fees.",
                "The resource constraint? Amazon prime 2 day delivery."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 50544,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "It's always the ones you most suspect. ",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "It's sad that it took 40+ years for him to face justice. The article says the accuser tried getting the rapist to pay for therapy in 2007 but she wouldn't sign an NDA so he wouldn't. \n\nThat means for atleast 18 years (probably more) she has been actively trying to get justice. All while he probably made millions of dollars and most likely abused others. \n\n>Morris was a member of President Donald Trump's spiritual advisory committee during his first term.\n\nWow. Of course the guy who raped a 12 year old was in Trump's cabinet.",
                "This is the free space on the BINGO card",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/13/2025 16:10:43 UTC"
}