{
    "posts": [
        {
            "category": "HOT",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 25311,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at [Covid.gov](https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/). They turned that site into a joke.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "I will laugh so hard if that meme VIP dinner last night turns into a super spreader event.",
                "Covid dlc before gta6",
                "Trump and Covid, name a more iconic duo....",
                "We had first COVID, yes, but what about second COVID?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 1122,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe via a skilled worker visa. Wish there were better options for bailing out of the US. So many people there hate what is happening over there and simply don’t have the resources to leave or the agency to change it.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "Based on how Starmer has been acting lately he'll deport them straight back to the US thinking it will make Reform voters like him",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "Took almost 200 years but it's time to go home.",
                "Hell come to Canada as well, I have met a lot of outstanding people from the USA, some of the nicest people around.   We got cold beer, weed is legal,  best part is - Break your arm? You won’t need a second mortgage. Get sick? You won’t be sent home with a $40,000 invoice and you get a lollipop.  That lollipop alone should seal the deal,  I recommend picking the lime one as it’s the bestest.",
                "Between people leaving, people being deported, tourism down and people who voted against this regime actively trying to boycott supporters of Trump the economy is going to dump big time.  It may not be apparent now but a year from now will look very different from what the Biden presidency accomplished. Shame on our elected congress.",
                "I started applying for teaching jobs in South Korea the day after the election. I have no intention of returning to the states as long as the GOP and tech bros control the government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 1434,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Well after what happened in the Baldwin trial I am not surprised. ",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "Is it legal for her to get her old job back?  Is she allowed to handle guns?  Maybe she could become a taser only police officer."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia launches major aerial attack on Ukraine capital",
            "external_url": "https://www.bbc.com/news/articles/cy908n4vr0jo",
            "upvotes": 2346,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a586/live/a0bdf040-38af-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                "Russia launched 250 drones and 14 ballistic missiles against Kyiv, Ukraine's air force said, causing fires in residential buildings. It was one of the biggest combined aerial assaults on the city since the war began. The air force said it had downed six missiles and 245 drones.",
                "Fuck Russia. Fuck Trump and his cronies in washington taking care of a genocidal, geriatric, pilled-up grandpa.",
                "Don't forget people, it's important for the peace efforts to let them enough time to prepare a memorandum and then a ceasefire, all they need is time to be sure of how to prepare peace.\n\n\nAlso, it's Biden's war, not mine, if I was president by the time, this war would never have begun. And you know, my doctor, he saw my results in the IQ test, beautiful results, beautiful, he never saw such results, he told me they were beautiful, he never saw such results like these, he said you're in the genius category, and Putin is a good guy I think, he 'ever wanted this war, it was all Biden's war, nice guy that putin, very clever, very smart, and yes, these IQ results, I wish you could see them, so beautiful.",
                "[removed]",
                "I thought Trump was going to end this with one call months ago.  Did he lose the phone number?",
                "Fuck Russia and fuck their puppet president.",
                "I thought Trump brokered a truce 🤨",
                "At this point, just bomb the Kremlin and then accuse Russia of escalation 🤦🏼 uno reverse card",
                "It makes me fucking sick to my stomach that Putin (and other dictators) think we're still in the stone ages and that it's ok to just invade another nation and kill thousands and thousands of people over LAND. \n\nAre you fucking kidding me?! FFS look how big Russia is!!\n\nIs there no one that can snipe that megalomaniac son of a bitch? This shit needs to end yesterday.\n\n(sorry for the colorful language but this pisses me off more and more every day)",
                "EU needs to start building up more pressure. Start by removing all Russian citizens."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 624,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "If you told me this was their fried chicken I’d still eat it",
                "Elevated…? \n\nUp from what…? There is zero “safe level” for lead.",
                "Ron Desantis bans lead testing in all foods",
                "Just stop testing for it and it won’t be an issue! /s",
                "Where do they keep picking up all this lead that ends up in our food?\n\nAnd why does a disproportionate amount of affected food seem to be baby food?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 26421,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.\n\n**Edit:** Courtesy of /u/MtnMoonMama here is a link to write President Macron about the situation if you feel so inclined. https://www.elysee.fr/en/contact/",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/\n\n\nEdit: fill out the form. Send it. They send you an email with a link you must click. Click the link to send. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Man, where's the Mexican space program when you need it.",
                "Humans are fucking garbage"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tree-sitter enters third week in WA's Olympic Foothills to halt logging",
            "external_url": "https://www.fox13seattle.com/news/tree-sitter-enters-third-week",
            "upvotes": 658,
            "date": "05/24/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/05/1280/720/vlcsnap-2025-05-23-19h10m42s347.jpg?ve=1&tl=1",
            "top_comments": [
                "save the trees! especially the old growth forests.",
                "It’s early, I had to read that title twice to realize tree sitting is not an Olympic event.",
                "Here’s one for the guy who replied that the states would manage their forests just fine and keep them safe, when I posted worrying about this administration opening 59% of our national forests for logging.\n\nThanks so much, Washington, for continuing to demonstrate that money into the right pockets trumps everything else.",
                "Not all heroes wear capes. Some wear rope harnesses and fight for forests the quiet way",
                "read the article, this guy is fucking hardcore.  he has a trap set that will straight up kill him if anything in his camp is tampered with.  of you try and force him down *you will kill him*",
                "Honestly, we(those of us with jobs and life obligations we can’t abandon to live in a tree) should start a fund to pay people a modest wage to stage protests like these. I can’t stand the sight of our natural world being pillaged, but I can’t just abandon my life to do stuff like this, as much as I would like to. Does that make me a bad person? A hypocrite? Sometimes I just don’t know anymore.",
                " 3 weeks? They’re a tree shitter too by now"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 211,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "It's not a normal day in Israel unless they wake up and murder a few kids.  \n\nFuck Israel",
                "But r/worldnews says it’s all Hamas’ fault",
                "I don't understand what the fuck is Israels problem",
                "It's time America stopped sponsoring this genocidal regime.",
                "We need a full trade embargo against this regime immediately",
                "How is it not genocide?",
                "Stealing land and killing doctors",
                "I can't imagine the doctor's reaction when her nine children died at once",
                "Jesus....\n\n\nDo supporters of this expect there to be forgiveness in the future?",
                "9!\n\nHow TF did he find time for medical school?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 19668,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "Not calling her crown princess is weird.",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "They forgot to exempt white girls",
                "Well, that's no good for the EU <-> US relationship, but those were already fucked for a couple of months - crazy how hard-earned respect can be lost within mere seconds.",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kim Jong Un watches as North Korea's newest warship falls off dry dock",
            "external_url": "https://www.nbcnews.com/world/asia/new-north-korean-warship-damaged-launch-ceremony-leader-kim-looks-rcna208425",
            "upvotes": 5784,
            "date": "05/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-kim-jong-un-mb-0757-9be9f5.jpg",
            "top_comments": [
                ">The 5,000-ton destroyer slid off a flatcar because of “inexperienced command and operational carelessness in the course of the launch,” according to the Korean Central News Agency, crushing parts of the bottom of the ship.\n\nI wonder if those guys are already dead.",
                "North Korea doesn't have a dedicated Dry Dock. North Korea has been side launching their ships and does not have a dedicated Dry Dock to do the extensive repairs the ship will need if it could be repaired at all.",
                "Kinda amusing until you realise a bunch of, most probably innocent, people are going to suffer for this, and that most of N.Korea's population is already horribly suffering, and they're spending their  money on pointless warships.",
                "I want to giggle, but I realize someone will pay dearly for this...",
                "Satellite image of the fallen warship:\n\nhttps://i.imgur.com/9Mdrqzc.png\n\nThey were side-launching the ship and it seems like one end slid while the other lagged behind or remained stationary, causing the whole thing to go caddywompus.",
                "Multiple people will get executed for this",
                "This is the entirely predictable outcome of attempting to modernize a navy under Russian tutelage.\n\nhttps://www.twz.com/russias-cursed-carrier-is-finally-in-a-drydock-that-cant-sink\n\nhttp://www.hisutton.com/Russian-Floating-Dock-PD-19-Sinks.html",
                "I know he watched, but where can I?",
                "Too bad he doesn't have a butt-hole, then at least he could give a shit.",
                "Those responsible will be subject to anti-aircraft missiles."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 208,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "It's not a normal day in Israel unless they wake up and murder a few kids.  \n\nFuck Israel",
                "But r/worldnews says it’s all Hamas’ fault",
                "I don't understand what the fuck is Israels problem",
                "It's time America stopped sponsoring this genocidal regime.",
                "We need a full trade embargo against this regime immediately",
                "How is it not genocide?",
                "Stealing land and killing doctors",
                "I can't imagine the doctor's reaction when her nine children died at once",
                "Jesus....\n\n\nDo supporters of this expect there to be forgiveness in the future?",
                "9!\n\nHow TF did he find time for medical school?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 625,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "If you told me this was their fried chicken I’d still eat it",
                "Elevated…? \n\nUp from what…? There is zero “safe level” for lead.",
                "Ron Desantis bans lead testing in all foods",
                "Just stop testing for it and it won’t be an issue! /s",
                "Where do they keep picking up all this lead that ends up in our food?\n\nAnd why does a disproportionate amount of affected food seem to be baby food?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 1119,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe via a skilled worker visa. Wish there were better options for bailing out of the US. So many people there hate what is happening over there and simply don’t have the resources to leave or the agency to change it.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "Based on how Starmer has been acting lately he'll deport them straight back to the US thinking it will make Reform voters like him",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "Took almost 200 years but it's time to go home.",
                "Hell come to Canada as well, I have met a lot of outstanding people from the USA, some of the nicest people around.   We got cold beer, weed is legal,  best part is - Break your arm? You won’t need a second mortgage. Get sick? You won’t be sent home with a $40,000 invoice and you get a lollipop.  That lollipop alone should seal the deal,  I recommend picking the lime one as it’s the bestest.",
                "Between people leaving, people being deported, tourism down and people who voted against this regime actively trying to boycott supporters of Trump the economy is going to dump big time.  It may not be apparent now but a year from now will look very different from what the Biden presidency accomplished. Shame on our elected congress.",
                "I started applying for teaching jobs in South Korea the day after the election. I have no intention of returning to the states as long as the GOP and tech bros control the government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 1433,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Well after what happened in the Baldwin trial I am not surprised. ",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "Is it legal for her to get her old job back?  Is she allowed to handle guns?  Maybe she could become a taser only police officer."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tree-sitter enters third week in WA's Olympic Foothills to halt logging",
            "external_url": "https://www.fox13seattle.com/news/tree-sitter-enters-third-week",
            "upvotes": 659,
            "date": "05/24/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/05/1280/720/vlcsnap-2025-05-23-19h10m42s347.jpg?ve=1&tl=1",
            "top_comments": [
                "save the trees! especially the old growth forests.",
                "It’s early, I had to read that title twice to realize tree sitting is not an Olympic event.",
                "Here’s one for the guy who replied that the states would manage their forests just fine and keep them safe, when I posted worrying about this administration opening 59% of our national forests for logging.\n\nThanks so much, Washington, for continuing to demonstrate that money into the right pockets trumps everything else.",
                "Not all heroes wear capes. Some wear rope harnesses and fight for forests the quiet way",
                "read the article, this guy is fucking hardcore.  he has a trap set that will straight up kill him if anything in his camp is tampered with.  of you try and force him down *you will kill him*",
                "Honestly, we(those of us with jobs and life obligations we can’t abandon to live in a tree) should start a fund to pay people a modest wage to stage protests like these. I can’t stand the sight of our natural world being pillaged, but I can’t just abandon my life to do stuff like this, as much as I would like to. Does that make me a bad person? A hypocrite? Sometimes I just don’t know anymore.",
                " 3 weeks? They’re a tree shitter too by now"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia launches major aerial attack on Ukraine capital",
            "external_url": "https://www.bbc.com/news/articles/cy908n4vr0jo",
            "upvotes": 2351,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a586/live/a0bdf040-38af-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                "Russia launched 250 drones and 14 ballistic missiles against Kyiv, Ukraine's air force said, causing fires in residential buildings. It was one of the biggest combined aerial assaults on the city since the war began. The air force said it had downed six missiles and 245 drones.",
                "Fuck Russia. Fuck Trump and his cronies in washington taking care of a genocidal, geriatric, pilled-up grandpa.",
                "Don't forget people, it's important for the peace efforts to let them enough time to prepare a memorandum and then a ceasefire, all they need is time to be sure of how to prepare peace.\n\n\nAlso, it's Biden's war, not mine, if I was president by the time, this war would never have begun. And you know, my doctor, he saw my results in the IQ test, beautiful results, beautiful, he never saw such results, he told me they were beautiful, he never saw such results like these, he said you're in the genius category, and Putin is a good guy I think, he 'ever wanted this war, it was all Biden's war, nice guy that putin, very clever, very smart, and yes, these IQ results, I wish you could see them, so beautiful.",
                "[removed]",
                "I thought Trump was going to end this with one call months ago.  Did he lose the phone number?",
                "Fuck Russia and fuck their puppet president.",
                "I thought Trump brokered a truce 🤨",
                "At this point, just bomb the Kremlin and then accuse Russia of escalation 🤦🏼 uno reverse card",
                "It makes me fucking sick to my stomach that Putin (and other dictators) think we're still in the stone ages and that it's ok to just invade another nation and kill thousands and thousands of people over LAND. \n\nAre you fucking kidding me?! FFS look how big Russia is!!\n\nIs there no one that can snipe that megalomaniac son of a bitch? This shit needs to end yesterday.\n\n(sorry for the colorful language but this pisses me off more and more every day)",
                "EU needs to start building up more pressure. Start by removing all Russian citizens."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Boeing avoids prosecution in Justice Department deal over crashes",
            "external_url": "https://www.bbc.com/news/articles/c14kg0lj8k6o",
            "upvotes": 594,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c6b0/live/bd6b4b10-3806-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "lesson here...corporate fraud DOES pay off.   Shareholders dividends are more important than human lives.  And government \"fines\" are just a business expense.",
                "How much did they \"donate\" to Trump's account for this outcome?",
                "\"I'm sorry that your loved one died in an aviation accident, but if it's any consolation, Trump can now afford another golden toilet.\"",
                "Is this the Invisible Hand of the market that everyone keeps talking about?",
                "I guess casualties are just a write off",
                "Another bribe pays off.",
                "At least call it what it was- a bribe.",
                "Justice denied to victims again.",
                "Being rich = not a criminal/not a fraud. I love capitalism. Until my job was outsourced to Mexico. Now I pay tariffs to hopefully bring back the company that abandoned me! Win/Win",
                "So, what is the pay-off amount per death?\n\nWhat is the going rate for a bribe for a corporation to get away with murder?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Kim Kardashian’s robbers found guilty in Paris but won’t face prison time",
            "external_url": "https://apnews.com/article/kim-kardashian-heist-verdict-ff574b4b9427f7908ab32e3ee0008fef",
            "upvotes": 1673,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The chief judge, David De Pas, said that the defendants’ ages — six are in their 60s and 70s — and their health issues weighed on the court’s decision to impose sentences that he said “aren’t very severe.”\n\nThey're called the \"Grandpa Robbers\" over in France.",
                "Didn't this happen nearly 10 years ago?",
                "Not surprising, we have a big issue in France when it comes to Justice. It takes ages to have trials, the prison are overcrowded and in a terrible state and the sentences are a joke. There is another big trial taking place right now, a monster doctor raped 299 children when they were under anesthesia after he operated on them. He wrote in a private diary describing everything in detail. \n\nHe is facing 20 years in prison plus a special measure to keep him in Prison if they judge he is at risk to do it again. 20 years. For 300 rapes. On minors. The guy is 74 years but still it's infuriating. \n\nAnd we have this issue for a lot of crimes.",
                "Why even have a trial then",
                "So if you’re old you can rob someone and get away with it ? Cool to know !",
                "shes so brave. she wore like $2m in jewlery to the court appearance as a statement that.. er idk what the statement was but she's brave!",
                "\"Any other circumstance would be different but...she's just the worst\"",
                "Looks like a standard trial in Belgium were none of the criminals would face actual punishment 🤡🤷‍♂️🤷‍♂️\n\nSo ffing sad 🤨",
                "I thought the bodyguard was involved?",
                "Chic grandpa robbers ? 🤣 /J"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 12 injured in hot air balloon crash near popular tourist site in Mexico",
            "external_url": "https://edition.cnn.com/2025/05/23/americas/mexico-hot-air-balloon-crash-intl-latam",
            "upvotes": 256,
            "date": "05/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/globo.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They are *extremely* lucky.\n\nPretty much every other time I've seen a power line hot air balloon story has been a no survivors moment",
                "The hot air balloon ride we did in Turkey was the first and last I’ll ever do. Views were epic and amazing, it was also out of control the entire time, almost ran into another balloon, and we got rag dolled so hard on landing we all thought we were going to die. Super cool and exciting, but never again.",
                "I don't think I could ever be convinced to go on a hot air balloon",
                "No way in hell you're getting me in one of those balloons. I've never thought that they were safe.",
                "Flew in one of those balloons few months ago, landed in a tree",
                ">*The civil protection agency added that the balloon was operated by a tour company that offers hot air balloon rides to view the pyramids from above.*\n\nIt may not be the only hot air this tour company offers.",
                "Thank God it wasn't a bus crash, there would have been 120 injured.",
                "Guy from my high school died in New Mexico from one of these. Would never try",
                "I once heard a comedian say “I’m not saying ALL white people die in hot air balloon accidents. I’m just saying ONLY white people die in hot air balloon accidents.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tensions rise as superpowers scrap for a piece of the Arctic",
            "external_url": "https://www.bbc.com/news/articles/cjwqn7z02plo",
            "upvotes": 159,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bc8a/live/2024fda0-3811-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "> Beijing faces stiff competition from Russia, China, Europe, India and the US.\n\nWho wrote this",
                "Look, there's a reason some powers don't give a fuck about climate change/global warming. You see, when the north turns into new temperature weather zones and all those resources become available for exploitation, all of our oligarch overlords will seize the opportunity to gain profits and power. They stand to gain from millions of people being displaced and global catastrophies becoming regular which is why they don't give a rats ass about the science.",
                "That's going to be prime beachfront property by the year 2075.",
                "I’m glad Europe is rejecting china trying to buy their access to the arctic through shitty land purchase and “infrastructure” projects.",
                "Next major battle place?",
                "Wasn't this the plot of the latest captain america?",
                "Chinese claims on the Arctic are more relevant and prevalent than what reddit would have you believe.\n\nTrump's ramblings about Greenland came from security briefs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 210,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "It's not a normal day in Israel unless they wake up and murder a few kids.  \n\nFuck Israel",
                "But r/worldnews says it’s all Hamas’ fault",
                "I don't understand what the fuck is Israels problem",
                "It's time America stopped sponsoring this genocidal regime.",
                "We need a full trade embargo against this regime immediately",
                "How is it not genocide?",
                "Stealing land and killing doctors",
                "I can't imagine the doctor's reaction when her nine children died at once",
                "Jesus....\n\n\nDo supporters of this expect there to be forgiveness in the future?",
                "9!\n\nHow TF did he find time for medical school?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 1121,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe via a skilled worker visa. Wish there were better options for bailing out of the US. So many people there hate what is happening over there and simply don’t have the resources to leave or the agency to change it.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "Based on how Starmer has been acting lately he'll deport them straight back to the US thinking it will make Reform voters like him",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "Took almost 200 years but it's time to go home.",
                "Hell come to Canada as well, I have met a lot of outstanding people from the USA, some of the nicest people around.   We got cold beer, weed is legal,  best part is - Break your arm? You won’t need a second mortgage. Get sick? You won’t be sent home with a $40,000 invoice and you get a lollipop.  That lollipop alone should seal the deal,  I recommend picking the lime one as it’s the bestest.",
                "Between people leaving, people being deported, tourism down and people who voted against this regime actively trying to boycott supporters of Trump the economy is going to dump big time.  It may not be apparent now but a year from now will look very different from what the Biden presidency accomplished. Shame on our elected congress.",
                "I started applying for teaching jobs in South Korea the day after the election. I have no intention of returning to the states as long as the GOP and tech bros control the government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 626,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "If you told me this was their fried chicken I’d still eat it",
                "Elevated…? \n\nUp from what…? There is zero “safe level” for lead.",
                "Ron Desantis bans lead testing in all foods",
                "Just stop testing for it and it won’t be an issue! /s",
                "Where do they keep picking up all this lead that ends up in our food?\n\nAnd why does a disproportionate amount of affected food seem to be baby food?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tree-sitter enters third week in WA's Olympic Foothills to halt logging",
            "external_url": "https://www.fox13seattle.com/news/tree-sitter-enters-third-week",
            "upvotes": 662,
            "date": "05/24/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/05/1280/720/vlcsnap-2025-05-23-19h10m42s347.jpg?ve=1&tl=1",
            "top_comments": [
                "save the trees! especially the old growth forests.",
                "It’s early, I had to read that title twice to realize tree sitting is not an Olympic event.",
                "Here’s one for the guy who replied that the states would manage their forests just fine and keep them safe, when I posted worrying about this administration opening 59% of our national forests for logging.\n\nThanks so much, Washington, for continuing to demonstrate that money into the right pockets trumps everything else.",
                "Not all heroes wear capes. Some wear rope harnesses and fight for forests the quiet way",
                "read the article, this guy is fucking hardcore.  he has a trap set that will straight up kill him if anything in his camp is tampered with.  of you try and force him down *you will kill him*",
                "Honestly, we(those of us with jobs and life obligations we can’t abandon to live in a tree) should start a fund to pay people a modest wage to stage protests like these. I can’t stand the sight of our natural world being pillaged, but I can’t just abandon my life to do stuff like this, as much as I would like to. Does that make me a bad person? A hypocrite? Sometimes I just don’t know anymore.",
                " 3 weeks? They’re a tree shitter too by now"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 1437,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Well after what happened in the Baldwin trial I am not surprised. ",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "Is it legal for her to get her old job back?  Is she allowed to handle guns?  Maybe she could become a taser only police officer."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia launches major aerial attack on Ukraine capital",
            "external_url": "https://www.bbc.com/news/articles/cy908n4vr0jo",
            "upvotes": 2353,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a586/live/a0bdf040-38af-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                "Russia launched 250 drones and 14 ballistic missiles against Kyiv, Ukraine's air force said, causing fires in residential buildings. It was one of the biggest combined aerial assaults on the city since the war began. The air force said it had downed six missiles and 245 drones.",
                "Fuck Russia. Fuck Trump and his cronies in washington taking care of a genocidal, geriatric, pilled-up grandpa.",
                "Don't forget people, it's important for the peace efforts to let them enough time to prepare a memorandum and then a ceasefire, all they need is time to be sure of how to prepare peace.\n\n\nAlso, it's Biden's war, not mine, if I was president by the time, this war would never have begun. And you know, my doctor, he saw my results in the IQ test, beautiful results, beautiful, he never saw such results, he told me they were beautiful, he never saw such results like these, he said you're in the genius category, and Putin is a good guy I think, he 'ever wanted this war, it was all Biden's war, nice guy that putin, very clever, very smart, and yes, these IQ results, I wish you could see them, so beautiful.",
                "[removed]",
                "I thought Trump was going to end this with one call months ago.  Did he lose the phone number?",
                "Fuck Russia and fuck their puppet president.",
                "I thought Trump brokered a truce 🤨",
                "At this point, just bomb the Kremlin and then accuse Russia of escalation 🤦🏼 uno reverse card",
                "It makes me fucking sick to my stomach that Putin (and other dictators) think we're still in the stone ages and that it's ok to just invade another nation and kill thousands and thousands of people over LAND. \n\nAre you fucking kidding me?! FFS look how big Russia is!!\n\nIs there no one that can snipe that megalomaniac son of a bitch? This shit needs to end yesterday.\n\n(sorry for the colorful language but this pisses me off more and more every day)",
                "EU needs to start building up more pressure. Start by removing all Russian citizens."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Boeing avoids prosecution in Justice Department deal over crashes",
            "external_url": "https://www.bbc.com/news/articles/c14kg0lj8k6o",
            "upvotes": 595,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c6b0/live/bd6b4b10-3806-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "lesson here...corporate fraud DOES pay off.   Shareholders dividends are more important than human lives.  And government \"fines\" are just a business expense.",
                "How much did they \"donate\" to Trump's account for this outcome?",
                "\"I'm sorry that your loved one died in an aviation accident, but if it's any consolation, Trump can now afford another golden toilet.\"",
                "Is this the Invisible Hand of the market that everyone keeps talking about?",
                "I guess casualties are just a write off",
                "Another bribe pays off.",
                "At least call it what it was- a bribe.",
                "Justice denied to victims again.",
                "Being rich = not a criminal/not a fraud. I love capitalism. Until my job was outsourced to Mexico. Now I pay tariffs to hopefully bring back the company that abandoned me! Win/Win",
                "So, what is the pay-off amount per death?\n\nWhat is the going rate for a bribe for a corporation to get away with murder?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 25308,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at [Covid.gov](https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/). They turned that site into a joke.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "I will laugh so hard if that meme VIP dinner last night turns into a super spreader event.",
                "Covid dlc before gta6",
                "Trump and Covid, name a more iconic duo....",
                "We had first COVID, yes, but what about second COVID?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 26421,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.\n\n**Edit:** Courtesy of /u/MtnMoonMama here is a link to write President Macron about the situation if you feel so inclined. https://www.elysee.fr/en/contact/",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/\n\n\nEdit: fill out the form. Send it. They send you an email with a link you must click. Click the link to send. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Man, where's the Mexican space program when you need it.",
                "Humans are fucking garbage"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 19667,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "Not calling her crown princess is weird.",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "They forgot to exempt white girls",
                "Well, that's no good for the EU <-> US relationship, but those were already fucked for a couple of months - crazy how hard-earned respect can be lost within mere seconds.",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/24/2025 16:09:09 UTC"
}