{
    "posts": [
        {
            "category": "HOT",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 24195,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Their idea is to radicalize an entire generation.",
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Nearly 30 Dead After Tornadoes Rip Across Midwest",
            "external_url": "https://weather.com/storms/tornado/news/2025-05-16-st-louis-clayton-missouri-tornado?cm_ven=hp-slot-1",
            "upvotes": 5611,
            "date": "05/18/2025",
            "thumbnail": "https://s.w-x.co/AP25138086182395%20%281%29.jpg",
            "top_comments": [
                "That seems like an awful high death toll for something like this. Maybe I’m trippin",
                "Good thing we moved 400M from the FEMA budget to pay for Trump’s golf trips.\n\n/s",
                "Thank God we have things in place to help these people like FEMA....",
                "Maybe if there was an organization that was staffed with people during severe weather that could worn the public of dangerous conditions, then maybe there wouldn't be as many deaths. I guess we'll never know.",
                "“Trump cuts results in nearly 30 dead after Tornadoes rip across Midwest, failure to warn public.”",
                "Trump states need that FEMA aid. Biden and any other president (both R & D) would already be on top of this. ",
                "Good thing NOAA had all those cuts.  Especially with Hurricane season about to start.",
                "NOAA? FEMA? Nah, lets make a 90mil parade for the president.",
                "Just curious.. for those in the area.. were you adequately warned? ",
                "Republicans voted for this.  They want more people to die from natural disasters."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Missouri lawmakers move to repeal abortion protections enacted by voters.",
            "external_url": "https://abcnews.go.com/Health/missouri-lawmakers-move-repeal-abortion-protections-enacted-voters/story?utm_source=facebook&utm_medium=social&utm_campaign=dhfacebook&utm_content=null&id=121830350&fbclid=IwQ0xDSwKW6yNleHRuA2FlbQIxMQABHr3yvoAJ0gM5eMDCOgc1o6jFmnLbKXvaLvFQffvILWKjIfW-67bfV2LACCQ4_aem_F8GPe-4NadiM88p1HCAq4w",
            "upvotes": 2930,
            "date": "05/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a7a633fe-062c-400f-be55-b39539073060/missouri-abortion-protest-02-ap-jef-250515_1747318588640_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I mean what do the voters know right?",
                "Like in Florida where they vote overwhelmingly for Amendments and then elect politicians who do everything they can to undermine those Amendments.",
                "So much for “representative” democracy. What those hypocrites want is a theocracy.",
                "Eventually Republicans will just do away with these pesky elections. If they're already ignoring the will of the voters then it's already underway.",
                "Can someone with more knowledge than me explain how this is legal? Ballot initiatives are not suggestions, it’s literally the will of the people.",
                "Same thing happened in Ohio. \"We the People\" voted for laws and the Republicans say \"we didn't know what we were voting on\" and took away our votes! REALLY??",
                "In case anyone is keeping score, this time it's the Republicans who are attempting to subvert the will of the people.\n\nI know, I was surprised, too.",
                "Wonder what they'll do if this is voted down. Try again?",
                "They really love to discredit the whole “your vote counts” stuff when they dont like the results.",
                "The modern elected Republican thinks they have the authority to do what they want. They don’t think they represent their constituents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 2221,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "\"We need to sanitize the phrase 'suicide bomber', what do you have, Johnson?\"\n\n\"Nihilistic ideations\"\n\n\"BRILLIANT\"",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "“Nihilists? Well fuck me. Say what you will about the tenants of National Socialism, at least it’s an ethos.”",
                "Call it what it is, a terrorist attack. Not a blast.",
                "I’m confused, are we still blaming pro-lifers?",
                "big lebowski,  this is from the movie.   ",
                "Big jump to nihilist. Giving people who don't give a shit a bad name",
                "This aggression will not stand.",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 1941,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "/r/antinatalist to be quarantined by the end of the day then?",
                "Average r/efilism poster.",
                "\\> Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here\n\nI'll bet money that this guy was a redditor.\n\nI think we've done something terrible to our society by creating places where these sad people can congregate without any moderating voice of reason. You don't even need any charismatic leader or conspiracy. These echo chambers are engines for self-radicalization",
                "I'm just gonna say it; this guy was an absolute moron.",
                "It was obviously a far right pro life Christian nationalist............is what you would believe if all you read was the comments under the previous reddit post of the initial news story. \n\nWill redditors gain any self awareness and refrain from jumping the gun and assigning motivations to developing stories. Probably not, would be nice though."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 13805,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Elections have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 6692,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/05-gettyimages-2215097286.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were people on the masts...",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/fVtpJ](https://archive.is/fVtpJ)\n\n* Edit: Link and content below updated.\n\n# A Mexican Navy training ship struck the Brooklyn Bridge, killing at least 2. Here’s what we know\n\nAt least two people were killed and about 20 injured when a Mexican Navy training ship on a global goodwill tour struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\nThere were 277 people on the sailing ship, called the Cuauhtémoc, at the time of the incident and everyone is believed to be accounted for, officials said Saturday\n\n[Related live-story: 2 dead after Mexican Navy training ship carrying more than 200 people strikes underside of Brooklyn Bridge](https://archive.is/o/fVtpJ/https://www.cnn.com/us/live-news/brooklyn-bridge-mexican-navy-ship-05-18-25-hnk)\n\nDramatic video shows the Cuauhtémoc’s masts hitting the underside of the bridge and breaking as the vessel passes underneath, with pieces falling down toward the deck.\n\nHere’s what we know:\n\n**What happened**\n\nThe incident occurred around 8:20 p.m. local time as the ship was departing from New York’s Pier 17, where it had been docked at the South Street Seaport Museum for five days of public viewing.\n\nThe ship’s masts – bedecked in lights - struck the bridge, breaking on impact and sending debris falling onto the vessel’s deck.\n\nNew York City Mayor Eric Adams said the ship lost power. City officials earlier said “mechanical issues” may have caused the incident, but cautioned all information so far is preliminary. An investigation is ongoing.\n\nThe New York Fire Department said in an email to CNN it received the call that a ship had struck the bridge around 8:39 p.m. More than 100 fire and emergency medical service personnel responded to the scene, NYFD said in its email.\n\nVideo of the Mexican Navy training ship shortly after it struck the Brooklyn Bridge showed people hanging from at least one of its masts. On tall ships like the Cuauhtémoc, it is a ceremonial tradition for sailors to climb the masts and rigging when departing or arriving into harbor.\n\n“We could see some people being kind of dragged,” an eyewitness, Flavio Moreira, told CNN. “I believe it was some of the staff, they were on the top of the boat. And they were swinging around, back and forth as soon as the ship hit the bridge.”\n\n**Multiple killed**\n\nTwo people were killed and two remain in critical condition, Adams said. The two who died fell from one of the ship’s masts, the law enforcement official told CNN. They were pronounced dead after being taken to a nearby hospital, the official said.\n\n“At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries,” Adams [wrote on X](https://archive.is/o/fVtpJ/https://x.com/NYCMayor/status/1923956324737351832).\n\nThe Mexican Navy said earlier a total of 22 people were injured, 19 of whom were taken to hospitals.\n\nMexican President Claudia Sheinbaum said the two people killed were crew members and sent her condolences to their families.\n\n“We are deeply saddened by the loss of two crew members of the Cuauhtémoc Training Ship, who lost their lives in the unfortunate accident in New York Harbor. Our sympathy and support go out to their families,” Sheinbaum said in a post on X early Sunday.\n\nSheinbaum said the Mexican Navy is supporting those injured in the incident, and that the Mexican ambassador to the United States and Mexican Consulate General were supporting the navy.\n\n**An investigation underway**\n\nThe ship appeared to lose power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel toward the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\nThe National Transportation Safety Board is conducting an investigation.\n\nMexican authorities described the Cuauhtémoc ship as a steel-hulled three-masted barque with a length of around 300 feet and a height of roughly 160 feet, a 2024 [news release](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/) from one of its training cruises said.\n\nGovernment [documents](https://archive.is/o/fVtpJ/https://nauticalcharts.noaa.gov/publications/coast-pilot/files/cp2/CPB2_C09_WEB.pdf) show the Brooklyn Bridge has a navigational clearance of 127 feet, roughly 30 feet shorter than the height of the sailing ship.\n\nThere was no visible damage to the Brooklyn Bridge, which appeared to be left structurally intact.\n\n“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge,” NY Department of Transportation said in a [post](https://archive.is/o/fVtpJ/https://x.com/NYC_DOT/status/1923934086554349869) on X.\n\nTraffic was temporarily closed in both directions for about 40 minutes as emergency services responded to the scene. It was later reopened following a preliminary inspection, Adams said.\n\nThis ship has been moved to Manhattan’s Pier 36, located along the East River less than a mile from the Brooklyn Bridge, according to the law enforcement official.\n\n**What do we know about the ship?**\n\nThe Cuauhtémoc is a training sailing ship of the Mexican Navy and described by officials as a diplomatic symbol of Mexico abroad.\n\nKnown as the “Ambassador and Knight of the Seas,” the ship was in New York as part of a global goodwill tour and was en route to Iceland at the time of the incident.\n\nA spokesperson for the New York City-area [Sail4th 250](https://archive.is/o/fVtpJ/https://www.sail4th.org/) events told CNN that the Cuauhtémoc ship had “welcomed dignitaries and media” as part of its New York stop on its global tour.\n\nThe sailing ship was expected to join the parade of international tall ships to celebrate the United States’s 250 anniversary on July 4, 2026 – in what the event is calling “the largest-ever flotilla of tall ships from around the world.\n\n”Built in Spain in 1981, the ship was acquired by the Mexican Navy to train cadets and officers. It regularly takes part in major regattas around the world. According to a [news release ](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/)from one of its global cruises, it was used for training by the Heroic Naval Military School, an elite military academy in Mexico.\n\nThe ship, as of last year, had visited 212 ports in 64 countries with 756,085 nautical miles sailed, the latter equivalent to making 35 trips around the world, the release said.\n\nThis story has been updated with additional information.",
                "Wonder how long he'll have caps lock on this time",
                "Omg 🤦‍♀️ we all know where this is going…",
                "prez is going to call it an international conflict /smh",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 41281,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "[removed]",
                "One of my siblings was there having lunch nearby and, thankfully, only heard the explosion. They left immediately and, before the news reported it, they were under the impression that a meth lab had blown up.\n\nWhoever did this deserves to rot in hell.",
                "Caused by someone who is \"pro life\"",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration closing iconic NASA research center in New York",
            "external_url": "https://www.axios.com/2025/05/17/trump-nasa-goddard-office",
            "upvotes": 5958,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "While the scientists have to vacate by the end of the month, the US government still continues to hold the lease for the building from Columbia University. So this will likely not save any money for taxpayers. [https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html](https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html)",
                "The reason is in the article.\n\n“Puts at risk the database of historical temperature readings going back to 1880”\n\nThe administration is angling climate research in a way that can be summarized with “There is no climate change if there is no data to say so.”\n\nHence the mass cuts to remote environmental sensing projects and related. He’ll they’ve even gone after DoD programs that do that for only the military",
                "Of course they are. They'll probably sell it to the trump org for $1.",
                "This administration just wants to wreck everything. I find it hard to believe this is actually about saving money, but instead it’s about destroying history.",
                "Someone needs to kepe track all the buildings sold to trump cronies for pennies so we can jail thrm",
                "I hope y’all know that these services are never coming back.",
                "It would be helpful if the journalist who wrote this article asked their White House sources where these scientists plan to work after they are vacated from the building. That’s the big issue- they now have nowhere office to work out of, which is insane.",
                "It’s like we’re living in someone’s game of CIV or SimCity and their little brother took over and tried to make it as shitty as possible.",
                "Yep to sell off all our federal buildings to pay for their bullshit tax cut.",
                "You’d almost think he’s doing this to intentionally destroy and cripple the United States."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 15899,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sites cost what is now up to over 20 lives.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Didn't DOGE cut the weather forecast services and one of the warnings of doing it would lead to people dying from the lack of hazardous weather warnings?",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 2220,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "\"We need to sanitize the phrase 'suicide bomber', what do you have, Johnson?\"\n\n\"Nihilistic ideations\"\n\n\"BRILLIANT\"",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "“Nihilists? Well fuck me. Say what you will about the tenants of National Socialism, at least it’s an ethos.”",
                "Call it what it is, a terrorist attack. Not a blast.",
                "I’m confused, are we still blaming pro-lifers?",
                "big lebowski,  this is from the movie.   ",
                "Big jump to nihilist. Giving people who don't give a shit a bad name",
                "This aggression will not stand.",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Missouri lawmakers move to repeal abortion protections enacted by voters.",
            "external_url": "https://abcnews.go.com/Health/missouri-lawmakers-move-repeal-abortion-protections-enacted-voters/story?utm_source=facebook&utm_medium=social&utm_campaign=dhfacebook&utm_content=null&id=121830350&fbclid=IwQ0xDSwKW6yNleHRuA2FlbQIxMQABHr3yvoAJ0gM5eMDCOgc1o6jFmnLbKXvaLvFQffvILWKjIfW-67bfV2LACCQ4_aem_F8GPe-4NadiM88p1HCAq4w",
            "upvotes": 2933,
            "date": "05/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a7a633fe-062c-400f-be55-b39539073060/missouri-abortion-protest-02-ap-jef-250515_1747318588640_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I mean what do the voters know right?",
                "Like in Florida where they vote overwhelmingly for Amendments and then elect politicians who do everything they can to undermine those Amendments.",
                "So much for “representative” democracy. What those hypocrites want is a theocracy.",
                "Eventually Republicans will just do away with these pesky elections. If they're already ignoring the will of the voters then it's already underway.",
                "Can someone with more knowledge than me explain how this is legal? Ballot initiatives are not suggestions, it’s literally the will of the people.",
                "Same thing happened in Ohio. \"We the People\" voted for laws and the Republicans say \"we didn't know what we were voting on\" and took away our votes! REALLY??",
                "In case anyone is keeping score, this time it's the Republicans who are attempting to subvert the will of the people.\n\nI know, I was surprised, too.",
                "Wonder what they'll do if this is voted down. Try again?",
                "They really love to discredit the whole “your vote counts” stuff when they dont like the results.",
                "The modern elected Republican thinks they have the authority to do what they want. They don’t think they represent their constituents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 1944,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "/r/antinatalist to be quarantined by the end of the day then?",
                "Average r/efilism poster.",
                "\\> Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here\n\nI'll bet money that this guy was a redditor.\n\nI think we've done something terrible to our society by creating places where these sad people can congregate without any moderating voice of reason. You don't even need any charismatic leader or conspiracy. These echo chambers are engines for self-radicalization",
                "I'm just gonna say it; this guy was an absolute moron.",
                "It was obviously a far right pro life Christian nationalist............is what you would believe if all you read was the comments under the previous reddit post of the initial news story. \n\nWill redditors gain any self awareness and refrain from jumping the gun and assigning motivations to developing stories. Probably not, would be nice though."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Nearly 30 Dead After Tornadoes Rip Across Midwest",
            "external_url": "https://weather.com/storms/tornado/news/2025-05-16-st-louis-clayton-missouri-tornado?cm_ven=hp-slot-1",
            "upvotes": 5608,
            "date": "05/18/2025",
            "thumbnail": "https://s.w-x.co/AP25138086182395%20%281%29.jpg",
            "top_comments": [
                "That seems like an awful high death toll for something like this. Maybe I’m trippin",
                "Good thing we moved 400M from the FEMA budget to pay for Trump’s golf trips.\n\n/s",
                "Thank God we have things in place to help these people like FEMA....",
                "Maybe if there was an organization that was staffed with people during severe weather that could worn the public of dangerous conditions, then maybe there wouldn't be as many deaths. I guess we'll never know.",
                "“Trump cuts results in nearly 30 dead after Tornadoes rip across Midwest, failure to warn public.”",
                "Trump states need that FEMA aid. Biden and any other president (both R & D) would already be on top of this. ",
                "Good thing NOAA had all those cuts.  Especially with Hurricane season about to start.",
                "NOAA? FEMA? Nah, lets make a 90mil parade for the president.",
                "Just curious.. for those in the area.. were you adequately warned? ",
                "Republicans voted for this.  They want more people to die from natural disasters."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 24203,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Their idea is to radicalize an entire generation.",
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 6698,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/05-gettyimages-2215097286.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were people on the masts...",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/fVtpJ](https://archive.is/fVtpJ)\n\n* Edit: Link and content below updated.\n\n# A Mexican Navy training ship struck the Brooklyn Bridge, killing at least 2. Here’s what we know\n\nAt least two people were killed and about 20 injured when a Mexican Navy training ship on a global goodwill tour struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\nThere were 277 people on the sailing ship, called the Cuauhtémoc, at the time of the incident and everyone is believed to be accounted for, officials said Saturday\n\n[Related live-story: 2 dead after Mexican Navy training ship carrying more than 200 people strikes underside of Brooklyn Bridge](https://archive.is/o/fVtpJ/https://www.cnn.com/us/live-news/brooklyn-bridge-mexican-navy-ship-05-18-25-hnk)\n\nDramatic video shows the Cuauhtémoc’s masts hitting the underside of the bridge and breaking as the vessel passes underneath, with pieces falling down toward the deck.\n\nHere’s what we know:\n\n**What happened**\n\nThe incident occurred around 8:20 p.m. local time as the ship was departing from New York’s Pier 17, where it had been docked at the South Street Seaport Museum for five days of public viewing.\n\nThe ship’s masts – bedecked in lights - struck the bridge, breaking on impact and sending debris falling onto the vessel’s deck.\n\nNew York City Mayor Eric Adams said the ship lost power. City officials earlier said “mechanical issues” may have caused the incident, but cautioned all information so far is preliminary. An investigation is ongoing.\n\nThe New York Fire Department said in an email to CNN it received the call that a ship had struck the bridge around 8:39 p.m. More than 100 fire and emergency medical service personnel responded to the scene, NYFD said in its email.\n\nVideo of the Mexican Navy training ship shortly after it struck the Brooklyn Bridge showed people hanging from at least one of its masts. On tall ships like the Cuauhtémoc, it is a ceremonial tradition for sailors to climb the masts and rigging when departing or arriving into harbor.\n\n“We could see some people being kind of dragged,” an eyewitness, Flavio Moreira, told CNN. “I believe it was some of the staff, they were on the top of the boat. And they were swinging around, back and forth as soon as the ship hit the bridge.”\n\n**Multiple killed**\n\nTwo people were killed and two remain in critical condition, Adams said. The two who died fell from one of the ship’s masts, the law enforcement official told CNN. They were pronounced dead after being taken to a nearby hospital, the official said.\n\n“At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries,” Adams [wrote on X](https://archive.is/o/fVtpJ/https://x.com/NYCMayor/status/1923956324737351832).\n\nThe Mexican Navy said earlier a total of 22 people were injured, 19 of whom were taken to hospitals.\n\nMexican President Claudia Sheinbaum said the two people killed were crew members and sent her condolences to their families.\n\n“We are deeply saddened by the loss of two crew members of the Cuauhtémoc Training Ship, who lost their lives in the unfortunate accident in New York Harbor. Our sympathy and support go out to their families,” Sheinbaum said in a post on X early Sunday.\n\nSheinbaum said the Mexican Navy is supporting those injured in the incident, and that the Mexican ambassador to the United States and Mexican Consulate General were supporting the navy.\n\n**An investigation underway**\n\nThe ship appeared to lose power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel toward the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\nThe National Transportation Safety Board is conducting an investigation.\n\nMexican authorities described the Cuauhtémoc ship as a steel-hulled three-masted barque with a length of around 300 feet and a height of roughly 160 feet, a 2024 [news release](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/) from one of its training cruises said.\n\nGovernment [documents](https://archive.is/o/fVtpJ/https://nauticalcharts.noaa.gov/publications/coast-pilot/files/cp2/CPB2_C09_WEB.pdf) show the Brooklyn Bridge has a navigational clearance of 127 feet, roughly 30 feet shorter than the height of the sailing ship.\n\nThere was no visible damage to the Brooklyn Bridge, which appeared to be left structurally intact.\n\n“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge,” NY Department of Transportation said in a [post](https://archive.is/o/fVtpJ/https://x.com/NYC_DOT/status/1923934086554349869) on X.\n\nTraffic was temporarily closed in both directions for about 40 minutes as emergency services responded to the scene. It was later reopened following a preliminary inspection, Adams said.\n\nThis ship has been moved to Manhattan’s Pier 36, located along the East River less than a mile from the Brooklyn Bridge, according to the law enforcement official.\n\n**What do we know about the ship?**\n\nThe Cuauhtémoc is a training sailing ship of the Mexican Navy and described by officials as a diplomatic symbol of Mexico abroad.\n\nKnown as the “Ambassador and Knight of the Seas,” the ship was in New York as part of a global goodwill tour and was en route to Iceland at the time of the incident.\n\nA spokesperson for the New York City-area [Sail4th 250](https://archive.is/o/fVtpJ/https://www.sail4th.org/) events told CNN that the Cuauhtémoc ship had “welcomed dignitaries and media” as part of its New York stop on its global tour.\n\nThe sailing ship was expected to join the parade of international tall ships to celebrate the United States’s 250 anniversary on July 4, 2026 – in what the event is calling “the largest-ever flotilla of tall ships from around the world.\n\n”Built in Spain in 1981, the ship was acquired by the Mexican Navy to train cadets and officers. It regularly takes part in major regattas around the world. According to a [news release ](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/)from one of its global cruises, it was used for training by the Heroic Naval Military School, an elite military academy in Mexico.\n\nThe ship, as of last year, had visited 212 ports in 64 countries with 756,085 nautical miles sailed, the latter equivalent to making 35 trips around the world, the release said.\n\nThis story has been updated with additional information.",
                "Wonder how long he'll have caps lock on this time",
                "Omg 🤦‍♀️ we all know where this is going…",
                "prez is going to call it an international conflict /smh",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 13805,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Elections have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration closing iconic NASA research center in New York",
            "external_url": "https://www.axios.com/2025/05/17/trump-nasa-goddard-office",
            "upvotes": 5960,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "While the scientists have to vacate by the end of the month, the US government still continues to hold the lease for the building from Columbia University. So this will likely not save any money for taxpayers. [https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html](https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html)",
                "The reason is in the article.\n\n“Puts at risk the database of historical temperature readings going back to 1880”\n\nThe administration is angling climate research in a way that can be summarized with “There is no climate change if there is no data to say so.”\n\nHence the mass cuts to remote environmental sensing projects and related. He’ll they’ve even gone after DoD programs that do that for only the military",
                "Of course they are. They'll probably sell it to the trump org for $1.",
                "This administration just wants to wreck everything. I find it hard to believe this is actually about saving money, but instead it’s about destroying history.",
                "Someone needs to kepe track all the buildings sold to trump cronies for pennies so we can jail thrm",
                "I hope y’all know that these services are never coming back.",
                "It would be helpful if the journalist who wrote this article asked their White House sources where these scientists plan to work after they are vacated from the building. That’s the big issue- they now have nowhere office to work out of, which is insane.",
                "It’s like we’re living in someone’s game of CIV or SimCity and their little brother took over and tried to make it as shitty as possible.",
                "Yep to sell off all our federal buildings to pay for their bullshit tax cut.",
                "You’d almost think he’s doing this to intentionally destroy and cripple the United States."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 41282,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "[removed]",
                "One of my siblings was there having lunch nearby and, thankfully, only heard the explosion. They left immediately and, before the news reported it, they were under the impression that a meth lab had blown up.\n\nWhoever did this deserves to rot in hell.",
                "Caused by someone who is \"pro life\"",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 2112,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5fd/live/4a9f25b0-3366-11f0-b738-f51320fcf8ba.jpg",
            "top_comments": [
                "Ack. I imagine avalanche would be a horrible way to die.",
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Missouri lawmakers move to repeal abortion protections enacted by voters.",
            "external_url": "https://abcnews.go.com/Health/missouri-lawmakers-move-repeal-abortion-protections-enacted-voters/story?utm_source=facebook&utm_medium=social&utm_campaign=dhfacebook&utm_content=null&id=121830350&fbclid=IwQ0xDSwKW6yNleHRuA2FlbQIxMQABHr3yvoAJ0gM5eMDCOgc1o6jFmnLbKXvaLvFQffvILWKjIfW-67bfV2LACCQ4_aem_F8GPe-4NadiM88p1HCAq4w",
            "upvotes": 2939,
            "date": "05/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a7a633fe-062c-400f-be55-b39539073060/missouri-abortion-protest-02-ap-jef-250515_1747318588640_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I mean what do the voters know right?",
                "Like in Florida where they vote overwhelmingly for Amendments and then elect politicians who do everything they can to undermine those Amendments.",
                "So much for “representative” democracy. What those hypocrites want is a theocracy.",
                "Eventually Republicans will just do away with these pesky elections. If they're already ignoring the will of the voters then it's already underway.",
                "Can someone with more knowledge than me explain how this is legal? Ballot initiatives are not suggestions, it’s literally the will of the people.",
                "Same thing happened in Ohio. \"We the People\" voted for laws and the Republicans say \"we didn't know what we were voting on\" and took away our votes! REALLY??",
                "In case anyone is keeping score, this time it's the Republicans who are attempting to subvert the will of the people.\n\nI know, I was surprised, too.",
                "Wonder what they'll do if this is voted down. Try again?",
                "They really love to discredit the whole “your vote counts” stuff when they dont like the results.",
                "The modern elected Republican thinks they have the authority to do what they want. They don’t think they represent their constituents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 2225,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "\"We need to sanitize the phrase 'suicide bomber', what do you have, Johnson?\"\n\n\"Nihilistic ideations\"\n\n\"BRILLIANT\"",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "“Nihilists? Well fuck me. Say what you will about the tenants of National Socialism, at least it’s an ethos.”",
                "Call it what it is, a terrorist attack. Not a blast.",
                "I’m confused, are we still blaming pro-lifers?",
                "big lebowski,  this is from the movie.   ",
                "Big jump to nihilist. Giving people who don't give a shit a bad name",
                "This aggression will not stand.",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Nearly 30 Dead After Tornadoes Rip Across Midwest",
            "external_url": "https://weather.com/storms/tornado/news/2025-05-16-st-louis-clayton-missouri-tornado?cm_ven=hp-slot-1",
            "upvotes": 5608,
            "date": "05/18/2025",
            "thumbnail": "https://s.w-x.co/AP25138086182395%20%281%29.jpg",
            "top_comments": [
                "That seems like an awful high death toll for something like this. Maybe I’m trippin",
                "Good thing we moved 400M from the FEMA budget to pay for Trump’s golf trips.\n\n/s",
                "Thank God we have things in place to help these people like FEMA....",
                "Maybe if there was an organization that was staffed with people during severe weather that could worn the public of dangerous conditions, then maybe there wouldn't be as many deaths. I guess we'll never know.",
                "“Trump cuts results in nearly 30 dead after Tornadoes rip across Midwest, failure to warn public.”",
                "Trump states need that FEMA aid. Biden and any other president (both R & D) would already be on top of this. ",
                "Good thing NOAA had all those cuts.  Especially with Hurricane season about to start.",
                "NOAA? FEMA? Nah, lets make a 90mil parade for the president.",
                "Just curious.. for those in the area.. were you adequately warned? ",
                "Republicans voted for this.  They want more people to die from natural disasters."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 1943,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "/r/antinatalist to be quarantined by the end of the day then?",
                "Average r/efilism poster.",
                "\\> Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here\n\nI'll bet money that this guy was a redditor.\n\nI think we've done something terrible to our society by creating places where these sad people can congregate without any moderating voice of reason. You don't even need any charismatic leader or conspiracy. These echo chambers are engines for self-radicalization",
                "I'm just gonna say it; this guy was an absolute moron.",
                "It was obviously a far right pro life Christian nationalist............is what you would believe if all you read was the comments under the previous reddit post of the initial news story. \n\nWill redditors gain any self awareness and refrain from jumping the gun and assigning motivations to developing stories. Probably not, would be nice though."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 24207,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Their idea is to radicalize an entire generation.",
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 13799,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Elections have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 6692,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/05-gettyimages-2215097286.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were people on the masts...",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/fVtpJ](https://archive.is/fVtpJ)\n\n* Edit: Link and content below updated.\n\n# A Mexican Navy training ship struck the Brooklyn Bridge, killing at least 2. Here’s what we know\n\nAt least two people were killed and about 20 injured when a Mexican Navy training ship on a global goodwill tour struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\nThere were 277 people on the sailing ship, called the Cuauhtémoc, at the time of the incident and everyone is believed to be accounted for, officials said Saturday\n\n[Related live-story: 2 dead after Mexican Navy training ship carrying more than 200 people strikes underside of Brooklyn Bridge](https://archive.is/o/fVtpJ/https://www.cnn.com/us/live-news/brooklyn-bridge-mexican-navy-ship-05-18-25-hnk)\n\nDramatic video shows the Cuauhtémoc’s masts hitting the underside of the bridge and breaking as the vessel passes underneath, with pieces falling down toward the deck.\n\nHere’s what we know:\n\n**What happened**\n\nThe incident occurred around 8:20 p.m. local time as the ship was departing from New York’s Pier 17, where it had been docked at the South Street Seaport Museum for five days of public viewing.\n\nThe ship’s masts – bedecked in lights - struck the bridge, breaking on impact and sending debris falling onto the vessel’s deck.\n\nNew York City Mayor Eric Adams said the ship lost power. City officials earlier said “mechanical issues” may have caused the incident, but cautioned all information so far is preliminary. An investigation is ongoing.\n\nThe New York Fire Department said in an email to CNN it received the call that a ship had struck the bridge around 8:39 p.m. More than 100 fire and emergency medical service personnel responded to the scene, NYFD said in its email.\n\nVideo of the Mexican Navy training ship shortly after it struck the Brooklyn Bridge showed people hanging from at least one of its masts. On tall ships like the Cuauhtémoc, it is a ceremonial tradition for sailors to climb the masts and rigging when departing or arriving into harbor.\n\n“We could see some people being kind of dragged,” an eyewitness, Flavio Moreira, told CNN. “I believe it was some of the staff, they were on the top of the boat. And they were swinging around, back and forth as soon as the ship hit the bridge.”\n\n**Multiple killed**\n\nTwo people were killed and two remain in critical condition, Adams said. The two who died fell from one of the ship’s masts, the law enforcement official told CNN. They were pronounced dead after being taken to a nearby hospital, the official said.\n\n“At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries,” Adams [wrote on X](https://archive.is/o/fVtpJ/https://x.com/NYCMayor/status/1923956324737351832).\n\nThe Mexican Navy said earlier a total of 22 people were injured, 19 of whom were taken to hospitals.\n\nMexican President Claudia Sheinbaum said the two people killed were crew members and sent her condolences to their families.\n\n“We are deeply saddened by the loss of two crew members of the Cuauhtémoc Training Ship, who lost their lives in the unfortunate accident in New York Harbor. Our sympathy and support go out to their families,” Sheinbaum said in a post on X early Sunday.\n\nSheinbaum said the Mexican Navy is supporting those injured in the incident, and that the Mexican ambassador to the United States and Mexican Consulate General were supporting the navy.\n\n**An investigation underway**\n\nThe ship appeared to lose power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel toward the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\nThe National Transportation Safety Board is conducting an investigation.\n\nMexican authorities described the Cuauhtémoc ship as a steel-hulled three-masted barque with a length of around 300 feet and a height of roughly 160 feet, a 2024 [news release](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/) from one of its training cruises said.\n\nGovernment [documents](https://archive.is/o/fVtpJ/https://nauticalcharts.noaa.gov/publications/coast-pilot/files/cp2/CPB2_C09_WEB.pdf) show the Brooklyn Bridge has a navigational clearance of 127 feet, roughly 30 feet shorter than the height of the sailing ship.\n\nThere was no visible damage to the Brooklyn Bridge, which appeared to be left structurally intact.\n\n“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge,” NY Department of Transportation said in a [post](https://archive.is/o/fVtpJ/https://x.com/NYC_DOT/status/1923934086554349869) on X.\n\nTraffic was temporarily closed in both directions for about 40 minutes as emergency services responded to the scene. It was later reopened following a preliminary inspection, Adams said.\n\nThis ship has been moved to Manhattan’s Pier 36, located along the East River less than a mile from the Brooklyn Bridge, according to the law enforcement official.\n\n**What do we know about the ship?**\n\nThe Cuauhtémoc is a training sailing ship of the Mexican Navy and described by officials as a diplomatic symbol of Mexico abroad.\n\nKnown as the “Ambassador and Knight of the Seas,” the ship was in New York as part of a global goodwill tour and was en route to Iceland at the time of the incident.\n\nA spokesperson for the New York City-area [Sail4th 250](https://archive.is/o/fVtpJ/https://www.sail4th.org/) events told CNN that the Cuauhtémoc ship had “welcomed dignitaries and media” as part of its New York stop on its global tour.\n\nThe sailing ship was expected to join the parade of international tall ships to celebrate the United States’s 250 anniversary on July 4, 2026 – in what the event is calling “the largest-ever flotilla of tall ships from around the world.\n\n”Built in Spain in 1981, the ship was acquired by the Mexican Navy to train cadets and officers. It regularly takes part in major regattas around the world. According to a [news release ](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/)from one of its global cruises, it was used for training by the Heroic Naval Military School, an elite military academy in Mexico.\n\nThe ship, as of last year, had visited 212 ports in 64 countries with 756,085 nautical miles sailed, the latter equivalent to making 35 trips around the world, the release said.\n\nThis story has been updated with additional information.",
                "Wonder how long he'll have caps lock on this time",
                "Omg 🤦‍♀️ we all know where this is going…",
                "prez is going to call it an international conflict /smh",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 41284,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "[removed]",
                "One of my siblings was there having lunch nearby and, thankfully, only heard the explosion. They left immediately and, before the news reported it, they were under the impression that a meth lab had blown up.\n\nWhoever did this deserves to rot in hell.",
                "Caused by someone who is \"pro life\"",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration closing iconic NASA research center in New York",
            "external_url": "https://www.axios.com/2025/05/17/trump-nasa-goddard-office",
            "upvotes": 5956,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "While the scientists have to vacate by the end of the month, the US government still continues to hold the lease for the building from Columbia University. So this will likely not save any money for taxpayers. [https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html](https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html)",
                "The reason is in the article.\n\n“Puts at risk the database of historical temperature readings going back to 1880”\n\nThe administration is angling climate research in a way that can be summarized with “There is no climate change if there is no data to say so.”\n\nHence the mass cuts to remote environmental sensing projects and related. He’ll they’ve even gone after DoD programs that do that for only the military",
                "Of course they are. They'll probably sell it to the trump org for $1.",
                "This administration just wants to wreck everything. I find it hard to believe this is actually about saving money, but instead it’s about destroying history.",
                "Someone needs to kepe track all the buildings sold to trump cronies for pennies so we can jail thrm",
                "I hope y’all know that these services are never coming back.",
                "It would be helpful if the journalist who wrote this article asked their White House sources where these scientists plan to work after they are vacated from the building. That’s the big issue- they now have nowhere office to work out of, which is insane.",
                "It’s like we’re living in someone’s game of CIV or SimCity and their little brother took over and tried to make it as shitty as possible.",
                "Yep to sell off all our federal buildings to pay for their bullshit tax cut.",
                "You’d almost think he’s doing this to intentionally destroy and cripple the United States."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 15894,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sites cost what is now up to over 20 lives.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Didn't DOGE cut the weather forecast services and one of the warnings of doing it would lead to people dying from the lack of hazardous weather warnings?",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/18/2025 20:10:02 UTC"
}