{
    "posts": [
        {
            "category": "HOT",
            "title": "DOJ to seek death penalty for Luigi Mangione in CEO murder case",
            "external_url": "https://www.cnbc.com/2025/04/01/luigi-mangione-death-penalty-brian-thompson.html",
            "upvotes": 33809,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124291-1743523094454-108124291-17435230372025-04-01t154224z_1209086563_rc22zca5958d_rtrmadp_0_unitedhealth-ceo.jpg?v=1743523101&w=1920&h=1080",
            "top_comments": [
                "Not surprising. Do I think the jury is going to recommend the death penalty? My gut says no, but I think life is still on the table ",
                "Kinda wild to announce this, playing up the whole “Luigi killed a father” thing, on the same day that you sent a father to die in El Salvador.",
                "I still don't understand why the DoJ is even involved. This shouldn't be a federal case. It should be handled by the state of New York",
                "[removed]",
                "The Parkland school shooter killed 17 people and wasn’t sentenced to death. \n\nThis is a politically driven punishment. \n\nEdit: I’ve learned the prosecutors in the Parkland shooting trial did try for the death penalty but the jury was not unanimous in agreement so the shooter avoided that punishment. Thanks for those who gave me some learning in the child comments. ",
                "Sure, make him a martyr. Go ahead.",
                "What a surprise.\n\nAnd the execution will probably be streamed pay per view on X.",
                "Oh they’re scared scared. \n\nMaking him a martyr is the worst possible thing these cowards could do. Good luck with all that.",
                "Universal Healthcare would have saved Brian Thompson's life.",
                "Why is this a federal case at all to begin with? A private citizen killed another private citizen in NYC...\n\nStates are really allowing this kind of federal overreach these days?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 16319,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                "How long until states get border checks where you cant leave without state visa or minors cant leave without parental permission and minors becomes boosted to under 25s. But i feel like they'd go for trying to get a national ban on abortion instead. They wont stop trying find a win",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "\"Alabama [bans abortion](https://www.cnn.com/2019/05/15/politics/alabama-governor-signs-bill/index.html) at any stage of pregnancy with no exceptions for rape and incest.\"\n\nDumb Fucks.",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "Alabama in a couple years: \"We gave you a speeding ticket for exceeding the posted speed limit in Iowa.\"",
                "Can we prosecute the people stalking and reporting women who they suspect have had an abortion?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 2590,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 10150,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "As a non-white living in the US, I am terrified for my family. We’re all US citizens but these people aren’t even checking anymore",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 15606,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "I fucking hate it here.",
                "Remind me what the point of all this is?  If they were serious about saving money, they've already failed.  The IRS has already said that they were kneecapped to the tune of $500B.  Nothing Elon or Trump have done will make up for that loss.  They're complete and utter failures.",
                "Funny how \"the government spends too much, we need to save money\" always means cutting the programs that help people instead of ordering fewer fighter jets at the Pentagon.",
                "It’s a coup. Has always been a coup.",
                "If you don't count the cases there is no disease! June 15, 2020 “When you test, you create cases.” President Donald J. Trump.\n\nSomehow, Americans voted again to have the guy as President.",
                "And you thought what was in Taco Bell was mystery meat before…"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 5593,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lawyers doing what they can with lawsuits in system thats already being undermined. But its up to general public to call representatives and join protests to show how unpopular these cuts are",
                "STATE OF COLORADO; STATE OF RHODE ISLAND; STATE OF CALIFORNIA; STATE OF\nMINNESOTA; STATE OF WASHINGTON; STATE\nOF ARIZONA; STATE OF CONNECTICUT;\nSTATE OF DELAWARE; DISTRICT OF\nCOLUMBIA; STATE OF HAWAI‘I; STATE OF\nILLINOIS; OFFICE OF THE GOVERNOR ex rel.\nAndy Beshear, in his official capacity as Governor of the COMMONWEALTH OF KENTUCKY;STATE OF MAINE; STATE OF MARYLAND; COMMONWEALTH OF MASSACHUSETTS; STATE OF MICHIGAN; STATE OF NEVADA;STATE OF NEW JERSEY; STATE OF NEW MEXICO; STATE OF NEW YORK; STATE OF NORTH CAROLINA; STATE OF OREGON; JOSH SHAPIRO, in his official capacity as Governor of the COMMONWEALTH OF PENNSYLVANIA;\nand STATE OF WISCONSIN\n\nThere’s the list after clicking 3 links so you don’t have to",
                "For the sake of the American people, let's hope they win.\n\nContact your Congressional reps.  Tell them you are unhappy that your, your friend's and your family's health are being put in jeopardy",
                "SUE HIM? How about impeach him?\n\nEdit and this time remove his ass.",
                "Are any of those states republican states?",
                "April 5th. Fid a local protest in your area.",
                "I'll bet Indiana isn't one of them. Our AG is busy mocking gay people for April fool's day.",
                "I do not have any faith that our judiciary will check or balance anything the Trump admin does. There will be some judges that stand up, but they’ll just be removed, silenced, ignored, or overruled by the wildly corrupt Supreme Court.",
                "This is the plan. Tie up the Justice system with all of this stupid trump crap.",
                "I hope if it does get restored only the 23 blue states and DC get their funding. Screw the red states."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Mississippi governor signs typo tax overhaul bill into law to phase out income tax",
            "external_url": "https://apnews.com/us-news/taxes-tate-reeves-mississippi-general-news-573ad75c52cb94af8f8adc90d1cd5e96",
            "upvotes": 1700,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good god, MS. You really are a sitcom at this point:\n\n\"The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\"",
                "If those Mississippi legislators could read they'd be very upset",
                "I couldn't find what the typo was in this article. So I had to look [around](https://mississippitoday.org/2025/03/24/how-did-the-mississippi-typo-tax-swap-act-of-2025-happen-legislative-recap/). For anyone else wondering:\n\nThe latter parts of the tax reduction only occur:\n\n>when revenue surplus equals 85% or more of the cost of a 1% cut in the tax rate.\n\nBut the bill was passed and signed as `.85%`. So the cuts are almost guranteed to continue.",
                "These paragraphs explain how the typo affected things:\n\n>House leaders have long pushed to eliminate the state personal income tax in relatively short order. The Senate had urged a longer-term approach, arguing it would be unwise to slash a third of the state’s revenue in uncertain economic times. Senators last week had conceded to eliminate the income tax, but only with economic growth “triggers” as safeguards — the tax wouldn’t phase out unless the state saw robust economic growth and controlled spending. It would have likely taken many years.\n\n>Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.",
                "So they say Mississippi is open for business and a bunch of people will move there. Do people really want to live there with no schools, libraries, hospitals, or maybe even fire stations and police? They already can't pay for these things, what is going to happen with no income tax?",
                "Nothing screams \"governing with competence\" like accidentally fast-tracking a massive tax overhaul \\*because of typos\\*. This wasn’t just a clerical hiccup. This is generational economic policy passed by people who \\*didn’t read the fine print\\*. Or maybe they did and hoped no one else would. Either way, Mississippi just gave its wealthiest residents a high-five and told the working poor to budget harder. \n\n\n\nThey’ll tell you it’s bold reform. But behind the curtain? It’s austerity cosplaying as prosperity.",
                "Stop giving this deadbeat red state more federal money than it kicks in.",
                "As a lifetime Mississippi resident, let me assure you - we don’t hide our idiots away, we put them in political positions such as Governor.",
                "Wait until y'all find out [why we no longer have ballot initiatives ](https://apnews.com/article/ms-state-wire-mississippi-marijuana-health-4f81d577aeb2ed8a04849f62c86c707e)",
                "Mississippi is like that brother who's always fucking up and didn't graduate high school. But you still love them because they're your brother. The whole south can't pull it's own weight."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Medical Student Convicted Of Raping Another Student Escapes Sentence As “He Is Young And Talented”",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/01/medical-student-convicted-of-raping-another-student-escapes-sent/",
            "upvotes": 2885,
            "date": "04/01/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2025/04/01/93759d66-b14b-42bc-aa5d-8469165278ca.png",
            "top_comments": [
                ">In his summing up the judge said “It has been proven that sexual intercourse took place at a time that she was in a state that meant that she couldn’t possibly consent to it. The offence is serious and unacceptable.”\n\n>Nevertheless, the judge refrained from passing sentence. “It is undeniable that he passed the line of what is permissible. The man showed a lack of respect for the victim's physical, psychological and sexual boundaries. However, he is still young and has no criminal record. He is also a talented and committed person both in his professional and private live. By finding him guilty but not punishing him, he will be made to feel guilty and the chance of him reoffending will be prevented, without socially impairing the man”.\n\n\"Its **unacceptable**! But I won't punish him.\"",
                "Young and talented at what, raping?",
                "Unfortunately, the title must exactly match the article, so I couldn’t emphasize that the medical student is actually A GYNAECOLOGY RESIDENT!!!!!!! In other words, while the man is young and talented, the woman he raped—and the women who will be vulnerable and naked alone with him in his practice—apparently are not. :)\n\n\nA similar thing occurred a few years ago in the same belgian courthouse when white elite student club called Reuzegom left their only black member, Sanda Dia, for dead after subjecting him to hours of torture as part of an initiation ritual. He eventually died, and the perpetrators tried to cover their tracks. The verdict was the same: they were found guilty but did not receive any sentencing besides a very low fine of €400 and some community service (in Belgium, you only get a criminal record if there's an actual sentence and the fine needs to exceed X amount which wasn't the case here so they still have clean records) because they were considered “young and promising.” In reality, they were white, wealthy, and one of their fathers was a judge in the same court. A YouTuber who doxxed them was fined €20K—roughly equivalent to 22K dollars—because it is illegal to publish the names of individuals who do not have a criminal record.",
                "Gynecologist that raped an unconscious woman. \n\nWho the hell would ever risk hiring this scum??\n\nWhat woman would ever want to be examined by him?!?",
                "That's disgusting. The judge and rapist should both be in prison.",
                "His medical license should be revoked.",
                "If you lack the critical thinking skills to not rape someone, I couldn't care less how talented you are. Straight to jail, do not pass go.",
                "Young and Talented? At what? Rape?",
                "It's not a bug when it happens one, two, three times. It's the system.",
                "Sounds like the judge should be dismissed. Make an example. There needs to be better oversight of judges, considering it is known that even the smallest power makes some abuse it. Abuse need not be believed to be abuse by the abuser."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "[CNN] Hooters files for bankruptcy",
            "external_url": "https://www.cnn.com/2025/03/31/business/hooters-restaurant-bankruptcy?cid=ios_app",
            "upvotes": 5292,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202903609.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can’t keep posting these types of things on April fools.",
                "Going out for wings at this point costs almost as much as steak.   I didn't mind hooters wings so much, but they were only worth about half what they cost lately. Typical private equity firms trying to squeeze customers until the business breaks.",
                "I hope that doesn't screw up Sid's 5 year plan.",
                "In case you were wondering, they are owned by Private Equity.",
                "Some would say they've went tits up...",
                "The fact they’re still around is surprising.",
                "NOT an April Fool's item. Obviously. How this brand survived as long as it has is a mystery of history.",
                "Never been to one but from the anecdotes I've read here on reddit you could easily go to any random strip club and be served better food and booze while seeing more skin and skimpy outfits for the same price.",
                "Thanks for the mammaries!",
                "Read the article, it’s not about “woke”, it’s not even going away.  The current private-equity backed ownership that bought it from the owners some time ago, is now about to sell it back to the original owners, or rather an ownership group they control.  This bankruptcy is somehow related to preparations for that sale.  It sounds like if you are a Hooters patron this is a good thing for you."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Measles cases in Texas and New Mexico rise to 470, state health departments say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-new-mexico-rise-470-state-health-departments-say-2025-04-01/",
            "upvotes": 2535,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've lost hope for control of this outbreak ever since the parents who had their child die said measles \"was not that bad\".  I truly wish those two a miserable life.",
                "Remember when we used to have a CDC that functioned?",
                "Republicans dismissal of basic science has turned the US into a 3rd world country.",
                "And, as usual, it'll be children who suffer.\n\n  \nYou would think that they'd want their ~~child slave force~~ future workforce to be healthy enough to slave away.",
                "This update adds 22 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 78 cases. Last Tuesday’s update added 18 cases. The previous Friday's update added 30 cases.\n\nOne new hospitalization (up to 42 from 41) was reported, while no new deaths were reported for Texas.",
                "If only there were a simple and easy way to prevent this. A shot maybe, that you could be given at a very young age which will protect you for the remainder of your life.",
                "Robert Kennedy Jr., dumb, dumb, dumb, dumb, dumb.",
                "New Mexico added 4 new cases today to their total reported case count (up to 48 from 44) for this outbreak.\n\nOklahoma hasn’t posted today’s update yet. Currently, they have reported 9 total cases.\n\nKansas updates on Wednesdays. They’re currently at 23 cases that are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "Feel bad for the kids, not for the parents. I hope this decision derails your lives. Besides immuno-compromised decisions, you had a choice and now you get to see the repercussions of choosing to not believing in science.",
                "Everything is bigger in Texas, except brains"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "At least 2,700 people killed in Myanmar earthquake as aid agencies concerned about access to food, water and medicine",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-death-toll-rises-water-food-shortages/105124958?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=link",
            "upvotes": 35,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5be9e6d9e471787db328433bf2ab0512?impolicy=wcms_watermark_news&cropH=1396&cropW=2482&xPos=39&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "In before American conservatives try to explain why it’s a good thing to cut off USAID."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Hungarians keep up protests against Orban's move to ban Pride",
            "external_url": "https://www.reuters.com/world/europe/hungarians-keep-up-protests-against-orbans-move-ban-pride-2025-04-01/",
            "upvotes": 113,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hate, hate and more hate.",
                ">Pride goeth before destruction, and an haughty spirit before a fall.\n\n\nAccording to King James."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Sackets Harbor community calls for return of three children taken during ICE dairy farm visit",
            "external_url": "https://www.northcountrypublicradio.org/news/story/51511/20250331/sackets-harbor-community-calls-for-return-of-three-children-taken-during-ice-dairy-farm-visit",
            "upvotes": 168,
            "date": "04/01/2025",
            "thumbnail": "https://www.northcountrypublicradio.org/news/images/250331SacketHarborCSDBuildingWebsitePhoto.jpg",
            "top_comments": [
                "*\"He explained to me how detrimental and how terrifying it was to see those kids \\[taken\\] by masked, armed Homeland Security agents and ICE agents, handcuffed and put in the van, and escorted off his far...,\"  DeCillis says the farmer described his workers - and the children - as his family.* \n\nAll three children/teens are productive local students.",
                "With ice acting this way we are doomed to see waco 2.0",
                "They are one small step from killing people. This has to be stopped.",
                "This is a heavily Republican area of Northern NY state. They likely voted for this.",
                "wow, I feel so much safer with those children gone, thanks Republicans.  Frist you save me from pronouns and DEI, and now three children.",
                "Are we sure they're even in the country anymore? This administration is cruel and twisted",
                "I wish there was a visual to go with this story. A video of this family working on the farm and the kids in school and then masked men hauling them away. This needs to be seen to reach this country. All farmers who value their workers should video document what their workers do on the farms because who is going to do their work once they are gone?  The laid off Federal workers….I doubt that."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 2576,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Mississippi governor signs typo tax overhaul bill into law to phase out income tax",
            "external_url": "https://apnews.com/us-news/taxes-tate-reeves-mississippi-general-news-573ad75c52cb94af8f8adc90d1cd5e96",
            "upvotes": 1699,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good god, MS. You really are a sitcom at this point:\n\n\"The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\"",
                "If those Mississippi legislators could read they'd be very upset",
                "I couldn't find what the typo was in this article. So I had to look [around](https://mississippitoday.org/2025/03/24/how-did-the-mississippi-typo-tax-swap-act-of-2025-happen-legislative-recap/). For anyone else wondering:\n\nThe latter parts of the tax reduction only occur:\n\n>when revenue surplus equals 85% or more of the cost of a 1% cut in the tax rate.\n\nBut the bill was passed and signed as `.85%`. So the cuts are almost guranteed to continue.",
                "These paragraphs explain how the typo affected things:\n\n>House leaders have long pushed to eliminate the state personal income tax in relatively short order. The Senate had urged a longer-term approach, arguing it would be unwise to slash a third of the state’s revenue in uncertain economic times. Senators last week had conceded to eliminate the income tax, but only with economic growth “triggers” as safeguards — the tax wouldn’t phase out unless the state saw robust economic growth and controlled spending. It would have likely taken many years.\n\n>Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.",
                "So they say Mississippi is open for business and a bunch of people will move there. Do people really want to live there with no schools, libraries, hospitals, or maybe even fire stations and police? They already can't pay for these things, what is going to happen with no income tax?",
                "Nothing screams \"governing with competence\" like accidentally fast-tracking a massive tax overhaul \\*because of typos\\*. This wasn’t just a clerical hiccup. This is generational economic policy passed by people who \\*didn’t read the fine print\\*. Or maybe they did and hoped no one else would. Either way, Mississippi just gave its wealthiest residents a high-five and told the working poor to budget harder. \n\n\n\nThey’ll tell you it’s bold reform. But behind the curtain? It’s austerity cosplaying as prosperity.",
                "Stop giving this deadbeat red state more federal money than it kicks in.",
                "As a lifetime Mississippi resident, let me assure you - we don’t hide our idiots away, we put them in political positions such as Governor.",
                "Wait until y'all find out [why we no longer have ballot initiatives ](https://apnews.com/article/ms-state-wire-mississippi-marijuana-health-4f81d577aeb2ed8a04849f62c86c707e)",
                "Mississippi is like that brother who's always fucking up and didn't graduate high school. But you still love them because they're your brother. The whole south can't pull it's own weight."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Bankruptcy judge denies J&J settlement plan related to baby powder containing talc",
            "external_url": "https://abcnews.go.com/Business/wireStory/bankruptcy-judge-denies-jj-settlement-plan-related-baby-120367510",
            "upvotes": 342,
            "date": "04/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8478001b-9461-45c2-8e75-0a3fc79c08ef/wirestory_92635cde7709ede6712a6a56b1342ee2_16x9.jpg?w=1600",
            "top_comments": [
                "They keep trying to throw the baby powder out with the bath water.  This is their third try at it.",
                "They call it talk powder when its asbestos!",
                "In order to fund their court costs, J&J launches new Asbest-O's breakfast cereal.",
                "This has been one of those interesting cases where science points one way and the courts (and public opinion) have run the other. There's a number of reasons that courts can diverge from scientific consensus, but what I find really curious is how the bias against the weight of evidence is also over represented in Internet searches and AI responses.\n\nYou'd think that given a company with resources like J&J they would be more effective of getting their narrative out but you have to get pretty deep into a search engine to find critical analysis of the talc claims. And it would be one thing if the critical analysis were coming from small organizations or orgaorg without much prestigious, but that's not the case. \n\nthe American Cancer Society (ACS) states that research on talc and ovarian cancer “have been mixed, with some studies reporting a slightly increased risk and some reporting no increase … For any individual woman, if there is an increased risk, the overall increase is likely to be very small.”\n\nThe NCI concludes that “the weight of evidence does not support an association between perineal talc exposure and an increased risk of ovarian cancer.”\n\nSo you've got two major cancer based orgs stating that the evidence is either weak or absent, and yet their messages are not ones you'd come across readily with a quick search asking about the evidence. \n\nIt's probably because this topic is on the more nuanced end of the spectrum where you have to really look at how to weigh different studies in determining whether there's a cause and effect connection, and it's one most of us just don't have the skill sets to interpret correctly"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Bon Air juvenile center fires point to broader problems",
            "external_url": "https://www.vpm.org/news/2025-04-01/bon-air-juvenile-center-fire-problems-djj-commission-on-youth-floriano",
            "upvotes": 41,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Rehabilitation\" has always been a code word for \"pointless torture\" in US prisons."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Medical Student Convicted Of Raping Another Student Escapes Sentence As “He Is Young And Talented”",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/01/medical-student-convicted-of-raping-another-student-escapes-sent/",
            "upvotes": 2874,
            "date": "04/01/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2025/04/01/93759d66-b14b-42bc-aa5d-8469165278ca.png",
            "top_comments": [
                ">In his summing up the judge said “It has been proven that sexual intercourse took place at a time that she was in a state that meant that she couldn’t possibly consent to it. The offence is serious and unacceptable.”\n\n>Nevertheless, the judge refrained from passing sentence. “It is undeniable that he passed the line of what is permissible. The man showed a lack of respect for the victim's physical, psychological and sexual boundaries. However, he is still young and has no criminal record. He is also a talented and committed person both in his professional and private live. By finding him guilty but not punishing him, he will be made to feel guilty and the chance of him reoffending will be prevented, without socially impairing the man”.\n\n\"Its **unacceptable**! But I won't punish him.\"",
                "Young and talented at what, raping?",
                "Unfortunately, the title must exactly match the article, so I couldn’t emphasize that the medical student is actually A GYNAECOLOGY RESIDENT!!!!!!! In other words, while the man is young and talented, the woman he raped—and the women who will be vulnerable and naked alone with him in his practice—apparently are not. :)\n\n\nA similar thing occurred a few years ago in the same belgian courthouse when white elite student club called Reuzegom left their only black member, Sanda Dia, for dead after subjecting him to hours of torture as part of an initiation ritual. He eventually died, and the perpetrators tried to cover their tracks. The verdict was the same: they were found guilty but did not receive any sentencing besides a very low fine of €400 and some community service (in Belgium, you only get a criminal record if there's an actual sentence and the fine needs to exceed X amount which wasn't the case here so they still have clean records) because they were considered “young and promising.” In reality, they were white, wealthy, and one of their fathers was a judge in the same court. A YouTuber who doxxed them was fined €20K—roughly equivalent to 22K dollars—because it is illegal to publish the names of individuals who do not have a criminal record.",
                "Gynecologist that raped an unconscious woman. \n\nWho the hell would ever risk hiring this scum??\n\nWhat woman would ever want to be examined by him?!?",
                "That's disgusting. The judge and rapist should both be in prison.",
                "His medical license should be revoked.",
                "If you lack the critical thinking skills to not rape someone, I couldn't care less how talented you are. Straight to jail, do not pass go.",
                "Young and Talented? At what? Rape?",
                "It's not a bug when it happens one, two, three times. It's the system.",
                "Sounds like the judge should be dismissed. Make an example. There needs to be better oversight of judges, considering it is known that even the smallest power makes some abuse it. Abuse need not be believed to be abuse by the abuser."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "5 People Have Already Died on Rikers This Year as Crisis Worsens",
            "external_url": "https://www.nytimes.com/2025/04/01/nyregion/rikers-death.html?unlocked_article_code=1.8U4.78fb.od6EE1qaJ1Y6&smid=url-share",
            "upvotes": 1610,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The degree of civilization in a society can be judged by entering its prisons.\n\nFyodor Dostoevsky",
                "According to Wikipedia, 85 percent of inmates at Riker's are pretrial defendants. This is a big part of why bail reform is so important.",
                "It’s almost as if you over incarcerate, treat people like animals, and hire unqualified and unstable corrections officers there might be terrible consequences.",
                "That's just the death's they couldnt hide.",
                "Where Trump should be",
                "> A mental health worker noted that Mr. Quidone was vomiting and sweating heavily, but did not notify medical staff members\n\nWHY? Why are they allowed to be so negligent?",
                "But I’m sure they’ll monitor Harvey Weinstein 24/7 so he makes it to trial",
                "Meanwhile the motherfucking prison guards were on strike because they want the right to kill more prisoners",
                "The American criminal “justice” system is a crime against humanity",
                "Build more prisons. You can do all the crime reduction stuff as well, but some people just refuse to be civil and do belong in jail. Rikers is over crowded, so build another prison. \n\nAgain, you can absolutely do all the crime reduction community based stuff too, but you can’t restart society at year zero."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Fourth missing U.S. soldier found dead in Lithuania",
            "external_url": "https://www.nbcnews.com/news/world/fourth-missing-us-soldier-found-dead-lithuania-rcna199112",
            "upvotes": 759,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-lithuania-missing-soldiers-mn-1230-832e20.jpg",
            "top_comments": [
                "I'm curious to hear from a military person how severe of a fuck up this is. Was it an unforeseeable accident? Or is there somebody that should have said No to the training exercise?",
                "Since he was not with the other 3 does that mean he managed to escape the vehicle but could not escape the bog? That's truly tragic.",
                "Why does it say there’s 3 comments but I can’t see a single one?",
                "Looking forward to the endless Benghazi style hearings on this.",
                "Remember, all US military personnel, your commander in chief either didn’t listen to the briefing about these soldiers, didn’t care enough to give them attention, or forgot about them immediately.",
                "Something something Benghazi",
                "Imagine if Biden was in office right now. He's not so this isn't a concern for MAGA.  Remember \"I don't like prisoners of war\".  Here it is.",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 2589,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 5589,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lawyers doing what they can with lawsuits in system thats already being undermined. But its up to general public to call representatives and join protests to show how unpopular these cuts are",
                "STATE OF COLORADO; STATE OF RHODE ISLAND; STATE OF CALIFORNIA; STATE OF\nMINNESOTA; STATE OF WASHINGTON; STATE\nOF ARIZONA; STATE OF CONNECTICUT;\nSTATE OF DELAWARE; DISTRICT OF\nCOLUMBIA; STATE OF HAWAI‘I; STATE OF\nILLINOIS; OFFICE OF THE GOVERNOR ex rel.\nAndy Beshear, in his official capacity as Governor of the COMMONWEALTH OF KENTUCKY;STATE OF MAINE; STATE OF MARYLAND; COMMONWEALTH OF MASSACHUSETTS; STATE OF MICHIGAN; STATE OF NEVADA;STATE OF NEW JERSEY; STATE OF NEW MEXICO; STATE OF NEW YORK; STATE OF NORTH CAROLINA; STATE OF OREGON; JOSH SHAPIRO, in his official capacity as Governor of the COMMONWEALTH OF PENNSYLVANIA;\nand STATE OF WISCONSIN\n\nThere’s the list after clicking 3 links so you don’t have to",
                "For the sake of the American people, let's hope they win.\n\nContact your Congressional reps.  Tell them you are unhappy that your, your friend's and your family's health are being put in jeopardy",
                "SUE HIM? How about impeach him?\n\nEdit and this time remove his ass.",
                "Are any of those states republican states?",
                "April 5th. Fid a local protest in your area.",
                "I'll bet Indiana isn't one of them. Our AG is busy mocking gay people for April fool's day.",
                "I do not have any faith that our judiciary will check or balance anything the Trump admin does. There will be some judges that stand up, but they’ll just be removed, silenced, ignored, or overruled by the wildly corrupt Supreme Court.",
                "This is the plan. Tie up the Justice system with all of this stupid trump crap.",
                "I hope if it does get restored only the 23 blue states and DC get their funding. Screw the red states."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Bankruptcy judge denies J&J settlement plan related to baby powder containing talc",
            "external_url": "https://abcnews.go.com/Business/wireStory/bankruptcy-judge-denies-jj-settlement-plan-related-baby-120367510",
            "upvotes": 336,
            "date": "04/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8478001b-9461-45c2-8e75-0a3fc79c08ef/wirestory_92635cde7709ede6712a6a56b1342ee2_16x9.jpg?w=1600",
            "top_comments": [
                "They keep trying to throw the baby powder out with the bath water.  This is their third try at it.",
                "They call it talk powder when its asbestos!",
                "In order to fund their court costs, J&J launches new Asbest-O's breakfast cereal.",
                "This has been one of those interesting cases where science points one way and the courts (and public opinion) have run the other. There's a number of reasons that courts can diverge from scientific consensus, but what I find really curious is how the bias against the weight of evidence is also over represented in Internet searches and AI responses.\n\nYou'd think that given a company with resources like J&J they would be more effective of getting their narrative out but you have to get pretty deep into a search engine to find critical analysis of the talc claims. And it would be one thing if the critical analysis were coming from small organizations or orgaorg without much prestigious, but that's not the case. \n\nthe American Cancer Society (ACS) states that research on talc and ovarian cancer “have been mixed, with some studies reporting a slightly increased risk and some reporting no increase … For any individual woman, if there is an increased risk, the overall increase is likely to be very small.”\n\nThe NCI concludes that “the weight of evidence does not support an association between perineal talc exposure and an increased risk of ovarian cancer.”\n\nSo you've got two major cancer based orgs stating that the evidence is either weak or absent, and yet their messages are not ones you'd come across readily with a quick search asking about the evidence. \n\nIt's probably because this topic is on the more nuanced end of the spectrum where you have to really look at how to weigh different studies in determining whether there's a cause and effect connection, and it's one most of us just don't have the skill sets to interpret correctly"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 16316,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                "How long until states get border checks where you cant leave without state visa or minors cant leave without parental permission and minors becomes boosted to under 25s. But i feel like they'd go for trying to get a national ban on abortion instead. They wont stop trying find a win",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "\"Alabama [bans abortion](https://www.cnn.com/2019/05/15/politics/alabama-governor-signs-bill/index.html) at any stage of pregnancy with no exceptions for rape and incest.\"\n\nDumb Fucks.",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "Alabama in a couple years: \"We gave you a speeding ticket for exceeding the posted speed limit in Iowa.\"",
                "Can we prosecute the people stalking and reporting women who they suspect have had an abortion?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Medical Student Convicted Of Raping Another Student Escapes Sentence As “He Is Young And Talented”",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/01/medical-student-convicted-of-raping-another-student-escapes-sent/",
            "upvotes": 2882,
            "date": "04/01/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2025/04/01/93759d66-b14b-42bc-aa5d-8469165278ca.png",
            "top_comments": [
                ">In his summing up the judge said “It has been proven that sexual intercourse took place at a time that she was in a state that meant that she couldn’t possibly consent to it. The offence is serious and unacceptable.”\n\n>Nevertheless, the judge refrained from passing sentence. “It is undeniable that he passed the line of what is permissible. The man showed a lack of respect for the victim's physical, psychological and sexual boundaries. However, he is still young and has no criminal record. He is also a talented and committed person both in his professional and private live. By finding him guilty but not punishing him, he will be made to feel guilty and the chance of him reoffending will be prevented, without socially impairing the man”.\n\n\"Its **unacceptable**! But I won't punish him.\"",
                "Young and talented at what, raping?",
                "Unfortunately, the title must exactly match the article, so I couldn’t emphasize that the medical student is actually A GYNAECOLOGY RESIDENT!!!!!!! In other words, while the man is young and talented, the woman he raped—and the women who will be vulnerable and naked alone with him in his practice—apparently are not. :)\n\n\nA similar thing occurred a few years ago in the same belgian courthouse when white elite student club called Reuzegom left their only black member, Sanda Dia, for dead after subjecting him to hours of torture as part of an initiation ritual. He eventually died, and the perpetrators tried to cover their tracks. The verdict was the same: they were found guilty but did not receive any sentencing besides a very low fine of €400 and some community service (in Belgium, you only get a criminal record if there's an actual sentence and the fine needs to exceed X amount which wasn't the case here so they still have clean records) because they were considered “young and promising.” In reality, they were white, wealthy, and one of their fathers was a judge in the same court. A YouTuber who doxxed them was fined €20K—roughly equivalent to 22K dollars—because it is illegal to publish the names of individuals who do not have a criminal record.",
                "Gynecologist that raped an unconscious woman. \n\nWho the hell would ever risk hiring this scum??\n\nWhat woman would ever want to be examined by him?!?",
                "That's disgusting. The judge and rapist should both be in prison.",
                "His medical license should be revoked.",
                "If you lack the critical thinking skills to not rape someone, I couldn't care less how talented you are. Straight to jail, do not pass go.",
                "Young and Talented? At what? Rape?",
                "It's not a bug when it happens one, two, three times. It's the system.",
                "Sounds like the judge should be dismissed. Make an example. There needs to be better oversight of judges, considering it is known that even the smallest power makes some abuse it. Abuse need not be believed to be abuse by the abuser."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles cases in Texas and New Mexico rise to 470, state health departments say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-new-mexico-rise-470-state-health-departments-say-2025-04-01/",
            "upvotes": 2535,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've lost hope for control of this outbreak ever since the parents who had their child die said measles \"was not that bad\".  I truly wish those two a miserable life.",
                "Remember when we used to have a CDC that functioned?",
                "Republicans dismissal of basic science has turned the US into a 3rd world country.",
                "And, as usual, it'll be children who suffer.\n\n  \nYou would think that they'd want their ~~child slave force~~ future workforce to be healthy enough to slave away.",
                "This update adds 22 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 78 cases. Last Tuesday’s update added 18 cases. The previous Friday's update added 30 cases.\n\nOne new hospitalization (up to 42 from 41) was reported, while no new deaths were reported for Texas.",
                "If only there were a simple and easy way to prevent this. A shot maybe, that you could be given at a very young age which will protect you for the remainder of your life.",
                "Robert Kennedy Jr., dumb, dumb, dumb, dumb, dumb.",
                "New Mexico added 4 new cases today to their total reported case count (up to 48 from 44) for this outbreak.\n\nOklahoma hasn’t posted today’s update yet. Currently, they have reported 9 total cases.\n\nKansas updates on Wednesdays. They’re currently at 23 cases that are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "Feel bad for the kids, not for the parents. I hope this decision derails your lives. Besides immuno-compromised decisions, you had a choice and now you get to see the repercussions of choosing to not believing in science.",
                "Everything is bigger in Texas, except brains"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Mississippi governor signs typo tax overhaul bill into law to phase out income tax",
            "external_url": "https://apnews.com/us-news/taxes-tate-reeves-mississippi-general-news-573ad75c52cb94af8f8adc90d1cd5e96",
            "upvotes": 1704,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good god, MS. You really are a sitcom at this point:\n\n\"The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\"",
                "If those Mississippi legislators could read they'd be very upset",
                "I couldn't find what the typo was in this article. So I had to look [around](https://mississippitoday.org/2025/03/24/how-did-the-mississippi-typo-tax-swap-act-of-2025-happen-legislative-recap/). For anyone else wondering:\n\nThe latter parts of the tax reduction only occur:\n\n>when revenue surplus equals 85% or more of the cost of a 1% cut in the tax rate.\n\nBut the bill was passed and signed as `.85%`. So the cuts are almost guranteed to continue.",
                "These paragraphs explain how the typo affected things:\n\n>House leaders have long pushed to eliminate the state personal income tax in relatively short order. The Senate had urged a longer-term approach, arguing it would be unwise to slash a third of the state’s revenue in uncertain economic times. Senators last week had conceded to eliminate the income tax, but only with economic growth “triggers” as safeguards — the tax wouldn’t phase out unless the state saw robust economic growth and controlled spending. It would have likely taken many years.\n\n>Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.",
                "So they say Mississippi is open for business and a bunch of people will move there. Do people really want to live there with no schools, libraries, hospitals, or maybe even fire stations and police? They already can't pay for these things, what is going to happen with no income tax?",
                "Nothing screams \"governing with competence\" like accidentally fast-tracking a massive tax overhaul \\*because of typos\\*. This wasn’t just a clerical hiccup. This is generational economic policy passed by people who \\*didn’t read the fine print\\*. Or maybe they did and hoped no one else would. Either way, Mississippi just gave its wealthiest residents a high-five and told the working poor to budget harder. \n\n\n\nThey’ll tell you it’s bold reform. But behind the curtain? It’s austerity cosplaying as prosperity.",
                "Stop giving this deadbeat red state more federal money than it kicks in.",
                "As a lifetime Mississippi resident, let me assure you - we don’t hide our idiots away, we put them in political positions such as Governor.",
                "Wait until y'all find out [why we no longer have ballot initiatives ](https://apnews.com/article/ms-state-wire-mississippi-marijuana-health-4f81d577aeb2ed8a04849f62c86c707e)",
                "Mississippi is like that brother who's always fucking up and didn't graduate high school. But you still love them because they're your brother. The whole south can't pull it's own weight."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "RISING",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 10150,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "As a non-white living in the US, I am terrified for my family. We’re all US citizens but these people aren’t even checking anymore",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "5 People Have Already Died on Rikers This Year as Crisis Worsens",
            "external_url": "https://www.nytimes.com/2025/04/01/nyregion/rikers-death.html?unlocked_article_code=1.8U4.78fb.od6EE1qaJ1Y6&smid=url-share",
            "upvotes": 1613,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The degree of civilization in a society can be judged by entering its prisons.\n\nFyodor Dostoevsky",
                "According to Wikipedia, 85 percent of inmates at Riker's are pretrial defendants. This is a big part of why bail reform is so important.",
                "It’s almost as if you over incarcerate, treat people like animals, and hire unqualified and unstable corrections officers there might be terrible consequences.",
                "That's just the death's they couldnt hide.",
                "Where Trump should be",
                "> A mental health worker noted that Mr. Quidone was vomiting and sweating heavily, but did not notify medical staff members\n\nWHY? Why are they allowed to be so negligent?",
                "But I’m sure they’ll monitor Harvey Weinstein 24/7 so he makes it to trial",
                "Meanwhile the motherfucking prison guards were on strike because they want the right to kill more prisoners",
                "The American criminal “justice” system is a crime against humanity",
                "Build more prisons. You can do all the crime reduction stuff as well, but some people just refuse to be civil and do belong in jail. Rikers is over crowded, so build another prison. \n\nAgain, you can absolutely do all the crime reduction community based stuff too, but you can’t restart society at year zero."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Fourth missing U.S. soldier found dead in Lithuania",
            "external_url": "https://www.nbcnews.com/news/world/fourth-missing-us-soldier-found-dead-lithuania-rcna199112",
            "upvotes": 763,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-lithuania-missing-soldiers-mn-1230-832e20.jpg",
            "top_comments": [
                "I'm curious to hear from a military person how severe of a fuck up this is. Was it an unforeseeable accident? Or is there somebody that should have said No to the training exercise?",
                "Since he was not with the other 3 does that mean he managed to escape the vehicle but could not escape the bog? That's truly tragic.",
                "Why does it say there’s 3 comments but I can’t see a single one?",
                "Looking forward to the endless Benghazi style hearings on this.",
                "Remember, all US military personnel, your commander in chief either didn’t listen to the briefing about these soldiers, didn’t care enough to give them attention, or forgot about them immediately.",
                "Something something Benghazi",
                "Imagine if Biden was in office right now. He's not so this isn't a concern for MAGA.  Remember \"I don't like prisoners of war\".  Here it is.",
                "[deleted]"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/02/2025 00:41:33 UTC"
}