{
    "posts": [
        {
            "category": "HOT",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 6198,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Foreplay lasted 85 years! 🤣",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "In this economy??!?!",
                "Wait till they find out how expensive is it to raise kids.",
                "Feels like about the age I’ll be ready to have kids",
                "Isn't this actually amazing news for the species?",
                "Are these kids even responsible enough to raise babies of their own?"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 1065,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "Is everyone prepared to take in, feed and care for their aging parents?  Because you fucking better be.",
                "The GOP has wanted to privatize Social Security since Reagan.",
                "The republicans see an opportunity to give a piece of the trillions of dollars that move through the agency to the billionaire class. \n\nThe new Commissioner is a billionaire Payments company CEO who can lay the framework for privatization and control of the distribution. \n\nAll of the Senior leadership has been converted to Political Appointees who will gladly approve of any changes designed to shift funds from retirees and the disabled to the billionaires. Even a-little skimmed off the top would be billions of dollars a years. \n\nCongress has raided the fund for decades putting IOUs in the funds with a promise to fix it later. \n\nThe staff received a letter this week threatening layoffs unless more employees voluntarily move to front line positions.  Positions that they are not trained for and that will subsequently cause additional organizational stress. \n\nEveryone, employee and beneficiary will suffer financially and emotionally. The beneficiaries most of all as cuts to the program staff result in higher barriers to access the program. \n\nWe only have a couple of weeks left to stop the damage that’s already occurring and begin to reverse course. \n\nCall, write, protest. Or stand by and watch musk and the others steal what is rightfully yours through a series of dull procedural changes with not a shot fired.",
                "I'm pretty apathetic at this point, I knew SS would likely be gone before I ever got my share of it but it's still concerning to watch it happen in real time.\n\nWould like to at least get the money I put into it back but there's no chance of that happening.",
                "Well Musk, Trump and the Republicans see those payments as useless. Useless because they don’t care for anyone else besides themselves. They don’t care for us."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 8172,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks.",
                "Weird time to try something.\n\n> ... the East Block houses the offices of senators and their staff, but there is little activity on the Hill because Parliament is dissolved for the ongoing federal election.",
                "jd vance peeking in the windows",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                ">The barricaded man call at East Block has ended without incident,” Ottawa police said on X. “One man is in custody. The @ottawapolice criminal investigation is ongoing and an update will be provided in the morning. We thank the public for its cooperation.”  \n\n\nokay then.   back to the buying Canadian. ",
                "Pierre Poilievres new campaign strat.",
                "Send in Kevin Vickers!",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "What have the Russians done now?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "5 nurses who work on the same floor at Massachusetts hospital have brain tumors",
            "external_url": "https://www.nbcnews.com/news/rcna199798",
            "upvotes": 25501,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-newton-mass-general-brigham-newton-wellesley-hospital-google-ac-754p-6d4eef.jpg",
            "top_comments": [
                "11 employees all on the maternity ward experienced illness - I wonder what the symptoms of the other six were",
                "Reminds me of the [Kramatorsk incident where residents were exposed to gamma radiation](https://en.m.wikipedia.org/wiki/Kramatorsk_radiological_accident) due to a capsule containing highly radioactive caesium-17 being in their walls. Residents kept succumbing to leukaemia.",
                "This happened to me. Four men on our block got brain tumours within a couple year span. All of us lived on the south side of the street. We all had different types of tumours. I was the only one that survived. One of them was Canadian rock legend Gord Downey of the Tragically Hip.",
                "I wonder if they all sat in the same area at work?  \n\n\nPerhaps near a shared wall with an imaging department that was not constructed properly?",
                "When i worked in pediatric hematology/oncology as a study coordinator, one of my tasks was maintaining the cancer registry. Basically, any time someone is diagnosed with cancer, it would be put in to the state, and there were things like zip code, date, and other stuff tracked. It was purely because if stuff like this. If ever there were 3 or more cancer patients with similar/the same type of cancer in a certain zip code/area, the state and CDC would send investigators. And, now that RFK Jr and Elon are in charge, that shit will end. And it will be really really bad.",
                "In case anyone didn’t read the article, it’s three different types of benign tumor, which would not meet the definition of a cancer cluster",
                "I ran this by a doctor friend and her take was that a lot of seeming cancer clusters end up being nothing, and it's possible that screening went way up once people started worrying so they found benign tumors that would never have been found otherwise. She thought it would be more likely that there would be a variety of different cancers if you were really dealing with some kind of radiation exposure. \n\n\nI don't know, but it was a possibility I hadn't considered before. ",
                "Well the first obvious step imo is to walk around their work / storage / parking with a Geiger counter at different times of the day / night to see if there's anything flaring were it's not supposed to",
                "Seems like low probability this should happen but there are like hundreds of thousands of hospital departments in the US, so lots of chances for something like this to occur. \n\nImprobable things happen all the time because the frequency of events in which those things might occur are also incredibly high.\n\nEdit: https://en.m.wikipedia.org/wiki/Law_of_truly_large_numbers \n\nI think of Murphy’s law as a corollary to the law of truly large numbers",
                "I’m sure RFK Jr. will get to the bottom of it…"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 370,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Maybe Trump will pop by and toss some paper towels around.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "There were tornados last week.  Now flooding.  These stories don’t get much coverage and it seems no one will get any support from what’s left of the federal government to assist."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US rescuers notably absent in Myanmar quake cleanup",
            "external_url": "https://www.nbcnewyork.com/news/national-international/myanmar-earthquake-us-aid-absent/6213545/",
            "upvotes": 5961,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2207977162.jpg?quality=85&strip=all&crop=0px%2C627px%2C6000px%2C3375px&resize=1200%2C675",
            "top_comments": [
                "\"Days after the Myanmar quake, the U.S. made its first announcement of help: It was sending a three-member assessment team of non-specialist advisers from a regional USAID office in Bangkok, Thailand. Coincidentally, like hundreds of other USAID staffers around the world, the three had received layoff notices from the Trump administration on March 28 within hours of the quake, current and former USAID officials confirmed.\"",
                ">China shares a border and close ties with Myanmar. Chinese rescuers had their first success Sunday, fewer than 48 hours after the quake, when they joined hands with local people to pull an elderly man from a badly damaged hospital in the capital city of Naypyitaw.\n\n>By Wednesday, Chinese rescuers had pulled out nine survivors, including a pregnant woman and a child. In Mandalay, Chinese rescuers saved a 52-year-old man who trapped for nearly 125 hours.\n\nFor an administration that talks plenty about countering China, shit like this is boneheaded. In these developing countries, when a more pro-China and a more pro-US candidate are going head to head voters are gonna remember it was the Chinese saving them when disasters stuck.",
                "According to reports US has sent 3 advisors and no rescuers ,That is callous reaction by current Oval Office .",
                "We've gone very quickly from being the World's Leader to the World's Assholes.\n\nThis absolutely does the opposite of making America great.",
                "I live in Fairfax Co., and we always send our rescue teams for international disasters and they are NOT happy about having to sit on their hands.",
                "Oh, and here's a 10% tariff for you when you rebuild.",
                "Fuck Trump and Fuck Elon musk - evil, vile people. Abdicating the US’s role as a powerful nation in the world.",
                "I work in emergency infrastructure response for a large municipality. As part of that I am also a member of our large state’s safety assessment program (SAP), which is what would be happening in Myanmar right now. \n\nThis is a very niche occupation that unless you work for a large agency you don’t really get much experience. In my work capacity I am handling emergency projects daily but other members of the SAP may go years without any real experience. \n\nThe point is, that it is on our best interests as a country to help other countries because valuable experience, knowledge and contacts are made that will directly benefit our abilities to respond. \n\nFEMA, SAP and other similar programs need qualified, experienced and knowledgeable members. \n\nThis presidency from a know nothing president and his team will cause damage that will be felt years from now. \n\nI mean we all know he is awful but in every thing he does when you drill down further you realize how much more harmful he is.",
                "This administration is busy firing them all.",
                "None of Trump’s puppeteers are in Myanmar, so they don’t get assistance."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Measles outbreak in Texas hits 481 cases, with 59 new infections confirmed in last 3 days",
            "external_url": "https://abcnews.go.com/Health/measles-outbreak-texas-hits-481-cases-59-new/story?id=120485225",
            "upvotes": 6952,
            "date": "04/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "If only there was a way to prevent this...",
                "*Surely the hit-and-run man who loves heroin will fix this for us!*",
                "This update adds 59 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 22 cases. Last Friday’s update added 78 cases. Last Tuesday’s update added 18 cases.\n\nFourteen new hospitalizations (up to 56 from 42) were reported, while no new deaths were reported for Texas. That's a significantly larger jump in the number of hospitalizations than has been reported in the past few weeks.\n\nIt's possible some facilities had delayed reporting. Some of these hospitalizations may have occurred in previous weeks and were only reported to the state this week.",
                "People with newborns are stressing about the measles since babies can’t get the MMR vaccine until 12 months. Thanks anti-vaxxer assholes",
                "New Mexico added 6 new cases today to their total reported case count (up to 54 from 48) for this outbreak.\n\nOklahoma is still at 10 cases.\n\nKansas added one new case this week to bring their total to 24. Most are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "The most upsetting part of this is that is the innocent children who are ultimately the ones suffering due to their parent's willful negligence.  In their mind a dead child is better than a vaccinated one.",
                "Send RFK Jr. there to investigate and visit those afflicted..",
                "Fuck Andrew Wakefield",
                "Making measles great again",
                "Remember, this outbreak and the deaths associated with it were 100% preventable, save for the actions of a handful conservative politician idiots."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Roofer says ICE arrested three of his relatives in a workplace raid.",
            "external_url": "https://www.nbcnews.com/news/us-news/roofer-says-ice-arrested-three-relatives-workplace-raid-rcna199781",
            "upvotes": 7221,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250207-ICE-ch-1610-0afc92.jpg",
            "top_comments": [
                "I didn't understand why ICE isn't raiding meat processing plants in South Dakota, farms in Iowa or construction companies in Arizona. But they did come to Duluth, Minnesota, and took two guys from a roofing company away. ICE isn't trying very hard to get rid of illegals.",
                "Curious, if they were illegal workers, why weren't their bosses also arrested for breaking the law by hiring them??",
                "Hmm.....all these ICE stories seem to be mostly in blue states.  Education funding cuts?  Blue states, too.  Trump is weaponizing funding and laws and seeking his revenge.  His disciples still lap it up.",
                "> In the 2024 U.S. presidential election, exit polls indicate that approximately 55% of Latino men voted for Donald Trump, marking a significant increase from previous elections.  This surge in support contributed to Trump securing about 46% of the overall Latino vote, surpassing the previous Republican high set by George W. Bush in 2004.  Economic concerns, particularly inflation and job security, were primary factors influencing this shift among Latino voters.  Additionally, cultural values and perspectives on issues such as immigration and healthcare played roles in their voting decisions.  ￼ ￼\n\nJust leaving this here for no reason.",
                "American born Latinos need to wake up. If you think they are not considering removing you next you are in fantasyland",
                "Should start arresting business owners who employ illegal immigrants in defiance of the laws, too.",
                "The real purpose is to rile up people in blue states, identify them, track them and then when the time is right declare that they are threats to America and round them up and ship them off to  a re-education center (slave labor camps) and make them disappear. Sound crazy? It been done before in Germany, Russia, Chile, China, to new just a very few in the past 100 years.",
                "ICE acting like brown shirted thugs from yesteryear",
                "The US unemployment rate is 4%. Who do MAGAs think are going to do the work that immigrants are currently doing?",
                "I’m sure that the older you get the more conservative you become. People literally voted against their own families."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "\"Hands Off\" Protests occur across the US. protesting Trump and Musk",
            "external_url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d",
            "upvotes": 3725,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went to the protest in downtown Princeton, New Jersey and there were probably 1400 to 1600 people gathered. A huge turnout for such a small town. My son went to the protest in Boston, my eldest son to the one in Stamford, Connecticut and my sister was on the mall in Washington DC.",
                "It was my first time going to a protest. If Corey Booker can give a 25 hour speech, I can at least show up with a sign.",
                "Preliminary estimates put attendee numbers at 5 million across the country. For all the people that keep saying Americans aren't doing enough.",
                "In Las Vegas on vacation and they had a terrific protest here. Had to be 1/2 mile parade of protesters on the strip. Some jerk was giving a Nazi salute and chanting \"Kamala\" until I made fun of him and he called me a 'little bitch.' Then he backed into his group of friends and disappeared. Lol.",
                "Estimated at 3.5-5M protestors",
                "I’m so proud to been able to get out and participate! 2000+ for Moorhead, MN \nGet your tiny hands OFF of my daughter’s rights!! Get your tiny hands OFF of my rights!!",
                "So many shocking places with big crowds. Small cities in Iowa, Michigan, Alaska. Honestly, it’s beautiful to see the country come together.",
                "Well I'm glad Black people were not part of any protest. Whenever we show up en mass,  it's a riot. \nWe did our marching in Nov. \nSo the rest of Americans gotta fix this mess.",
                "Wasting their time...trump is still president"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US revokes all visas for South Sudanese over country’s failure to repatriate citizens",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/us-revokes-all-visas-for-south-sudanese-over-countrys-failure-to-repatriate-citizens?CMP=Share_AndroidApp_Other",
            "upvotes": 230,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3083898966606d743ad9cfcde3da546795006bbd/0_110_7472_4483/master/7472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1c3c1e5409ad3a8ce2c9d83d2130457f",
            "top_comments": [
                "What's next? US to revoke all Canadian visas, so the entire NHL crumbles?",
                "Article 33 of the Fourth Geneva Convention states: “No protected person may be punished for an offense he or she has not personally committed. Collective penalties and likewise all measures of intimidation or of terrorism are prohibited.”\n\nI guess these people don’t want to travel outside the US ever again. Turns out lil’ Marco has some of that Castro energy himself!",
                "Little Marco being the bitch we all know he is.",
                "I wonder if Marco realizes that his kids will be embarrassed to be related to him.",
                "Ain’t there are active war in Sudan",
                "There is literally a civil war going on over there what is wrong people holy fuck.",
                "Lmao, casually violating the Geneva convention",
                "[removed]",
                "God I hate this Rubio asshole, dead-eyed fundamentalist that sold out his soul for pennies. Hope he burns when the time comes...",
                "Should have said thank you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US revokes all visas for South Sudanese over country’s failure to repatriate citizens",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/us-revokes-all-visas-for-south-sudanese-over-countrys-failure-to-repatriate-citizens?CMP=Share_AndroidApp_Other",
            "upvotes": 230,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3083898966606d743ad9cfcde3da546795006bbd/0_110_7472_4483/master/7472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1c3c1e5409ad3a8ce2c9d83d2130457f",
            "top_comments": [
                "What's next? US to revoke all Canadian visas, so the entire NHL crumbles?",
                "Article 33 of the Fourth Geneva Convention states: “No protected person may be punished for an offense he or she has not personally committed. Collective penalties and likewise all measures of intimidation or of terrorism are prohibited.”\n\nI guess these people don’t want to travel outside the US ever again. Turns out lil’ Marco has some of that Castro energy himself!",
                "Little Marco being the bitch we all know he is.",
                "I wonder if Marco realizes that his kids will be embarrassed to be related to him.",
                "Ain’t there are active war in Sudan",
                "There is literally a civil war going on over there what is wrong people holy fuck.",
                "Lmao, casually violating the Geneva convention",
                "[removed]",
                "God I hate this Rubio asshole, dead-eyed fundamentalist that sold out his soul for pennies. Hope he burns when the time comes...",
                "Should have said thank you."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 368,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Maybe Trump will pop by and toss some paper towels around.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "There were tornados last week.  Now flooding.  These stories don’t get much coverage and it seems no one will get any support from what’s left of the federal government to assist."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 1067,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "Is everyone prepared to take in, feed and care for their aging parents?  Because you fucking better be.",
                "The GOP has wanted to privatize Social Security since Reagan.",
                "The republicans see an opportunity to give a piece of the trillions of dollars that move through the agency to the billionaire class. \n\nThe new Commissioner is a billionaire Payments company CEO who can lay the framework for privatization and control of the distribution. \n\nAll of the Senior leadership has been converted to Political Appointees who will gladly approve of any changes designed to shift funds from retirees and the disabled to the billionaires. Even a-little skimmed off the top would be billions of dollars a years. \n\nCongress has raided the fund for decades putting IOUs in the funds with a promise to fix it later. \n\nThe staff received a letter this week threatening layoffs unless more employees voluntarily move to front line positions.  Positions that they are not trained for and that will subsequently cause additional organizational stress. \n\nEveryone, employee and beneficiary will suffer financially and emotionally. The beneficiaries most of all as cuts to the program staff result in higher barriers to access the program. \n\nWe only have a couple of weeks left to stop the damage that’s already occurring and begin to reverse course. \n\nCall, write, protest. Or stand by and watch musk and the others steal what is rightfully yours through a series of dull procedural changes with not a shot fired.",
                "I'm pretty apathetic at this point, I knew SS would likely be gone before I ever got my share of it but it's still concerning to watch it happen in real time.\n\nWould like to at least get the money I put into it back but there's no chance of that happening.",
                "Well Musk, Trump and the Republicans see those payments as useless. Useless because they don’t care for anyone else besides themselves. They don’t care for us."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Boy with Einstein-level IQ joins sister as member of Mensa",
            "external_url": "https://www.ctvnews.ca/lifestyle/article/gifted-5-year-old-boy-with-einstein-level-iq-joins-sister-as-member-of-mensa/",
            "upvotes": 0,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2DV3DHX255EPNCHMUDYOH36GBQ.JPG?smart=true&auth=a5bf74065c37f767a3d993e094e7241f17572bcf34a358859bc8f2318d72e593&width=1200&height=630",
            "top_comments": [
                "I was given an IQ test in 4th grade. They immediately moved me into the ‘talented and gifted’ programs and started letting me study all the math I wanted. I’ve grown up to be a scientist in biotech. I hang out with a lot of shockingly-smart people. \n\nEvery single person I’ve ever met who mentioned being in MENSA came off as an egotistical douche where this was supposed to impress me. This kid is too young to necessarily decide these things for himself. Here’s hoping this is the least impressive thing on his resume.",
                "I just hope they’re still teaching critical thinking skills to rest of the non-Einsteins in his school.",
                "Qualifying for Mensa means you are the smartest kid in a 50-person room of kids your age. I never get why that's something newsworthy.",
                "He's not going to enjoy living in this madhouse."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "At least 16 dead as storms touch off tornadoes and widespread flooding in central US",
            "external_url": "https://edition.cnn.com/2025/04/06/weather/south-midwest-storm-peak-flooding-hnk/index.html",
            "upvotes": 118,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25095700312819.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Perfect time for President to go golfing!",
                "The irony is no one in the media is screaming for FEMA or for the president, or anyone….I remember non stop around the clock coverage during Biden presidency when one tornado did any damages…",
                "Hey Americans! Do you think our President will mention anything about our fellow Americans dying this weekend - unprompted!?",
                "Trump didn’t authorize that with his sharpie , so no relief",
                "Guess we should cut FEMA spending.",
                "Red states learning what the phrase “chickens come home to roost” means"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 6192,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Foreplay lasted 85 years! 🤣",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "In this economy??!?!",
                "Wait till they find out how expensive is it to raise kids.",
                "Feels like about the age I’ll be ready to have kids",
                "Isn't this actually amazing news for the species?",
                "Are these kids even responsible enough to raise babies of their own?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "UK's Jaguar Land Rover to pause shipments to US over tariffs",
            "external_url": "https://www.reuters.com/business/autos-transportation/uks-jaguar-land-rover-pause-shipments-us-over-tariffs-times-says-2025-04-05/",
            "upvotes": 995,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. \n\n\nNo Jaguars?!\n\n\nNo Land Rovers??!!\n\n\nThe billionaire-infested cabinet will not allow this to stand. They'll get exempted.",
                "Isn't Jaguar taking a semester off to find themselves?",
                "We're going to end up like Russia and North Korea at this rate; shunned by and cut off from the rest of the world for all time.",
                "Every one that will be tariffed should just stop shipments. The US will learn REAL fuckin fast then",
                "✓ 'Rovers, Defenders, and Jags (oh my)  \n✓ Nintendo Switch 2 pre-orders (stings a bit)  \n✓ Stuff I missed (do tell)  \n✓ More to come",
                "Dozens of people will be impacted by this, dozens!",
                "Damn it! I was just about to become a multi millionaire and buy one of each",
                "“Jaguar Land Rover will pause shipments of its Britain-made cars to the United States for a month, it said on Saturday, as it considers how to mitigate the cost of President Donald Trump's 25% tariff.\n\nJaguar Land Rover, which is owned by India's Tata Motors (TAMO.NS), opens new tab, confirmed the temporary export suspension after the Times newspaper reported the plan.”",
                "Wow not sure how we will recover from this",
                "People buy LR, but I don’t know who is lining up to buy the rebranded Jaguar that the internet memed on."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
            "external_url": "https://news.sky.com/story/two-labour-mps-denied-entry-and-deported-from-israel-13343009",
            "upvotes": 1365,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-labour-mps-yuan-yang_6877521.png?20250406062935",
            "top_comments": [
                "  \nThe link requires a waiver. Can you summarize the Israel's case against MPs Yuan Yang and Abtisam Mohamed or provide a clean link?",
                "This is a massive and direct disrespect to the people these MPs represent and the democratic system that represents all of us. Israel often hides behind its supposed democratic system, but that democracy only exists when you support their broad national agenda (especially the ongoing genocide in Palestine and their ongoing theft of territory).\n\nThey deny journalists access to hide their crimes (https://rsf.org/en/one-year-gaza-how-israel-orchestrated-media-blackout-region-war), murder them when they are witness (including British journalists: https://www.theguardian.com/media/2006/apr/05/pressandpublishing.broadcasting) , murder aid workers (including British aid workers: https://www.bbc.co.uk/news/articles/cj68kkeyyz1o) and have killed between 50,000-70,000 people in Palestine (a third of which are estimated to be children). \n\nYet the UK keeps supporting them. We've been providing them aid, selling them weapons (https://www.oxfam.org.uk/get-involved/campaign-with-oxfam/gaza-israel-crisis-sign-petition-call-for-ceasefire-now/does-the-uk-sell-arms-to-israel/)  and spent billions flying constant reconissance flights to provide the Israeli army with intel (which we then refuse to review when it could prove Israel's crimes against British aid workers: https://www.middleeasteye.net/news/uk-wont-release-spy-plane-footage-related-killing-uk-aid-worker-gaza).\n\nThis isn't a disconnected conflict in a distant country we have nothing to do with- we are currently active partners in this genocide  Our RAF planes, and our tax money is being used to facilitate this slaughter while the government cuts services at home. And when our MPs want to visit, to assess the situation on our behalf as our representatives, Israel doesn't even let them in. It is long past time for the UK to act on our own values and self interests, stop spending money on Israel's bloody genocide and halt all arms sales to this psychotic regime.",
                "At what point do western countries start to sever ties with Israel? I mean this country treats us terribly, but still demands our money and support? Biggest welfare state in the world.\n\nEdit: below you will see an islamaphobic comment from someone who blocked me. The are trying to suggest that if you don't support Israel, you do support Islamic extremism. Israel survives because it's framed this issue as a dichotomy. The truth is, you could just not pay Israel or support any of it. It's a perfectly acceptable position that you could keep your money for yourself.",
                "A badge of honour to have on one's passport",
                "Behold the so-called only democracy in the middle east.\n\n\\>document the activities of security forces and spread anti-Israel hatred\n\nSo they are against killing aid workers?",
                "Israel - \"nothing to see here, go away now.\"",
                "Israel is a garbage country.",
                "This is the bit I don't understand from Lammy's statement. \n\n\"UK diplomatic delegations, including those to international organizations and specific countries, are announced and organized by the Foreign, Commonwealth and Development Office (FCDO), with appointments made by the Prime Minister or Secretary of State for Foreign and Commonwealth Affairs, and are governed by the 1961 Vienna Convention on Diplomatic Relations\" \n\nHere's the Guidance for MPs re diplomatic delegations: \n\nhttps://acrobat.adobe.com/id/urn:aaid:sc:EU:24b771af-144c-4bfd-81e4-072b9895344c\n\nWas the delegation  announced and organised by the FCDO? Did they carry the formal documentation required? If so this is a diplomatic incident. If not then it's not a diplomatic delegation. Just being an MP arriving on an EasyJet flight is not a diplomatic visit.\n\nIt's all very confusing.",
                "Wear it like a badge of honor",
                "Problem for Thornberry and Lammy trying to object now, is that they’ve spent far too long supporting Israel doing this sort of nonsense, so their objections can be dismissed as factional."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 8174,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks.",
                "Weird time to try something.\n\n> ... the East Block houses the offices of senators and their staff, but there is little activity on the Hill because Parliament is dissolved for the ongoing federal election.",
                "jd vance peeking in the windows",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                ">The barricaded man call at East Block has ended without incident,” Ottawa police said on X. “One man is in custody. The @ottawapolice criminal investigation is ongoing and an update will be provided in the morning. We thank the public for its cooperation.”  \n\n\nokay then.   back to the buying Canadian. ",
                "Pierre Poilievres new campaign strat.",
                "Send in Kevin Vickers!",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "What have the Russians done now?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "Labour MP Dan Norris arrested on suspicion of rape and child sex offences",
            "external_url": "https://news.sky.com/story/labour-mp-arrested-on-suspicion-of-rape-and-child-sex-offences-13342856",
            "upvotes": 511,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-dan-norris-labour_6877329.jpg?20250405183946",
            "top_comments": [
                "like its really so easy not to be a pedo, loads of people have done it successfully \n\ncan we just like find a few of those people and put them in positions of power?",
                "*He has also lost the party whip in the House of Commons and has stepped down from his role as chair of the League Against Cruel Sports.*\n\nWe must assume that the \"man in his 60s\" is indeed MP Mr Norris.  I wonder why all the dancing around in  this piece about the actual identity of the accused.",
                "It seems pedophilia is the one thing that Labor, the Tories, and the Royal Family can all agree on.",
                "If found guilty there should be no little deals and exceptional circumstances to be brought forward. If he is a nonce then he should be tried as one and the relevant punishment given, the child / children that have suffered due to his disgusting actions will take many years of therapy if they can be (mended) at all . People of power who are part of the British little boys club that abuse and rape children SHOULD be made an example of and not be protected from punishment…😡😡",
                "He might be receiving a job opportunity from trump soon",
                "He should have been suspected from the haircut alone",
                "It's always the ones who hated Corbyn"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 1072,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "Is everyone prepared to take in, feed and care for their aging parents?  Because you fucking better be.",
                "The GOP has wanted to privatize Social Security since Reagan.",
                "The republicans see an opportunity to give a piece of the trillions of dollars that move through the agency to the billionaire class. \n\nThe new Commissioner is a billionaire Payments company CEO who can lay the framework for privatization and control of the distribution. \n\nAll of the Senior leadership has been converted to Political Appointees who will gladly approve of any changes designed to shift funds from retirees and the disabled to the billionaires. Even a-little skimmed off the top would be billions of dollars a years. \n\nCongress has raided the fund for decades putting IOUs in the funds with a promise to fix it later. \n\nThe staff received a letter this week threatening layoffs unless more employees voluntarily move to front line positions.  Positions that they are not trained for and that will subsequently cause additional organizational stress. \n\nEveryone, employee and beneficiary will suffer financially and emotionally. The beneficiaries most of all as cuts to the program staff result in higher barriers to access the program. \n\nWe only have a couple of weeks left to stop the damage that’s already occurring and begin to reverse course. \n\nCall, write, protest. Or stand by and watch musk and the others steal what is rightfully yours through a series of dull procedural changes with not a shot fired.",
                "I'm pretty apathetic at this point, I knew SS would likely be gone before I ever got my share of it but it's still concerning to watch it happen in real time.\n\nWould like to at least get the money I put into it back but there's no chance of that happening.",
                "Well Musk, Trump and the Republicans see those payments as useless. Useless because they don’t care for anyone else besides themselves. They don’t care for us."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US revokes all visas for South Sudanese over country’s failure to repatriate citizens",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/us-revokes-all-visas-for-south-sudanese-over-countrys-failure-to-repatriate-citizens?CMP=Share_AndroidApp_Other",
            "upvotes": 232,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3083898966606d743ad9cfcde3da546795006bbd/0_110_7472_4483/master/7472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1c3c1e5409ad3a8ce2c9d83d2130457f",
            "top_comments": [
                "What's next? US to revoke all Canadian visas, so the entire NHL crumbles?",
                "Article 33 of the Fourth Geneva Convention states: “No protected person may be punished for an offense he or she has not personally committed. Collective penalties and likewise all measures of intimidation or of terrorism are prohibited.”\n\nI guess these people don’t want to travel outside the US ever again. Turns out lil’ Marco has some of that Castro energy himself!",
                "Little Marco being the bitch we all know he is.",
                "I wonder if Marco realizes that his kids will be embarrassed to be related to him.",
                "Ain’t there are active war in Sudan",
                "There is literally a civil war going on over there what is wrong people holy fuck.",
                "Lmao, casually violating the Geneva convention",
                "[removed]",
                "God I hate this Rubio asshole, dead-eyed fundamentalist that sold out his soul for pennies. Hope he burns when the time comes...",
                "Should have said thank you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 370,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Maybe Trump will pop by and toss some paper towels around.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "There were tornados last week.  Now flooding.  These stories don’t get much coverage and it seems no one will get any support from what’s left of the federal government to assist."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 6200,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Foreplay lasted 85 years! 🤣",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "In this economy??!?!",
                "Wait till they find out how expensive is it to raise kids.",
                "Feels like about the age I’ll be ready to have kids",
                "Isn't this actually amazing news for the species?",
                "Are these kids even responsible enough to raise babies of their own?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 8177,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks.",
                "Weird time to try something.\n\n> ... the East Block houses the offices of senators and their staff, but there is little activity on the Hill because Parliament is dissolved for the ongoing federal election.",
                "jd vance peeking in the windows",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                ">The barricaded man call at East Block has ended without incident,” Ottawa police said on X. “One man is in custody. The @ottawapolice criminal investigation is ongoing and an update will be provided in the morning. We thank the public for its cooperation.”  \n\n\nokay then.   back to the buying Canadian. ",
                "Pierre Poilievres new campaign strat.",
                "Send in Kevin Vickers!",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "What have the Russians done now?"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "5 nurses who work on the same floor at Massachusetts hospital have brain tumors",
            "external_url": "https://www.nbcnews.com/news/rcna199798",
            "upvotes": 25509,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-newton-mass-general-brigham-newton-wellesley-hospital-google-ac-754p-6d4eef.jpg",
            "top_comments": [
                "11 employees all on the maternity ward experienced illness - I wonder what the symptoms of the other six were",
                "Reminds me of the [Kramatorsk incident where residents were exposed to gamma radiation](https://en.m.wikipedia.org/wiki/Kramatorsk_radiological_accident) due to a capsule containing highly radioactive caesium-17 being in their walls. Residents kept succumbing to leukaemia.",
                "This happened to me. Four men on our block got brain tumours within a couple year span. All of us lived on the south side of the street. We all had different types of tumours. I was the only one that survived. One of them was Canadian rock legend Gord Downey of the Tragically Hip.",
                "I wonder if they all sat in the same area at work?  \n\n\nPerhaps near a shared wall with an imaging department that was not constructed properly?",
                "When i worked in pediatric hematology/oncology as a study coordinator, one of my tasks was maintaining the cancer registry. Basically, any time someone is diagnosed with cancer, it would be put in to the state, and there were things like zip code, date, and other stuff tracked. It was purely because if stuff like this. If ever there were 3 or more cancer patients with similar/the same type of cancer in a certain zip code/area, the state and CDC would send investigators. And, now that RFK Jr and Elon are in charge, that shit will end. And it will be really really bad.",
                "In case anyone didn’t read the article, it’s three different types of benign tumor, which would not meet the definition of a cancer cluster",
                "I ran this by a doctor friend and her take was that a lot of seeming cancer clusters end up being nothing, and it's possible that screening went way up once people started worrying so they found benign tumors that would never have been found otherwise. She thought it would be more likely that there would be a variety of different cancers if you were really dealing with some kind of radiation exposure. \n\n\nI don't know, but it was a possibility I hadn't considered before. ",
                "Well the first obvious step imo is to walk around their work / storage / parking with a Geiger counter at different times of the day / night to see if there's anything flaring were it's not supposed to",
                "Seems like low probability this should happen but there are like hundreds of thousands of hospital departments in the US, so lots of chances for something like this to occur. \n\nImprobable things happen all the time because the frequency of events in which those things might occur are also incredibly high.\n\nEdit: https://en.m.wikipedia.org/wiki/Law_of_truly_large_numbers \n\nI think of Murphy’s law as a corollary to the law of truly large numbers",
                "I’m sure RFK Jr. will get to the bottom of it…"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "US rescuers notably absent in Myanmar quake cleanup",
            "external_url": "https://www.nbcnewyork.com/news/national-international/myanmar-earthquake-us-aid-absent/6213545/",
            "upvotes": 5962,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2207977162.jpg?quality=85&strip=all&crop=0px%2C627px%2C6000px%2C3375px&resize=1200%2C675",
            "top_comments": [
                "\"Days after the Myanmar quake, the U.S. made its first announcement of help: It was sending a three-member assessment team of non-specialist advisers from a regional USAID office in Bangkok, Thailand. Coincidentally, like hundreds of other USAID staffers around the world, the three had received layoff notices from the Trump administration on March 28 within hours of the quake, current and former USAID officials confirmed.\"",
                ">China shares a border and close ties with Myanmar. Chinese rescuers had their first success Sunday, fewer than 48 hours after the quake, when they joined hands with local people to pull an elderly man from a badly damaged hospital in the capital city of Naypyitaw.\n\n>By Wednesday, Chinese rescuers had pulled out nine survivors, including a pregnant woman and a child. In Mandalay, Chinese rescuers saved a 52-year-old man who trapped for nearly 125 hours.\n\nFor an administration that talks plenty about countering China, shit like this is boneheaded. In these developing countries, when a more pro-China and a more pro-US candidate are going head to head voters are gonna remember it was the Chinese saving them when disasters stuck.",
                "According to reports US has sent 3 advisors and no rescuers ,That is callous reaction by current Oval Office .",
                "We've gone very quickly from being the World's Leader to the World's Assholes.\n\nThis absolutely does the opposite of making America great.",
                "I live in Fairfax Co., and we always send our rescue teams for international disasters and they are NOT happy about having to sit on their hands.",
                "Oh, and here's a 10% tariff for you when you rebuild.",
                "Fuck Trump and Fuck Elon musk - evil, vile people. Abdicating the US’s role as a powerful nation in the world.",
                "I work in emergency infrastructure response for a large municipality. As part of that I am also a member of our large state’s safety assessment program (SAP), which is what would be happening in Myanmar right now. \n\nThis is a very niche occupation that unless you work for a large agency you don’t really get much experience. In my work capacity I am handling emergency projects daily but other members of the SAP may go years without any real experience. \n\nThe point is, that it is on our best interests as a country to help other countries because valuable experience, knowledge and contacts are made that will directly benefit our abilities to respond. \n\nFEMA, SAP and other similar programs need qualified, experienced and knowledgeable members. \n\nThis presidency from a know nothing president and his team will cause damage that will be felt years from now. \n\nI mean we all know he is awful but in every thing he does when you drill down further you realize how much more harmful he is.",
                "This administration is busy firing them all.",
                "None of Trump’s puppeteers are in Myanmar, so they don’t get assistance."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles outbreak in Texas hits 481 cases, with 59 new infections confirmed in last 3 days",
            "external_url": "https://abcnews.go.com/Health/measles-outbreak-texas-hits-481-cases-59-new/story?id=120485225",
            "upvotes": 6943,
            "date": "04/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "If only there was a way to prevent this...",
                "*Surely the hit-and-run man who loves heroin will fix this for us!*",
                "This update adds 59 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 22 cases. Last Friday’s update added 78 cases. Last Tuesday’s update added 18 cases.\n\nFourteen new hospitalizations (up to 56 from 42) were reported, while no new deaths were reported for Texas. That's a significantly larger jump in the number of hospitalizations than has been reported in the past few weeks.\n\nIt's possible some facilities had delayed reporting. Some of these hospitalizations may have occurred in previous weeks and were only reported to the state this week.",
                "People with newborns are stressing about the measles since babies can’t get the MMR vaccine until 12 months. Thanks anti-vaxxer assholes",
                "New Mexico added 6 new cases today to their total reported case count (up to 54 from 48) for this outbreak.\n\nOklahoma is still at 10 cases.\n\nKansas added one new case this week to bring their total to 24. Most are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "The most upsetting part of this is that is the innocent children who are ultimately the ones suffering due to their parent's willful negligence.  In their mind a dead child is better than a vaccinated one.",
                "Send RFK Jr. there to investigate and visit those afflicted..",
                "Fuck Andrew Wakefield",
                "Making measles great again",
                "Remember, this outbreak and the deaths associated with it were 100% preventable, save for the actions of a handful conservative politician idiots."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Roofer says ICE arrested three of his relatives in a workplace raid.",
            "external_url": "https://www.nbcnews.com/news/us-news/roofer-says-ice-arrested-three-relatives-workplace-raid-rcna199781",
            "upvotes": 7217,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250207-ICE-ch-1610-0afc92.jpg",
            "top_comments": [
                "I didn't understand why ICE isn't raiding meat processing plants in South Dakota, farms in Iowa or construction companies in Arizona. But they did come to Duluth, Minnesota, and took two guys from a roofing company away. ICE isn't trying very hard to get rid of illegals.",
                "Curious, if they were illegal workers, why weren't their bosses also arrested for breaking the law by hiring them??",
                "Hmm.....all these ICE stories seem to be mostly in blue states.  Education funding cuts?  Blue states, too.  Trump is weaponizing funding and laws and seeking his revenge.  His disciples still lap it up.",
                "> In the 2024 U.S. presidential election, exit polls indicate that approximately 55% of Latino men voted for Donald Trump, marking a significant increase from previous elections.  This surge in support contributed to Trump securing about 46% of the overall Latino vote, surpassing the previous Republican high set by George W. Bush in 2004.  Economic concerns, particularly inflation and job security, were primary factors influencing this shift among Latino voters.  Additionally, cultural values and perspectives on issues such as immigration and healthcare played roles in their voting decisions.  ￼ ￼\n\nJust leaving this here for no reason.",
                "American born Latinos need to wake up. If you think they are not considering removing you next you are in fantasyland",
                "Should start arresting business owners who employ illegal immigrants in defiance of the laws, too.",
                "The real purpose is to rile up people in blue states, identify them, track them and then when the time is right declare that they are threats to America and round them up and ship them off to  a re-education center (slave labor camps) and make them disappear. Sound crazy? It been done before in Germany, Russia, Chile, China, to new just a very few in the past 100 years.",
                "ICE acting like brown shirted thugs from yesteryear",
                "The US unemployment rate is 4%. Who do MAGAs think are going to do the work that immigrants are currently doing?",
                "I’m sure that the older you get the more conservative you become. People literally voted against their own families."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "\"Hands Off\" Protests occur across the US. protesting Trump and Musk",
            "external_url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d",
            "upvotes": 3729,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went to the protest in downtown Princeton, New Jersey and there were probably 1400 to 1600 people gathered. A huge turnout for such a small town. My son went to the protest in Boston, my eldest son to the one in Stamford, Connecticut and my sister was on the mall in Washington DC.",
                "It was my first time going to a protest. If Corey Booker can give a 25 hour speech, I can at least show up with a sign.",
                "Preliminary estimates put attendee numbers at 5 million across the country. For all the people that keep saying Americans aren't doing enough.",
                "In Las Vegas on vacation and they had a terrific protest here. Had to be 1/2 mile parade of protesters on the strip. Some jerk was giving a Nazi salute and chanting \"Kamala\" until I made fun of him and he called me a 'little bitch.' Then he backed into his group of friends and disappeared. Lol.",
                "Estimated at 3.5-5M protestors",
                "I’m so proud to been able to get out and participate! 2000+ for Moorhead, MN \nGet your tiny hands OFF of my daughter’s rights!! Get your tiny hands OFF of my rights!!",
                "So many shocking places with big crowds. Small cities in Iowa, Michigan, Alaska. Honestly, it’s beautiful to see the country come together.",
                "Well I'm glad Black people were not part of any protest. Whenever we show up en mass,  it's a riot. \nWe did our marching in Nov. \nSo the rest of Americans gotta fix this mess.",
                "Wasting their time...trump is still president"
            ],
            "aggregate_sentiment": 82.0
        }
    ],
    "last_updated": "04/06/2025 12:13:39 UTC"
}