{
    "posts": [
        {
            "category": "HOT",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 3742,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burger who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches",
                "Face looks surprisingly intact for someone caught by a dad in his daughter‘s bedroom."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Officers who attended Jan. 6 rally ask Supreme Court to keep identities anonymous",
            "external_url": "https://abcnews.go.com/US/wireStory/seattle-officers-attended-jan-6-rally-us-supreme-120979630",
            "upvotes": 24457,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7283fa25-35ca-41e0-a982-84b019579cf9/wirestory_01d1b6115c8b6529e74bbaf90a332239_16x9.jpg?w=1600",
            "top_comments": [
                "Meanwhile laws are being put on the books about wearing masks in public, and Im not even touching the Covid thing. Obviously this goes without saying and getting into the streets peacefully and organizing is as important now as its been since the Civil Rights movements in the 50s/60s. Fascism exists in the shadows and the darkness until enough power is amassed to unmask.",
                "Why are they concerned that the public will find out they went to a peaceful rally?",
                "Absolutely fuck that. Unless they are willing to retire/quit as law enforcement.",
                "‘Rally’ ?! Fuck each and every one of those traitors..",
                "These men support a russian asset for president. They deserved to be shamed and shunned for their terroristic actions.",
                "SEATTLE -- Current and former Seattle police officers who attended President Donald Trump's “Stop the Steal” political rally on Jan. 6, 2021 at the U.S. Capitol are asking the nation's highest court to keep their identities anonymous in public court records. \n\nUsing “John Doe” pseudonyms, they sued over whether the investigation into their activities should be made public. The Washington State Supreme Court ruled in February that they can be identified and that they haven't shown that public release of their names violates their right to privacy. The state supreme court denied reconsideration earlier this month and lawyers for the four officers submitted a petition to the U.S. Supreme Court, asking that the names remain protected during their legal challenge. \n\nFour officers who attended events in the nation’s capital on the day of an insurrection claimed they are protected under the state’s public records law. They say they did nothing wrong and that revealing their names would violate their privacy.\n\nIn the aftermath of the Jan. 6, 2021 events, the Seattle Police Department ordered an investigation into whether any of its officers who traveled to Washington, D.C. to attend the rally had violated any laws or department policies.\n\nThe investigation found that married officers Caitlin and Alexander Everett crossed barriers set up by the Capitol police and were next to the Capitol Building, in violation of the law, prompting Diaz to fire the pair. Investigators said three other officers had not violated policies and the fourth case was ruled “inconclusive.”\n\nSam Sueoka, a law student at the time, filed records requests seeking disclosure of the investigation's records for the participating officers. \n\n“We are reviewing the Does' motion for a stay,” Neil Fox, one of the Sueoka's attorneys, said in an email to The Associated Press Saturday. \n\nRequiring the officers to use their real names in the litigation would create a chilling effect on voicing unpopular opinions, the petition to the Supreme Court said. \n\n“At its core, this appeal involves whether a government agency can ignore the chilling effect resulting from an employer requiring an employee to disclose their off-duty political activities and attendant impressions or motivations associated therewith, followed by widespread dissemination to those who deliberately seek this information to subject these public servants to vilification without the commission of any misconduct whatsoever,” the petition said. \n\nA response to the petition is due next week on Friday.",
                ">They say they did nothing wrong and that revealing their names would violate their privacy.\n\nThey were in a public place. There is not a reasonable expectation of privacy in public, that's why photographers can take public pictures without consent. The SCOTUS shouldn't even entertain this.",
                "We already know who they are…..\n\nhttps://liberationnews.org/unmasked-at-last-all-seattle-cops-at-fascist-jan-6-rally-have-been-identified/\n\nThe rot starts with the Seattle Police Officers Guild.",
                "Absolutely not. You’re going to be treated like everyone else.",
                "Traitors against the US with badges and guns."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Indonesian student detained by Ice after US secretly revokes his visa",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/19/aditya-wahyu-harsono-immigration-indonesia",
            "upvotes": 15740,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3a43d1eaa2e95650e34757d82253187c664e2a41/217_850_2715_1629/master/2715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=308f66172b74fd4660247063a77b7561",
            "top_comments": [
                "> His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\nThe revocation was backdated to 23 March and allegedly based on his 2022 misdemeanor conviction for graffitiing a semi-truck trailer.\n\nThey detained him, claimed his visa was revoked, then backdated paperwork revoking his visa? Yeah, that's not alarming or anything.",
                ">Harsono’s wife, Peyton, called Gad in a panic after she received a call from human resources at the hospital. Two Immigration and Customs Enforcement (Ice) agents, dressed in plain clothes, had shown up and instructed the staff to stage a fake meeting in the basement so they could apprehend him, according to Gad.\n\n>Hospital staff were distraught but felt forced to comply.\n\n>“He unsuspectedly walks in, smiling, and then they just pull out their handcuffs and forcibly detain him, pushing against the wall, start frisking him, and stripping all of his belongings,” Gad said.\n\nThis is sickening",
                "“His wife has been in a state of shock and exhaustion,” Sarah Gad, Harsono’s lawyer, said. “The Department of Homeland Security has weaponized the immigration system to serve just an entirely different purpose, which is to instill fear.”",
                "A student at my college got their visa revoked a few weeks ago and according to an email they sent out there was no notification given, the college just happened to be doing a routine check of international visa status and caught it",
                "**>** His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\n\n\\> The revocation was backdated to 23 March\n\nWTF. His visa was secretly revoked and backdated.",
                "I'd like any Trump voter to explain to me why secretly revoking a visa is necessary.",
                "So here we have a guy making real progress with his life, contributing to society in major ways and all.\n\nAnd yet, he ends up devastated, embarrassed, and now sits in jail while his wife and child also suffer.\n\nScrew everyone involved. Seriously, get a life, you damn racists.\n\nEdit: an award from a kind stranger! 🙏\n\nEdit 2: Another! Thank you, kind sir/ma'am! ♥️",
                "ICE is really working hard to kick out all foreign visa holders who have had any blemish, no matter how slight.  It is a definite agenda to rid this country of all foreigners they possibly can.",
                "The staff that complied with ICE to set up a fake meeting are cowards. ",
                "Millions of people in America are cheering because suffering of minorities makes them happy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Zelenskyy says Russia still firing on Ukraine despite ‘Easter truce’",
            "external_url": "https://www.theguardian.com/world/2025/apr/19/putin-announces-surprise-easter-truce-and-claims-russia-will-not-attack-ukraine-until-monday",
            "upvotes": 7085,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/de1a30b2ab01b986fd22ad96a0e808bc677ba681/0_84_2506_1503/master/2506.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f9b1488cbff715ccfc565226a4a496ca",
            "top_comments": [
                "To the surprise of absolutely no one",
                "Of course the russians are breaking their deal. They break every deal they sign. It is a known quantity.\n\nToo bad we have a russian asset in the white house now. Things are only going to get worse. Set your watch by it.",
                "Of course. Putin never intended to honor the truce. The only purpose of it was propaganda to state that Ukraine was breaking it.",
                "Tomorrow Trump will complain that Ukraine didn‘t accept Putin‘s offer and announce this is the reason the US can‘t do anything anymore to end the war.",
                "A ceasefire with Russia just means that you aren’t allowed to fire back.",
                "I still don't understand why there's so many Americans and bots claiming Zelensky is the reason the war is continuing when it could all end tomorrow if the Russians just fuck off back to their own country considering THEY are the ones invading!!!",
                "I'm starting to think this Putin guy isn't all that honorable.",
                "Whats really telling, russia just announced it. It shows who the ACTUAL aggressor is in this war. There wasn't a \"both sides have agreed on a truce.\"\n\nRussia just said there will be a truce. And so far it lasted about as long as you'd expect.",
                "There will be fires and death around Ukraine and orange head will be on TV Monday saying how great Putin was to implement the truce.",
                "Sounds about right. If Putin was honorable or had a sense of fairness then the invasion never would have happened."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Bronx mom, son found dead with 4-year-old girl miraculously alive after days of screaming and foul odors.",
            "external_url": "https://www.nbcnewyork.com/bronx/bronx-mother-brother-found-dead/6231232/",
            "upvotes": 8004,
            "date": "04/19/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/bronx_dead.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Stories like this make me wish I had some sort of wellness check in set up to protect my child and dogs in case something happened to me and my partner.",
                "This reminds me of the diabetic dad that died with his 18month old toddler that curled up next to him and died. \n\nThe neighbor heard stuff, but never alerted anyone.",
                "Am I stupid i feel like im having a stroke trying to read the title",
                "\"neighbors told the cops they heard the 4 year old screaming for days\" and yet no one called the police for a wellness check. The cops only came after family found them dead. That's NYC for you, especially deep Brooklyn and the Bronx. 🙄",
                "Not suspicious? How does a mother and 8 year old child dying at the same time be deemed not suspicious?",
                "Thank god someone found her I can’t think of a worse city to try to get help from others by screaming.",
                "Neighbors just let it ride for days? Jesus. I'd have called after a few hours just because a screaming child is something you can't listen to for hours without wanting to do something.",
                "Give that girl all the therapy.",
                "This headline is barely decipherable.",
                "I text with my son every morning and usually in the evenings. We call it \"proof of life.\""
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Austin Metcalf's father has angry exchange with 'Protect White Americans' protest organizer",
            "external_url": "https://www.keranews.org/news/2025-04-19/low-turnout-for-protect-white-americans-protest-over-austin-metcalf-stabbing-death-frisco-track-meet-karmelo-anthony-jeff-metcalf-an-angry-exchange",
            "upvotes": 4145,
            "date": "04/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/9f2a366/2147483647/strip/true/crop/8192x4301+0+582/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9f%2F75%2F50fae46946eab9bf7ba1a4bfd09c%2F04192025-frisco-protest-02-kera.jpg",
            "top_comments": [
                "Jesus, this father is being treated like shit by everyone, and he’s the one who lost his son",
                ">“You’re creating more Austin Metcalfs with your weakness, sir,” he told the grieving father.\n\nInsane thing to say to a father who lost his son. The restraint required to not assault him on sight is biblical.",
                "“Black man here, and you’re being weak” \n\nTha fuck?!?!",
                "Yeah they don’t care about the kid or his father, they care about pushing a racial divide. If it wasn’t obvious before, it is now.",
                "Just in case you were wondering, this is a video of the protest.\n\nhttps://www.reddit.com/r/PublicFreakout/comments/1k32zbe/maga_holding_a_white_lives_matter_protest_in/\n\nI don't know how anyone will be able to get an accurate count.\n\n/s",
                "I know a lot of people dislike Twitter [but people should REALLY see how the guy running the protest is responding now.](https://x.com/JakeLangJ6/status/1913700595019432143) He wants to run for political office in Florida.\n\nEDIT: Update. Now he claims to have broken into the stadium and has uploaded a video he claims is the blood of the boy who died.",
                "Hey, folks my age (mid-40's)...all those years we said \"Man, I can't wait for all the shitty old racists to die\"? Welp, they're dead, but they raised racist kids who turned into shitheads like this guy. \n\nWaiting ain't gonna cut it.\n\n(Edited for typo.)",
                "“Both the Metcalf family and the Anthony family have faced threats following online backlash over what happened at the Frisco track meet.”\n\nWe are broken as a society",
                "I know it’s the perfect storm of factors but I don’t remember the last time I’ve seen a situation like this used to rile people up on the internet. Wonder who’s responsible?",
                "Karmelo Anthony is an ass hole who happens to be black. He didn't do what he did because he's black. Jake Lang is an ass hole for victimizing the Metcalf family again for using their son's death for a cause they don't even agree with."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Israeli military review into killing of Gaza aid workers finds 'professional failures'",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-military-says-review-into-killing-gaza-aid-workers-found-professional-2025-04-20/",
            "upvotes": 170,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is dystopian af. Why does humanity have to be so awful",
                "I'm sure they were just following orders. ",
                "Mistakes were made=we got caught",
                "They’ve been having an awful lot of those in the last year.",
                "We investigated ourselves and found we did nothing wrong.",
                "Professional war fighters committing war crimes is indeed a \"professional failure,\" but it's also much more than that... specifically the crime part.",
                "Professional failures? How about total disregard for Palestinians and those who try to help them. This was a deliberate act as it’s not the only one that has targeted aid workers.",
                "So now murder of civilians and first aid workers is \"professional failure\". Cute",
                "I bet thats what the nazis said.",
                "Hate when I have a bad day at work and casually commit a war crime."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "American born doctor receives email from immigration officials telling her to leave the country immediately",
            "external_url": "https://www.nbcnews.com/news/rcna201698",
            "upvotes": 32035,
            "date": "04/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250417-lisa-anderson-mn-0900-993ef5.jpg",
            "top_comments": [
                "Where are they going to deport her? To Narnia?",
                "So, there's two additional things to worry about.\n\n1) the government is sending out deportation emails without checking.\n\n2) ICE has shown a willingness to grab everyone nearby and deport them without checking.\n\nIt almost doesn't matter if you're a US citizen because no one will ever actually try to verify if you're the right person.",
                "When incompetence meets abject cruelty, this is the result.",
                "This is the same system determining who goes to the gulag. And we see how well that works when they fuck up.",
                "When will enough people wake up? Or is it too late?",
                "When is Marco Rubio going to get one of these emails?",
                "well since the supreme court basically put this whole program on judicial hold at about 1am est this morning, this person has extra time to contact the ACLU and get in on the massive class action lawsuit coming. \n\nThis kind of nazi garbage has to be done quickly, now that there are sticks in the spokes, I am optimistic that this can be stopped. \n\nWe are now waiting on the circuit courts rulings and the petition to the sup court from the solicitor general after. \n\nKeep putting the political and social pressure on this admin, and dont let the republicans try to pivot away and make people forget what they did!",
                "I said as soon as he got elected this was coming. I'll put $50 that says inside of a year you see the first native born American citizen sent to El Salvador. \n\n\nThough I will admit they are likely to be some flavor of not white. And Maga will cheer it on.",
                "Welcome to modern fascism, where a computer algorithm randomly picks you out for oppression. Maybe Leon Skum and the DOGE dipshits are behind this, or maybe it's puppy killer Noem's henchmen, but the end result is the same: this administration (regime) is arbitrarily and half-assedly targeting Americans in a blind exercise of pure cruelty.",
                "I swear if they send me an email I’ll never see it. I hardly ever check my email"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Volvo to cut up to 800 US jobs as Trump's tariffs bite",
            "external_url": "https://www.reuters.com/business/autos-transportation/volvo-cut-up-800-us-jobs-trumps-tariffs-bite-2025-04-18/",
            "upvotes": 3135,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this what winning looks like?",
                "Note that this is Volvo AB, the division that builds semi trucks. This is not good news for the freight industry, as there aren't a ton of manufacturers for heavy trucks in the US",
                "NEW YORK, April 18 (Reuters) - Volvo Group plans to lay off as many as 800 workers at three U.S. facilities over the next three months due to market uncertainty and demand concerns in the face of President Donald Trump's tariffs, a spokesperson said on Friday.\nVolvo Group North America said in a statement it has told employees it plans to lay off 550-800 people at its Mack Trucks site in Macungie, Pennsylvania, and two Volvo Group facilities in Dublin, Virginia, and Hagerstown, Maryland.\nThe company, part of Sweden's AB Volvo (VOLVb.ST), opens new tab, employs nearly 20,000 people in North America, according to its website.\nTrump has upended the global trading system that has been in place for over 75 years with a plan for tariffs on products from across the world. His vacillating trade policy has undermined consumer and business confidence, and caused economists to raise their forecasts for a U.S. recession.\nnference\n\nVolvo Group's lay-offs are the latest response from a car and truck industry that is reeling from the Republican president's tariffs on certain parts, which is expected to increase the cost of manufacturing vehicles.\n\"Heavy-duty truck orders continue to be negatively affected by market uncertainty about freight rates and demand, possible regulatory changes, and the impact of tariffs,\" a spokesperson for Volvo Group North America said in an emailed statement.\n\"We regret having to take this action, but we need to align production with reduced demand for our vehicles.\"",
                "I was just listening to some union people happy about tariffs and are ok with higher prices so I'm glad they are getting what they voted for",
                "\"Volvo Group plans to lay off as many as 800 workers at **three U.S. facilities** over the next three months due to market uncertainty and demand concerns in the face of President Donald Trump's tariffs, a spokesperson said on Friday.\"\n\nJust in case you were thinking these were Swedish Volvo workers (not that it would be any better) it's not. It's American workers going out of work on behalf of Donald J. Trump--a man who has never worked for a company that didn't have his own name on it.",
                "I wish it would work out to be 800 trump voters just so they can see consequences for their actions but it will never be that",
                "Don't worry. Over on r/con, it's all about the start of the Revolutionary War. All good 🍻",
                "MAGA, are you tired of winning yet?",
                "Is that how you create in-country jobs?",
                "Inflation up on tariffs, unemployment up cause of the shitty economy, stagflation here we come!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 13076,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "If not vaccinated [9 out of 10 people will contract measles after being exposed](https://www.cdc.gov/measles/about/index.html). \n\n\nThat doctor is a moron and superspreader.",
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "Are we playing Typhoid Mary again?",
                "RFK should be locked up. He’s a lunatic.",
                "RFK jr. Is the worm in americas brain. ",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Israeli Probe Finds Failures in Its Killing of 15 Gaza Aid Workers",
            "external_url": "https://www.wsj.com/world/middle-east/israeli-probe-finds-failures-in-its-killing-of-15-gaza-aid-workers-f1d4b1be",
            "upvotes": 37,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Failures meaning they got caught.",
                "Failures in covering up. Efforts will be doubled next time.",
                "\"Failure\" likely means their bombs only killed 95% of the community.",
                "The IDF is a terrorist organization.",
                "They meant to kill 16."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Israeli military review into killing of Gaza aid workers finds 'professional failures'",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-military-says-review-into-killing-gaza-aid-workers-found-professional-2025-04-20/",
            "upvotes": 171,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is dystopian af. Why does humanity have to be so awful",
                "I'm sure they were just following orders. ",
                "Mistakes were made=we got caught",
                "They’ve been having an awful lot of those in the last year.",
                "We investigated ourselves and found we did nothing wrong.",
                "Professional war fighters committing war crimes is indeed a \"professional failure,\" but it's also much more than that... specifically the crime part.",
                "Professional failures? How about total disregard for Palestinians and those who try to help them. This was a deliberate act as it’s not the only one that has targeted aid workers.",
                "So now murder of civilians and first aid workers is \"professional failure\". Cute",
                "I bet thats what the nazis said.",
                "Hate when I have a bad day at work and casually commit a war crime."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 3750,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burger who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches",
                "Face looks surprisingly intact for someone caught by a dad in his daughter‘s bedroom."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "No sweat: Humanoid robots run a Chinese half-marathon alongside flesh-and-blood competitors",
            "external_url": "https://apnews.com/article/china-robot-half-marathon-153c6823bd628625106ed26267874d21",
            "upvotes": 455,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why does it seem increasingly likely that various forms of technology are going to live out our dreams of being entertainers, musicians, artists, and athletes while actual human beings are condemned to die on the factory floor in the middle of a 16 hour shift?",
                "Jokes on them, my Subaru Forester can already go much faster and further than even the most athletic person.",
                "And they’re worried about trans athletes in the US",
                "[deleted]",
                "That's wild! Imagine running a marathon and having a robot pass you. I wonder if they have to recharge mid-race or if they can go the whole distance on one charge.",
                "Great. Now Republicans are gonna start complaining about trans robot athletes.",
                "I think Im going to start collecting magnets",
                "Thank god that robot wasn’t a trans woman or this might actually be a problem….",
                "[https://youtu.be/koB435oHYqY?si=j-DEeai-jBj3qPrM](https://youtu.be/koB435oHYqY?si=j-DEeai-jBj3qPrM)\n\nI was more impressed at first, but then I saw a video. If the robots finally try and take over, just take a brisk walk down the street, and you'll be fine.",
                "No sweat, just multiple stops to swap out the batteries. Seriously, that’s what happened. It ran slow as hell in its own huge lane and stopped multiple times to get new batteries that non-robots had to put in it.\n\nThe headline makes it sound like it was neck and neck with the Kenyans."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Officers who attended Jan. 6 rally ask Supreme Court to keep identities anonymous",
            "external_url": "https://abcnews.go.com/US/wireStory/seattle-officers-attended-jan-6-rally-us-supreme-120979630",
            "upvotes": 24454,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7283fa25-35ca-41e0-a982-84b019579cf9/wirestory_01d1b6115c8b6529e74bbaf90a332239_16x9.jpg?w=1600",
            "top_comments": [
                "Meanwhile laws are being put on the books about wearing masks in public, and Im not even touching the Covid thing. Obviously this goes without saying and getting into the streets peacefully and organizing is as important now as its been since the Civil Rights movements in the 50s/60s. Fascism exists in the shadows and the darkness until enough power is amassed to unmask.",
                "Why are they concerned that the public will find out they went to a peaceful rally?",
                "Absolutely fuck that. Unless they are willing to retire/quit as law enforcement.",
                "‘Rally’ ?! Fuck each and every one of those traitors..",
                "These men support a russian asset for president. They deserved to be shamed and shunned for their terroristic actions.",
                "SEATTLE -- Current and former Seattle police officers who attended President Donald Trump's “Stop the Steal” political rally on Jan. 6, 2021 at the U.S. Capitol are asking the nation's highest court to keep their identities anonymous in public court records. \n\nUsing “John Doe” pseudonyms, they sued over whether the investigation into their activities should be made public. The Washington State Supreme Court ruled in February that they can be identified and that they haven't shown that public release of their names violates their right to privacy. The state supreme court denied reconsideration earlier this month and lawyers for the four officers submitted a petition to the U.S. Supreme Court, asking that the names remain protected during their legal challenge. \n\nFour officers who attended events in the nation’s capital on the day of an insurrection claimed they are protected under the state’s public records law. They say they did nothing wrong and that revealing their names would violate their privacy.\n\nIn the aftermath of the Jan. 6, 2021 events, the Seattle Police Department ordered an investigation into whether any of its officers who traveled to Washington, D.C. to attend the rally had violated any laws or department policies.\n\nThe investigation found that married officers Caitlin and Alexander Everett crossed barriers set up by the Capitol police and were next to the Capitol Building, in violation of the law, prompting Diaz to fire the pair. Investigators said three other officers had not violated policies and the fourth case was ruled “inconclusive.”\n\nSam Sueoka, a law student at the time, filed records requests seeking disclosure of the investigation's records for the participating officers. \n\n“We are reviewing the Does' motion for a stay,” Neil Fox, one of the Sueoka's attorneys, said in an email to The Associated Press Saturday. \n\nRequiring the officers to use their real names in the litigation would create a chilling effect on voicing unpopular opinions, the petition to the Supreme Court said. \n\n“At its core, this appeal involves whether a government agency can ignore the chilling effect resulting from an employer requiring an employee to disclose their off-duty political activities and attendant impressions or motivations associated therewith, followed by widespread dissemination to those who deliberately seek this information to subject these public servants to vilification without the commission of any misconduct whatsoever,” the petition said. \n\nA response to the petition is due next week on Friday.",
                ">They say they did nothing wrong and that revealing their names would violate their privacy.\n\nThey were in a public place. There is not a reasonable expectation of privacy in public, that's why photographers can take public pictures without consent. The SCOTUS shouldn't even entertain this.",
                "We already know who they are…..\n\nhttps://liberationnews.org/unmasked-at-last-all-seattle-cops-at-fascist-jan-6-rally-have-been-identified/\n\nThe rot starts with the Seattle Police Officers Guild.",
                "Absolutely not. You’re going to be treated like everyone else.",
                "Traitors against the US with badges and guns."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Indonesian student detained by Ice after US secretly revokes his visa",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/19/aditya-wahyu-harsono-immigration-indonesia",
            "upvotes": 15725,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3a43d1eaa2e95650e34757d82253187c664e2a41/217_850_2715_1629/master/2715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=308f66172b74fd4660247063a77b7561",
            "top_comments": [
                "> His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\nThe revocation was backdated to 23 March and allegedly based on his 2022 misdemeanor conviction for graffitiing a semi-truck trailer.\n\nThey detained him, claimed his visa was revoked, then backdated paperwork revoking his visa? Yeah, that's not alarming or anything.",
                ">Harsono’s wife, Peyton, called Gad in a panic after she received a call from human resources at the hospital. Two Immigration and Customs Enforcement (Ice) agents, dressed in plain clothes, had shown up and instructed the staff to stage a fake meeting in the basement so they could apprehend him, according to Gad.\n\n>Hospital staff were distraught but felt forced to comply.\n\n>“He unsuspectedly walks in, smiling, and then they just pull out their handcuffs and forcibly detain him, pushing against the wall, start frisking him, and stripping all of his belongings,” Gad said.\n\nThis is sickening",
                "“His wife has been in a state of shock and exhaustion,” Sarah Gad, Harsono’s lawyer, said. “The Department of Homeland Security has weaponized the immigration system to serve just an entirely different purpose, which is to instill fear.”",
                "A student at my college got their visa revoked a few weeks ago and according to an email they sent out there was no notification given, the college just happened to be doing a routine check of international visa status and caught it",
                "**>** His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\n\n\\> The revocation was backdated to 23 March\n\nWTF. His visa was secretly revoked and backdated.",
                "I'd like any Trump voter to explain to me why secretly revoking a visa is necessary.",
                "So here we have a guy making real progress with his life, contributing to society in major ways and all.\n\nAnd yet, he ends up devastated, embarrassed, and now sits in jail while his wife and child also suffer.\n\nScrew everyone involved. Seriously, get a life, you damn racists.\n\nEdit: an award from a kind stranger! 🙏\n\nEdit 2: Another! Thank you, kind sir/ma'am! ♥️",
                "ICE is really working hard to kick out all foreign visa holders who have had any blemish, no matter how slight.  It is a definite agenda to rid this country of all foreigners they possibly can.",
                "The staff that complied with ICE to set up a fake meeting are cowards. ",
                "Millions of people in America are cheering because suffering of minorities makes them happy."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Austin Metcalf's father has angry exchange with 'Protect White Americans' protest organizer",
            "external_url": "https://www.keranews.org/news/2025-04-19/low-turnout-for-protect-white-americans-protest-over-austin-metcalf-stabbing-death-frisco-track-meet-karmelo-anthony-jeff-metcalf-an-angry-exchange",
            "upvotes": 4134,
            "date": "04/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/9f2a366/2147483647/strip/true/crop/8192x4301+0+582/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9f%2F75%2F50fae46946eab9bf7ba1a4bfd09c%2F04192025-frisco-protest-02-kera.jpg",
            "top_comments": [
                "Jesus, this father is being treated like shit by everyone, and he’s the one who lost his son",
                ">“You’re creating more Austin Metcalfs with your weakness, sir,” he told the grieving father.\n\nInsane thing to say to a father who lost his son. The restraint required to not assault him on sight is biblical.",
                "“Black man here, and you’re being weak” \n\nTha fuck?!?!",
                "Yeah they don’t care about the kid or his father, they care about pushing a racial divide. If it wasn’t obvious before, it is now.",
                "Just in case you were wondering, this is a video of the protest.\n\nhttps://www.reddit.com/r/PublicFreakout/comments/1k32zbe/maga_holding_a_white_lives_matter_protest_in/\n\nI don't know how anyone will be able to get an accurate count.\n\n/s",
                "I know a lot of people dislike Twitter [but people should REALLY see how the guy running the protest is responding now.](https://x.com/JakeLangJ6/status/1913700595019432143) He wants to run for political office in Florida.\n\nEDIT: Update. Now he claims to have broken into the stadium and has uploaded a video he claims is the blood of the boy who died.",
                "Hey, folks my age (mid-40's)...all those years we said \"Man, I can't wait for all the shitty old racists to die\"? Welp, they're dead, but they raised racist kids who turned into shitheads like this guy. \n\nWaiting ain't gonna cut it.\n\n(Edited for typo.)",
                "“Both the Metcalf family and the Anthony family have faced threats following online backlash over what happened at the Frisco track meet.”\n\nWe are broken as a society",
                "I know it’s the perfect storm of factors but I don’t remember the last time I’ve seen a situation like this used to rile people up on the internet. Wonder who’s responsible?",
                "Karmelo Anthony is an ass hole who happens to be black. He didn't do what he did because he's black. Jake Lang is an ass hole for victimizing the Metcalf family again for using their son's death for a cause they don't even agree with."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Elections Canada announces record turnout on first day of advance voting | CBC News",
            "external_url": "https://www.cbc.ca/news/politics/elections-canada-record-turnout-first-day-advance-voting-1.7514390?__vfz=medium%3Dsharebar",
            "upvotes": 1216,
            "date": "04/19/2025",
            "thumbnail": "https://i.cbc.ca/1.7514394.1745092561!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/cda-advance-polls-20250418.JPG?im=Resize%3D620",
            "top_comments": [
                "Any data on how many voted by special ballot already? I voted that way at Mic Mac Mall about two weeks ago, and the workers there also said the turnout was nutso.",
                "I hope all 2 million of them decided they didn't want to be the 51st state.",
                "Voted today. While it was quick, in and out in 8min, there were pretty high amount of people coming in. Friemd of mine waited 20min at his pooling station.",
                "You can also vote at the election office in your constituency.  Yesterday I tried to vote at the advance poll near me and left when I heard it would be at least 90 minutes.  I was at the election office for about 3 minutes.  No other voters were there.",
                "Went to vote on Friday night and it was pretty quiet, had time to talk a bit and the workers told me it was nonstop until 3pm (they're in a church basement and there was a mass around that time). \n\nI find these people quite brave to do four 12-hour days on a holiday weekend. They also have to show up at the office to count the vote in their boxes on the 28th.",
                "When voter turnout is high, it has favored the Liberals historically. We'll see if it holds true this election. \n\nCanadians agree on most things federally ... 62% are moderates. 33% at center, 15% center-left and 14% center-right. All this left/right yelling is garbage... and I believe most can see it for what it is.",
                "I voted on Friday, it was packed and I waited for 2 hours but it was worth it.\n\nGet out there people!",
                "I hope ppl voted with common sense.",
                "Any Candidates here explain why? Is it because of people worry Canada Conservative Party too close to MAGA? Or other way around?",
                "For scale, relative to the 2019 election turnout total of 18.3M, 2M is ≅11%"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "Zelenskyy says Russia still firing on Ukraine despite ‘Easter truce’",
            "external_url": "https://www.theguardian.com/world/2025/apr/19/putin-announces-surprise-easter-truce-and-claims-russia-will-not-attack-ukraine-until-monday",
            "upvotes": 7086,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/de1a30b2ab01b986fd22ad96a0e808bc677ba681/0_84_2506_1503/master/2506.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f9b1488cbff715ccfc565226a4a496ca",
            "top_comments": [
                "To the surprise of absolutely no one",
                "Of course the russians are breaking their deal. They break every deal they sign. It is a known quantity.\n\nToo bad we have a russian asset in the white house now. Things are only going to get worse. Set your watch by it.",
                "Of course. Putin never intended to honor the truce. The only purpose of it was propaganda to state that Ukraine was breaking it.",
                "Tomorrow Trump will complain that Ukraine didn‘t accept Putin‘s offer and announce this is the reason the US can‘t do anything anymore to end the war.",
                "A ceasefire with Russia just means that you aren’t allowed to fire back.",
                "I still don't understand why there's so many Americans and bots claiming Zelensky is the reason the war is continuing when it could all end tomorrow if the Russians just fuck off back to their own country considering THEY are the ones invading!!!",
                "I'm starting to think this Putin guy isn't all that honorable.",
                "Whats really telling, russia just announced it. It shows who the ACTUAL aggressor is in this war. There wasn't a \"both sides have agreed on a truce.\"\n\nRussia just said there will be a truce. And so far it lasted about as long as you'd expect.",
                "There will be fires and death around Ukraine and orange head will be on TV Monday saying how great Putin was to implement the truce.",
                "Sounds about right. If Putin was honorable or had a sense of fairness then the invasion never would have happened."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Volvo to cut up to 800 US jobs as Trump's tariffs bite",
            "external_url": "https://www.reuters.com/business/autos-transportation/volvo-cut-up-800-us-jobs-trumps-tariffs-bite-2025-04-18/",
            "upvotes": 3133,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this what winning looks like?",
                "Note that this is Volvo AB, the division that builds semi trucks. This is not good news for the freight industry, as there aren't a ton of manufacturers for heavy trucks in the US",
                "NEW YORK, April 18 (Reuters) - Volvo Group plans to lay off as many as 800 workers at three U.S. facilities over the next three months due to market uncertainty and demand concerns in the face of President Donald Trump's tariffs, a spokesperson said on Friday.\nVolvo Group North America said in a statement it has told employees it plans to lay off 550-800 people at its Mack Trucks site in Macungie, Pennsylvania, and two Volvo Group facilities in Dublin, Virginia, and Hagerstown, Maryland.\nThe company, part of Sweden's AB Volvo (VOLVb.ST), opens new tab, employs nearly 20,000 people in North America, according to its website.\nTrump has upended the global trading system that has been in place for over 75 years with a plan for tariffs on products from across the world. His vacillating trade policy has undermined consumer and business confidence, and caused economists to raise their forecasts for a U.S. recession.\nnference\n\nVolvo Group's lay-offs are the latest response from a car and truck industry that is reeling from the Republican president's tariffs on certain parts, which is expected to increase the cost of manufacturing vehicles.\n\"Heavy-duty truck orders continue to be negatively affected by market uncertainty about freight rates and demand, possible regulatory changes, and the impact of tariffs,\" a spokesperson for Volvo Group North America said in an emailed statement.\n\"We regret having to take this action, but we need to align production with reduced demand for our vehicles.\"",
                "I was just listening to some union people happy about tariffs and are ok with higher prices so I'm glad they are getting what they voted for",
                "\"Volvo Group plans to lay off as many as 800 workers at **three U.S. facilities** over the next three months due to market uncertainty and demand concerns in the face of President Donald Trump's tariffs, a spokesperson said on Friday.\"\n\nJust in case you were thinking these were Swedish Volvo workers (not that it would be any better) it's not. It's American workers going out of work on behalf of Donald J. Trump--a man who has never worked for a company that didn't have his own name on it.",
                "I wish it would work out to be 800 trump voters just so they can see consequences for their actions but it will never be that",
                "Don't worry. Over on r/con, it's all about the start of the Revolutionary War. All good 🍻",
                "MAGA, are you tired of winning yet?",
                "Is that how you create in-country jobs?",
                "Inflation up on tariffs, unemployment up cause of the shitty economy, stagflation here we come!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 3739,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burger who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches",
                "Face looks surprisingly intact for someone caught by a dad in his daughter‘s bedroom."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Officers who attended Jan. 6 rally ask Supreme Court to keep identities anonymous",
            "external_url": "https://abcnews.go.com/US/wireStory/seattle-officers-attended-jan-6-rally-us-supreme-120979630",
            "upvotes": 24452,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7283fa25-35ca-41e0-a982-84b019579cf9/wirestory_01d1b6115c8b6529e74bbaf90a332239_16x9.jpg?w=1600",
            "top_comments": [
                "Meanwhile laws are being put on the books about wearing masks in public, and Im not even touching the Covid thing. Obviously this goes without saying and getting into the streets peacefully and organizing is as important now as its been since the Civil Rights movements in the 50s/60s. Fascism exists in the shadows and the darkness until enough power is amassed to unmask.",
                "Why are they concerned that the public will find out they went to a peaceful rally?",
                "Absolutely fuck that. Unless they are willing to retire/quit as law enforcement.",
                "‘Rally’ ?! Fuck each and every one of those traitors..",
                "These men support a russian asset for president. They deserved to be shamed and shunned for their terroristic actions.",
                "SEATTLE -- Current and former Seattle police officers who attended President Donald Trump's “Stop the Steal” political rally on Jan. 6, 2021 at the U.S. Capitol are asking the nation's highest court to keep their identities anonymous in public court records. \n\nUsing “John Doe” pseudonyms, they sued over whether the investigation into their activities should be made public. The Washington State Supreme Court ruled in February that they can be identified and that they haven't shown that public release of their names violates their right to privacy. The state supreme court denied reconsideration earlier this month and lawyers for the four officers submitted a petition to the U.S. Supreme Court, asking that the names remain protected during their legal challenge. \n\nFour officers who attended events in the nation’s capital on the day of an insurrection claimed they are protected under the state’s public records law. They say they did nothing wrong and that revealing their names would violate their privacy.\n\nIn the aftermath of the Jan. 6, 2021 events, the Seattle Police Department ordered an investigation into whether any of its officers who traveled to Washington, D.C. to attend the rally had violated any laws or department policies.\n\nThe investigation found that married officers Caitlin and Alexander Everett crossed barriers set up by the Capitol police and were next to the Capitol Building, in violation of the law, prompting Diaz to fire the pair. Investigators said three other officers had not violated policies and the fourth case was ruled “inconclusive.”\n\nSam Sueoka, a law student at the time, filed records requests seeking disclosure of the investigation's records for the participating officers. \n\n“We are reviewing the Does' motion for a stay,” Neil Fox, one of the Sueoka's attorneys, said in an email to The Associated Press Saturday. \n\nRequiring the officers to use their real names in the litigation would create a chilling effect on voicing unpopular opinions, the petition to the Supreme Court said. \n\n“At its core, this appeal involves whether a government agency can ignore the chilling effect resulting from an employer requiring an employee to disclose their off-duty political activities and attendant impressions or motivations associated therewith, followed by widespread dissemination to those who deliberately seek this information to subject these public servants to vilification without the commission of any misconduct whatsoever,” the petition said. \n\nA response to the petition is due next week on Friday.",
                ">They say they did nothing wrong and that revealing their names would violate their privacy.\n\nThey were in a public place. There is not a reasonable expectation of privacy in public, that's why photographers can take public pictures without consent. The SCOTUS shouldn't even entertain this.",
                "We already know who they are…..\n\nhttps://liberationnews.org/unmasked-at-last-all-seattle-cops-at-fascist-jan-6-rally-have-been-identified/\n\nThe rot starts with the Seattle Police Officers Guild.",
                "Absolutely not. You’re going to be treated like everyone else.",
                "Traitors against the US with badges and guns."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Indonesian student detained by Ice after US secretly revokes his visa",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/19/aditya-wahyu-harsono-immigration-indonesia",
            "upvotes": 15732,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3a43d1eaa2e95650e34757d82253187c664e2a41/217_850_2715_1629/master/2715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=308f66172b74fd4660247063a77b7561",
            "top_comments": [
                "> His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\nThe revocation was backdated to 23 March and allegedly based on his 2022 misdemeanor conviction for graffitiing a semi-truck trailer.\n\nThey detained him, claimed his visa was revoked, then backdated paperwork revoking his visa? Yeah, that's not alarming or anything.",
                ">Harsono’s wife, Peyton, called Gad in a panic after she received a call from human resources at the hospital. Two Immigration and Customs Enforcement (Ice) agents, dressed in plain clothes, had shown up and instructed the staff to stage a fake meeting in the basement so they could apprehend him, according to Gad.\n\n>Hospital staff were distraught but felt forced to comply.\n\n>“He unsuspectedly walks in, smiling, and then they just pull out their handcuffs and forcibly detain him, pushing against the wall, start frisking him, and stripping all of his belongings,” Gad said.\n\nThis is sickening",
                "“His wife has been in a state of shock and exhaustion,” Sarah Gad, Harsono’s lawyer, said. “The Department of Homeland Security has weaponized the immigration system to serve just an entirely different purpose, which is to instill fear.”",
                "A student at my college got their visa revoked a few weeks ago and according to an email they sent out there was no notification given, the college just happened to be doing a routine check of international visa status and caught it",
                "**>** His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\n\n\\> The revocation was backdated to 23 March\n\nWTF. His visa was secretly revoked and backdated.",
                "I'd like any Trump voter to explain to me why secretly revoking a visa is necessary.",
                "So here we have a guy making real progress with his life, contributing to society in major ways and all.\n\nAnd yet, he ends up devastated, embarrassed, and now sits in jail while his wife and child also suffer.\n\nScrew everyone involved. Seriously, get a life, you damn racists.\n\nEdit: an award from a kind stranger! 🙏\n\nEdit 2: Another! Thank you, kind sir/ma'am! ♥️",
                "ICE is really working hard to kick out all foreign visa holders who have had any blemish, no matter how slight.  It is a definite agenda to rid this country of all foreigners they possibly can.",
                "The staff that complied with ICE to set up a fake meeting are cowards. ",
                "Millions of people in America are cheering because suffering of minorities makes them happy."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Zelenskyy says Russia still firing on Ukraine despite ‘Easter truce’",
            "external_url": "https://www.theguardian.com/world/2025/apr/19/putin-announces-surprise-easter-truce-and-claims-russia-will-not-attack-ukraine-until-monday",
            "upvotes": 7084,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/de1a30b2ab01b986fd22ad96a0e808bc677ba681/0_84_2506_1503/master/2506.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f9b1488cbff715ccfc565226a4a496ca",
            "top_comments": [
                "To the surprise of absolutely no one",
                "Of course the russians are breaking their deal. They break every deal they sign. It is a known quantity.\n\nToo bad we have a russian asset in the white house now. Things are only going to get worse. Set your watch by it.",
                "Of course. Putin never intended to honor the truce. The only purpose of it was propaganda to state that Ukraine was breaking it.",
                "Tomorrow Trump will complain that Ukraine didn‘t accept Putin‘s offer and announce this is the reason the US can‘t do anything anymore to end the war.",
                "A ceasefire with Russia just means that you aren’t allowed to fire back.",
                "I still don't understand why there's so many Americans and bots claiming Zelensky is the reason the war is continuing when it could all end tomorrow if the Russians just fuck off back to their own country considering THEY are the ones invading!!!",
                "I'm starting to think this Putin guy isn't all that honorable.",
                "Whats really telling, russia just announced it. It shows who the ACTUAL aggressor is in this war. There wasn't a \"both sides have agreed on a truce.\"\n\nRussia just said there will be a truce. And so far it lasted about as long as you'd expect.",
                "There will be fires and death around Ukraine and orange head will be on TV Monday saying how great Putin was to implement the truce.",
                "Sounds about right. If Putin was honorable or had a sense of fairness then the invasion never would have happened."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Bronx mom, son found dead with 4-year-old girl miraculously alive after days of screaming and foul odors.",
            "external_url": "https://www.nbcnewyork.com/bronx/bronx-mother-brother-found-dead/6231232/",
            "upvotes": 8001,
            "date": "04/19/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/bronx_dead.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Stories like this make me wish I had some sort of wellness check in set up to protect my child and dogs in case something happened to me and my partner.",
                "This reminds me of the diabetic dad that died with his 18month old toddler that curled up next to him and died. \n\nThe neighbor heard stuff, but never alerted anyone.",
                "Am I stupid i feel like im having a stroke trying to read the title",
                "\"neighbors told the cops they heard the 4 year old screaming for days\" and yet no one called the police for a wellness check. The cops only came after family found them dead. That's NYC for you, especially deep Brooklyn and the Bronx. 🙄",
                "Not suspicious? How does a mother and 8 year old child dying at the same time be deemed not suspicious?",
                "Thank god someone found her I can’t think of a worse city to try to get help from others by screaming.",
                "Neighbors just let it ride for days? Jesus. I'd have called after a few hours just because a screaming child is something you can't listen to for hours without wanting to do something.",
                "Give that girl all the therapy.",
                "This headline is barely decipherable.",
                "I text with my son every morning and usually in the evenings. We call it \"proof of life.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Austin Metcalf's father has angry exchange with 'Protect White Americans' protest organizer",
            "external_url": "https://www.keranews.org/news/2025-04-19/low-turnout-for-protect-white-americans-protest-over-austin-metcalf-stabbing-death-frisco-track-meet-karmelo-anthony-jeff-metcalf-an-angry-exchange",
            "upvotes": 4147,
            "date": "04/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/9f2a366/2147483647/strip/true/crop/8192x4301+0+582/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9f%2F75%2F50fae46946eab9bf7ba1a4bfd09c%2F04192025-frisco-protest-02-kera.jpg",
            "top_comments": [
                "Jesus, this father is being treated like shit by everyone, and he’s the one who lost his son",
                ">“You’re creating more Austin Metcalfs with your weakness, sir,” he told the grieving father.\n\nInsane thing to say to a father who lost his son. The restraint required to not assault him on sight is biblical.",
                "“Black man here, and you’re being weak” \n\nTha fuck?!?!",
                "Yeah they don’t care about the kid or his father, they care about pushing a racial divide. If it wasn’t obvious before, it is now.",
                "Just in case you were wondering, this is a video of the protest.\n\nhttps://www.reddit.com/r/PublicFreakout/comments/1k32zbe/maga_holding_a_white_lives_matter_protest_in/\n\nI don't know how anyone will be able to get an accurate count.\n\n/s",
                "I know a lot of people dislike Twitter [but people should REALLY see how the guy running the protest is responding now.](https://x.com/JakeLangJ6/status/1913700595019432143) He wants to run for political office in Florida.\n\nEDIT: Update. Now he claims to have broken into the stadium and has uploaded a video he claims is the blood of the boy who died.",
                "Hey, folks my age (mid-40's)...all those years we said \"Man, I can't wait for all the shitty old racists to die\"? Welp, they're dead, but they raised racist kids who turned into shitheads like this guy. \n\nWaiting ain't gonna cut it.\n\n(Edited for typo.)",
                "“Both the Metcalf family and the Anthony family have faced threats following online backlash over what happened at the Frisco track meet.”\n\nWe are broken as a society",
                "I know it’s the perfect storm of factors but I don’t remember the last time I’ve seen a situation like this used to rile people up on the internet. Wonder who’s responsible?",
                "Karmelo Anthony is an ass hole who happens to be black. He didn't do what he did because he's black. Jake Lang is an ass hole for victimizing the Metcalf family again for using their son's death for a cause they don't even agree with."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Israeli military review into killing of Gaza aid workers finds 'professional failures'",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-military-says-review-into-killing-gaza-aid-workers-found-professional-2025-04-20/",
            "upvotes": 166,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is dystopian af. Why does humanity have to be so awful",
                "I'm sure they were just following orders. ",
                "Mistakes were made=we got caught",
                "They’ve been having an awful lot of those in the last year.",
                "We investigated ourselves and found we did nothing wrong.",
                "Professional war fighters committing war crimes is indeed a \"professional failure,\" but it's also much more than that... specifically the crime part.",
                "Professional failures? How about total disregard for Palestinians and those who try to help them. This was a deliberate act as it’s not the only one that has targeted aid workers.",
                "So now murder of civilians and first aid workers is \"professional failure\". Cute",
                "I bet thats what the nazis said.",
                "Hate when I have a bad day at work and casually commit a war crime."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "American born doctor receives email from immigration officials telling her to leave the country immediately",
            "external_url": "https://www.nbcnews.com/news/rcna201698",
            "upvotes": 32036,
            "date": "04/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250417-lisa-anderson-mn-0900-993ef5.jpg",
            "top_comments": [
                "Where are they going to deport her? To Narnia?",
                "So, there's two additional things to worry about.\n\n1) the government is sending out deportation emails without checking.\n\n2) ICE has shown a willingness to grab everyone nearby and deport them without checking.\n\nIt almost doesn't matter if you're a US citizen because no one will ever actually try to verify if you're the right person.",
                "When incompetence meets abject cruelty, this is the result.",
                "This is the same system determining who goes to the gulag. And we see how well that works when they fuck up.",
                "When will enough people wake up? Or is it too late?",
                "When is Marco Rubio going to get one of these emails?",
                "well since the supreme court basically put this whole program on judicial hold at about 1am est this morning, this person has extra time to contact the ACLU and get in on the massive class action lawsuit coming. \n\nThis kind of nazi garbage has to be done quickly, now that there are sticks in the spokes, I am optimistic that this can be stopped. \n\nWe are now waiting on the circuit courts rulings and the petition to the sup court from the solicitor general after. \n\nKeep putting the political and social pressure on this admin, and dont let the republicans try to pivot away and make people forget what they did!",
                "I said as soon as he got elected this was coming. I'll put $50 that says inside of a year you see the first native born American citizen sent to El Salvador. \n\n\nThough I will admit they are likely to be some flavor of not white. And Maga will cheer it on.",
                "Welcome to modern fascism, where a computer algorithm randomly picks you out for oppression. Maybe Leon Skum and the DOGE dipshits are behind this, or maybe it's puppy killer Noem's henchmen, but the end result is the same: this administration (regime) is arbitrarily and half-assedly targeting Americans in a blind exercise of pure cruelty.",
                "I swear if they send me an email I’ll never see it. I hardly ever check my email"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Volvo to cut up to 800 US jobs as Trump's tariffs bite",
            "external_url": "https://www.reuters.com/business/autos-transportation/volvo-cut-up-800-us-jobs-trumps-tariffs-bite-2025-04-18/",
            "upvotes": 3140,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this what winning looks like?",
                "Note that this is Volvo AB, the division that builds semi trucks. This is not good news for the freight industry, as there aren't a ton of manufacturers for heavy trucks in the US",
                "NEW YORK, April 18 (Reuters) - Volvo Group plans to lay off as many as 800 workers at three U.S. facilities over the next three months due to market uncertainty and demand concerns in the face of President Donald Trump's tariffs, a spokesperson said on Friday.\nVolvo Group North America said in a statement it has told employees it plans to lay off 550-800 people at its Mack Trucks site in Macungie, Pennsylvania, and two Volvo Group facilities in Dublin, Virginia, and Hagerstown, Maryland.\nThe company, part of Sweden's AB Volvo (VOLVb.ST), opens new tab, employs nearly 20,000 people in North America, according to its website.\nTrump has upended the global trading system that has been in place for over 75 years with a plan for tariffs on products from across the world. His vacillating trade policy has undermined consumer and business confidence, and caused economists to raise their forecasts for a U.S. recession.\nnference\n\nVolvo Group's lay-offs are the latest response from a car and truck industry that is reeling from the Republican president's tariffs on certain parts, which is expected to increase the cost of manufacturing vehicles.\n\"Heavy-duty truck orders continue to be negatively affected by market uncertainty about freight rates and demand, possible regulatory changes, and the impact of tariffs,\" a spokesperson for Volvo Group North America said in an emailed statement.\n\"We regret having to take this action, but we need to align production with reduced demand for our vehicles.\"",
                "I was just listening to some union people happy about tariffs and are ok with higher prices so I'm glad they are getting what they voted for",
                "\"Volvo Group plans to lay off as many as 800 workers at **three U.S. facilities** over the next three months due to market uncertainty and demand concerns in the face of President Donald Trump's tariffs, a spokesperson said on Friday.\"\n\nJust in case you were thinking these were Swedish Volvo workers (not that it would be any better) it's not. It's American workers going out of work on behalf of Donald J. Trump--a man who has never worked for a company that didn't have his own name on it.",
                "I wish it would work out to be 800 trump voters just so they can see consequences for their actions but it will never be that",
                "Don't worry. Over on r/con, it's all about the start of the Revolutionary War. All good 🍻",
                "MAGA, are you tired of winning yet?",
                "Is that how you create in-country jobs?",
                "Inflation up on tariffs, unemployment up cause of the shitty economy, stagflation here we come!"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 13084,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "If not vaccinated [9 out of 10 people will contract measles after being exposed](https://www.cdc.gov/measles/about/index.html). \n\n\nThat doctor is a moron and superspreader.",
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "Are we playing Typhoid Mary again?",
                "RFK should be locked up. He’s a lunatic.",
                "RFK jr. Is the worm in americas brain. ",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point."
            ],
            "aggregate_sentiment": 80.0
        }
    ],
    "last_updated": "04/20/2025 16:08:52 UTC"
}