{
    "posts": [
        {
            "category": "HOT",
            "title": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/",
            "upvotes": 3545,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/38534070-4ac0-48c8-98f7-131bee4a6782/thumbnail/1200x630/d6cab5ed83afe5450cd346e51971c2c0/gettyimages-2200888728.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Best system of justice money, bribes, and favors can buy",
                "Jesus, this is going to go down in the history books as one of the most corrupt cases ever and a highlight of just how bad the justice system in the US has gotten.\n\nThis is another case where the evidence is overwhelming, obvious, and blatant and he gets off scott free.",
                "Crimes are  legal now. Not that it wasn't always better for rich folks but you're getting banana republic levels of corruption now.",
                "Corruption everywhere! God bless America.",
                "To the surprise of absolutely no one",
                "This just sets us on a path where the president, with judicial consent, can decide himself what laws are, and are not, enforceable.",
                ">That means Adams cannot be re-tried on the same charges at a later time - a stipulation the Justice Department sought in its initial request to dismiss the case.\n\nSuch a fucking corrupt administration.",
                ">“Some will undoubtedly find today’s decision unsatisfying, wondering why, if DOJ’s ostensible reasons for dropping this case are so troubling, the Court does not simply deny the Motion to Dismiss altogether. But, as explained above, the Court cannot order DOJ to continue the prosecution, and it is aware of no authority (outside of the criminal contempt context) that would empower it, as some have urged, to appoint an independent prosecutor,” Judge Ho wrote. “Therefore, any decision by this Court to deny the Government’s Motion to Dismiss would be futile at best, because DOJ could—and, by all indications, unequivocally would—simply refuse to prosecute the case, inevitably resulting in a dismissal after seventy days for violating the Mayor’s right to a speedy trial. That route would simply postpone finality in this case to a date uncomfortably close to the June 24 mayoral primary. The public interest would not be served by such an outcome.”\n\nSo basically the judge is saying, “Yes, the reasons DOJ wanted this dismissed are bad, but I can’t force the prosecution to do their jobs, and if I dismiss with prejudice now they can’t hold these charges over the head of an elected official to manipulate them.”. These are the hard choices people have to make when the government has gone rogue and isn’t interested in prosecuting someone who, by all accounts, very obviously took bribes from a foreign government.",
                "Wild open air corruption",
                "New Yorkers are going to replace this guy with a corrupt sex pest that’s part of Bibi’s legal defense team"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US sends three-person disaster response team to earthquake-stricken Myanmar after USAID gutted",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-usaid-cuts-emergency-response/105125224",
            "upvotes": 5464,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2990662b455f59bbc476a59ae6691b22?impolicy=wcms_watermark_news&cropH=2659&cropW=4727&xPos=0&yPos=246&width=862&height=485&imformat=generic",
            "top_comments": [
                "I can imagine them asking the victims to sign a very fair « rescue deal »",
                "That team will most likely be looking for mineral deposits I guess?",
                "at this point you could just stay home",
                "Basically a team of real estate assessor",
                "The Trump administration is disbanding FEMA, so this is more than they intend to send to any domestic disasters as well. \n\n\nThey're a bunch of selfish grifters who realized they had finally consolidated enough power to break the system and suck out the marrow.",
                "Weak and irrelevant also describes the current lame-duck administration in totality.",
                "I hate that our country is embarrassed on a daily basis by Trump.",
                "Well, they took \"soft power\" in a new direction.",
                "I'm stunned they did this much.",
                "This is so sad. I personally worked alongside 150 USAAID firefighters during the 2011 tsunami in Japan. I would know to be highly pissed that their units are no longer being deployed abroad to help those in need, having worked so hard over the decades. All of them were volunteers with regular jobs, ready to go wherever was needed at a drop of hat."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Actor Val Kilmer, star of 'Batman Forever', dies at 65",
            "external_url": "https://www.reuters.com/world/us/actor-val-kilmer-star-batman-forever-dies-65-nyt-reports-2025-04-02/",
            "upvotes": 48553,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I highly recommend his 2020 book called I’m your Huckleberry, I just finished it last month. Since he couldn’t read the audiobook, he had three different people read it for him, including Will Forte from SNL. He really lived a great life. Rest in peace.",
                "I am glad we got to see him star Top Gun 2. He was a fighter and held on for a long time despite a very aggressive and terrible disease. I hope he is now at peace.",
                "Damn. He had so many legendary roles in his career. And great comedic chops as well.",
                "I wondered for months before the movie came out how Iceman would be portrayed in Top Gun 2, since Val’s illness took his voice away. \n\nIt was a pleasant surprise how they did it, and did right by him to honor his character. \n\nOne of my favorites from the 90s growing up. His guest spot on Entourage was a hilarious surprise. \n\nHe will be missed dearly.",
                "Fair winds and following seas, Iceman.",
                "RIP. I'm glad he isn't suffering anymore. he'd been battling cancer for so long",
                "Batman Forever is the one they picked for the headline?",
                "I'm your huckleberry. RIP",
                "Willow. It’s a favorite. What a legend.",
                "He was great in Kiss Kiss Bang Bang"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "HOT",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 1300,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "when you use personality B around group A",
                "You wouldn't download a car, would you?",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk",
            "external_url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353",
            "upvotes": 81289,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Susan-Crawford-Brad-Schimel-CH-1007-8c869d.jpg",
            "top_comments": [
                "So proud of my state today!",
                "And the margin wasn't even close either.\n\nFL two deep red districts, while staying red, also swung 20 points toward the Dem.  People are not happy, period.",
                "Fuck off Elon. We hate you.",
                "Good. Elon's money can't buy everything. ",
                "Hello from Wisconsin. Nearly $100M was poured into this race. It was fucking miserable for all of us. We should all be embarrassed that we have let this happen to our democracy.\n\nFuck oligarchs, fuck big money in politics.",
                "It just feels nice to read a positive headline for once. \n\nCongratulations to Susan, fuck you Elon.",
                "The thought of Elon coping and seething at this brings me great joy",
                "Well now trump is going to go extra nuclear tomorrow with whatever the plan was instead of firing elon for doing a piss poor job.",
                "And Elon spent millions on this race lmao",
                "Imagine being one of the richest people in human history and you still fail to use your unimaginable wealth to blatantly manipulate votes in a state election.\n\nIt's hard for me to think of anyone who has ever existed that is a bigger loser than Elon Musk."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Over 200 passengers sickened with norovirus aboard luxury cruise ship",
            "external_url": "https://abcnews.go.com/US/200-passengers-sickened-norovirus-aboard-cunard-line-cruise/story?id=120387184",
            "upvotes": 1230,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/5f55135a-789f-4424-892e-0e61f30bf452/cunard-1-gty-er-250401_1743541838037_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">According to the federal health agency, every year the norovirus causes between 19 and 21 million illnesses, 109,000 hospitalizations and 900 deaths.\n\nI didn't know it was that many deaths per year.",
                "It’s pretty rough. I’ve been hospitalized with it a time or two, C. Diff too. Caught norovirus from a daycare my stepdaughter worked at. Put me into the hospital for a week.",
                "Viruses spread like wildfire on cruises, and norovirus is stupidly  contagious. I wouldn't wish it on most of the people I dislike, it's truly miserable. Not everyone is going to make it to the bathroom, so yay for trying to sanitize and clean surfaces and laundry.",
                "Not suprised. My coworkers favorite story is about how on his cruise he saw someone not wash his hands after shitting and go straight back to the buffet.",
                "I caught norovirus the morning of December 24th and let me tell everyone it wasn't fun..let's just say firing out of both ends for hours....",
                "This sounds like a literal -- and I do mean a literal nightmare. When I had norovirus I was slightly feverish, no vomitting, but I couldn't be more than 10 steps away from a toilet for 3 days. Take a SINGLE SIP of water... on the toilet within 90 seconds guaranteed. \n\nI lost close to 30lbs in 3 days. I was absolutely miserable. I would take multiple bouts of COVID, flu, strep, etc before I have that again.",
                "That's why they call them \"floating petri dishes.\" There's already been a number of outbreaks this year:\n\n[https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html](https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html)\n\nIt doesn't take much for norovirus to spread on a ship, especially where buffets are served. Just one employee who didn't wash hands properly and pretty soon everyone is shitting and puking.",
                "Wash your hands, people. This shouldn’t be happening",
                "Maybe it's the numbers but \"Norovirus on cruise ship\" is not normally news. I work in a lab near a cruise port and we are constantly getting outbreak samples.",
                "What kind of hell must that be to be stuck on a ship with hundreds of vomiting and \"diarrheaing\" people."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 33202,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 320,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "Jesus christ that name gives me the heebie jeebies.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "This is good news but holy shit is that gross.",
                "Just the name creeps me the f out.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Anyone heard from Matt Gaetz recently?",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Man 'dressed like Trump' terrorizes NJ donut shop",
            "external_url": "https://nj1015.com/pride-flag-incident-matawan-main-street-donuts/",
            "upvotes": 578,
            "date": "04/02/2025",
            "thumbnail": "https://townsquare.media/site/385/files/2025/03/attachment-Main-Street-.jpg?w=1200&q=75&format=natural",
            "top_comments": [
                "\"Donald Trump\" isn't the first thing that comes to mind when I see that getup, but he's definitely got the \"act like a bigoted asshole\" part of the look down.\n\n>The incident unfolded just before noon on Saturday at Main Street Donuts, where police say a man, later identified as 61-year-old Maciej Wojciak, tried to tear down a pride flag from in front of the shop, and damaged the metal bracket.\n\n>While officers were canvassing the area looking for Wojciak, the man allegedly returned to Main Street Donuts where witnesses say he made Nazi gestures, including Nazi salutes, shouting Nazi propaganda, and threatened to burn down the donut shop.",
                "Breaking news: Pam Bondi is seeking the death penalty for the shop owner.",
                "“Dressed like Trump” is a bit of a stretch, though I’m sure that was his intent.  It looked more like a bad cosplay of Carrottop to me.",
                "There was a time when publicly making a \"Nazi gesture\" would get you beaten within an inch of your life.",
                "[61 years old btw](https://townsquare.media/site/385/files/2025/03/attachment-Main-Street-1.jpg?w=1600&q=75)",
                "What a coincidence, someone dressed like trump is terrorizing the entire world.",
                "Is that you, Donald Fieri?",
                "I was expecting a full on Point Break Ex-Presidents get up. Instead it’s a guy in one of those novelty hats that looks like Guy Fieri wearing a MAGA visor, a 2-PAC t-shirt and gold chains.",
                "That is a situation that calls for an ass beating then a call to the cops.",
                "Even though New Jersey is a blue state we are at risk of becoming at least purple because of all the brain dead MAGA cult members who have been inbred for decades.  They really need to just move to Florida and take their ignorance and intolerance with them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Leuven University Hospital suspends gynaecology student that escaped sentencing after having been convicted of rape",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/02/leuven-university-hospital-suspends-gynaecology-student-that-esc/",
            "upvotes": 725,
            "date": "04/02/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2019/12/13/c6f00a1d-1db4-11ea-abcc-02b7b76bf47f.jpg",
            "top_comments": [
                "If he raped the judge, would the judge also just give him a pat on the back and tell him to go live his life, it's all good?",
                "Wow, just wow. Another case of affluenza?",
                "So the student didn't get sentenced, so no criminal record, and he's probably studying gynaecology so he can work with female clients like the predator he is. Pretty transparent to see why he's pursing that field and here we have a judge who's completely fine with letting him get away with raping someone and letting him proceed with that career. This has the smell of corruption all over it.",
                "So... what's this person name? Just curious as I didn't see it in the article and was thinking maybe it'll be kinda like with convicted rapist Brock Allen Turner, who apparently now just goes by Allen Turner.",
                "[deleted]"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 328,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "Jesus christ that name gives me the heebie jeebies.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "This is good news but holy shit is that gross.",
                "Just the name creeps me the f out.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Anyone heard from Matt Gaetz recently?",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 1299,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "when you use personality B around group A",
                "You wouldn't download a car, would you?",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US Supreme Court rejects medical marijuana firm's bid to avoid racketeering suit",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-rejects-medical-marijuana-firms-bid-avoid-racketeering-suit-2025-04-02/",
            "upvotes": 129,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "A little donation has proven to be the cure to this ailment…",
                "If it was a cocaine firm, donny Jr would have been all over it.",
                "They should hot box the capitol building so everyone will chill the f out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/",
            "upvotes": 3544,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/38534070-4ac0-48c8-98f7-131bee4a6782/thumbnail/1200x630/d6cab5ed83afe5450cd346e51971c2c0/gettyimages-2200888728.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Best system of justice money, bribes, and favors can buy",
                "Jesus, this is going to go down in the history books as one of the most corrupt cases ever and a highlight of just how bad the justice system in the US has gotten.\n\nThis is another case where the evidence is overwhelming, obvious, and blatant and he gets off scott free.",
                "Crimes are  legal now. Not that it wasn't always better for rich folks but you're getting banana republic levels of corruption now.",
                "Corruption everywhere! God bless America.",
                "To the surprise of absolutely no one",
                "This just sets us on a path where the president, with judicial consent, can decide himself what laws are, and are not, enforceable.",
                ">That means Adams cannot be re-tried on the same charges at a later time - a stipulation the Justice Department sought in its initial request to dismiss the case.\n\nSuch a fucking corrupt administration.",
                ">“Some will undoubtedly find today’s decision unsatisfying, wondering why, if DOJ’s ostensible reasons for dropping this case are so troubling, the Court does not simply deny the Motion to Dismiss altogether. But, as explained above, the Court cannot order DOJ to continue the prosecution, and it is aware of no authority (outside of the criminal contempt context) that would empower it, as some have urged, to appoint an independent prosecutor,” Judge Ho wrote. “Therefore, any decision by this Court to deny the Government’s Motion to Dismiss would be futile at best, because DOJ could—and, by all indications, unequivocally would—simply refuse to prosecute the case, inevitably resulting in a dismissal after seventy days for violating the Mayor’s right to a speedy trial. That route would simply postpone finality in this case to a date uncomfortably close to the June 24 mayoral primary. The public interest would not be served by such an outcome.”\n\nSo basically the judge is saying, “Yes, the reasons DOJ wanted this dismissed are bad, but I can’t force the prosecution to do their jobs, and if I dismiss with prejudice now they can’t hold these charges over the head of an elected official to manipulate them.”. These are the hard choices people have to make when the government has gone rogue and isn’t interested in prosecuting someone who, by all accounts, very obviously took bribes from a foreign government.",
                "Wild open air corruption",
                "New Yorkers are going to replace this guy with a corrupt sex pest that’s part of Bibi’s legal defense team"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "UK couple's death in New Zealand probed as murder-suicide",
            "external_url": "https://www.bbc.com/news/articles/ce3qyz6dn17o",
            "upvotes": 26,
            "date": "04/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6c46/live/5332daa0-0f99-11f0-b696-d3bfdfb825fc.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Third ex-police officer arrested in Rotherham child sexual exploitation inquiry",
            "external_url": "https://www.theguardian.com/uk-news/2025/apr/02/third-ex-police-officer-arrested-in-rotherham-child-sexual-exploitation-inquiry?utm_source=dlvr.it&utm_medium=bluesky&CMP=bsky_gu",
            "upvotes": 100,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ded7f4363584d05a09102521ebd223cd77369d35/742_122_3325_1995/master/3325.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b50bdaa0a90bc61b85e5627fd179332e",
            "top_comments": [
                "Why is it always the ones you most expect?",
                "What the fuck is wrong with Rotherham‽"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Over 200 passengers sickened with norovirus aboard luxury cruise ship",
            "external_url": "https://abcnews.go.com/US/200-passengers-sickened-norovirus-aboard-cunard-line-cruise/story?id=120387184",
            "upvotes": 1228,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/5f55135a-789f-4424-892e-0e61f30bf452/cunard-1-gty-er-250401_1743541838037_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">According to the federal health agency, every year the norovirus causes between 19 and 21 million illnesses, 109,000 hospitalizations and 900 deaths.\n\nI didn't know it was that many deaths per year.",
                "It’s pretty rough. I’ve been hospitalized with it a time or two, C. Diff too. Caught norovirus from a daycare my stepdaughter worked at. Put me into the hospital for a week.",
                "Viruses spread like wildfire on cruises, and norovirus is stupidly  contagious. I wouldn't wish it on most of the people I dislike, it's truly miserable. Not everyone is going to make it to the bathroom, so yay for trying to sanitize and clean surfaces and laundry.",
                "Not suprised. My coworkers favorite story is about how on his cruise he saw someone not wash his hands after shitting and go straight back to the buffet.",
                "I caught norovirus the morning of December 24th and let me tell everyone it wasn't fun..let's just say firing out of both ends for hours....",
                "This sounds like a literal -- and I do mean a literal nightmare. When I had norovirus I was slightly feverish, no vomitting, but I couldn't be more than 10 steps away from a toilet for 3 days. Take a SINGLE SIP of water... on the toilet within 90 seconds guaranteed. \n\nI lost close to 30lbs in 3 days. I was absolutely miserable. I would take multiple bouts of COVID, flu, strep, etc before I have that again.",
                "That's why they call them \"floating petri dishes.\" There's already been a number of outbreaks this year:\n\n[https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html](https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html)\n\nIt doesn't take much for norovirus to spread on a ship, especially where buffets are served. Just one employee who didn't wash hands properly and pretty soon everyone is shitting and puking.",
                "Wash your hands, people. This shouldn’t be happening",
                "Maybe it's the numbers but \"Norovirus on cruise ship\" is not normally news. I work in a lab near a cruise port and we are constantly getting outbreak samples.",
                "What kind of hell must that be to be stuck on a ship with hundreds of vomiting and \"diarrheaing\" people."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Man 'dressed like Trump' terrorizes NJ donut shop",
            "external_url": "https://nj1015.com/pride-flag-incident-matawan-main-street-donuts/",
            "upvotes": 577,
            "date": "04/02/2025",
            "thumbnail": "https://townsquare.media/site/385/files/2025/03/attachment-Main-Street-.jpg?w=1200&q=75&format=natural",
            "top_comments": [
                "\"Donald Trump\" isn't the first thing that comes to mind when I see that getup, but he's definitely got the \"act like a bigoted asshole\" part of the look down.\n\n>The incident unfolded just before noon on Saturday at Main Street Donuts, where police say a man, later identified as 61-year-old Maciej Wojciak, tried to tear down a pride flag from in front of the shop, and damaged the metal bracket.\n\n>While officers were canvassing the area looking for Wojciak, the man allegedly returned to Main Street Donuts where witnesses say he made Nazi gestures, including Nazi salutes, shouting Nazi propaganda, and threatened to burn down the donut shop.",
                "Breaking news: Pam Bondi is seeking the death penalty for the shop owner.",
                "“Dressed like Trump” is a bit of a stretch, though I’m sure that was his intent.  It looked more like a bad cosplay of Carrottop to me.",
                "There was a time when publicly making a \"Nazi gesture\" would get you beaten within an inch of your life.",
                "[61 years old btw](https://townsquare.media/site/385/files/2025/03/attachment-Main-Street-1.jpg?w=1600&q=75)",
                "What a coincidence, someone dressed like trump is terrorizing the entire world.",
                "Is that you, Donald Fieri?",
                "I was expecting a full on Point Break Ex-Presidents get up. Instead it’s a guy in one of those novelty hats that looks like Guy Fieri wearing a MAGA visor, a 2-PAC t-shirt and gold chains.",
                "That is a situation that calls for an ass beating then a call to the cops.",
                "Even though New Jersey is a blue state we are at risk of becoming at least purple because of all the brain dead MAGA cult members who have been inbred for decades.  They really need to just move to Florida and take their ignorance and intolerance with them."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Leuven University Hospital suspends gynaecology student that escaped sentencing after having been convicted of rape",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/02/leuven-university-hospital-suspends-gynaecology-student-that-esc/",
            "upvotes": 717,
            "date": "04/02/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2019/12/13/c6f00a1d-1db4-11ea-abcc-02b7b76bf47f.jpg",
            "top_comments": [
                "If he raped the judge, would the judge also just give him a pat on the back and tell him to go live his life, it's all good?",
                "Wow, just wow. Another case of affluenza?",
                "So the student didn't get sentenced, so no criminal record, and he's probably studying gynaecology so he can work with female clients like the predator he is. Pretty transparent to see why he's pursing that field and here we have a judge who's completely fine with letting him get away with raping someone and letting him proceed with that career. This has the smell of corruption all over it.",
                "So... what's this person name? Just curious as I didn't see it in the article and was thinking maybe it'll be kinda like with convicted rapist Brock Allen Turner, who apparently now just goes by Allen Turner.",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "US sends three-person disaster response team to earthquake-stricken Myanmar after USAID gutted",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-usaid-cuts-emergency-response/105125224",
            "upvotes": 5463,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2990662b455f59bbc476a59ae6691b22?impolicy=wcms_watermark_news&cropH=2659&cropW=4727&xPos=0&yPos=246&width=862&height=485&imformat=generic",
            "top_comments": [
                "I can imagine them asking the victims to sign a very fair « rescue deal »",
                "That team will most likely be looking for mineral deposits I guess?",
                "at this point you could just stay home",
                "Basically a team of real estate assessor",
                "The Trump administration is disbanding FEMA, so this is more than they intend to send to any domestic disasters as well. \n\n\nThey're a bunch of selfish grifters who realized they had finally consolidated enough power to break the system and suck out the marrow.",
                "Weak and irrelevant also describes the current lame-duck administration in totality.",
                "I hate that our country is embarrassed on a daily basis by Trump.",
                "Well, they took \"soft power\" in a new direction.",
                "I'm stunned they did this much.",
                "This is so sad. I personally worked alongside 150 USAAID firefighters during the 2011 tsunami in Japan. I would know to be highly pissed that their units are no longer being deployed abroad to help those in need, having worked so hard over the decades. All of them were volunteers with regular jobs, ready to go wherever was needed at a drop of hat."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 1312,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "when you use personality B around group A",
                "You wouldn't download a car, would you?",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 330,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "Jesus christ that name gives me the heebie jeebies.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "This is good news but holy shit is that gross.",
                "Just the name creeps me the f out.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Anyone heard from Matt Gaetz recently?",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/",
            "upvotes": 3545,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/38534070-4ac0-48c8-98f7-131bee4a6782/thumbnail/1200x630/d6cab5ed83afe5450cd346e51971c2c0/gettyimages-2200888728.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Best system of justice money, bribes, and favors can buy",
                "Jesus, this is going to go down in the history books as one of the most corrupt cases ever and a highlight of just how bad the justice system in the US has gotten.\n\nThis is another case where the evidence is overwhelming, obvious, and blatant and he gets off scott free.",
                "Crimes are  legal now. Not that it wasn't always better for rich folks but you're getting banana republic levels of corruption now.",
                "Corruption everywhere! God bless America.",
                "To the surprise of absolutely no one",
                "This just sets us on a path where the president, with judicial consent, can decide himself what laws are, and are not, enforceable.",
                ">That means Adams cannot be re-tried on the same charges at a later time - a stipulation the Justice Department sought in its initial request to dismiss the case.\n\nSuch a fucking corrupt administration.",
                ">“Some will undoubtedly find today’s decision unsatisfying, wondering why, if DOJ’s ostensible reasons for dropping this case are so troubling, the Court does not simply deny the Motion to Dismiss altogether. But, as explained above, the Court cannot order DOJ to continue the prosecution, and it is aware of no authority (outside of the criminal contempt context) that would empower it, as some have urged, to appoint an independent prosecutor,” Judge Ho wrote. “Therefore, any decision by this Court to deny the Government’s Motion to Dismiss would be futile at best, because DOJ could—and, by all indications, unequivocally would—simply refuse to prosecute the case, inevitably resulting in a dismissal after seventy days for violating the Mayor’s right to a speedy trial. That route would simply postpone finality in this case to a date uncomfortably close to the June 24 mayoral primary. The public interest would not be served by such an outcome.”\n\nSo basically the judge is saying, “Yes, the reasons DOJ wanted this dismissed are bad, but I can’t force the prosecution to do their jobs, and if I dismiss with prejudice now they can’t hold these charges over the head of an elected official to manipulate them.”. These are the hard choices people have to make when the government has gone rogue and isn’t interested in prosecuting someone who, by all accounts, very obviously took bribes from a foreign government.",
                "Wild open air corruption",
                "New Yorkers are going to replace this guy with a corrupt sex pest that’s part of Bibi’s legal defense team"
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "RISING",
            "title": "Over 200 passengers sickened with norovirus aboard luxury cruise ship",
            "external_url": "https://abcnews.go.com/US/200-passengers-sickened-norovirus-aboard-cunard-line-cruise/story?id=120387184",
            "upvotes": 1229,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/5f55135a-789f-4424-892e-0e61f30bf452/cunard-1-gty-er-250401_1743541838037_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">According to the federal health agency, every year the norovirus causes between 19 and 21 million illnesses, 109,000 hospitalizations and 900 deaths.\n\nI didn't know it was that many deaths per year.",
                "It’s pretty rough. I’ve been hospitalized with it a time or two, C. Diff too. Caught norovirus from a daycare my stepdaughter worked at. Put me into the hospital for a week.",
                "Viruses spread like wildfire on cruises, and norovirus is stupidly  contagious. I wouldn't wish it on most of the people I dislike, it's truly miserable. Not everyone is going to make it to the bathroom, so yay for trying to sanitize and clean surfaces and laundry.",
                "Not suprised. My coworkers favorite story is about how on his cruise he saw someone not wash his hands after shitting and go straight back to the buffet.",
                "I caught norovirus the morning of December 24th and let me tell everyone it wasn't fun..let's just say firing out of both ends for hours....",
                "This sounds like a literal -- and I do mean a literal nightmare. When I had norovirus I was slightly feverish, no vomitting, but I couldn't be more than 10 steps away from a toilet for 3 days. Take a SINGLE SIP of water... on the toilet within 90 seconds guaranteed. \n\nI lost close to 30lbs in 3 days. I was absolutely miserable. I would take multiple bouts of COVID, flu, strep, etc before I have that again.",
                "That's why they call them \"floating petri dishes.\" There's already been a number of outbreaks this year:\n\n[https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html](https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html)\n\nIt doesn't take much for norovirus to spread on a ship, especially where buffets are served. Just one employee who didn't wash hands properly and pretty soon everyone is shitting and puking.",
                "Wash your hands, people. This shouldn’t be happening",
                "Maybe it's the numbers but \"Norovirus on cruise ship\" is not normally news. I work in a lab near a cruise port and we are constantly getting outbreak samples.",
                "What kind of hell must that be to be stuck on a ship with hundreds of vomiting and \"diarrheaing\" people."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US sends three-person disaster response team to earthquake-stricken Myanmar after USAID gutted",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-usaid-cuts-emergency-response/105125224",
            "upvotes": 5465,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2990662b455f59bbc476a59ae6691b22?impolicy=wcms_watermark_news&cropH=2659&cropW=4727&xPos=0&yPos=246&width=862&height=485&imformat=generic",
            "top_comments": [
                "I can imagine them asking the victims to sign a very fair « rescue deal »",
                "That team will most likely be looking for mineral deposits I guess?",
                "at this point you could just stay home",
                "Basically a team of real estate assessor",
                "The Trump administration is disbanding FEMA, so this is more than they intend to send to any domestic disasters as well. \n\n\nThey're a bunch of selfish grifters who realized they had finally consolidated enough power to break the system and suck out the marrow.",
                "Weak and irrelevant also describes the current lame-duck administration in totality.",
                "I hate that our country is embarrassed on a daily basis by Trump.",
                "Well, they took \"soft power\" in a new direction.",
                "I'm stunned they did this much.",
                "This is so sad. I personally worked alongside 150 USAAID firefighters during the 2011 tsunami in Japan. I would know to be highly pissed that their units are no longer being deployed abroad to help those in need, having worked so hard over the decades. All of them were volunteers with regular jobs, ready to go wherever was needed at a drop of hat."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Leuven University Hospital suspends gynaecology student that escaped sentencing after having been convicted of rape",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/02/leuven-university-hospital-suspends-gynaecology-student-that-esc/",
            "upvotes": 722,
            "date": "04/02/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2019/12/13/c6f00a1d-1db4-11ea-abcc-02b7b76bf47f.jpg",
            "top_comments": [
                "If he raped the judge, would the judge also just give him a pat on the back and tell him to go live his life, it's all good?",
                "Wow, just wow. Another case of affluenza?",
                "So the student didn't get sentenced, so no criminal record, and he's probably studying gynaecology so he can work with female clients like the predator he is. Pretty transparent to see why he's pursing that field and here we have a judge who's completely fine with letting him get away with raping someone and letting him proceed with that career. This has the smell of corruption all over it.",
                "So... what's this person name? Just curious as I didn't see it in the article and was thinking maybe it'll be kinda like with convicted rapist Brock Allen Turner, who apparently now just goes by Allen Turner.",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Man 'dressed like Trump' terrorizes NJ donut shop",
            "external_url": "https://nj1015.com/pride-flag-incident-matawan-main-street-donuts/",
            "upvotes": 575,
            "date": "04/02/2025",
            "thumbnail": "https://townsquare.media/site/385/files/2025/03/attachment-Main-Street-.jpg?w=1200&q=75&format=natural",
            "top_comments": [
                "\"Donald Trump\" isn't the first thing that comes to mind when I see that getup, but he's definitely got the \"act like a bigoted asshole\" part of the look down.\n\n>The incident unfolded just before noon on Saturday at Main Street Donuts, where police say a man, later identified as 61-year-old Maciej Wojciak, tried to tear down a pride flag from in front of the shop, and damaged the metal bracket.\n\n>While officers were canvassing the area looking for Wojciak, the man allegedly returned to Main Street Donuts where witnesses say he made Nazi gestures, including Nazi salutes, shouting Nazi propaganda, and threatened to burn down the donut shop.",
                "Breaking news: Pam Bondi is seeking the death penalty for the shop owner.",
                "“Dressed like Trump” is a bit of a stretch, though I’m sure that was his intent.  It looked more like a bad cosplay of Carrottop to me.",
                "There was a time when publicly making a \"Nazi gesture\" would get you beaten within an inch of your life.",
                "[61 years old btw](https://townsquare.media/site/385/files/2025/03/attachment-Main-Street-1.jpg?w=1600&q=75)",
                "What a coincidence, someone dressed like trump is terrorizing the entire world.",
                "Is that you, Donald Fieri?",
                "I was expecting a full on Point Break Ex-Presidents get up. Instead it’s a guy in one of those novelty hats that looks like Guy Fieri wearing a MAGA visor, a 2-PAC t-shirt and gold chains.",
                "That is a situation that calls for an ass beating then a call to the cops.",
                "Even though New Jersey is a blue state we are at risk of becoming at least purple because of all the brain dead MAGA cult members who have been inbred for decades.  They really need to just move to Florida and take their ignorance and intolerance with them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Germany seeking to deport two Irish citizens for taking part in pro-Palestine protests",
            "external_url": "https://www.thejournal.ie/germany-seeking-to-deport-two-irish-citizens-for-taking-part-in-pro-palestine-protests-6665056-Apr2025/",
            "upvotes": 662,
            "date": "04/02/2025",
            "thumbnail": "https://img2.thejournal.ie/article/6665056/river/?height=400&version=6665057",
            "top_comments": [
                "According to \"Der Tagesspiegel\"\n\n\n> The charges include resisting law enforcement officers after dispersing demonstrations, insults, particularly serious breach of the peace and the use of signs of terrorist organisations, including the slogan \"From the River to the Sea\". According to the accusation of the immigration authorities, all of the individuals are members of a violent group from the pro-Palestinian scene, said the court spokeswoman.\n\n\nTranslated with DeepL\n\n\nArticle:\nhttps://www.tagesspiegel.de/berlin/nach-beteiligung-an-palastina-protesten-in-berlin-drei-eu-burgern-und-einem-studenten-aus-den-usa-droht-ausweisung-13468543.html",
                "[removed]",
                "You can't trust headlines these days.",
                "How can Germany be ok with genocide after their history? I would think of all nations and the citizens within that nation they would be the first to oppose what’s happening in Palestine. Terrifying how Fascism is taking up power again all over the globe.",
                "\"Trump is such barbaric to deport anyone just because their skin! That's why we just deport people who upsets Israel\"",
                "[removed]",
                "The era of allowing foreign citizens to be a part of politics is ending. \n\nThe reality is that you don't have a right to participate in politics in countries in which you are not a citizen, that's literally the point of citizenship.",
                "might be time to start donning the guy fawkes masks.",
                "[deleted]"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Actor Val Kilmer, star of 'Batman Forever', dies at 65",
            "external_url": "https://www.reuters.com/world/us/actor-val-kilmer-star-batman-forever-dies-65-nyt-reports-2025-04-02/",
            "upvotes": 48555,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I highly recommend his 2020 book called I’m your Huckleberry, I just finished it last month. Since he couldn’t read the audiobook, he had three different people read it for him, including Will Forte from SNL. He really lived a great life. Rest in peace.",
                "I am glad we got to see him star Top Gun 2. He was a fighter and held on for a long time despite a very aggressive and terrible disease. I hope he is now at peace.",
                "Damn. He had so many legendary roles in his career. And great comedic chops as well.",
                "I wondered for months before the movie came out how Iceman would be portrayed in Top Gun 2, since Val’s illness took his voice away. \n\nIt was a pleasant surprise how they did it, and did right by him to honor his character. \n\nOne of my favorites from the 90s growing up. His guest spot on Entourage was a hilarious surprise. \n\nHe will be missed dearly.",
                "Fair winds and following seas, Iceman.",
                "RIP. I'm glad he isn't suffering anymore. he'd been battling cancer for so long",
                "Batman Forever is the one they picked for the headline?",
                "I'm your huckleberry. RIP",
                "Willow. It’s a favorite. What a legend.",
                "He was great in Kiss Kiss Bang Bang"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk",
            "external_url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353",
            "upvotes": 81298,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Susan-Crawford-Brad-Schimel-CH-1007-8c869d.jpg",
            "top_comments": [
                "So proud of my state today!",
                "And the margin wasn't even close either.\n\nFL two deep red districts, while staying red, also swung 20 points toward the Dem.  People are not happy, period.",
                "Fuck off Elon. We hate you.",
                "Good. Elon's money can't buy everything. ",
                "Hello from Wisconsin. Nearly $100M was poured into this race. It was fucking miserable for all of us. We should all be embarrassed that we have let this happen to our democracy.\n\nFuck oligarchs, fuck big money in politics.",
                "It just feels nice to read a positive headline for once. \n\nCongratulations to Susan, fuck you Elon.",
                "The thought of Elon coping and seething at this brings me great joy",
                "Well now trump is going to go extra nuclear tomorrow with whatever the plan was instead of firing elon for doing a piss poor job.",
                "And Elon spent millions on this race lmao",
                "Imagine being one of the richest people in human history and you still fail to use your unimaginable wealth to blatantly manipulate votes in a state election.\n\nIt's hard for me to think of anyone who has ever existed that is a bigger loser than Elon Musk."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/02/2025 16:10:30 UTC"
}