{
    "posts": [
        {
            "category": "HOT",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 7050,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "Not calling her crown princess is weird.",
                "They forgot to exempt white girls",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "Please let this become an international incident."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 27894,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "Trump's vendetta against Harvard is deeply disturbing",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "at this point just start revoking any of trump's crones ivy league diploma starting with JD. it wont do anything, but it would massively hurt their egos.",
                "Did Havard reject Baron or something?",
                "NAL but I don't see how singling out a school for a ban like this could possibly be legal.",
                "Trump throwing darts at the board.  Flooding the zone so his funding bill doesn't get extra scrutiny.  There's a provision buried in there limiting the authority of the judicial branch.  Of course, MSM will just focus on Harvard and tariffs.  All part of the plan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 3323,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Please save the whales and the dolphins. These non-human persons should not be kept isolated and enclosed.",
                "Man, where's the Mexican space program when you need it.",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Justice Department reaches deal to allow Boeing to avoid prosecution over 737 Max crashes | AP News",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-9f7250a2e2b400b31e19f2b261f78163",
            "upvotes": 1306,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Let me show you my shocked face: 😐",
                "\"The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer. The deal still needs to be finalized.\" How much did they give Trump and his family?",
                "2025 America: corporate crime is now legal and we're done pretending",
                " Justice in Murica.  Bribe the Comrade Cheeto and walk away.",
                "I'm a lawyer, and I'm no spring chicken on how the world works. Even so, I'm never any less disgusted and shocked that murder in this country is legal if you do it from a conference room. \n\n\nBoeing murdered 346 people for a marketing strategy. ",
                "Sounds like someone’s bribe check cleared",
                "The “Justice” department",
                "I bet my left arm this is the 1.1 billion they're going to use to retrofit the Qatari jet. Un fucking believable...",
                "Just Remember Everybody the Supreme Court Said Bribery was legal so long as you get paid after the judgement :)",
                "DOJ being compromised like this is INSANE. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Twelve injured in knife attack at Hamburg railway station",
            "external_url": "https://www.bbc.co.uk/news/articles/cm26v7n5y4eo",
            "upvotes": 1459,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e23e/live/a550d960-3800-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                ">This is the latest violent attack in Germany in recent months.\n\nthats certainly a statement",
                "For an incident like this to happen during rush hour it could have been much worse.",
                "*A spokesman for the Hamburg fire department told Agence France-Presse (AFP) that 12 people had been injured in the attack. Among them were \"six people with life-threatening injuries,\" the spokesman said.*\n\nThis account makes the attack more deadly than the earlier one",
                "Women in male dominated fields",
                "I assume interest in this will magically disappear when people find out it was a 39 y.o. woman",
                "A few people in the comments failing to remember the phrase “don’t bring a knife to a gunfight”.\n\nPeople hellbent on causing harm will find a way, if she had a gun there would be fatalities and probably many more lives affected.",
                "How could the knife do this??",
                "[deleted]",
                "Silly countries and their gun control. Don't they know they could have more dead citizens, even dead school children, if they didn't limit psychos to knives?!",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Record beef prices raise Memorial Day cookout costs",
            "external_url": "https://www.reuters.com/world/us/record-beef-prices-raise-memorial-day-cookout-costs-2025-05-23/",
            "upvotes": 880,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nuh uh. Facebook told me prices for everything is waaaayyyy down.",
                "> Ground chuck prices in April reached a record $6 per pound, up 14% from a year ago, after farmers slashed their cattle herds to a 74-year low due to a years-long drought that reduced grazing lands.\n\nNo, there is no climate change, let's remove all environmental protection laws. And *DRILL*!",
                "A year ago, this would get 24-7 breathless news coverage on every cable outlet.",
                "This is what we (as a country) get for electing an old fool with dementia to be President.",
                "When can we expect the stupid graphics like Fox News has done for Thanksgiving?",
                "What do you mean? \n\nGroceries including beef are at an all time low. Everyone is saying it. We have the most beautiful prices in the world. Maybe ever. They come up to me and say \"sir, thank you for the lowest prices we've ever seen\".",
                "Beef quality in America has dropped SO MUCH in the last 20 years, its all garbage now, and prices climb. I saw a 4 pack of ribeyes at costco for $80 a couple weeks ago and its the same quality as Wal-Mart steak.",
                "This thread is so full of cynicism!  I didn’t come here to hear people blame the President.  I came here to get suggestions for alternative meats to eat since I can’t afford beef.  Llama, raccoon, shrew meat?  I’ve never eaten a snake before but I bet I could catch one by the lake.",
                "Looks like meats back OFF the menu boys!",
                "The joke is on them. I'm not grilling shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Arizona hiker Hannah Moody's body found off trail day after she was reported missing",
            "external_url": "https://www.cbsnews.com/news/arizona-hiker-hannah-moody-body-found-day-after-reported-missing/",
            "upvotes": 3766,
            "date": "05/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/23/107aed1a-2e93-45c7-8eb8-1c8131429a1f/thumbnail/1200x630/f4a0c770f4fd4f736d45091011844477/hannah-moody-640x360.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "According to Scottsdale police, Moody's body was spotted at about 12:05 p.m. near the Gateway Trailhead of the McDowell Sonoran Preserve in Scottsdale. She was first reported missing at around 7:50 the evening before by friends who got concerned because they hadn't heard from her.",
                "Last fall I read \"The Heat Will Kill You First,\" which is mostly about climate change but uses the incredibly sad story of a family that died (dad, mom, baby, and their dog) during a hike on a hot day as an example of what heat does to the human body. It sounds like one of the worst ways to go.\n\nDo not underestimate heat!",
                "I once took a friend on a hike near Tucson, around this time of year. They showed up with one of those airplane water bottles, maybe 6 ounces of water. People have no clue the risks they take with their lives sometimes.",
                "A couple of years ago I got really dehydrated working all day outside in July. Cleaned up, went to a party and drank a lot of beer, woke the next morning and chugged a big glass of ice water. This apparently stimulated my Vagus Nerve, and sent me into fibrillation. I ended up in the ER, got to experience a cardioversion procedure. \n\nIt doesn't matter how tough you think you are - don't fuck around with dehydration.",
                "It gets brutally hot . \n\nWe have people out in 90 to 100+ degree weather, heavily exerting themselves, passing out, not bringing any water let alone enough, and often refuse to seek medical treatment.\nBack at it the next day.\n\nMistakes are made.",
                "I live in the desert and drive a pick up truck.  I always keep an unopened gallon of water in my bed.  We have homeless so it gets \"stolen\" a couple of times a week.  I'll continue doing it because heat kills.  I'll pay the $1.50 to ensure someone gets hydrated and is less likely to die.",
                "First dead hiker means it’s officially summer. This happens all summer every year. Kids, elderly, people from out of state. You cannot imagine the brutality of the heat if you haven’t experienced it.",
                "Local news here said she claimed to have 5 gallons of water with her for that hike. Thats over 40 lbs of just water alone, at what point does that actual water weight work against you in this 100+ heat",
                "Sometimes it's the case that they : \nOverestimate their ability to withstand the heat.\nOverestimate their ability to handle the terrain.\n\nAnd in-between these two endpoints, some combination.\n\nUnderappreciation of the elements  and  then perhaps a rather exaggerated belief in their abilities. \nSometimes poor prep. No compass   no cellphone, low charge on cell phone. \n\nMyself, I'm not in great shape anymore and I know that I'm disorganized. I don't hike. I get lost easily.  I'm more likely to die by pulling a box from the shelf in my closet.",
                "May she rest in peace. The stories of hikers who accidentally get lost are so heartbreaking to hear about."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 20176,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "Yup this is really life.",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "It is truly unfathomable that key positions in the government are being filled by people who don’t even know the jobs description.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "The hard to believe part is common Maga followers still trusting Trump."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Skeletal remains found on New Jersey beaches decades ago identified as captain of doomed 19th-century ship",
            "external_url": "https://www.cbsnews.com/news/investigative-genetic-genealogy-captain-identified-new-jersey-ramapo/",
            "upvotes": 1178,
            "date": "05/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/23/67c8e097-cd1c-4d20-930c-9e613023593e/thumbnail/1200x630g2/9d9f0b1813a8a24cfe8a656f87f2f3d2/ship-image001-1.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "129 years at sea. Found by students. Confirmed by DNA. That’s not just science, but that’s storytelling at its finest. \n\nHuge credit to those Ramapo students and NJSP. They gave a name back to someone lost for generations and gave his family something they never thought they’d get: closure.",
                ">Skeletal remains found on New Jersey beaches decades ago have been identified as those of a 19th-century schooner captain, thanks to the investigative efforts of college students. \n\n>The ship, the Oriental, sank in 1844. The schooner was transporting 60 tons of marble from Connecticut to Philadelphia to be used in the construction of Girard College, which still operates today. The ship likely sprung a leak, according to a [news release announcing the identification](https://www.ramapo.edu/news/press-releases/bone-fragments-found-on-new-jersey-beaches-linked-to-19th-century-shipwreck/) of the remains, and sank off the coast of Brigantine Shoal. All five crew members aboard the ship died. \n\n>The skeletal remains, including a skull, were found on a number of South Jersey beaches between 1995 and 2013. The set of remains became known as \"Scattered Man John Doe.\" Police efforts to identify the bones failed. \n\n>In 2023, the New Jersey State Police partnered with Ramapo College's Investigative Genetic Genealogy Center. A sample from the bones was uploaded to genetic genealogy company Intermountain Forensics, which submitted it to DNA matching sites in February 2024. Meanwhile, students at Ramapo used the profile for research.\n\n>They found ancestry matches dating back to the 1600s, including genetic relatives from Connecticut. For the next year, students continued to find ties to Connecticut, and eventually they started looking at shipwrecks off the coast of New Jersey. They came upon two articles about the sinking of the Oriental. One [article](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/image001-1.png) named the crew members aboard at the time of the sinking and [another](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/unnamed.png) detailed the wreck itself. \n\n>\"The storm was so tremendous that no help could be given from the shore,\" said the article, which was published in the Boston Daily Bee in December 1844 and described an account from a Connecticut publication. \n\n>According to the article, one crew member was \"decently buried\" after his \"corpse was thrown on the shore.\" No other bodies were discovered immediately after the sinking. \n\nCreepy story, considering the ship sank in 1844 and remains were found between 1995 and 2013. Great work by the students; they were able to identify the captain and can now give him a proper burial.",
                "I was one of students who worked this case as a team lead! So grateful to be part of Ramapo’s program and give Henry his name back!",
                "Fair winds and following seas.",
                "19th Century \"Major Tom\" (Captain Tom?) finally made it home.",
                "It's good news when you think about it. When you find human bones, better a 19th century sea captain than a murder victim. That's a really cool find!",
                "Timely episode of Ologies this week! It's about shipwrecks. \n\nhttps://pca.st/episode/919e135b-7d30-48c0-aaa5-457b6aedb82d",
                "I wonder if these remains were the ones \"decently buried\"?  Would seem likely that a \"decently buried\" corpse might be buried slightly inland.  Over the years the shoreline probably eroded until the bones became exposed and found by passers-by.  I would think that a simple drowned person in the sea might wash ashore, but being in the intertidal zone is pretty hard on a body and it would have disintegrated and eroded away many decades prior.  Just my guess.",
                "may your bones bleach in the sands."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russian group 'Qilin' demands ransom by next week, City of Abilene refuses to pay",
            "external_url": "https://ktxs.com/news/local/russian-group-qilin-demands-ransom-by-may-27-city-of-abilene-refuses-to-pay",
            "upvotes": 837,
            "date": "05/23/2025",
            "thumbnail": "https://ktxs.com/resources/media2/16x9/640/986/0x60/90/2bd7d544-d83c-4b9f-8511-73eaa502f6a0-AbileneMunicipalCourt.jpg",
            "top_comments": [
                "Where are Trump's great security experts? Sobering up or on a verbal high note about Biden's failures?",
                "My retirement plan is to accept that my identity will eventually get stolen.",
                "Launch a counter hacking in response and demand ransom too. We will see who outsmarts who. Oh wait, I forgot, all the experts at the FBI have been gutted, oh well,.... there goes any cyber security the US had.",
                "I don't understand how this keeps happening - everyone knows their data is under threat. \n\nMy company is tiny in comparison yet I keep 3 complete data backups, one recent (made monthly), one 365 day old and one a copy of my original clean install from more than a decade ago; if I'm hacked I can tell them to go F themselves.",
                "As long as Trump gets a cut of whatever these Russian hackers take in, he’ll look the other way.",
                "Abilene TX?  You can keep it, Russia. \n\n😉",
                "Trump halted all US Cyber Command activities against Russia a few months ago.  It opened the door for more state-sponsored activities like this from Russia.  Oh well.  Despite losing our democracy to an obvious Russian asset, it could be much worse…. We could have a competent and qualified black woman as President.   Yikes!",
                "\"We'll just going to have to let them have whatever they want so that we don't escalate anything\"\n\n-Orange turd man probably",
                "And Trump just ended the federal funding provided to the states for cyber security",
                "Most places not run by complete idiots have ransomware insurance for this and it’s a very quick resolution."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Low-cost airlines to debut standing-only seats in 2026",
            "external_url": "https://euroweeklynews.com/2025/05/21/low-cost-airlines-to-launch-standing-only-seats-in-2026/",
            "upvotes": 2,
            "date": "05/23/2025",
            "thumbnail": "https://cdn.euroweeklynews.com/wp-content/uploads/2025/05/standing-only-seats.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Justice Department reaches deal to allow Boeing to avoid prosecution over 737 Max crashes | AP News",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-9f7250a2e2b400b31e19f2b261f78163",
            "upvotes": 1302,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Let me show you my shocked face: 😐",
                "\"The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer. The deal still needs to be finalized.\" How much did they give Trump and his family?",
                "2025 America: corporate crime is now legal and we're done pretending",
                " Justice in Murica.  Bribe the Comrade Cheeto and walk away.",
                "I'm a lawyer, and I'm no spring chicken on how the world works. Even so, I'm never any less disgusted and shocked that murder in this country is legal if you do it from a conference room. \n\n\nBoeing murdered 346 people for a marketing strategy. ",
                "Sounds like someone’s bribe check cleared",
                "The “Justice” department",
                "I bet my left arm this is the 1.1 billion they're going to use to retrofit the Qatari jet. Un fucking believable...",
                "Just Remember Everybody the Supreme Court Said Bribery was legal so long as you get paid after the judgement :)",
                "DOJ being compromised like this is INSANE. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 3318,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Please save the whales and the dolphins. These non-human persons should not be kept isolated and enclosed.",
                "Man, where's the Mexican space program when you need it.",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Record beef prices raise Memorial Day cookout costs",
            "external_url": "https://www.reuters.com/world/us/record-beef-prices-raise-memorial-day-cookout-costs-2025-05-23/",
            "upvotes": 880,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nuh uh. Facebook told me prices for everything is waaaayyyy down.",
                "> Ground chuck prices in April reached a record $6 per pound, up 14% from a year ago, after farmers slashed their cattle herds to a 74-year low due to a years-long drought that reduced grazing lands.\n\nNo, there is no climate change, let's remove all environmental protection laws. And *DRILL*!",
                "A year ago, this would get 24-7 breathless news coverage on every cable outlet.",
                "This is what we (as a country) get for electing an old fool with dementia to be President.",
                "When can we expect the stupid graphics like Fox News has done for Thanksgiving?",
                "What do you mean? \n\nGroceries including beef are at an all time low. Everyone is saying it. We have the most beautiful prices in the world. Maybe ever. They come up to me and say \"sir, thank you for the lowest prices we've ever seen\".",
                "Beef quality in America has dropped SO MUCH in the last 20 years, its all garbage now, and prices climb. I saw a 4 pack of ribeyes at costco for $80 a couple weeks ago and its the same quality as Wal-Mart steak.",
                "This thread is so full of cynicism!  I didn’t come here to hear people blame the President.  I came here to get suggestions for alternative meats to eat since I can’t afford beef.  Llama, raccoon, shrew meat?  I’ve never eaten a snake before but I bet I could catch one by the lake.",
                "Looks like meats back OFF the menu boys!",
                "The joke is on them. I'm not grilling shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "12 people injured in stabbing at Hamburg train station, authorities say",
            "external_url": "https://apnews.com/article/stabbing-hamburg-train-station-aa0c9d31a07e6055cf465986cbe578d0",
            "upvotes": 105,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*A spokesman for the Hamburg fire department told Agence France-Presse (AFP) that 12 people had been injured in the attack. Among them were \"six people with life-threatening injuries,\" the spokesman said.*\n\nA serious knife attack--given this many grave injuries.",
                "So how/what/why - happened? I assume German news are filtered and hiding the truth...",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Twelve injured in knife attack at Hamburg railway station",
            "external_url": "https://www.bbc.co.uk/news/articles/cm26v7n5y4eo",
            "upvotes": 1454,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e23e/live/a550d960-3800-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                ">This is the latest violent attack in Germany in recent months.\n\nthats certainly a statement",
                "For an incident like this to happen during rush hour it could have been much worse.",
                "*A spokesman for the Hamburg fire department told Agence France-Presse (AFP) that 12 people had been injured in the attack. Among them were \"six people with life-threatening injuries,\" the spokesman said.*\n\nThis account makes the attack more deadly than the earlier one",
                "Women in male dominated fields",
                "I assume interest in this will magically disappear when people find out it was a 39 y.o. woman",
                "A few people in the comments failing to remember the phrase “don’t bring a knife to a gunfight”.\n\nPeople hellbent on causing harm will find a way, if she had a gun there would be fatalities and probably many more lives affected.",
                "How could the knife do this??",
                "[deleted]",
                "Silly countries and their gun control. Don't they know they could have more dead citizens, even dead school children, if they didn't limit psychos to knives?!",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 7037,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "Not calling her crown princess is weird.",
                "They forgot to exempt white girls",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "Please let this become an international incident."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Skeletal remains found on New Jersey beaches decades ago identified as captain of doomed 19th-century ship",
            "external_url": "https://www.cbsnews.com/news/investigative-genetic-genealogy-captain-identified-new-jersey-ramapo/",
            "upvotes": 1177,
            "date": "05/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/23/67c8e097-cd1c-4d20-930c-9e613023593e/thumbnail/1200x630g2/9d9f0b1813a8a24cfe8a656f87f2f3d2/ship-image001-1.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "129 years at sea. Found by students. Confirmed by DNA. That’s not just science, but that’s storytelling at its finest. \n\nHuge credit to those Ramapo students and NJSP. They gave a name back to someone lost for generations and gave his family something they never thought they’d get: closure.",
                ">Skeletal remains found on New Jersey beaches decades ago have been identified as those of a 19th-century schooner captain, thanks to the investigative efforts of college students. \n\n>The ship, the Oriental, sank in 1844. The schooner was transporting 60 tons of marble from Connecticut to Philadelphia to be used in the construction of Girard College, which still operates today. The ship likely sprung a leak, according to a [news release announcing the identification](https://www.ramapo.edu/news/press-releases/bone-fragments-found-on-new-jersey-beaches-linked-to-19th-century-shipwreck/) of the remains, and sank off the coast of Brigantine Shoal. All five crew members aboard the ship died. \n\n>The skeletal remains, including a skull, were found on a number of South Jersey beaches between 1995 and 2013. The set of remains became known as \"Scattered Man John Doe.\" Police efforts to identify the bones failed. \n\n>In 2023, the New Jersey State Police partnered with Ramapo College's Investigative Genetic Genealogy Center. A sample from the bones was uploaded to genetic genealogy company Intermountain Forensics, which submitted it to DNA matching sites in February 2024. Meanwhile, students at Ramapo used the profile for research.\n\n>They found ancestry matches dating back to the 1600s, including genetic relatives from Connecticut. For the next year, students continued to find ties to Connecticut, and eventually they started looking at shipwrecks off the coast of New Jersey. They came upon two articles about the sinking of the Oriental. One [article](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/image001-1.png) named the crew members aboard at the time of the sinking and [another](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/unnamed.png) detailed the wreck itself. \n\n>\"The storm was so tremendous that no help could be given from the shore,\" said the article, which was published in the Boston Daily Bee in December 1844 and described an account from a Connecticut publication. \n\n>According to the article, one crew member was \"decently buried\" after his \"corpse was thrown on the shore.\" No other bodies were discovered immediately after the sinking. \n\nCreepy story, considering the ship sank in 1844 and remains were found between 1995 and 2013. Great work by the students; they were able to identify the captain and can now give him a proper burial.",
                "I was one of students who worked this case as a team lead! So grateful to be part of Ramapo’s program and give Henry his name back!",
                "Fair winds and following seas.",
                "19th Century \"Major Tom\" (Captain Tom?) finally made it home.",
                "It's good news when you think about it. When you find human bones, better a 19th century sea captain than a murder victim. That's a really cool find!",
                "Timely episode of Ologies this week! It's about shipwrecks. \n\nhttps://pca.st/episode/919e135b-7d30-48c0-aaa5-457b6aedb82d",
                "I wonder if these remains were the ones \"decently buried\"?  Would seem likely that a \"decently buried\" corpse might be buried slightly inland.  Over the years the shoreline probably eroded until the bones became exposed and found by passers-by.  I would think that a simple drowned person in the sea might wash ashore, but being in the intertidal zone is pretty hard on a body and it would have disintegrated and eroded away many decades prior.  Just my guess.",
                "may your bones bleach in the sands."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New Stalin monument in Moscow subway stirs debate",
            "external_url": "https://www.cnn.com/2025/05/23/style/joseph-stalin-monument-moscow-metro-intl-scli",
            "upvotes": 513,
            "date": "05/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214572535.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A monument to [Soviet](https://www.cnn.com/2023/02/06/europe/ukraine-famine-survivor-intl) dictator [Joseph Stalin](https://www.cnn.com/style/article/stalin-moscow-architecture) erected in [Moscow’s](https://www.cnn.com/2025/05/06/europe/ukraine-drones-moscow-may-9-xi-intl-hnk) subway is stirring debate, with some Russians welcoming it as a historical tribute, but others saying it’s a mistake to commemorate someone who presided over so much suffering.\n\n>The life-size wall sculpture in Moscow’s Taganskaya metro station depicts Stalin standing on Moscow’s Red Square surrounded by a crowd of Soviet citizens looking at him in admiration, and is a recreation of a monument that was unveiled in the same station in 1950, three years before Stalin died.\n\n>The Moscow metro said that the original monument to Stalin had been “lost” in 1966 when the Taganskaya metro station hosting it had been reconfigured.\n\n>Nearly 700,000 people were executed in Stalin’s 1937-38 Great Terror amid show trials and purges of his real and perceived enemies. Many other Soviet citizens were sent to the gulag, a grim network of prison camps, spread across the world’s largest country.\n\n>The Moscow metro said in a statement that the new version of the monument, which was presented to the public on May 15, was one of its “gifts” to passengers to mark the 90th anniversary of the sprawling, ornate and famously efficient transportation system.\n\n>The work’s original title, “Gratitude of the People to the Leader and Commander,” was dedicated to Stalin’s role in delivering victory for the Soviet Union in World War II, the 80th anniversary of which Russia [marked with pomp this year](https://www.cnn.com/2025/05/09/europe/russia-victory-day-parade-intl-hnk).\n\n>“This man (Stalin), he created a lot,” said Yevgeny Ivanov, a Moscow resident, who had come to look at the new monument on Wednesday. “He has something to be proud of. And it is not for us to tear it down. A man did something - we must respect what he did.”\n\n>Kirill Frolov, another resident of the capital, said he accepted that Stalin’s record was mixed and that you couldn’t call him “good.”\n\nPutin won't mind bringing back the tyrants of the past.",
                "Commemorating the guy who did the purges and killed close to 1 million people. Russia is something else",
                "If you put up a statue of Churchill in UK or US no one would bat an eye despite millions of dead Bangladeshis",
                "They keep installing those in Ukraine occupied territories as well. The Russian Soviet Empire idol of gobbunism to mark their territory",
                "*”Stirs debate”* \n\nWhat kind of tepid “both sides have equally valid arguments” reporting is this? It’s OK to take a side on this one CNN and call it what it is. \n\n*Stalin’s record was mixed*\n\nWell, an “Açaí Berry & Dog Turds Smoothie” is also mixed, and packed full of vitamins and anti-oxidants. That still doesn’t mean you should still drink it everyday for breakfast.",
                "It should stir vandalism.",
                "I can use this post to spread some interesting knowledge about early years of Stalin 🙂 Young years the most successful operation that showed his organisational capabilities was robbery of Tiflis Bank 1907, he excelled at extortion, kidnapping, assassination, arson, bank robbery and thuggery. \n\nHis participation in communist movement was mostly due to ”political prisoners” were punished rather lightly than regular criminals. In his 1913 to 1916 Siberian exile as “political” he was living with real political communist Yakov Sverdlov, which he was constantly bullying and scoffing for his “clean look and behaviour” he got the dog and called it “Yashka” to piss off Yakov. His saying about Yakov “This clean spitter is so annoying and all his stupidity of washing dishes is laughable, I am much smarter than he is, I’m putting all my plates under bed and Yashka licking them white clean for me”\n\nYakov eventually moved away in another house,  and Stalin took the 14-year-old girl orphan from that village, abusing her about 2 years until his term ended. But Soviet party members pedofilism is another topic, Russian Olympic gymnasts and Balet schools, Kremlin stuff were well-known suppliers of underaged girls, for e.g. Beria",
                "Louis C.K. has a great tale of the time he traveled to Russia, highlight of the trip was the subway.\nFuck Stalin",
                "It says everything about present day Russia that they recreate a monument for one of history's most evil men. A man responsible for building one of the most paranoid dictatorships on earth, directly responsible for the untimely death of literally millions of men, women and children.",
                "Free public urinal in the Moscow Subway"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 27896,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "Trump's vendetta against Harvard is deeply disturbing",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "at this point just start revoking any of trump's crones ivy league diploma starting with JD. it wont do anything, but it would massively hurt their egos.",
                "Did Havard reject Baron or something?",
                "NAL but I don't see how singling out a school for a ban like this could possibly be legal.",
                "Trump throwing darts at the board.  Flooding the zone so his funding bill doesn't get extra scrutiny.  There's a provision buried in there limiting the authority of the judicial branch.  Of course, MSM will just focus on Harvard and tariffs.  All part of the plan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Justice Department reaches deal to allow Boeing to avoid prosecution over 737 Max crashes | AP News",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-9f7250a2e2b400b31e19f2b261f78163",
            "upvotes": 1301,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Let me show you my shocked face: 😐",
                "\"The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer. The deal still needs to be finalized.\" How much did they give Trump and his family?",
                "2025 America: corporate crime is now legal and we're done pretending",
                " Justice in Murica.  Bribe the Comrade Cheeto and walk away.",
                "I'm a lawyer, and I'm no spring chicken on how the world works. Even so, I'm never any less disgusted and shocked that murder in this country is legal if you do it from a conference room. \n\n\nBoeing murdered 346 people for a marketing strategy. ",
                "Sounds like someone’s bribe check cleared",
                "The “Justice” department",
                "I bet my left arm this is the 1.1 billion they're going to use to retrofit the Qatari jet. Un fucking believable...",
                "Just Remember Everybody the Supreme Court Said Bribery was legal so long as you get paid after the judgement :)",
                "DOJ being compromised like this is INSANE. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 3319,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Please save the whales and the dolphins. These non-human persons should not be kept isolated and enclosed.",
                "Man, where's the Mexican space program when you need it.",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 7043,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "Not calling her crown princess is weird.",
                "They forgot to exempt white girls",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "Please let this become an international incident."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Record beef prices raise Memorial Day cookout costs",
            "external_url": "https://www.reuters.com/world/us/record-beef-prices-raise-memorial-day-cookout-costs-2025-05-23/",
            "upvotes": 880,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nuh uh. Facebook told me prices for everything is waaaayyyy down.",
                "> Ground chuck prices in April reached a record $6 per pound, up 14% from a year ago, after farmers slashed their cattle herds to a 74-year low due to a years-long drought that reduced grazing lands.\n\nNo, there is no climate change, let's remove all environmental protection laws. And *DRILL*!",
                "A year ago, this would get 24-7 breathless news coverage on every cable outlet.",
                "This is what we (as a country) get for electing an old fool with dementia to be President.",
                "When can we expect the stupid graphics like Fox News has done for Thanksgiving?",
                "What do you mean? \n\nGroceries including beef are at an all time low. Everyone is saying it. We have the most beautiful prices in the world. Maybe ever. They come up to me and say \"sir, thank you for the lowest prices we've ever seen\".",
                "Beef quality in America has dropped SO MUCH in the last 20 years, its all garbage now, and prices climb. I saw a 4 pack of ribeyes at costco for $80 a couple weeks ago and its the same quality as Wal-Mart steak.",
                "This thread is so full of cynicism!  I didn’t come here to hear people blame the President.  I came here to get suggestions for alternative meats to eat since I can’t afford beef.  Llama, raccoon, shrew meat?  I’ve never eaten a snake before but I bet I could catch one by the lake.",
                "Looks like meats back OFF the menu boys!",
                "The joke is on them. I'm not grilling shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Twelve injured in knife attack at Hamburg railway station",
            "external_url": "https://www.bbc.co.uk/news/articles/cm26v7n5y4eo",
            "upvotes": 1454,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e23e/live/a550d960-3800-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                ">This is the latest violent attack in Germany in recent months.\n\nthats certainly a statement",
                "For an incident like this to happen during rush hour it could have been much worse.",
                "*A spokesman for the Hamburg fire department told Agence France-Presse (AFP) that 12 people had been injured in the attack. Among them were \"six people with life-threatening injuries,\" the spokesman said.*\n\nThis account makes the attack more deadly than the earlier one",
                "Women in male dominated fields",
                "I assume interest in this will magically disappear when people find out it was a 39 y.o. woman",
                "A few people in the comments failing to remember the phrase “don’t bring a knife to a gunfight”.\n\nPeople hellbent on causing harm will find a way, if she had a gun there would be fatalities and probably many more lives affected.",
                "How could the knife do this??",
                "[deleted]",
                "Silly countries and their gun control. Don't they know they could have more dead citizens, even dead school children, if they didn't limit psychos to knives?!",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Skeletal remains found on New Jersey beaches decades ago identified as captain of doomed 19th-century ship",
            "external_url": "https://www.cbsnews.com/news/investigative-genetic-genealogy-captain-identified-new-jersey-ramapo/",
            "upvotes": 1177,
            "date": "05/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/23/67c8e097-cd1c-4d20-930c-9e613023593e/thumbnail/1200x630g2/9d9f0b1813a8a24cfe8a656f87f2f3d2/ship-image001-1.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "129 years at sea. Found by students. Confirmed by DNA. That’s not just science, but that’s storytelling at its finest. \n\nHuge credit to those Ramapo students and NJSP. They gave a name back to someone lost for generations and gave his family something they never thought they’d get: closure.",
                ">Skeletal remains found on New Jersey beaches decades ago have been identified as those of a 19th-century schooner captain, thanks to the investigative efforts of college students. \n\n>The ship, the Oriental, sank in 1844. The schooner was transporting 60 tons of marble from Connecticut to Philadelphia to be used in the construction of Girard College, which still operates today. The ship likely sprung a leak, according to a [news release announcing the identification](https://www.ramapo.edu/news/press-releases/bone-fragments-found-on-new-jersey-beaches-linked-to-19th-century-shipwreck/) of the remains, and sank off the coast of Brigantine Shoal. All five crew members aboard the ship died. \n\n>The skeletal remains, including a skull, were found on a number of South Jersey beaches between 1995 and 2013. The set of remains became known as \"Scattered Man John Doe.\" Police efforts to identify the bones failed. \n\n>In 2023, the New Jersey State Police partnered with Ramapo College's Investigative Genetic Genealogy Center. A sample from the bones was uploaded to genetic genealogy company Intermountain Forensics, which submitted it to DNA matching sites in February 2024. Meanwhile, students at Ramapo used the profile for research.\n\n>They found ancestry matches dating back to the 1600s, including genetic relatives from Connecticut. For the next year, students continued to find ties to Connecticut, and eventually they started looking at shipwrecks off the coast of New Jersey. They came upon two articles about the sinking of the Oriental. One [article](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/image001-1.png) named the crew members aboard at the time of the sinking and [another](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/unnamed.png) detailed the wreck itself. \n\n>\"The storm was so tremendous that no help could be given from the shore,\" said the article, which was published in the Boston Daily Bee in December 1844 and described an account from a Connecticut publication. \n\n>According to the article, one crew member was \"decently buried\" after his \"corpse was thrown on the shore.\" No other bodies were discovered immediately after the sinking. \n\nCreepy story, considering the ship sank in 1844 and remains were found between 1995 and 2013. Great work by the students; they were able to identify the captain and can now give him a proper burial.",
                "I was one of students who worked this case as a team lead! So grateful to be part of Ramapo’s program and give Henry his name back!",
                "Fair winds and following seas.",
                "19th Century \"Major Tom\" (Captain Tom?) finally made it home.",
                "It's good news when you think about it. When you find human bones, better a 19th century sea captain than a murder victim. That's a really cool find!",
                "Timely episode of Ologies this week! It's about shipwrecks. \n\nhttps://pca.st/episode/919e135b-7d30-48c0-aaa5-457b6aedb82d",
                "I wonder if these remains were the ones \"decently buried\"?  Would seem likely that a \"decently buried\" corpse might be buried slightly inland.  Over the years the shoreline probably eroded until the bones became exposed and found by passers-by.  I would think that a simple drowned person in the sea might wash ashore, but being in the intertidal zone is pretty hard on a body and it would have disintegrated and eroded away many decades prior.  Just my guess.",
                "may your bones bleach in the sands."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 27905,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "Trump's vendetta against Harvard is deeply disturbing",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "at this point just start revoking any of trump's crones ivy league diploma starting with JD. it wont do anything, but it would massively hurt their egos.",
                "Did Havard reject Baron or something?",
                "NAL but I don't see how singling out a school for a ban like this could possibly be legal.",
                "Trump throwing darts at the board.  Flooding the zone so his funding bill doesn't get extra scrutiny.  There's a provision buried in there limiting the authority of the judicial branch.  Of course, MSM will just focus on Harvard and tariffs.  All part of the plan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New Stalin monument in Moscow subway stirs debate",
            "external_url": "https://www.cnn.com/2025/05/23/style/joseph-stalin-monument-moscow-metro-intl-scli",
            "upvotes": 514,
            "date": "05/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214572535.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A monument to [Soviet](https://www.cnn.com/2023/02/06/europe/ukraine-famine-survivor-intl) dictator [Joseph Stalin](https://www.cnn.com/style/article/stalin-moscow-architecture) erected in [Moscow’s](https://www.cnn.com/2025/05/06/europe/ukraine-drones-moscow-may-9-xi-intl-hnk) subway is stirring debate, with some Russians welcoming it as a historical tribute, but others saying it’s a mistake to commemorate someone who presided over so much suffering.\n\n>The life-size wall sculpture in Moscow’s Taganskaya metro station depicts Stalin standing on Moscow’s Red Square surrounded by a crowd of Soviet citizens looking at him in admiration, and is a recreation of a monument that was unveiled in the same station in 1950, three years before Stalin died.\n\n>The Moscow metro said that the original monument to Stalin had been “lost” in 1966 when the Taganskaya metro station hosting it had been reconfigured.\n\n>Nearly 700,000 people were executed in Stalin’s 1937-38 Great Terror amid show trials and purges of his real and perceived enemies. Many other Soviet citizens were sent to the gulag, a grim network of prison camps, spread across the world’s largest country.\n\n>The Moscow metro said in a statement that the new version of the monument, which was presented to the public on May 15, was one of its “gifts” to passengers to mark the 90th anniversary of the sprawling, ornate and famously efficient transportation system.\n\n>The work’s original title, “Gratitude of the People to the Leader and Commander,” was dedicated to Stalin’s role in delivering victory for the Soviet Union in World War II, the 80th anniversary of which Russia [marked with pomp this year](https://www.cnn.com/2025/05/09/europe/russia-victory-day-parade-intl-hnk).\n\n>“This man (Stalin), he created a lot,” said Yevgeny Ivanov, a Moscow resident, who had come to look at the new monument on Wednesday. “He has something to be proud of. And it is not for us to tear it down. A man did something - we must respect what he did.”\n\n>Kirill Frolov, another resident of the capital, said he accepted that Stalin’s record was mixed and that you couldn’t call him “good.”\n\nPutin won't mind bringing back the tyrants of the past.",
                "Commemorating the guy who did the purges and killed close to 1 million people. Russia is something else",
                "If you put up a statue of Churchill in UK or US no one would bat an eye despite millions of dead Bangladeshis",
                "They keep installing those in Ukraine occupied territories as well. The Russian Soviet Empire idol of gobbunism to mark their territory",
                "*”Stirs debate”* \n\nWhat kind of tepid “both sides have equally valid arguments” reporting is this? It’s OK to take a side on this one CNN and call it what it is. \n\n*Stalin’s record was mixed*\n\nWell, an “Açaí Berry & Dog Turds Smoothie” is also mixed, and packed full of vitamins and anti-oxidants. That still doesn’t mean you should still drink it everyday for breakfast.",
                "It should stir vandalism.",
                "I can use this post to spread some interesting knowledge about early years of Stalin 🙂 Young years the most successful operation that showed his organisational capabilities was robbery of Tiflis Bank 1907, he excelled at extortion, kidnapping, assassination, arson, bank robbery and thuggery. \n\nHis participation in communist movement was mostly due to ”political prisoners” were punished rather lightly than regular criminals. In his 1913 to 1916 Siberian exile as “political” he was living with real political communist Yakov Sverdlov, which he was constantly bullying and scoffing for his “clean look and behaviour” he got the dog and called it “Yashka” to piss off Yakov. His saying about Yakov “This clean spitter is so annoying and all his stupidity of washing dishes is laughable, I am much smarter than he is, I’m putting all my plates under bed and Yashka licking them white clean for me”\n\nYakov eventually moved away in another house,  and Stalin took the 14-year-old girl orphan from that village, abusing her about 2 years until his term ended. But Soviet party members pedofilism is another topic, Russian Olympic gymnasts and Balet schools, Kremlin stuff were well-known suppliers of underaged girls, for e.g. Beria",
                "Louis C.K. has a great tale of the time he traveled to Russia, highlight of the trip was the subway.\nFuck Stalin",
                "It says everything about present day Russia that they recreate a monument for one of history's most evil men. A man responsible for building one of the most paranoid dictatorships on earth, directly responsible for the untimely death of literally millions of men, women and children.",
                "Free public urinal in the Moscow Subway"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russian group 'Qilin' demands ransom by next week, City of Abilene refuses to pay",
            "external_url": "https://ktxs.com/news/local/russian-group-qilin-demands-ransom-by-may-27-city-of-abilene-refuses-to-pay",
            "upvotes": 835,
            "date": "05/23/2025",
            "thumbnail": "https://ktxs.com/resources/media2/16x9/640/986/0x60/90/2bd7d544-d83c-4b9f-8511-73eaa502f6a0-AbileneMunicipalCourt.jpg",
            "top_comments": [
                "Where are Trump's great security experts? Sobering up or on a verbal high note about Biden's failures?",
                "My retirement plan is to accept that my identity will eventually get stolen.",
                "Launch a counter hacking in response and demand ransom too. We will see who outsmarts who. Oh wait, I forgot, all the experts at the FBI have been gutted, oh well,.... there goes any cyber security the US had.",
                "I don't understand how this keeps happening - everyone knows their data is under threat. \n\nMy company is tiny in comparison yet I keep 3 complete data backups, one recent (made monthly), one 365 day old and one a copy of my original clean install from more than a decade ago; if I'm hacked I can tell them to go F themselves.",
                "As long as Trump gets a cut of whatever these Russian hackers take in, he’ll look the other way.",
                "Abilene TX?  You can keep it, Russia. \n\n😉",
                "Trump halted all US Cyber Command activities against Russia a few months ago.  It opened the door for more state-sponsored activities like this from Russia.  Oh well.  Despite losing our democracy to an obvious Russian asset, it could be much worse…. We could have a competent and qualified black woman as President.   Yikes!",
                "\"We'll just going to have to let them have whatever they want so that we don't escalate anything\"\n\n-Orange turd man probably",
                "And Trump just ended the federal funding provided to the states for cyber security",
                "Most places not run by complete idiots have ransomware insurance for this and it’s a very quick resolution."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Arizona hiker Hannah Moody's body found off trail day after she was reported missing",
            "external_url": "https://www.cbsnews.com/news/arizona-hiker-hannah-moody-body-found-day-after-reported-missing/",
            "upvotes": 3763,
            "date": "05/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/23/107aed1a-2e93-45c7-8eb8-1c8131429a1f/thumbnail/1200x630/f4a0c770f4fd4f736d45091011844477/hannah-moody-640x360.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "According to Scottsdale police, Moody's body was spotted at about 12:05 p.m. near the Gateway Trailhead of the McDowell Sonoran Preserve in Scottsdale. She was first reported missing at around 7:50 the evening before by friends who got concerned because they hadn't heard from her.",
                "Last fall I read \"The Heat Will Kill You First,\" which is mostly about climate change but uses the incredibly sad story of a family that died (dad, mom, baby, and their dog) during a hike on a hot day as an example of what heat does to the human body. It sounds like one of the worst ways to go.\n\nDo not underestimate heat!",
                "I once took a friend on a hike near Tucson, around this time of year. They showed up with one of those airplane water bottles, maybe 6 ounces of water. People have no clue the risks they take with their lives sometimes.",
                "A couple of years ago I got really dehydrated working all day outside in July. Cleaned up, went to a party and drank a lot of beer, woke the next morning and chugged a big glass of ice water. This apparently stimulated my Vagus Nerve, and sent me into fibrillation. I ended up in the ER, got to experience a cardioversion procedure. \n\nIt doesn't matter how tough you think you are - don't fuck around with dehydration.",
                "It gets brutally hot . \n\nWe have people out in 90 to 100+ degree weather, heavily exerting themselves, passing out, not bringing any water let alone enough, and often refuse to seek medical treatment.\nBack at it the next day.\n\nMistakes are made.",
                "I live in the desert and drive a pick up truck.  I always keep an unopened gallon of water in my bed.  We have homeless so it gets \"stolen\" a couple of times a week.  I'll continue doing it because heat kills.  I'll pay the $1.50 to ensure someone gets hydrated and is less likely to die.",
                "First dead hiker means it’s officially summer. This happens all summer every year. Kids, elderly, people from out of state. You cannot imagine the brutality of the heat if you haven’t experienced it.",
                "Local news here said she claimed to have 5 gallons of water with her for that hike. Thats over 40 lbs of just water alone, at what point does that actual water weight work against you in this 100+ heat",
                "Sometimes it's the case that they : \nOverestimate their ability to withstand the heat.\nOverestimate their ability to handle the terrain.\n\nAnd in-between these two endpoints, some combination.\n\nUnderappreciation of the elements  and  then perhaps a rather exaggerated belief in their abilities. \nSometimes poor prep. No compass   no cellphone, low charge on cell phone. \n\nMyself, I'm not in great shape anymore and I know that I'm disorganized. I don't hike. I get lost easily.  I'm more likely to die by pulling a box from the shelf in my closet.",
                "May she rest in peace. The stories of hikers who accidentally get lost are so heartbreaking to hear about."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/23/2025 20:10:16 UTC"
}