{
    "posts": [
        {
            "category": "HOT",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 12460,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Remember this when they're asking for mercy",
                "Not deported. Kicked out illegally",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "Mind you the father - a citizen - as well as the court have a suspicion that ICE falsified the records and the mother didn't leave willingly with the child.",
                "Likely he’s getting the info from m the federal Medicaid registrar"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 2965,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "[removed]",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 27049,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "Where was he when I was a teen?",
                "The riddler if he was cool",
                "Give this man a key the city",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "\"In total, officers said they recovered over a quarter of an ounce of marijuana.\"\n\nBet it was 8 grams. 2g per egg. Doesn't sound as good as a quarter ounce for rage bait though.",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 1147,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Start calling them American blood offerings at this point.",
                "Uvalde went like 70% for Trump. This shit will NEVER change until the constitution is changed",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "I find it weird there's been no description of the shooter in any article I've read. \n\nI feel like that should tell me something, but I'm not sure what yet.",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Gun laws must be discussed seriously, man, I am from out of the States. Every month I certainly hear some hooligans' shooting and killing innocent people. \n\nI am scared to go to U.S. for my Masters, thinking I might get shot randomly for no reason at all.",
                "Why didn't they release the name of the suspect? This was a racial crime and they need to be shamed",
                "\"Not my problem\" -Trump "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 484,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-suspended-outage-power_6899773.jpg?20250428130514",
            "top_comments": [
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected",
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "Portugal is on total blackout. How is Spain and other countries?",
                "If that was a cyber attack, it would make it a frightening test run.",
                "If this was caused by russia, Nato needs to invoke article 5",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼",
                "[removed]",
                "What caused that terrible incident?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 9689,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 19113,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "Probably shouldn't cut parts off babies for no reason",
                "It's crazy it's still the norm in many parts of the US.\n\nMy son was born at the Montreal **Jewish** Hospital. It was clearly stated that circumcision (for non-medical cases) was not offered by the obstetrics department. There was a clinic available in the hospital with a doctor who is also a Mohel for those parents who chose so. It was a paid service not covered by the government.\n\nIMO, it should be made illegal, but that's a debate for another time.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Genital mutilation should be illegal",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "I'm a retired Neonatal intensive care nurse, who also worked in normal newborn nurseries in my day. I refused to assist doctors in circs. They're terrible. That's all I'll say on the subject."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 4781,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "I’m not just going to take their word for it that they’re immigrants",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "They’re saying that both MS-13 and Tren de Aragua were there. They’re literally just calling all immigrants members of these two gangs. If you demonize them and call them gang members, it becomes easier for the general public to justify deporting brown people left and right. You know who else was wrongly demonized in history, and the consequences of what happened to them because of it?",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 2918,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "You know you're the bad guy when N. Korea's got your back.",
                "These are replacement troops for the troops that were sent there last year, 40% casualties from last year....geez\n\n[https://www.bbc.com/news/articles/c87djeezjxeo](https://www.bbc.com/news/articles/c87djeezjxeo)",
                "Explains Trump's \"magical\" 180 this weekend",
                "> North Korean leader Kim Jong Un watches a cadet practicing on the parallel bars \n\nSending gymnasts off to war.",
                "This is a can of worms given the timeline:\n\n1. Trump and Zelenskyy talk. \n\n2. More US/NK nuclear talk planning leaks. \n\n3. NK admission of troops \n\n4. State Department forced to respond \n\nState Department Acknowledgment \n\n>The US State Department demanded North Korea’s deployment to Russia and any support by Russia in return must end, adding Russia had violated UN Security Council resolutions by training North Korean soldiers.\n\n>\"Countries such as North Korea, whose support has “perpetuated the Russia-Ukraine war, bear responsibility,” a State Department spokesperson told Reuters.\n\n  \nNuclear talks story earlier today preceding NK's admission:\n\n>The Trump administration has quietly been holding discussions and consulting outside experts as it considers options for potentially restarting dialogue with North Korea \n\n\nhttps://www.axios.com/2025/04/27/north-korea-talks-kim-jong-un-trump\n\nRussia and North Korea scheming their admissions together.",
                "Why is Russia provoking WW3??",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Dozens of African migrants killed in US strike on Yemen, Houthis say",
            "external_url": "https://www.bbc.com/news/articles/c9qw274w72vo",
            "upvotes": 456,
            "date": "04/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e43/live/54aedf50-23fd-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "It's true, Hegseth air dropped me the plans",
                "Terrible. Given the Houthi's attitudes towards African migrants I am guessing these people were enslaved there. I wish wealthy countries would attempt to rescue people in these situations instead of bombing them.",
                "They are probably counting this as a bonus.",
                "Don't believe anything the Houthis say.",
                "“Preemptive Deportation”-Karoline Leavitt",
                "The Houthis would try to win the sympathy of non-profit organizations at all costs for the money, dont believe a word coming out of their media.. aee there innocent people dying with these strikes? Yes! But whenever the Houthis speak its always lies and deception.. fucking scum.",
                "Bruh, what civilian infrastructure? Are you one of the people who got filthy rich because of the houthis on account of actual civilians?",
                "[removed]"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Russia declares a ceasefire in Ukraine on May 8-10 for WWII Victory Day",
            "external_url": "https://www.ctvnews.ca/world/russia-ukraine-war/article/putin-declares-3-day-may-ceasefire-to-mark-80-years-since-world-war-two-victory/",
            "upvotes": 7,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/22AAO7EPNFVKCOCKKVHELYQC6Q.jpg?smart=true&auth=0608258ac555185dd8cf1d8c67126a4505fc20dc0f5b125fe7dded3ce850cc32&width=1200&height=630",
            "top_comments": [
                "How about they declare that they are backing out and no longer attacking the Ukraine instead?",
                "I’m sure Russia won’t violate that.",
                "Russia’s ceasefire declarations are about as useful as Trump executive orders..",
                "20 $ says they stage a very public attack on themselves to boost recruitment.",
                "Translation: \"We'll attack on May 8-10\"",
                "they could declare that theyre giving ukraine their land back and pulling out.",
                "Want a ceasefire, withdraw from Ukraine.",
                "A ceasefire is a two sided agreement and cannot be declared by only one side."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Suspect arrested in Homeland Security Secretary Noem’s purse theft",
            "external_url": "https://apnews.com/article/kristi-noem-homeland-security-robbed-suspect-arrest-874c3933f1d59873c0225d737d3dae5a",
            "upvotes": 11,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn’t she say that anyone carrying over $1,500 cash was a drug dealer?",
                "I have questions....\n\n* Who carries $3K cash in their purse\n* Who puts a Gucci purse with $3K on the floor in a restaurant\n* How can  a masked man get close enough without the secret service noticing\n\n\"this happens all the time to people\"",
                "If you can't manage your bag at a restaurant, you can manage a country.",
                "Being in possession of a passport and a large amount of cash. Always ready to flee to some non-extradition country, I see.",
                "I’ve never seen the police care so much about recovering a working girls purse. ",
                "I’m sure they’ll try and charge the guy with a hate crime. Cause they understand the law so well.",
                "NOEM: \"I want my cash, my keys, my driver’s license, my passport and my Homeland Security badge back, dirtbag!. You are soooooo going to El Salvador!!!\"\n\nSUSPECT: \"What about the other stuff?\"\n\nNOEM: \"What other........... on second thoughts, maybe Otisville might be more your cup of tea, I hear they just resurfced their tennis courts.\"",
                "And then proceeded to steal Pete Hasgeth's purse",
                "Worst possible purse they could have stolen lmao"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Putin announces unilateral three-day ceasefire in Ukraine from May 8",
            "external_url": "https://www.cnn.com/2025/04/28/europe/putin-announces-ceasefire-may-intl/index.html?utm_medium=social&utm_source=igCNN&utm_content=2025-04-28T11%3A35%3A51",
            "upvotes": 0,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-22t161005z-1380209472-rc243eazsvlt-rtrmadp-3-russia-putin.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What's the point? No one in their right mind believes he'll honour it",
                "Estimated time of N. Korea reinforcement arrival May 11.",
                "They're just reloading their ammo during that three days.",
                "> to coincide with World War II commemorations and called on Kyiv to do the same, the Kremlin said Monday.\n\nPutting a war on pause to celebrate another war's end. We are an endlessly fascinating species.",
                "I hope Zelenskyy bombs the shit out of the Victory Day parade.",
                "Like the easter ceasefire that russia immediately broke? Or the ceasefire on critical energy infrastructure, which russia immediately broke?",
                "Why won’t you just cancel the war you started you baboon. Sheesh.",
                "”Please don’t mess up our parade”",
                "Just another reminder:\n\n>At a CNN town hall in May 2023, Trump said: “They’re dying, Russians and Ukrainians. I want them to stop dying. And I’ll have that done — I’ll have that done in 24 hours.” He said that would happen after he met with Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin. And he keeps repeating the claim on the campaign trail.\n\n(from an AP article circa 6/2024)",
                "Need everything they can show if they’re still doing May 9th parades. Probably will try to stage something as well."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 483,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-suspended-outage-power_6899773.jpg?20250428130514",
            "top_comments": [
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected",
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "Portugal is on total blackout. How is Spain and other countries?",
                "If that was a cyber attack, it would make it a frightening test run.",
                "If this was caused by russia, Nato needs to invoke article 5",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼",
                "[removed]",
                "What caused that terrible incident?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "[CNN] Conclave to elect Pope Francis’ successor set to start on May 7, Vatican source says",
            "external_url": "https://www.cnn.com/2025/04/28/europe/conclave-start-date-intl/index.html",
            "upvotes": 104,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-28t101618z-1483844028-rc2w6ea31ehm-rtrmadp-3-pope-succession-cardinals.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Which country does Ralph Fiennes represent? 🤔 ",
                "It’s a shame this isn’t televised.  Make it like Eurovision",
                "Who is going to run the Papal and vatican until then?",
                "How does one drink for this? Is it like the Kentucky Derby where we all make hats?",
                "Luckily Zhong Yi Ristorante is open late and has takeout."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Dozens of African migrants killed in US strike on Yemen, Houthis say",
            "external_url": "https://www.bbc.com/news/articles/c9qw274w72vo",
            "upvotes": 451,
            "date": "04/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e43/live/54aedf50-23fd-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "It's true, Hegseth air dropped me the plans",
                "Terrible. Given the Houthi's attitudes towards African migrants I am guessing these people were enslaved there. I wish wealthy countries would attempt to rescue people in these situations instead of bombing them.",
                "They are probably counting this as a bonus.",
                "Don't believe anything the Houthis say.",
                "“Preemptive Deportation”-Karoline Leavitt",
                "The Houthis would try to win the sympathy of non-profit organizations at all costs for the money, dont believe a word coming out of their media.. aee there innocent people dying with these strikes? Yes! But whenever the Houthis speak its always lies and deception.. fucking scum.",
                "Bruh, what civilian infrastructure? Are you one of the people who got filthy rich because of the houthis on account of actual civilians?",
                "[removed]"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 2956,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "[removed]",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 1154,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Start calling them American blood offerings at this point.",
                "Uvalde went like 70% for Trump. This shit will NEVER change until the constitution is changed",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "I find it weird there's been no description of the shooter in any article I've read. \n\nI feel like that should tell me something, but I'm not sure what yet.",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Gun laws must be discussed seriously, man, I am from out of the States. Every month I certainly hear some hooligans' shooting and killing innocent people. \n\nI am scared to go to U.S. for my Masters, thinking I might get shot randomly for no reason at all.",
                "Why didn't they release the name of the suspect? This was a racial crime and they need to be shamed",
                "\"Not my problem\" -Trump "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 12474,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Remember this when they're asking for mercy",
                "Not deported. Kicked out illegally",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "Mind you the father - a citizen - as well as the court have a suspicion that ICE falsified the records and the mother didn't leave willingly with the child.",
                "Likely he’s getting the info from m the federal Medicaid registrar"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Suspect charged with murder over Vancouver Filipino festival car ramming, police say victims were aged five to 65",
            "external_url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk/index.html",
            "upvotes": 1063,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-27t060646z-1584350354-rc256eaf4qtw-rtrmadp-3-canada-vancouver-street-festival-crash.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Kai-Ji Adam Lo, he had a brother that was killed like a year ago and even had a go fund me page.\n\n\nHis father also died shortly after they moved to the area.\n\n\nHis mother attempted suicide not too long ago too.\n\n\nHistory of mental illness, paranoia, probably schizophrenia, just sad all around. Often caught shouting with his mom where police would be called on them (no out right violence though).\n\n\nToo many lives lost for no reason at all.",
                "We really need to start having conversations about Serious Mental Illness (SMI). The idea of institutions warehousing the mentally ill has a long, violent, and tragic history, so most people are content to leave it alone (and nobody wants to pay extra taxes towards the \"undesirables\" who may never be able to participate in public life). However, long-term and short-term hospitalization for SMI is a critical piece of stabilizing mentally ill patients, and neither Canada nor the USA has enough beds to cover the people who need it. \n\nIf anyone wants to read more about it from a USA perspective, I recommend Bedlam: An Intimate Journey into America's Mental Health Crisis. If anyone has recommendations for a Canadian based book, I would definitely read your suggestions.",
                "Crazy guy, did something crazy.  It’s as simple as that.  Nothing political, nothing racial, nothing. Just bring back mental hospitals to deal with these damaged people instead of letting them roam the streets alone with their damaged thinking.  Get them help.",
                "They were saying he had schizophrenia on the radio this afternoon, can’t imagine what must have been going through his mind. So many people have had their lives taken and others will be devastated, what a tragedy. I can’t hate on someone who is obviously extremely ill, he will never know peace now. That is his life sentence as well as being put in an institution for the extremely ill. Such a horrible tragedy.",
                "I thought it would be racism but it’s mental illness.",
                "A very very minute part of me takes the smallest sliver of solace that this wasn't a hate fueled attack on people, but it's still a tragic nightmare of an event. I feel terrible for the victims and their families.",
                "What a disgusting human …what is wrong with this world",
                "Time to bring back the Mental hospitals.",
                "What a disgusting person, don’t let them see the outside world again",
                "There should have been a barricade. Crazy guy is ultimately responsible but police fell asleep not securing the area."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 486,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-suspended-outage-power_6899773.jpg?20250428130514",
            "top_comments": [
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected",
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "Portugal is on total blackout. How is Spain and other countries?",
                "If that was a cyber attack, it would make it a frightening test run.",
                "If this was caused by russia, Nato needs to invoke article 5",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼",
                "[removed]",
                "What caused that terrible incident?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 2958,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "[removed]",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "Dozens of African migrants killed in US strike on Yemen, Houthis say",
            "external_url": "https://www.bbc.com/news/articles/c9qw274w72vo",
            "upvotes": 454,
            "date": "04/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e43/live/54aedf50-23fd-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "It's true, Hegseth air dropped me the plans",
                "Terrible. Given the Houthi's attitudes towards African migrants I am guessing these people were enslaved there. I wish wealthy countries would attempt to rescue people in these situations instead of bombing them.",
                "They are probably counting this as a bonus.",
                "Don't believe anything the Houthis say.",
                "“Preemptive Deportation”-Karoline Leavitt",
                "The Houthis would try to win the sympathy of non-profit organizations at all costs for the money, dont believe a word coming out of their media.. aee there innocent people dying with these strikes? Yes! But whenever the Houthis speak its always lies and deception.. fucking scum.",
                "Bruh, what civilian infrastructure? Are you one of the people who got filthy rich because of the houthis on account of actual civilians?",
                "[removed]"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 12458,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Remember this when they're asking for mercy",
                "Not deported. Kicked out illegally",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "Mind you the father - a citizen - as well as the court have a suspicion that ICE falsified the records and the mother didn't leave willingly with the child.",
                "Likely he’s getting the info from m the federal Medicaid registrar"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 1158,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Start calling them American blood offerings at this point.",
                "Uvalde went like 70% for Trump. This shit will NEVER change until the constitution is changed",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "I find it weird there's been no description of the shooter in any article I've read. \n\nI feel like that should tell me something, but I'm not sure what yet.",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Gun laws must be discussed seriously, man, I am from out of the States. Every month I certainly hear some hooligans' shooting and killing innocent people. \n\nI am scared to go to U.S. for my Masters, thinking I might get shot randomly for no reason at all.",
                "Why didn't they release the name of the suspect? This was a racial crime and they need to be shamed",
                "\"Not my problem\" -Trump "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Suspect charged with murder over Vancouver Filipino festival car ramming, police say victims were aged five to 65",
            "external_url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk/index.html",
            "upvotes": 1061,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-27t060646z-1584350354-rc256eaf4qtw-rtrmadp-3-canada-vancouver-street-festival-crash.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Kai-Ji Adam Lo, he had a brother that was killed like a year ago and even had a go fund me page.\n\n\nHis father also died shortly after they moved to the area.\n\n\nHis mother attempted suicide not too long ago too.\n\n\nHistory of mental illness, paranoia, probably schizophrenia, just sad all around. Often caught shouting with his mom where police would be called on them (no out right violence though).\n\n\nToo many lives lost for no reason at all.",
                "We really need to start having conversations about Serious Mental Illness (SMI). The idea of institutions warehousing the mentally ill has a long, violent, and tragic history, so most people are content to leave it alone (and nobody wants to pay extra taxes towards the \"undesirables\" who may never be able to participate in public life). However, long-term and short-term hospitalization for SMI is a critical piece of stabilizing mentally ill patients, and neither Canada nor the USA has enough beds to cover the people who need it. \n\nIf anyone wants to read more about it from a USA perspective, I recommend Bedlam: An Intimate Journey into America's Mental Health Crisis. If anyone has recommendations for a Canadian based book, I would definitely read your suggestions.",
                "Crazy guy, did something crazy.  It’s as simple as that.  Nothing political, nothing racial, nothing. Just bring back mental hospitals to deal with these damaged people instead of letting them roam the streets alone with their damaged thinking.  Get them help.",
                "They were saying he had schizophrenia on the radio this afternoon, can’t imagine what must have been going through his mind. So many people have had their lives taken and others will be devastated, what a tragedy. I can’t hate on someone who is obviously extremely ill, he will never know peace now. That is his life sentence as well as being put in an institution for the extremely ill. Such a horrible tragedy.",
                "I thought it would be racism but it’s mental illness.",
                "A very very minute part of me takes the smallest sliver of solace that this wasn't a hate fueled attack on people, but it's still a tragic nightmare of an event. I feel terrible for the victims and their families.",
                "What a disgusting human …what is wrong with this world",
                "Time to bring back the Mental hospitals.",
                "What a disgusting person, don’t let them see the outside world again",
                "There should have been a barricade. Crazy guy is ultimately responsible but police fell asleep not securing the area."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 27046,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "Where was he when I was a teen?",
                "The riddler if he was cool",
                "Give this man a key the city",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "\"In total, officers said they recovered over a quarter of an ounce of marijuana.\"\n\nBet it was 8 grams. 2g per egg. Doesn't sound as good as a quarter ounce for rage bait though.",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 9689,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 19117,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "Probably shouldn't cut parts off babies for no reason",
                "It's crazy it's still the norm in many parts of the US.\n\nMy son was born at the Montreal **Jewish** Hospital. It was clearly stated that circumcision (for non-medical cases) was not offered by the obstetrics department. There was a clinic available in the hospital with a doctor who is also a Mohel for those parents who chose so. It was a paid service not covered by the government.\n\nIMO, it should be made illegal, but that's a debate for another time.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Genital mutilation should be illegal",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "I'm a retired Neonatal intensive care nurse, who also worked in normal newborn nurseries in my day. I refused to assist doctors in circs. They're terrible. That's all I'll say on the subject."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 4786,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "I’m not just going to take their word for it that they’re immigrants",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "They’re saying that both MS-13 and Tren de Aragua were there. They’re literally just calling all immigrants members of these two gangs. If you demonize them and call them gang members, it becomes easier for the general public to justify deporting brown people left and right. You know who else was wrongly demonized in history, and the consequences of what happened to them because of it?",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/28/2025 12:16:21 UTC"
}