{
    "posts": [
        {
            "category": "HOT",
            "title": "Satanist leader’s attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests",
            "external_url": "https://www.cnn.com/2025/03/29/us/kansas-satanist-protest-arrests-hnk/index.html",
            "upvotes": 18221,
            "date": "03/30/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25087823019751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“When we saw that nobody was doing anything — I guess just in the moment of it — it was like, ‘He’s not supposed to be allowed to do this,’ so we tried to stop him,” she said.\n\nThe party of free speech, everybody...",
                "Where’s the don’t tread on me crowd?",
                "The Government of the United States gives to bigotry no sanction, to persecution no assistance. Require only that they who live under its protection should demean themselves as good citizens, in giving it on all occasions their effectual support.\n\n-George Washington\n\n\n\t“We the General Assembly of Virginia… do enact that no man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burdened in his body or goods, nor shall otherwise suffer on account of his religious opinions or belief.”\n\n-Thomas Jefferson\n\n\n\n\t“The civil rights of none shall be abridged on account of religious belief or worship.”\n\n-James Madison",
                "They should have all worn Tesla logos. Then anyone attacking them would have been classified as domestic terrorists. : )",
                "I love that Satanist’s don’t even believe in Satan. It’s the Christians that do.",
                "They say “chaos” but it was positively uneventful compared to what they apparently expected to happen. It was amazing how much of an overreaction there was to this. (Of course hindsight is 20/20). They had police cars surrounding the capitol. An acquaintance who works in the capitol told me they  had SWAT on every floor and hid all the tables and chairs so they couldn’t be used as weapons. They gave all the state workers administrative leave that day too, so they wouldn’t be caught up in anything downtown.\n\nAnd yet despite all the worry about mass violence, there were a ton of children amongst the counter protesters, all dressed in their Sunday best.",
                "*trying to remember if there are any photos or evidence of satanists burning an inverted pentagram in front of a black family's house.",
                "Christians always really struggle to understand that Satanists are a political activist group pointing out the hypocrisy of our government bias towards Christianity, not literal worshipers of Satan. \n\nIt would take less than 5 minutes of googling to understand this. The only ones at that protest who actually believe in Satan are the Christians.",
                "The rational next step is to do a bigger one.",
                "Neo Nazis marching in the streets are protected by police because they say their voices are protected under free speech… but Church of Satan members are not protected?\n\nHave you ever studied other religions? Take some time and study religions other than your own. \n\nThis was never about free speech, or freedom for that matter. It has always been about control. That’s why the current administration is removing your ability to launch class action lawsuits against companies. That’s why this administration is gutting your system of education.\n\nIt’s about control"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 2232,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "Just tragic\n\nHer poor family too",
                "Everyone ragging on the dentist and general anesthesia in dental settings, but is there any indication it's the dentist's fault or would have gone differently in a hospital setting? Doesn't general anesthesia carry a (small) risk of death, even when performed properly?",
                "My son had a general anesthesia dental procure in September and it was scary for me even though it all went well. He did sleep for a while after waking up initially but I kept checking on him.\n\nMy other experience with general anesthesia in children was my one year old who needed stitches a couple years ago. He had fallen off a chair and cut his chin open. He was very resistant to getting stitches and was wiggling his way out every time the ER doc attempted it. Eventually she threw her hands up saying they would do general anesthesia. She was told no way it was needlessly risky to do it, so we gave it one last go and he let her put the stitches in. Until then I don’t think I had ever considered a risk in doing general anesthesia."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Magnitude-7.1 earthquake hits Tonga, tsunami threat issued",
            "external_url": "https://www.abc.net.au/news/2025-03-31/magnitude-7-earthquake-hits-tonga-tsunami-threat-issued/105114840",
            "upvotes": 4176,
            "date": "03/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/b9a5cf82d345f4121ba437e1a6894ca9?impolicy=wcms_watermark_news&cropH=480&cropW=853&xPos=0&yPos=62&width=862&height=485&imformat=generic",
            "top_comments": [
                "ring of fire really doing its thing this week\n\n(i say with resignation while sitting on a major fault line)",
                "are two different 7+ quakes that close together in terms of timeframe unusual?",
                "Tsunami warning has been cancelled according to the same source.",
                "Tonga, the place where a large volcano recently detonated? That Tonga?",
                "Oh boy…the population is only 100,000. I hope they stay safe. ",
                "“The US Tsunami Warning Centre says…”  Good job making DOGE aware of your existence. Layoffs coming Monday.",
                "The California corner of the Pacific plate seems *WAY* overdue for a big one unfortunately. The other three corners have suffered from massive earthquakes over the last decade or so.",
                "[https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive)",
                "*Inserts this is fine gif*",
                "Dang this weekend has been crazy"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "U.S. Army says recovering 4 soldiers missing in Lithuania \"will be a long and difficult\" operation",
            "external_url": "https://www.cbsnews.com/news/us-soldiers-missing-lithuania-army-m88-hercules-long-difficult-operation/",
            "upvotes": 2172,
            "date": "03/30/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/f7a8a787-ed5d-45be-b008-00d6abbc4d39/thumbnail/1200x630/26472697efa33e738651b8b54845ef3c/lithuania-us-soldiers-2206633876.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "No soldiers left behind. Unless the Secretary of Defense is busy getting horrible tattoos that ruin the flag.",
                "I’m sure the US VP, or defense has already visited the site and offered support. I’m so proud of the US /s",
                "They cut off the, “and we don’t think it’s worth it.” /s",
                "As difficult as finding those who went missing in El Salvador, isn't it?",
                "Well zero news coverage sooo no big deal to the government apparently👎🏼",
                "wait are they still alive?",
                "Sorry. The President is on record saying he prefers soldiers that weren’t captured. That’s why he cleverly dodged the draft. And why he was voted in by the party that demands we support our troops. I’m sure it makes sense to someone smarter than me.",
                "If they text something bad about Trump, his new Gestapo would find them instantly.",
                "\"suckers\" and \"losers\" Donald Trump",
                "[deleted]"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 20463,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "I think when one can buy democracy at that point democracy is dead.",
                "This is unfucking believable.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US immigration officials look to expand social media data collection",
            "external_url": "https://apnews.com/article/social-media-immigration-applicants-handles-dhs-f67b480abebff7e451056be17572593d",
            "upvotes": 882,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was reading a thing about 'misbeliefs Gen X has', and it said my generation was foolish because we believed more in anonymity whereas modern generations put themselves out there fully on the net.\n\nReminds me of the joke.. Do you know who the greatest hacker in the world is? *Of course not, if you did they wouldn't be the greatest hacker in the world.*",
                "Friends it is time to kill social media. It's been dying for years but let's all do the right thing and kill it dead.",
                "Ah, just like the Chinese Social Credit system.",
                "What was that?  Sorry, I can't hear you over the sound of my use of Mastodon instead of Facebook!",
                "Hey social media CEOs, remember when you were all about free speech? Wanna do something about that and tell the government to take a hike? Or are you gonna tell us that content moderation by a private company is infringing on free speech but the government literally persecuting people for their opinions isn’t?",
                "This is how the OG nokia brick phone makes a comeback.",
                "Maybe we should all stop using social media until those companies lobby the govt to not collect our data on our behalf. ",
                "Couldn’t u just delete ask your apps n take a burner phone",
                "US looking more like China everyday",
                "Backup your phone.  Delete all histories and app.  Then restore when through immigration.  Trump is copying china and russia.  "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 7816,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "They're still pulling this ahit. Seriously, stop firing people."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 34107,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Wow. That orange peel is thin as fuck"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 19054,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "The whole world hates you Elon. You are universally despised.",
                "The world cannot wait for Elon to Occupy Mars.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "[ Removed by Reddit ]",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "First orbital rocket launched from mainland Europe crashes after takeoff",
            "external_url": "https://www.theguardian.com/science/2025/mar/30/first-orbital-rocket-launched-europe-crashes-launch-spectrum",
            "upvotes": 301,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10060b8d3fc912884211933a8e0d4e3414dbec4c/0_58_2295_1377/master/2295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0fed1f6a50b7888b86e7980e0e245afc",
            "top_comments": [
                "Leon would call this a \"successful test\".  Celebrations all around.\n\n“This allowed the company to gather a substantial amount of flight data and experience to apply on future missions,” Isar said in a statement. “After the flight was terminated at T+30 seconds, the launch vehicle fell into the sea in a controlled manner.”\n\nChance of Germany Succeeding Next Time: Pretty Damn Good\n\nChance of Germany Consulting or Engaging Musk / USA : ZERO",
                "\"Isar Aerospace, which had warned the initial launch could end prematurely, said the test produced extensive data that its team could learn from.\"\n\nNow hire some experts leaving the US (more rights for employees, yay!), add European precision (well, maybe more pricey than Space X processes/materials?), and this may look pretty good pretty soon.",
                "no worries\n\nMusk has been trying a lot longer and he still blows up",
                "German rocket. Bummer, but at least we Europeans try and make progress in this regard. Now learn from the mistakes and do it again.",
                "My main question after watching that is if not self-destructing and allowing it to blow up on the ground was on purpose.",
                "the EU can fix this with 10 000 more regulations I believe"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 2233,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "Just tragic\n\nHer poor family too",
                "Everyone ragging on the dentist and general anesthesia in dental settings, but is there any indication it's the dentist's fault or would have gone differently in a hospital setting? Doesn't general anesthesia carry a (small) risk of death, even when performed properly?",
                "My son had a general anesthesia dental procure in September and it was scary for me even though it all went well. He did sleep for a while after waking up initially but I kept checking on him.\n\nMy other experience with general anesthesia in children was my one year old who needed stitches a couple years ago. He had fallen off a chair and cut his chin open. He was very resistant to getting stitches and was wiggling his way out every time the ER doc attempted it. Eventually she threw her hands up saying they would do general anesthesia. She was told no way it was needlessly risky to do it, so we gave it one last go and he let her put the stitches in. Until then I don’t think I had ever considered a risk in doing general anesthesia."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "First orbital rocket launched from mainland Europe crashes after takeoff",
            "external_url": "https://www.theguardian.com/science/2025/mar/30/first-orbital-rocket-launched-europe-crashes-launch-spectrum",
            "upvotes": 302,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10060b8d3fc912884211933a8e0d4e3414dbec4c/0_58_2295_1377/master/2295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0fed1f6a50b7888b86e7980e0e245afc",
            "top_comments": [
                "Leon would call this a \"successful test\".  Celebrations all around.\n\n“This allowed the company to gather a substantial amount of flight data and experience to apply on future missions,” Isar said in a statement. “After the flight was terminated at T+30 seconds, the launch vehicle fell into the sea in a controlled manner.”\n\nChance of Germany Succeeding Next Time: Pretty Damn Good\n\nChance of Germany Consulting or Engaging Musk / USA : ZERO",
                "\"Isar Aerospace, which had warned the initial launch could end prematurely, said the test produced extensive data that its team could learn from.\"\n\nNow hire some experts leaving the US (more rights for employees, yay!), add European precision (well, maybe more pricey than Space X processes/materials?), and this may look pretty good pretty soon.",
                "no worries\n\nMusk has been trying a lot longer and he still blows up",
                "German rocket. Bummer, but at least we Europeans try and make progress in this regard. Now learn from the mistakes and do it again.",
                "My main question after watching that is if not self-destructing and allowing it to blow up on the ground was on purpose.",
                "the EU can fix this with 10 000 more regulations I believe"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "US immigration officials look to expand social media data collection",
            "external_url": "https://apnews.com/article/social-media-immigration-applicants-handles-dhs-f67b480abebff7e451056be17572593d",
            "upvotes": 878,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was reading a thing about 'misbeliefs Gen X has', and it said my generation was foolish because we believed more in anonymity whereas modern generations put themselves out there fully on the net.\n\nReminds me of the joke.. Do you know who the greatest hacker in the world is? *Of course not, if you did they wouldn't be the greatest hacker in the world.*",
                "Friends it is time to kill social media. It's been dying for years but let's all do the right thing and kill it dead.",
                "Ah, just like the Chinese Social Credit system.",
                "What was that?  Sorry, I can't hear you over the sound of my use of Mastodon instead of Facebook!",
                "Hey social media CEOs, remember when you were all about free speech? Wanna do something about that and tell the government to take a hike? Or are you gonna tell us that content moderation by a private company is infringing on free speech but the government literally persecuting people for their opinions isn’t?",
                "This is how the OG nokia brick phone makes a comeback.",
                "Maybe we should all stop using social media until those companies lobby the govt to not collect our data on our behalf. ",
                "Couldn’t u just delete ask your apps n take a burner phone",
                "US looking more like China everyday",
                "Backup your phone.  Delete all histories and app.  Then restore when through immigration.  Trump is copying china and russia.  "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "U.S. Army says recovering 4 soldiers missing in Lithuania \"will be a long and difficult\" operation",
            "external_url": "https://www.cbsnews.com/news/us-soldiers-missing-lithuania-army-m88-hercules-long-difficult-operation/",
            "upvotes": 2170,
            "date": "03/30/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/f7a8a787-ed5d-45be-b008-00d6abbc4d39/thumbnail/1200x630/26472697efa33e738651b8b54845ef3c/lithuania-us-soldiers-2206633876.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "No soldiers left behind. Unless the Secretary of Defense is busy getting horrible tattoos that ruin the flag.",
                "I’m sure the US VP, or defense has already visited the site and offered support. I’m so proud of the US /s",
                "They cut off the, “and we don’t think it’s worth it.” /s",
                "As difficult as finding those who went missing in El Salvador, isn't it?",
                "Well zero news coverage sooo no big deal to the government apparently👎🏼",
                "wait are they still alive?",
                "Sorry. The President is on record saying he prefers soldiers that weren’t captured. That’s why he cleverly dodged the draft. And why he was voted in by the party that demands we support our troops. I’m sure it makes sense to someone smarter than me.",
                "If they text something bad about Trump, his new Gestapo would find them instantly.",
                "\"suckers\" and \"losers\" Donald Trump",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Magnitude-7.1 earthquake hits Tonga, tsunami threat issued",
            "external_url": "https://www.abc.net.au/news/2025-03-31/magnitude-7-earthquake-hits-tonga-tsunami-threat-issued/105114840",
            "upvotes": 4179,
            "date": "03/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/b9a5cf82d345f4121ba437e1a6894ca9?impolicy=wcms_watermark_news&cropH=480&cropW=853&xPos=0&yPos=62&width=862&height=485&imformat=generic",
            "top_comments": [
                "ring of fire really doing its thing this week\n\n(i say with resignation while sitting on a major fault line)",
                "are two different 7+ quakes that close together in terms of timeframe unusual?",
                "Tsunami warning has been cancelled according to the same source.",
                "Tonga, the place where a large volcano recently detonated? That Tonga?",
                "Oh boy…the population is only 100,000. I hope they stay safe. ",
                "“The US Tsunami Warning Centre says…”  Good job making DOGE aware of your existence. Layoffs coming Monday.",
                "The California corner of the Pacific plate seems *WAY* overdue for a big one unfortunately. The other three corners have suffered from massive earthquakes over the last decade or so.",
                "[https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive)",
                "*Inserts this is fine gif*",
                "Dang this weekend has been crazy"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Marine Le Pen’s future to be decided as embezzlement verdict arrives | Marine Le Pen",
            "external_url": "https://www.theguardian.com/world/2025/mar/30/marine-le-pen-alleged-embezzlement-verdict",
            "upvotes": 495,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/58bc467ff40e9de6aeda2a793b5dfee2227854d7/0_154_5625_3375/master/5625.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b13b135841c319ae6e5d0bde43caa396",
            "top_comments": [
                "va te faire foutre fasciste.  Fuck Le Pen and RN",
                "Wasn’t expecting that. I love this for her.",
                "Good. She deserves to fade into irrelevance",
                "Please, just this once, let justice be done and this fascist criminal be put behind bars. I'm tired of the bad guys winning.",
                "Le Penis not mightier!\n\n\nGood to see corruption actually coming to trial. I don't know what the odds are on the verdict, but it seems guilty could bar her from office. Anyone else follow the case more closely and has an idea of where it'll go?",
                "I hope she rots in jail",
                "On espère que la justice triomphe.",
                "5 years is too lenient, these people don't reform and they are politicians, they should be example for the nation, and not of how you mustn't behave. Politicians like that show to people it's alright to do it since THEY get away with it.",
                "It’s always far right that has corruption surrounding them… bolsonaro, milei, trump, lepen… they’re all the same",
                "When you cannot defeat the opposition at the ballot box then using the courts is always the next best thing..... it worked in Romania, it is working in Turkey and it will work in France. No reason to risk allowing the voters to decide if there is a chance they will make the wrong decision."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Satanist leader’s attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests",
            "external_url": "https://www.cnn.com/2025/03/29/us/kansas-satanist-protest-arrests-hnk/index.html",
            "upvotes": 18225,
            "date": "03/30/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25087823019751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“When we saw that nobody was doing anything — I guess just in the moment of it — it was like, ‘He’s not supposed to be allowed to do this,’ so we tried to stop him,” she said.\n\nThe party of free speech, everybody...",
                "Where’s the don’t tread on me crowd?",
                "The Government of the United States gives to bigotry no sanction, to persecution no assistance. Require only that they who live under its protection should demean themselves as good citizens, in giving it on all occasions their effectual support.\n\n-George Washington\n\n\n\t“We the General Assembly of Virginia… do enact that no man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burdened in his body or goods, nor shall otherwise suffer on account of his religious opinions or belief.”\n\n-Thomas Jefferson\n\n\n\n\t“The civil rights of none shall be abridged on account of religious belief or worship.”\n\n-James Madison",
                "They should have all worn Tesla logos. Then anyone attacking them would have been classified as domestic terrorists. : )",
                "I love that Satanist’s don’t even believe in Satan. It’s the Christians that do.",
                "They say “chaos” but it was positively uneventful compared to what they apparently expected to happen. It was amazing how much of an overreaction there was to this. (Of course hindsight is 20/20). They had police cars surrounding the capitol. An acquaintance who works in the capitol told me they  had SWAT on every floor and hid all the tables and chairs so they couldn’t be used as weapons. They gave all the state workers administrative leave that day too, so they wouldn’t be caught up in anything downtown.\n\nAnd yet despite all the worry about mass violence, there were a ton of children amongst the counter protesters, all dressed in their Sunday best.",
                "*trying to remember if there are any photos or evidence of satanists burning an inverted pentagram in front of a black family's house.",
                "Christians always really struggle to understand that Satanists are a political activist group pointing out the hypocrisy of our government bias towards Christianity, not literal worshipers of Satan. \n\nIt would take less than 5 minutes of googling to understand this. The only ones at that protest who actually believe in Satan are the Christians.",
                "The rational next step is to do a bigger one.",
                "Neo Nazis marching in the streets are protected by police because they say their voices are protected under free speech… but Church of Satan members are not protected?\n\nHave you ever studied other religions? Take some time and study religions other than your own. \n\nThis was never about free speech, or freedom for that matter. It has always been about control. That’s why the current administration is removing your ability to launch class action lawsuits against companies. That’s why this administration is gutting your system of education.\n\nIt’s about control"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Justin Welby: I failed to act on abuse scandal as scale was 'overwhelming'",
            "external_url": "https://www.bbc.com/news/articles/c89y9g83e92o.amp",
            "upvotes": 775,
            "date": "03/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/91dd/live/a38b7350-0c69-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "Something he knew about for years, but decided to turn a blind eye to it, hoping no one would ever find out ..",
                "Will no one rid me of this turbulent priest?",
                "He was very busy at the various galas and embassy parties that he had to attend, for religious purposes only, of course.",
                "He also says he forgives serial abuser.",
                "This guy should be in prison. So many lives were ruined because he was \"Too busy.\"   \nIt was more like he didn't want the scandal and tried to ignore it, hoping it would disappear. \n\nWTF",
                "The fire was too big, so I didn't call the fire department.",
                "> In his first interview since resigning, Welby, 68, told the BBC's Laura Kuenssberg that the sheer scale of the problem was \"a reason – not an excuse\" for his failure to act after taking the job in 2013.\n\"Every day more cases were coming across the desk that had been in the past, hadn't been dealt with adequately, and this was just, it was another case - and yes I knew Smyth but it was an absolutely overwhelming few weeks,\" he said.\n\nBoo hoo. I have zero sympathy for a lazy and corrupt adult who didn't protect children. Who knows how many kids could have been spared trauma if you'd have grown a spine.",
                "I feel you, that's why I haven't done my big pile of laundry yet.",
                "And because of guys like you, Sundays are no longer for Church in my household.",
                "He could have told the police. Maybe they'd have found time."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 20463,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "I think when one can buy democracy at that point democracy is dead.",
                "This is unfucking believable.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 7813,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "They're still pulling this ahit. Seriously, stop firing people."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "9-year-old girl dies after a dental procedure involving anesthesia in Vista",
            "external_url": "https://www.nbcsandiego.com/news/investigations/9-year-old-girl-dies-after-a-dental-procedure-involving-anesthesia-in-vista/3790395/",
            "upvotes": 2227,
            "date": "03/30/2025",
            "thumbnail": "https://media.nbcsandiego.com/2025/03/Dreamtime-Dentistry-Office-1.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Had a friend in college go under for sinus surgery. Was allergic to the anesthesia or some shit and died.",
                "After going through ACLS (Advance Cardiac Life Support) as an ICU nurse and going through the code situations with some dental hygienists working at a dental office offering anesthesia for dental work, I would never submit myself or my children to anesthesia at a dental office. They were so lost, had no idea what they were doing, and I cannot believe they were allowed to pass the super code simulation. I had to have some major dental work (failed/injected root canals requiring the entire tooth to be extracted) I stuck with local numbing and dealt with the discomfort during the work, rather than risk my life in their hands.",
                "There was a case where a patient was coughing while under dental anesthesia so the dentist gave more sedation thinking the anesthesia was too light.\n\nThere was gauze in the airway, that's why the patient was coughing.\n\nPatient died.\n\nIt's not safe for a dentist to try to administer anesthesia while performing dental work, it's best delegated to a dedicated anesthesia provider.",
                "Awful. This is why the UK banned general anaesthesia in dentists in 2002.",
                "Anesthesia scares the shit out of me. You can have the perfect anesthesiologist and the perfect surgery and still not wake up from it.",
                "“At this time, it’s not clear if the dental procedure played a role in her death.”\n\nI think this important piece of information is being glossed over",
                "This breaks my heart.  Poor girl was probably terrified of going to the dentist. I can't imagine the pain the family is going through.",
                "Just tragic\n\nHer poor family too",
                "Everyone ragging on the dentist and general anesthesia in dental settings, but is there any indication it's the dentist's fault or would have gone differently in a hospital setting? Doesn't general anesthesia carry a (small) risk of death, even when performed properly?",
                "My son had a general anesthesia dental procure in September and it was scary for me even though it all went well. He did sleep for a while after waking up initially but I kept checking on him.\n\nMy other experience with general anesthesia in children was my one year old who needed stitches a couple years ago. He had fallen off a chair and cut his chin open. He was very resistant to getting stitches and was wiggling his way out every time the ER doc attempted it. Eventually she threw her hands up saying they would do general anesthesia. She was told no way it was needlessly risky to do it, so we gave it one last go and he let her put the stitches in. Until then I don’t think I had ever considered a risk in doing general anesthesia."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US immigration officials look to expand social media data collection",
            "external_url": "https://apnews.com/article/social-media-immigration-applicants-handles-dhs-f67b480abebff7e451056be17572593d",
            "upvotes": 885,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was reading a thing about 'misbeliefs Gen X has', and it said my generation was foolish because we believed more in anonymity whereas modern generations put themselves out there fully on the net.\n\nReminds me of the joke.. Do you know who the greatest hacker in the world is? *Of course not, if you did they wouldn't be the greatest hacker in the world.*",
                "Friends it is time to kill social media. It's been dying for years but let's all do the right thing and kill it dead.",
                "Ah, just like the Chinese Social Credit system.",
                "What was that?  Sorry, I can't hear you over the sound of my use of Mastodon instead of Facebook!",
                "Hey social media CEOs, remember when you were all about free speech? Wanna do something about that and tell the government to take a hike? Or are you gonna tell us that content moderation by a private company is infringing on free speech but the government literally persecuting people for their opinions isn’t?",
                "This is how the OG nokia brick phone makes a comeback.",
                "Maybe we should all stop using social media until those companies lobby the govt to not collect our data on our behalf. ",
                "Couldn’t u just delete ask your apps n take a burner phone",
                "US looking more like China everyday",
                "Backup your phone.  Delete all histories and app.  Then restore when through immigration.  Trump is copying china and russia.  "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S. Army says recovering 4 soldiers missing in Lithuania \"will be a long and difficult\" operation",
            "external_url": "https://www.cbsnews.com/news/us-soldiers-missing-lithuania-army-m88-hercules-long-difficult-operation/",
            "upvotes": 2169,
            "date": "03/30/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/f7a8a787-ed5d-45be-b008-00d6abbc4d39/thumbnail/1200x630/26472697efa33e738651b8b54845ef3c/lithuania-us-soldiers-2206633876.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "No soldiers left behind. Unless the Secretary of Defense is busy getting horrible tattoos that ruin the flag.",
                "I’m sure the US VP, or defense has already visited the site and offered support. I’m so proud of the US /s",
                "They cut off the, “and we don’t think it’s worth it.” /s",
                "As difficult as finding those who went missing in El Salvador, isn't it?",
                "Well zero news coverage sooo no big deal to the government apparently👎🏼",
                "wait are they still alive?",
                "Sorry. The President is on record saying he prefers soldiers that weren’t captured. That’s why he cleverly dodged the draft. And why he was voted in by the party that demands we support our troops. I’m sure it makes sense to someone smarter than me.",
                "If they text something bad about Trump, his new Gestapo would find them instantly.",
                "\"suckers\" and \"losers\" Donald Trump",
                "[deleted]"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Marine Le Pen’s future to be decided as embezzlement verdict arrives | Marine Le Pen",
            "external_url": "https://www.theguardian.com/world/2025/mar/30/marine-le-pen-alleged-embezzlement-verdict",
            "upvotes": 496,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/58bc467ff40e9de6aeda2a793b5dfee2227854d7/0_154_5625_3375/master/5625.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b13b135841c319ae6e5d0bde43caa396",
            "top_comments": [
                "va te faire foutre fasciste.  Fuck Le Pen and RN",
                "Wasn’t expecting that. I love this for her.",
                "Good. She deserves to fade into irrelevance",
                "Please, just this once, let justice be done and this fascist criminal be put behind bars. I'm tired of the bad guys winning.",
                "Le Penis not mightier!\n\n\nGood to see corruption actually coming to trial. I don't know what the odds are on the verdict, but it seems guilty could bar her from office. Anyone else follow the case more closely and has an idea of where it'll go?",
                "I hope she rots in jail",
                "On espère que la justice triomphe.",
                "5 years is too lenient, these people don't reform and they are politicians, they should be example for the nation, and not of how you mustn't behave. Politicians like that show to people it's alright to do it since THEY get away with it.",
                "It’s always far right that has corruption surrounding them… bolsonaro, milei, trump, lepen… they’re all the same",
                "When you cannot defeat the opposition at the ballot box then using the courts is always the next best thing..... it worked in Romania, it is working in Turkey and it will work in France. No reason to risk allowing the voters to decide if there is a chance they will make the wrong decision."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Magnitude-7.1 earthquake hits Tonga, tsunami threat issued",
            "external_url": "https://www.abc.net.au/news/2025-03-31/magnitude-7-earthquake-hits-tonga-tsunami-threat-issued/105114840",
            "upvotes": 4179,
            "date": "03/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/b9a5cf82d345f4121ba437e1a6894ca9?impolicy=wcms_watermark_news&cropH=480&cropW=853&xPos=0&yPos=62&width=862&height=485&imformat=generic",
            "top_comments": [
                "ring of fire really doing its thing this week\n\n(i say with resignation while sitting on a major fault line)",
                "are two different 7+ quakes that close together in terms of timeframe unusual?",
                "Tsunami warning has been cancelled according to the same source.",
                "Tonga, the place where a large volcano recently detonated? That Tonga?",
                "Oh boy…the population is only 100,000. I hope they stay safe. ",
                "“The US Tsunami Warning Centre says…”  Good job making DOGE aware of your existence. Layoffs coming Monday.",
                "The California corner of the Pacific plate seems *WAY* overdue for a big one unfortunately. The other three corners have suffered from massive earthquakes over the last decade or so.",
                "[https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pntq/executive)",
                "*Inserts this is fine gif*",
                "Dang this weekend has been crazy"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "First orbital rocket launched from mainland Europe crashes after takeoff",
            "external_url": "https://www.theguardian.com/science/2025/mar/30/first-orbital-rocket-launched-europe-crashes-launch-spectrum",
            "upvotes": 298,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10060b8d3fc912884211933a8e0d4e3414dbec4c/0_58_2295_1377/master/2295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0fed1f6a50b7888b86e7980e0e245afc",
            "top_comments": [
                "Leon would call this a \"successful test\".  Celebrations all around.\n\n“This allowed the company to gather a substantial amount of flight data and experience to apply on future missions,” Isar said in a statement. “After the flight was terminated at T+30 seconds, the launch vehicle fell into the sea in a controlled manner.”\n\nChance of Germany Succeeding Next Time: Pretty Damn Good\n\nChance of Germany Consulting or Engaging Musk / USA : ZERO",
                "\"Isar Aerospace, which had warned the initial launch could end prematurely, said the test produced extensive data that its team could learn from.\"\n\nNow hire some experts leaving the US (more rights for employees, yay!), add European precision (well, maybe more pricey than Space X processes/materials?), and this may look pretty good pretty soon.",
                "no worries\n\nMusk has been trying a lot longer and he still blows up",
                "German rocket. Bummer, but at least we Europeans try and make progress in this regard. Now learn from the mistakes and do it again.",
                "My main question after watching that is if not self-destructing and allowing it to blow up on the ground was on purpose.",
                "the EU can fix this with 10 000 more regulations I believe"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Satanist leader’s attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests",
            "external_url": "https://www.cnn.com/2025/03/29/us/kansas-satanist-protest-arrests-hnk/index.html",
            "upvotes": 18230,
            "date": "03/30/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25087823019751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“When we saw that nobody was doing anything — I guess just in the moment of it — it was like, ‘He’s not supposed to be allowed to do this,’ so we tried to stop him,” she said.\n\nThe party of free speech, everybody...",
                "Where’s the don’t tread on me crowd?",
                "The Government of the United States gives to bigotry no sanction, to persecution no assistance. Require only that they who live under its protection should demean themselves as good citizens, in giving it on all occasions their effectual support.\n\n-George Washington\n\n\n\t“We the General Assembly of Virginia… do enact that no man shall be compelled to frequent or support any religious worship, place, or ministry whatsoever, nor shall be enforced, restrained, molested, or burdened in his body or goods, nor shall otherwise suffer on account of his religious opinions or belief.”\n\n-Thomas Jefferson\n\n\n\n\t“The civil rights of none shall be abridged on account of religious belief or worship.”\n\n-James Madison",
                "They should have all worn Tesla logos. Then anyone attacking them would have been classified as domestic terrorists. : )",
                "I love that Satanist’s don’t even believe in Satan. It’s the Christians that do.",
                "They say “chaos” but it was positively uneventful compared to what they apparently expected to happen. It was amazing how much of an overreaction there was to this. (Of course hindsight is 20/20). They had police cars surrounding the capitol. An acquaintance who works in the capitol told me they  had SWAT on every floor and hid all the tables and chairs so they couldn’t be used as weapons. They gave all the state workers administrative leave that day too, so they wouldn’t be caught up in anything downtown.\n\nAnd yet despite all the worry about mass violence, there were a ton of children amongst the counter protesters, all dressed in their Sunday best.",
                "*trying to remember if there are any photos or evidence of satanists burning an inverted pentagram in front of a black family's house.",
                "Christians always really struggle to understand that Satanists are a political activist group pointing out the hypocrisy of our government bias towards Christianity, not literal worshipers of Satan. \n\nIt would take less than 5 minutes of googling to understand this. The only ones at that protest who actually believe in Satan are the Christians.",
                "The rational next step is to do a bigger one.",
                "Neo Nazis marching in the streets are protected by police because they say their voices are protected under free speech… but Church of Satan members are not protected?\n\nHave you ever studied other religions? Take some time and study religions other than your own. \n\nThis was never about free speech, or freedom for that matter. It has always been about control. That’s why the current administration is removing your ability to launch class action lawsuits against companies. That’s why this administration is gutting your system of education.\n\nIt’s about control"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Justin Welby: I failed to act on abuse scandal as scale was 'overwhelming'",
            "external_url": "https://www.bbc.com/news/articles/c89y9g83e92o.amp",
            "upvotes": 774,
            "date": "03/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/91dd/live/a38b7350-0c69-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "Something he knew about for years, but decided to turn a blind eye to it, hoping no one would ever find out ..",
                "Will no one rid me of this turbulent priest?",
                "He was very busy at the various galas and embassy parties that he had to attend, for religious purposes only, of course.",
                "He also says he forgives serial abuser.",
                "This guy should be in prison. So many lives were ruined because he was \"Too busy.\"   \nIt was more like he didn't want the scandal and tried to ignore it, hoping it would disappear. \n\nWTF",
                "The fire was too big, so I didn't call the fire department.",
                "> In his first interview since resigning, Welby, 68, told the BBC's Laura Kuenssberg that the sheer scale of the problem was \"a reason – not an excuse\" for his failure to act after taking the job in 2013.\n\"Every day more cases were coming across the desk that had been in the past, hadn't been dealt with adequately, and this was just, it was another case - and yes I knew Smyth but it was an absolutely overwhelming few weeks,\" he said.\n\nBoo hoo. I have zero sympathy for a lazy and corrupt adult who didn't protect children. Who knows how many kids could have been spared trauma if you'd have grown a spine.",
                "I feel you, that's why I haven't done my big pile of laundry yet.",
                "And because of guys like you, Sundays are no longer for Church in my household.",
                "He could have told the police. Maybe they'd have found time."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 20471,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "I think when one can buy democracy at that point democracy is dead.",
                "This is unfucking believable.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 7813,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "They're still pulling this ahit. Seriously, stop firing people."
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "03/30/2025 20:08:42 UTC"
}