{
    "posts": [
        {
            "category": "HOT",
            "title": "The Catholic Church has elected Cardinal Robert Prevost as pope",
            "external_url": "https://www.houstonpublicmedia.org/npr/2025/05/08/nx-s1-5385327/the-catholic-church-has-elected-cardinal-robert-prevost-as-pope/",
            "upvotes": 13693,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2648x1766+0+0/resize/2648x1766!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2Fbc%2Ff80295a6417489396fcd93f99957%2Fap25128626700383.jpg",
            "top_comments": [
                "From [CBS News last week](https://www.cbsnews.com/news/who-will-be-the-next-pope-list-of-possible-candidates/):\n\n> Chicago-born Cardinal Robert Prevost is seen as having many of the qualities desired in a pope, and if elected, he would become the first U.S. pope in the church's history.\n\n> Prevost is the head of the church's Dicastery for Bishops, meaning he oversees the selection of new bishops. It's a powerful position, and for any cardinal electors who may be turned off by his American nationality, it's not his only one. Prevost is a dual citizen of the U.S. and Peru, where he served for many years.\n\n> Overall, **he's considered a centrist**, but on many social issues he's seen as progressive, embracing marginalized groups like Francis, who championed migrants and the poor. But Prevost opposes ordaining women as deacons, for instance, so he's seen as conservative on church doctrine.\n\n> His age could also be a factor — at 69 some may consider him too young to hold the church's highest office.",
                "From Chicago? Da Bears have God on their side now!",
                "He is a staunch advocate for climate change action and environmental issues",
                "First American. Pope Leo XIV",
                "Deep dish pizza is about to be the national food of the Vatican.",
                "This could be a Pope John Paul II situation, where the Pope is elected from a country specifically to contrast and oppose that country's particularly worrisome regime",
                "WOW. This was COMPLETELY unexpected. He wasn't even talked about as one of the frontrunners. Just to put it into perspective - he had 1-2% betting chance before today",
                "For those wondering, it's sort of a continuation of the previous Pope's idealogical leanings - champions the poor/migrants but is against ordaining women. He's also a dual US-Peru citizen.",
                "What's everyone's thoughts on this guy? Good, bad, indifferent?",
                "Took Shadeur Sanders three days to get drafted but the pope was selected in two"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 41583,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "I know Bill Gates isn't the best person in the world, but holy fuck do I prefer him over most other rich people right now.",
                "Musk will kill this planet just so he can colonize a different dead planet."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 5520,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "Oops. . .\n\nThe platforms need to demonitize these videos.  They're harassment.  A prank is putting googly eyes on all the photos in your mothers house or replacing the soap with potatoes.  It's not scaring the shit out of people or breaking the law.",
                "We've had teens do this to our house. They are not ringing the doorbell and running. They are full force hitting or kicking the front doors several times often until someone opens the door before they run. I live in a split level so they would also pound on the ground floor windows. \n\nWe basically staged a stake out one night. Saw them coming and called the cops. They got caught and we don't get \"ding dong ditched* anymore. \n\nThey're lucky we don't own any guns. I can 100% see these kids getting shot. It was terrifying.",
                "At 3am? Yeah, I can see why the homeowner would think they were trying to break in.",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "Check their phones- I guarantee they were recording it.\n\nMy next door neighbor got a ding dong prank early last year- except instead of ringing the bell they donkey kicked his door and caused the glass to shatter. At 2 in the morning.\n\nGuns got involved. Fortunately none of the stupid kids was shot.",
                "I remember playing ding dong ditch as a kid with some friends. Lived in a country area where homes were further apart. One of the homeowners fired a few shots off after we had ditched their home and were running away. We didn’t know if it was at us or in the air, but we def stopped playing after that day.",
                "to give some context this \"prank\" is common here where i live. this isn't simple ding dong ditch you guys simplify it. \n\nwhen it happened to us it was a group of four teens they rotated running  up to the door and kicking it. they know about the ring cameras and they know how to evade them. i was woken up at 3am with kids upstairs and my fight or flight kicked in guys. you don't have time to look on your ring. \n\nsometimes they also ring the doorbell but again many of these kids don't want to be identified so they cover their faces. again looking like a burglar. \n\ni'm not condoning the shooting i'm just setting some context for people to process what happened on both sides. \n\nit has shaken me and my family up. it's been almost a year and i still get ptsd and we have to check all the doors are locked constantly in what you would consider a safe suburb. \n\nit's not just a prank.",
                "\"TikTok\" + \"Prank\" almost always = \"You're doing something stupid that's likely to get you shot.\"",
                "I have weird military-related PTSD that triggers when unexpected people come to my house. \n\nI’m ashamed to say I yelled at an old Jehova’s Witness woman once for coming back after I told her not to. The unadulterated pure white-hot panic I feel when a loud knock hits my front door gives me days of depression. \n\nSo… I get it. You don’t know what battles people fight in their private homes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "White smoke billows from Sistine Chapel as new pope elected",
            "external_url": "https://www.reuters.com/world/europe/cardinals-set-second-day-conclave-elect-new-pope-2025-05-08/",
            "upvotes": 4328,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the NYT, commentating while they waited: \"With no smoke coming out of the chimney yet, all eyes were again on the birds strolling on the Sistine Chapel’s roof. After seagulls largely dominated the scene, a pigeon briefly took center stage.\"",
                "\"Sister Mona Lisa, a Brazilian nun, was in the square waving a Brazilian flag, in tears. 'I am so happy we have a pope,' she said.\"\n\n\nHow many comments do you think she gets on her name tho",
                "Genuinely surprised it went this quick",
                "The Cardinals have chosen ...... Albert Pujols?",
                "why did I learn about this from an ESPN notification",
                "they picked a pope quicker than a team picked Shedeur Sanders damn",
                "Imagine planning your European vacation and having this go down on your Vatican day.",
                "Please be a good Pope, please be such a good Pope that Marjorie Taylor Green gets an exorcism just by looking at him",
                "First American Pope. Can't tell if that's good or ill omen.",
                "Robert Prevost is the new first American Pope."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UnitedHealthcare sued by shareholders over reaction to CEO's killing",
            "external_url": "https://www.cnbc.com/2025/05/08/unitedhealthcare-sued-by-shareholders-over-reaction-to-ceos-killing.html",
            "upvotes": 899,
            "date": "05/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108071136-1733320864176-horizontal-Brian-Thompson.png?v=1733766690&w=1920&h=1080",
            "top_comments": [
                "The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nThat's all you really need to know about this company and its shareholders.",
                "From the Article \n\n> A group of investors sued UnitedHealthcare Group on Wednesday, accusing the company of misleading them after the killing of its CEO, Brian Thompson.\n\n> The class action lawsuit — filed in the Southern District of New York — accuses the health insurance company of not initially adjusting their 2025 net earning outlook to factor in how Thompson’s killing would affect their operations.\n\n> The investors described this as “materially false and misleading,” pointing to the immense public scrutiny the company and the broader health insurance industry experienced in the wake of Thompson’s killing.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.",
                "I am wondering what this means\n\n\"argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\"\n\nAre they angry they can't be assholes? Am I missing something?",
                "I suspect the problem. causing the loss of income, is not because the CEO is dead, but because of the bad publicity that people now see about United Healthcare.",
                "Who are these shareholders and where do they live? So we can avoid them at all costs.",
                "And I thought the new pope would be the least interesting story of the day \n\n>The legal defense fund for Mangione surpassed the $1 million mark in donations on Tuesday\n\nBut at least it has a happy ending",
                "Sure is a bold move to see someone killed for anti-consumer tactics and sue because they weren't anti-consumer enough. Someone feels too safe",
                "Shareholders of greed and slavery. Capitalism at its best!",
                "> On Dec. 3 — a day before Thompson was fatally shot — the company issued guidance that included net earnings of $28.15 to $28.65 per share and adjusted net earnings of $29.50 to $30.00 per share, the suit notes. And on January 16, the company announced that it was sticking with its old forecast.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\n\nThey are arguing that UnitedHealth should have adjusted their earnings forecast in response to the shooting.",
                "Why would they phrase it as anti-consumer instead of something like “cost preserving“ tactics, or “waste reduction“ tactics like they would usually do. Does it help their case to phrase it that way? Is it directly referencing something UHC did after the ceo was killed?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Pakistan’s Chinese-made jet brought down two Indian fighter aircraft, US officials say",
            "external_url": "https://www.reuters.com/world/pakistans-chinese-made-jet-brought-down-two-indian-fighter-aircraft-us-officials-2025-05-08/",
            "upvotes": 669,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the hulaboo about who shot down who’s jet and how many has been crazy. If either of these countries attack each other with potentially 50+ jets at a time, it’s all but guaranteed some will be shot down. \n\nThey both have fairly advanced 4th generation fighters, which are not stealth fighters. Both countries have capable anti aircraft systems and air to air shoot down capabilities. \n\nNeither of these countries air forces are even remotely invulnerable.",
                "Be prepared for brigading and mass user reports. My post to the aviation sub was auto removed due to mass user reports lol https://www.reddit.com/r/aviation/s/RlQXJOh4Gq\n\nEdit: The users on the Indian defense sub live in their own copium filled reality. They are denying any of these happened and [bragging about how great the Indian military is](https://www.reddit.com/r/IndianDefense/comments/1khm265/air_defence_systems_are_so_bad_that_they_started)\n\n\nIn fact, some of them are proposing to attack China now lol: https://www.reddit.com/r/IndianDefense/comments/1khm265/air_defence_systems_are_so_bad_that_they_started/mr8a693/",
                "Indians are going to downvote the hell out of this, I can fucking feel IT",
                "Well, that isn't good press for Dassault.",
                "In other news India claims that they brought down an F-16 (Indian sources)",
                "Pakistan got a complete system: radar, sam, jets etc from China. India's military equipment are from all over the world. it's not just J10 VS Rafale, more like J10+PL15+whatever radar system vs Rafale.",
                "Yeah, but how trustworthy is US intelligence nowadays?  For all we know they might have been shown a clip from Top Gun.",
                "TLDR: doesn't mention any credible source due to \"anonymity\", and The article is written by Pakistani jurnos.",
                "Sure. Still mad at India not getting the F planes",
                "How many have fallen off aircraft carriers"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "USDA chief says agency is trying to fill key jobs after paying 15,000 to leave",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389922/usda-deferred-resignation-federal-workers-brooke-rollins",
            "upvotes": 1772,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2Fef%2Ff073ccd940c397698bd07095878d%2Fgettyimages-2213159332.jpg",
            "top_comments": [
                "This sounds incredibly efficient",
                "This is the plan per Project 2025. They will fill it with their people now.",
                "Lol A friend who works for a certain state department in DC, got 10 notices from her boss to voluntarily leave w/severance or risk being fired. She took the offer and a week later her boss emailed her that he was forced to write those emails and that he didn't mean her. Apparently they laid off way too many people and now the department is no longer functioning. They offered to hire her back but can't until the contract to resign is complete. This is happening in every department. There is absolutely nothing efficient about this process and the amount of resources we are wasting is going to compound and affect everyone for years to come.",
                "The chainsaw approach will ultimately cost more.",
                "They mean complete ass kissing loyalists to Trump wanted. Only R's need apply.\n\n\nProject 2025 in action",
                "This is what happens when you take a sledgehammer to something that needs a scalpel.",
                "Replacing with yes men. Lots and lots of white yes men.",
                "Who wants to work for the Govt anymore",
                "Nothing like hiring in a bunch of new people with no one around to properly train them.",
                "We are doing everything we can to fix the problem we created."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration invokes state-secrets privilege in Kilmar Abrego Garcia case",
            "external_url": "https://www.cbsnews.com/news/trump-administration-invokes-state-secrets-privilege-kilmar-abrego-garcia-case/",
            "upvotes": 3737,
            "date": "05/08/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/28/48dfd391-f569-4e1c-8f7c-2bc5da5f98ac/thumbnail/1200x630/5a9a69d4782494521a82065f4cd019c4/gettyimages-2211837932.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"This guy's a supervillain but I can't prove it because the proof is classified.\"",
                "Jesus Christ, take the “L”. \n\nBut as others pointed out, they have big plans for renditioning people to gulags with no due process. Can’t let it get stalled right from the get go with judicial oversight…",
                "Yes, the state secret is that Trump and his administration is a bunch of cruel misguided egomaniacs who are destroying the country starting with the rule of law",
                "So we just need them to tell the info to old whiskeyleaks and he will send all the details out in a group text....again",
                "First they said it was administrative error\n\nThen they said he’s a gang member, and when pressed for evidence of that they could only provide hearsay from one CI\n\nNow they’re saying he was deported but they can’t tell anyone why because of “state secrets”?\n\nHOW FUCKING GULLIBLE DO YOU NEED TO BE TO CONTINUE LETTING THEM DO THIS IN BAD FAITH????",
                "But *Trump's* the guy who's constantly claiming to be the victim...\n\nThese people are some truly sleazy assholes.",
                "Courts deal with top secret intelligence often. They put in a process and move on. Stop delaying. You admitted you deported him improperly. Bring him home, present evidence, and deport him through proper means if you want",
                "Trump is a traitor to our nation and should be impeached, removed, convicted, and exiled.",
                "Just bring him back and give him his due process.  Trump is not the only resident of America that is entitled to due process.",
                "Is this that \"radical transparency\" they keep talking about?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Rauf Azhar: IC-814 hijack mastermind and terrorist behind Daniel Pearl's beheading reported killed in Op Sindoor",
            "external_url": "https://www.firstpost.com/world/rauf-azhar-ic-814-hijack-mastermind-and-terrorist-behind-daniel-pearls-beheading-reported-killed-in-op-sindoor-13886646.html",
            "upvotes": 418,
            "date": "05/08/2025",
            "thumbnail": "https://images.firstpost.com/uploads/2025/01/History-1-3-2025-01-7e0852a4367bfb004d0c3a22305d0f4a.jpg?im=FitAndFill=(1200,675)",
            "top_comments": [
                "Damn, there's a name I haven't heard in a long time.  Can't believe that was over 20 years ago.",
                "FINALLY. I’ve remembered Daniel Pearl and happy to see some justice.",
                "Finally, some good news.",
                "Good riddance to bad rubbish. ",
                "I have criticisms of India and Pakistan. In this case, good job India. You nabbed a guy who’s name was made infamous over 20 years ago",
                "The State gave these dead terrorist a STATE FUNERAL, tells you a lot about that nation.",
                "Well good that's how you deal with them. What you don't do is genocide whole regions and pretend you're dealing with them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Lawyers for man executed by firing squad in South Carolina say bullets mostly missed his heart",
            "external_url": "https://apnews.com/article/firing-squad-autopsy-missing-bullet-south-carolina-ffce046a03b2f636f79cff3a50f9474d",
            "upvotes": 377,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He opted to be killed by firing squad rather than lethal injection. Not sure what case the lawyers would realistically present with that in mind.",
                "“Mostly missed his heart” implies to me that at least one did hit his heart. Which seems like the goal, yeah? And in any case, why heart? If you wanted to shoot someone instantaneously, brain.",
                "He's only \"mostly dead\".  There's a big difference between \"mostly dead\" and \"all dead.\"  Mostly dead is slightly alive.",
                "What the fuck does mostly mean lol, either his heart was hit or it wasn't",
                "I think if we are going to do this we should execute via headshot. We should have no sympathy for the witnesses. If they choose to live in a society that uses the death penalty then they should be forced to witness the true horrors of execution. \n\nHell we should even televise it and force every channel to stream it live. Make people witness what they “support”",
                "Not very good shots were they. Not like he was a moving target.",
                "Honest question — Cops do this every day to people without this level of scrutiny. \n\nI'm not saying by any means it's ok, but why the scrutiny here but not for everyone else killed through state or government sanctioned means?\n\nGenuinely curious",
                "The death penalty is barbaric.",
                "So what.\n\nI’m pretty sure the persons he murdered suffered even more. Sorry I have no sympathy",
                "Ohh well that's too bad. If he wasn't out robbing, killing, and dousing people in fuel he wouldn'tve had that issue 🤷‍♂️\n\n\nNot our problem"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UnitedHealthcare sued by shareholders over reaction to CEO's killing",
            "external_url": "https://www.cnbc.com/2025/05/08/unitedhealthcare-sued-by-shareholders-over-reaction-to-ceos-killing.html",
            "upvotes": 899,
            "date": "05/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108071136-1733320864176-horizontal-Brian-Thompson.png?v=1733766690&w=1920&h=1080",
            "top_comments": [
                "The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nThat's all you really need to know about this company and its shareholders.",
                "From the Article \n\n> A group of investors sued UnitedHealthcare Group on Wednesday, accusing the company of misleading them after the killing of its CEO, Brian Thompson.\n\n> The class action lawsuit — filed in the Southern District of New York — accuses the health insurance company of not initially adjusting their 2025 net earning outlook to factor in how Thompson’s killing would affect their operations.\n\n> The investors described this as “materially false and misleading,” pointing to the immense public scrutiny the company and the broader health insurance industry experienced in the wake of Thompson’s killing.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.",
                "I am wondering what this means\n\n\"argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\"\n\nAre they angry they can't be assholes? Am I missing something?",
                "I suspect the problem. causing the loss of income, is not because the CEO is dead, but because of the bad publicity that people now see about United Healthcare.",
                "Who are these shareholders and where do they live? So we can avoid them at all costs.",
                "And I thought the new pope would be the least interesting story of the day \n\n>The legal defense fund for Mangione surpassed the $1 million mark in donations on Tuesday\n\nBut at least it has a happy ending",
                "Sure is a bold move to see someone killed for anti-consumer tactics and sue because they weren't anti-consumer enough. Someone feels too safe",
                "Shareholders of greed and slavery. Capitalism at its best!",
                "> On Dec. 3 — a day before Thompson was fatally shot — the company issued guidance that included net earnings of $28.15 to $28.65 per share and adjusted net earnings of $29.50 to $30.00 per share, the suit notes. And on January 16, the company announced that it was sticking with its old forecast.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\n\nThey are arguing that UnitedHealth should have adjusted their earnings forecast in response to the shooting.",
                "Why would they phrase it as anti-consumer instead of something like “cost preserving“ tactics, or “waste reduction“ tactics like they would usually do. Does it help their case to phrase it that way? Is it directly referencing something UHC did after the ceo was killed?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The Catholic Church has elected Cardinal Robert Prevost as pope",
            "external_url": "https://www.houstonpublicmedia.org/npr/2025/05/08/nx-s1-5385327/the-catholic-church-has-elected-cardinal-robert-prevost-as-pope/",
            "upvotes": 13696,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2648x1766+0+0/resize/2648x1766!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2Fbc%2Ff80295a6417489396fcd93f99957%2Fap25128626700383.jpg",
            "top_comments": [
                "From [CBS News last week](https://www.cbsnews.com/news/who-will-be-the-next-pope-list-of-possible-candidates/):\n\n> Chicago-born Cardinal Robert Prevost is seen as having many of the qualities desired in a pope, and if elected, he would become the first U.S. pope in the church's history.\n\n> Prevost is the head of the church's Dicastery for Bishops, meaning he oversees the selection of new bishops. It's a powerful position, and for any cardinal electors who may be turned off by his American nationality, it's not his only one. Prevost is a dual citizen of the U.S. and Peru, where he served for many years.\n\n> Overall, **he's considered a centrist**, but on many social issues he's seen as progressive, embracing marginalized groups like Francis, who championed migrants and the poor. But Prevost opposes ordaining women as deacons, for instance, so he's seen as conservative on church doctrine.\n\n> His age could also be a factor — at 69 some may consider him too young to hold the church's highest office.",
                "From Chicago? Da Bears have God on their side now!",
                "He is a staunch advocate for climate change action and environmental issues",
                "First American. Pope Leo XIV",
                "Deep dish pizza is about to be the national food of the Vatican.",
                "This could be a Pope John Paul II situation, where the Pope is elected from a country specifically to contrast and oppose that country's particularly worrisome regime",
                "WOW. This was COMPLETELY unexpected. He wasn't even talked about as one of the frontrunners. Just to put it into perspective - he had 1-2% betting chance before today",
                "For those wondering, it's sort of a continuation of the previous Pope's idealogical leanings - champions the poor/migrants but is against ordaining women. He's also a dual US-Peru citizen.",
                "What's everyone's thoughts on this guy? Good, bad, indifferent?",
                "Took Shadeur Sanders three days to get drafted but the pope was selected in two"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pakistan’s Chinese-made jet brought down two Indian fighter aircraft, US officials say",
            "external_url": "https://www.reuters.com/world/pakistans-chinese-made-jet-brought-down-two-indian-fighter-aircraft-us-officials-2025-05-08/",
            "upvotes": 670,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the hulaboo about who shot down who’s jet and how many has been crazy. If either of these countries attack each other with potentially 50+ jets at a time, it’s all but guaranteed some will be shot down. \n\nThey both have fairly advanced 4th generation fighters, which are not stealth fighters. Both countries have capable anti aircraft systems and air to air shoot down capabilities. \n\nNeither of these countries air forces are even remotely invulnerable.",
                "Be prepared for brigading and mass user reports. My post to the aviation sub was auto removed due to mass user reports lol https://www.reddit.com/r/aviation/s/RlQXJOh4Gq\n\nEdit: The users on the Indian defense sub live in their own copium filled reality. They are denying any of these happened and [bragging about how great the Indian military is](https://www.reddit.com/r/IndianDefense/comments/1khm265/air_defence_systems_are_so_bad_that_they_started)\n\n\nIn fact, some of them are proposing to attack China now lol: https://www.reddit.com/r/IndianDefense/comments/1khm265/air_defence_systems_are_so_bad_that_they_started/mr8a693/",
                "Indians are going to downvote the hell out of this, I can fucking feel IT",
                "Well, that isn't good press for Dassault.",
                "In other news India claims that they brought down an F-16 (Indian sources)",
                "Pakistan got a complete system: radar, sam, jets etc from China. India's military equipment are from all over the world. it's not just J10 VS Rafale, more like J10+PL15+whatever radar system vs Rafale.",
                "Yeah, but how trustworthy is US intelligence nowadays?  For all we know they might have been shown a clip from Top Gun.",
                "TLDR: doesn't mention any credible source due to \"anonymity\", and The article is written by Pakistani jurnos.",
                "Sure. Still mad at India not getting the F planes",
                "How many have fallen off aircraft carriers"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Rauf Azhar: IC-814 hijack mastermind and terrorist behind Daniel Pearl's beheading reported killed in Op Sindoor",
            "external_url": "https://www.firstpost.com/world/rauf-azhar-ic-814-hijack-mastermind-and-terrorist-behind-daniel-pearls-beheading-reported-killed-in-op-sindoor-13886646.html",
            "upvotes": 418,
            "date": "05/08/2025",
            "thumbnail": "https://images.firstpost.com/uploads/2025/01/History-1-3-2025-01-7e0852a4367bfb004d0c3a22305d0f4a.jpg?im=FitAndFill=(1200,675)",
            "top_comments": [
                "Damn, there's a name I haven't heard in a long time.  Can't believe that was over 20 years ago.",
                "FINALLY. I’ve remembered Daniel Pearl and happy to see some justice.",
                "Finally, some good news.",
                "Good riddance to bad rubbish. ",
                "I have criticisms of India and Pakistan. In this case, good job India. You nabbed a guy who’s name was made infamous over 20 years ago",
                "The State gave these dead terrorist a STATE FUNERAL, tells you a lot about that nation.",
                "Well good that's how you deal with them. What you don't do is genocide whole regions and pretend you're dealing with them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White smoke billows from Sistine Chapel as new pope elected",
            "external_url": "https://www.reuters.com/world/europe/cardinals-set-second-day-conclave-elect-new-pope-2025-05-08/",
            "upvotes": 4328,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the NYT, commentating while they waited: \"With no smoke coming out of the chimney yet, all eyes were again on the birds strolling on the Sistine Chapel’s roof. After seagulls largely dominated the scene, a pigeon briefly took center stage.\"",
                "\"Sister Mona Lisa, a Brazilian nun, was in the square waving a Brazilian flag, in tears. 'I am so happy we have a pope,' she said.\"\n\n\nHow many comments do you think she gets on her name tho",
                "Genuinely surprised it went this quick",
                "The Cardinals have chosen ...... Albert Pujols?",
                "why did I learn about this from an ESPN notification",
                "they picked a pope quicker than a team picked Shedeur Sanders damn",
                "Imagine planning your European vacation and having this go down on your Vatican day.",
                "Please be a good Pope, please be such a good Pope that Marjorie Taylor Green gets an exorcism just by looking at him",
                "First American Pope. Can't tell if that's good or ill omen.",
                "Robert Prevost is the new first American Pope."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli forces close Unrwa-run schools in East Jerusalem",
            "external_url": "https://www.bbc.com/news/articles/cqxej00w3wno",
            "upvotes": 260,
            "date": "05/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7e56/live/b15e8730-2c0b-11f0-8da1-ad2bbee6cda5.jpg",
            "top_comments": [
                "Worth knowing\n\n> Captured and occupied in 1967, this area was unilaterally annexed by Israel in 1980. Under international law, East Jerusalem is considered part of the West Bank, and Palestinian territories, and under illegal occupation by Israel.",
                "> Unrwa’s Commissioner-General, Philippe Lazzarini, said Israeli authorities were denying children their basic right to learn and accused them of a “blatant disregard of international law.”\n\nIt’s clear they don’t care because they can count on the West to keep enabling.",
                "Israel is amazing at conditioning people to hate them. Setting up the next generation of fighters.",
                "FUCK ISRAEL. what an evil fucking country",
                "When the schools are run by an organization whose staff took part in the Oct 7th atrocities, its time for that organization to be banned from running schools.",
                "UNRWA has a terrorism problem\n\nSeveral actors stopped funding them for it including the united states\n\nThere is a lot of evidence. \n\nEvidence for what they teach in schools too.\n\nUNRWA had it coming"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 5520,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "Oops. . .\n\nThe platforms need to demonitize these videos.  They're harassment.  A prank is putting googly eyes on all the photos in your mothers house or replacing the soap with potatoes.  It's not scaring the shit out of people or breaking the law.",
                "We've had teens do this to our house. They are not ringing the doorbell and running. They are full force hitting or kicking the front doors several times often until someone opens the door before they run. I live in a split level so they would also pound on the ground floor windows. \n\nWe basically staged a stake out one night. Saw them coming and called the cops. They got caught and we don't get \"ding dong ditched* anymore. \n\nThey're lucky we don't own any guns. I can 100% see these kids getting shot. It was terrifying.",
                "At 3am? Yeah, I can see why the homeowner would think they were trying to break in.",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "Check their phones- I guarantee they were recording it.\n\nMy next door neighbor got a ding dong prank early last year- except instead of ringing the bell they donkey kicked his door and caused the glass to shatter. At 2 in the morning.\n\nGuns got involved. Fortunately none of the stupid kids was shot.",
                "I remember playing ding dong ditch as a kid with some friends. Lived in a country area where homes were further apart. One of the homeowners fired a few shots off after we had ditched their home and were running away. We didn’t know if it was at us or in the air, but we def stopped playing after that day.",
                "to give some context this \"prank\" is common here where i live. this isn't simple ding dong ditch you guys simplify it. \n\nwhen it happened to us it was a group of four teens they rotated running  up to the door and kicking it. they know about the ring cameras and they know how to evade them. i was woken up at 3am with kids upstairs and my fight or flight kicked in guys. you don't have time to look on your ring. \n\nsometimes they also ring the doorbell but again many of these kids don't want to be identified so they cover their faces. again looking like a burglar. \n\ni'm not condoning the shooting i'm just setting some context for people to process what happened on both sides. \n\nit has shaken me and my family up. it's been almost a year and i still get ptsd and we have to check all the doors are locked constantly in what you would consider a safe suburb. \n\nit's not just a prank.",
                "\"TikTok\" + \"Prank\" almost always = \"You're doing something stupid that's likely to get you shot.\"",
                "I have weird military-related PTSD that triggers when unexpected people come to my house. \n\nI’m ashamed to say I yelled at an old Jehova’s Witness woman once for coming back after I told her not to. The unadulterated pure white-hot panic I feel when a loud knock hits my front door gives me days of depression. \n\nSo… I get it. You don’t know what battles people fight in their private homes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Lawyers for man executed by firing squad in South Carolina say bullets mostly missed his heart",
            "external_url": "https://apnews.com/article/firing-squad-autopsy-missing-bullet-south-carolina-ffce046a03b2f636f79cff3a50f9474d",
            "upvotes": 379,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He opted to be killed by firing squad rather than lethal injection. Not sure what case the lawyers would realistically present with that in mind.",
                "“Mostly missed his heart” implies to me that at least one did hit his heart. Which seems like the goal, yeah? And in any case, why heart? If you wanted to shoot someone instantaneously, brain.",
                "He's only \"mostly dead\".  There's a big difference between \"mostly dead\" and \"all dead.\"  Mostly dead is slightly alive.",
                "What the fuck does mostly mean lol, either his heart was hit or it wasn't",
                "I think if we are going to do this we should execute via headshot. We should have no sympathy for the witnesses. If they choose to live in a society that uses the death penalty then they should be forced to witness the true horrors of execution. \n\nHell we should even televise it and force every channel to stream it live. Make people witness what they “support”",
                "Not very good shots were they. Not like he was a moving target.",
                "Honest question — Cops do this every day to people without this level of scrutiny. \n\nI'm not saying by any means it's ok, but why the scrutiny here but not for everyone else killed through state or government sanctioned means?\n\nGenuinely curious",
                "The death penalty is barbaric.",
                "So what.\n\nI’m pretty sure the persons he murdered suffered even more. Sorry I have no sympathy",
                "Ohh well that's too bad. If he wasn't out robbing, killing, and dousing people in fuel he wouldn'tve had that issue 🤷‍♂️\n\n\nNot our problem"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 41590,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "I know Bill Gates isn't the best person in the world, but holy fuck do I prefer him over most other rich people right now.",
                "Musk will kill this planet just so he can colonize a different dead planet."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration invokes state-secrets privilege in Kilmar Abrego Garcia case",
            "external_url": "https://www.cbsnews.com/news/trump-administration-invokes-state-secrets-privilege-kilmar-abrego-garcia-case/",
            "upvotes": 3737,
            "date": "05/08/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/28/48dfd391-f569-4e1c-8f7c-2bc5da5f98ac/thumbnail/1200x630/5a9a69d4782494521a82065f4cd019c4/gettyimages-2211837932.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"This guy's a supervillain but I can't prove it because the proof is classified.\"",
                "Jesus Christ, take the “L”. \n\nBut as others pointed out, they have big plans for renditioning people to gulags with no due process. Can’t let it get stalled right from the get go with judicial oversight…",
                "Yes, the state secret is that Trump and his administration is a bunch of cruel misguided egomaniacs who are destroying the country starting with the rule of law",
                "So we just need them to tell the info to old whiskeyleaks and he will send all the details out in a group text....again",
                "First they said it was administrative error\n\nThen they said he’s a gang member, and when pressed for evidence of that they could only provide hearsay from one CI\n\nNow they’re saying he was deported but they can’t tell anyone why because of “state secrets”?\n\nHOW FUCKING GULLIBLE DO YOU NEED TO BE TO CONTINUE LETTING THEM DO THIS IN BAD FAITH????",
                "But *Trump's* the guy who's constantly claiming to be the victim...\n\nThese people are some truly sleazy assholes.",
                "Courts deal with top secret intelligence often. They put in a process and move on. Stop delaying. You admitted you deported him improperly. Bring him home, present evidence, and deport him through proper means if you want",
                "Trump is a traitor to our nation and should be impeached, removed, convicted, and exiled.",
                "Just bring him back and give him his due process.  Trump is not the only resident of America that is entitled to due process.",
                "Is this that \"radical transparency\" they keep talking about?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UnitedHealthcare sued by shareholders over reaction to CEO's killing",
            "external_url": "https://www.cnbc.com/2025/05/08/unitedhealthcare-sued-by-shareholders-over-reaction-to-ceos-killing.html",
            "upvotes": 898,
            "date": "05/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108071136-1733320864176-horizontal-Brian-Thompson.png?v=1733766690&w=1920&h=1080",
            "top_comments": [
                "The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nThat's all you really need to know about this company and its shareholders.",
                "From the Article \n\n> A group of investors sued UnitedHealthcare Group on Wednesday, accusing the company of misleading them after the killing of its CEO, Brian Thompson.\n\n> The class action lawsuit — filed in the Southern District of New York — accuses the health insurance company of not initially adjusting their 2025 net earning outlook to factor in how Thompson’s killing would affect their operations.\n\n> The investors described this as “materially false and misleading,” pointing to the immense public scrutiny the company and the broader health insurance industry experienced in the wake of Thompson’s killing.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.",
                "I am wondering what this means\n\n\"argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\"\n\nAre they angry they can't be assholes? Am I missing something?",
                "I suspect the problem. causing the loss of income, is not because the CEO is dead, but because of the bad publicity that people now see about United Healthcare.",
                "Who are these shareholders and where do they live? So we can avoid them at all costs.",
                "And I thought the new pope would be the least interesting story of the day \n\n>The legal defense fund for Mangione surpassed the $1 million mark in donations on Tuesday\n\nBut at least it has a happy ending",
                "Sure is a bold move to see someone killed for anti-consumer tactics and sue because they weren't anti-consumer enough. Someone feels too safe",
                "Shareholders of greed and slavery. Capitalism at its best!",
                "> On Dec. 3 — a day before Thompson was fatally shot — the company issued guidance that included net earnings of $28.15 to $28.65 per share and adjusted net earnings of $29.50 to $30.00 per share, the suit notes. And on January 16, the company announced that it was sticking with its old forecast.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\n\nThey are arguing that UnitedHealth should have adjusted their earnings forecast in response to the shooting.",
                "Why would they phrase it as anti-consumer instead of something like “cost preserving“ tactics, or “waste reduction“ tactics like they would usually do. Does it help their case to phrase it that way? Is it directly referencing something UHC did after the ceo was killed?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "White smoke billows from Sistine Chapel as new pope elected",
            "external_url": "https://www.reuters.com/world/europe/cardinals-set-second-day-conclave-elect-new-pope-2025-05-08/",
            "upvotes": 4326,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the NYT, commentating while they waited: \"With no smoke coming out of the chimney yet, all eyes were again on the birds strolling on the Sistine Chapel’s roof. After seagulls largely dominated the scene, a pigeon briefly took center stage.\"",
                "\"Sister Mona Lisa, a Brazilian nun, was in the square waving a Brazilian flag, in tears. 'I am so happy we have a pope,' she said.\"\n\n\nHow many comments do you think she gets on her name tho",
                "Genuinely surprised it went this quick",
                "The Cardinals have chosen ...... Albert Pujols?",
                "why did I learn about this from an ESPN notification",
                "they picked a pope quicker than a team picked Shedeur Sanders damn",
                "Imagine planning your European vacation and having this go down on your Vatican day.",
                "Please be a good Pope, please be such a good Pope that Marjorie Taylor Green gets an exorcism just by looking at him",
                "First American Pope. Can't tell if that's good or ill omen.",
                "Robert Prevost is the new first American Pope."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The Catholic Church has elected Cardinal Robert Prevost as pope",
            "external_url": "https://www.houstonpublicmedia.org/npr/2025/05/08/nx-s1-5385327/the-catholic-church-has-elected-cardinal-robert-prevost-as-pope/",
            "upvotes": 13687,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2648x1766+0+0/resize/2648x1766!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2Fbc%2Ff80295a6417489396fcd93f99957%2Fap25128626700383.jpg",
            "top_comments": [
                "From [CBS News last week](https://www.cbsnews.com/news/who-will-be-the-next-pope-list-of-possible-candidates/):\n\n> Chicago-born Cardinal Robert Prevost is seen as having many of the qualities desired in a pope, and if elected, he would become the first U.S. pope in the church's history.\n\n> Prevost is the head of the church's Dicastery for Bishops, meaning he oversees the selection of new bishops. It's a powerful position, and for any cardinal electors who may be turned off by his American nationality, it's not his only one. Prevost is a dual citizen of the U.S. and Peru, where he served for many years.\n\n> Overall, **he's considered a centrist**, but on many social issues he's seen as progressive, embracing marginalized groups like Francis, who championed migrants and the poor. But Prevost opposes ordaining women as deacons, for instance, so he's seen as conservative on church doctrine.\n\n> His age could also be a factor — at 69 some may consider him too young to hold the church's highest office.",
                "From Chicago? Da Bears have God on their side now!",
                "He is a staunch advocate for climate change action and environmental issues",
                "First American. Pope Leo XIV",
                "Deep dish pizza is about to be the national food of the Vatican.",
                "This could be a Pope John Paul II situation, where the Pope is elected from a country specifically to contrast and oppose that country's particularly worrisome regime",
                "WOW. This was COMPLETELY unexpected. He wasn't even talked about as one of the frontrunners. Just to put it into perspective - he had 1-2% betting chance before today",
                "For those wondering, it's sort of a continuation of the previous Pope's idealogical leanings - champions the poor/migrants but is against ordaining women. He's also a dual US-Peru citizen.",
                "What's everyone's thoughts on this guy? Good, bad, indifferent?",
                "Took Shadeur Sanders three days to get drafted but the pope was selected in two"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Pakistan’s Chinese-made jet brought down two Indian fighter aircraft, US officials say",
            "external_url": "https://www.reuters.com/world/pakistans-chinese-made-jet-brought-down-two-indian-fighter-aircraft-us-officials-2025-05-08/",
            "upvotes": 674,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the hulaboo about who shot down who’s jet and how many has been crazy. If either of these countries attack each other with potentially 50+ jets at a time, it’s all but guaranteed some will be shot down. \n\nThey both have fairly advanced 4th generation fighters, which are not stealth fighters. Both countries have capable anti aircraft systems and air to air shoot down capabilities. \n\nNeither of these countries air forces are even remotely invulnerable.",
                "Be prepared for brigading and mass user reports. My post to the aviation sub was auto removed due to mass user reports lol https://www.reddit.com/r/aviation/s/RlQXJOh4Gq\n\nEdit: The users on the Indian defense sub live in their own copium filled reality. They are denying any of these happened and [bragging about how great the Indian military is](https://www.reddit.com/r/IndianDefense/comments/1khm265/air_defence_systems_are_so_bad_that_they_started)\n\n\nIn fact, some of them are proposing to attack China now lol: https://www.reddit.com/r/IndianDefense/comments/1khm265/air_defence_systems_are_so_bad_that_they_started/mr8a693/",
                "Indians are going to downvote the hell out of this, I can fucking feel IT",
                "Well, that isn't good press for Dassault.",
                "In other news India claims that they brought down an F-16 (Indian sources)",
                "Pakistan got a complete system: radar, sam, jets etc from China. India's military equipment are from all over the world. it's not just J10 VS Rafale, more like J10+PL15+whatever radar system vs Rafale.",
                "Yeah, but how trustworthy is US intelligence nowadays?  For all we know they might have been shown a clip from Top Gun.",
                "TLDR: doesn't mention any credible source due to \"anonymity\", and The article is written by Pakistani jurnos.",
                "Sure. Still mad at India not getting the F planes",
                "How many have fallen off aircraft carriers"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Rauf Azhar: IC-814 hijack mastermind and terrorist behind Daniel Pearl's beheading reported killed in Op Sindoor",
            "external_url": "https://www.firstpost.com/world/rauf-azhar-ic-814-hijack-mastermind-and-terrorist-behind-daniel-pearls-beheading-reported-killed-in-op-sindoor-13886646.html",
            "upvotes": 414,
            "date": "05/08/2025",
            "thumbnail": "https://images.firstpost.com/uploads/2025/01/History-1-3-2025-01-7e0852a4367bfb004d0c3a22305d0f4a.jpg?im=FitAndFill=(1200,675)",
            "top_comments": [
                "Damn, there's a name I haven't heard in a long time.  Can't believe that was over 20 years ago.",
                "FINALLY. I’ve remembered Daniel Pearl and happy to see some justice.",
                "Finally, some good news.",
                "Good riddance to bad rubbish. ",
                "I have criticisms of India and Pakistan. In this case, good job India. You nabbed a guy who’s name was made infamous over 20 years ago",
                "The State gave these dead terrorist a STATE FUNERAL, tells you a lot about that nation.",
                "Well good that's how you deal with them. What you don't do is genocide whole regions and pretend you're dealing with them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 5516,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "Oops. . .\n\nThe platforms need to demonitize these videos.  They're harassment.  A prank is putting googly eyes on all the photos in your mothers house or replacing the soap with potatoes.  It's not scaring the shit out of people or breaking the law.",
                "We've had teens do this to our house. They are not ringing the doorbell and running. They are full force hitting or kicking the front doors several times often until someone opens the door before they run. I live in a split level so they would also pound on the ground floor windows. \n\nWe basically staged a stake out one night. Saw them coming and called the cops. They got caught and we don't get \"ding dong ditched* anymore. \n\nThey're lucky we don't own any guns. I can 100% see these kids getting shot. It was terrifying.",
                "At 3am? Yeah, I can see why the homeowner would think they were trying to break in.",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "Check their phones- I guarantee they were recording it.\n\nMy next door neighbor got a ding dong prank early last year- except instead of ringing the bell they donkey kicked his door and caused the glass to shatter. At 2 in the morning.\n\nGuns got involved. Fortunately none of the stupid kids was shot.",
                "I remember playing ding dong ditch as a kid with some friends. Lived in a country area where homes were further apart. One of the homeowners fired a few shots off after we had ditched their home and were running away. We didn’t know if it was at us or in the air, but we def stopped playing after that day.",
                "to give some context this \"prank\" is common here where i live. this isn't simple ding dong ditch you guys simplify it. \n\nwhen it happened to us it was a group of four teens they rotated running  up to the door and kicking it. they know about the ring cameras and they know how to evade them. i was woken up at 3am with kids upstairs and my fight or flight kicked in guys. you don't have time to look on your ring. \n\nsometimes they also ring the doorbell but again many of these kids don't want to be identified so they cover their faces. again looking like a burglar. \n\ni'm not condoning the shooting i'm just setting some context for people to process what happened on both sides. \n\nit has shaken me and my family up. it's been almost a year and i still get ptsd and we have to check all the doors are locked constantly in what you would consider a safe suburb. \n\nit's not just a prank.",
                "\"TikTok\" + \"Prank\" almost always = \"You're doing something stupid that's likely to get you shot.\"",
                "I have weird military-related PTSD that triggers when unexpected people come to my house. \n\nI’m ashamed to say I yelled at an old Jehova’s Witness woman once for coming back after I told her not to. The unadulterated pure white-hot panic I feel when a loud knock hits my front door gives me days of depression. \n\nSo… I get it. You don’t know what battles people fight in their private homes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli forces close Unrwa-run schools in East Jerusalem",
            "external_url": "https://www.bbc.com/news/articles/cqxej00w3wno",
            "upvotes": 263,
            "date": "05/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7e56/live/b15e8730-2c0b-11f0-8da1-ad2bbee6cda5.jpg",
            "top_comments": [
                "Worth knowing\n\n> Captured and occupied in 1967, this area was unilaterally annexed by Israel in 1980. Under international law, East Jerusalem is considered part of the West Bank, and Palestinian territories, and under illegal occupation by Israel.",
                "> Unrwa’s Commissioner-General, Philippe Lazzarini, said Israeli authorities were denying children their basic right to learn and accused them of a “blatant disregard of international law.”\n\nIt’s clear they don’t care because they can count on the West to keep enabling.",
                "Israel is amazing at conditioning people to hate them. Setting up the next generation of fighters.",
                "FUCK ISRAEL. what an evil fucking country",
                "When the schools are run by an organization whose staff took part in the Oct 7th atrocities, its time for that organization to be banned from running schools.",
                "UNRWA has a terrorism problem\n\nSeveral actors stopped funding them for it including the united states\n\nThere is a lot of evidence. \n\nEvidence for what they teach in schools too.\n\nUNRWA had it coming"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Lawyers for man executed by firing squad in South Carolina say bullets mostly missed his heart",
            "external_url": "https://apnews.com/article/firing-squad-autopsy-missing-bullet-south-carolina-ffce046a03b2f636f79cff3a50f9474d",
            "upvotes": 381,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He opted to be killed by firing squad rather than lethal injection. Not sure what case the lawyers would realistically present with that in mind.",
                "“Mostly missed his heart” implies to me that at least one did hit his heart. Which seems like the goal, yeah? And in any case, why heart? If you wanted to shoot someone instantaneously, brain.",
                "He's only \"mostly dead\".  There's a big difference between \"mostly dead\" and \"all dead.\"  Mostly dead is slightly alive.",
                "What the fuck does mostly mean lol, either his heart was hit or it wasn't",
                "I think if we are going to do this we should execute via headshot. We should have no sympathy for the witnesses. If they choose to live in a society that uses the death penalty then they should be forced to witness the true horrors of execution. \n\nHell we should even televise it and force every channel to stream it live. Make people witness what they “support”",
                "Not very good shots were they. Not like he was a moving target.",
                "Honest question — Cops do this every day to people without this level of scrutiny. \n\nI'm not saying by any means it's ok, but why the scrutiny here but not for everyone else killed through state or government sanctioned means?\n\nGenuinely curious",
                "The death penalty is barbaric.",
                "So what.\n\nI’m pretty sure the persons he murdered suffered even more. Sorry I have no sympathy",
                "Ohh well that's too bad. If he wasn't out robbing, killing, and dousing people in fuel he wouldn'tve had that issue 🤷‍♂️\n\n\nNot our problem"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 41602,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "I know Bill Gates isn't the best person in the world, but holy fuck do I prefer him over most other rich people right now.",
                "Musk will kill this planet just so he can colonize a different dead planet."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "USDA chief says agency is trying to fill key jobs after paying 15,000 to leave",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389922/usda-deferred-resignation-federal-workers-brooke-rollins",
            "upvotes": 1773,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2Fef%2Ff073ccd940c397698bd07095878d%2Fgettyimages-2213159332.jpg",
            "top_comments": [
                "This sounds incredibly efficient",
                "This is the plan per Project 2025. They will fill it with their people now.",
                "Lol A friend who works for a certain state department in DC, got 10 notices from her boss to voluntarily leave w/severance or risk being fired. She took the offer and a week later her boss emailed her that he was forced to write those emails and that he didn't mean her. Apparently they laid off way too many people and now the department is no longer functioning. They offered to hire her back but can't until the contract to resign is complete. This is happening in every department. There is absolutely nothing efficient about this process and the amount of resources we are wasting is going to compound and affect everyone for years to come.",
                "The chainsaw approach will ultimately cost more.",
                "They mean complete ass kissing loyalists to Trump wanted. Only R's need apply.\n\n\nProject 2025 in action",
                "This is what happens when you take a sledgehammer to something that needs a scalpel.",
                "Replacing with yes men. Lots and lots of white yes men.",
                "Who wants to work for the Govt anymore",
                "Nothing like hiring in a bunch of new people with no one around to properly train them.",
                "We are doing everything we can to fix the problem we created."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/08/2025 20:10:28 UTC"
}