{
    "posts": [
        {
            "category": "HOT",
            "title": "White House stunned as Hegseth inquiry brings up illegal wiretap claims",
            "external_url": "https://www.theguardian.com/us-news/2025/may/27/hegseth-pentagon-leak-investigation-wiretap",
            "upvotes": 3946,
            "date": "05/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/531eb17c00739d970da245fe8d17823228251b16/1023_249_3601_2882/master/3601.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=192f07ecc59f0eae9cb3a1e78d4a0bdc",
            "top_comments": [
                "So how many times is it gonna take Hegseth making everyone look like idiots before they do something about it?",
                "\" being fed dubious information by Hegseth’s personal lawyer, Tim Parlatore, who had been tasked with overseeing the investigation.\" \n\nAre. You. Fucking. KIDDING ME?! his PERSONAL lawyer is now getting involved with ANYTHING related to the Pentagon or aids in the Pentagon or fucking anything related to the US government?!?!",
                "The White House ain't stunned. The White House probably asked him to do it.\n\n\nDamn headlines are ass there days.",
                "Hah!\n\n\"But the illegal wiretap claim and Caldwell’s denials fueled a breakdown in trust between the Pentagon and the White House, where the Trump advisers tracking the investigation have privately suggested they no longer have any idea about who or what to believe.\"\n\nThis admin has spouted so many lies they don't even believe themselves anymore.",
                "Pretty obvious the trump crime family wanted him to use illegal methods of... Everything they do ",
                "Wait didn't they accuse-\n\nAh fuck it this is just par for the course",
                "If they don’t get Hegseth under control, he is going to start wiretapping kegs.",
                "He probably tapped the White House staff to get compromising materials in case they try to fire him...",
                "tRump's main criteria is that the SecDef is loyal enough to order troops to attack American citizens and politicians. ",
                "I'm sure they're stunned. Just like I'm stunned when I find the cheese my daughter has hid in her desk drawer for the 40th time."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Warning after 250 million bees escape overturned truck in US",
            "external_url": "https://www.bbc.co.uk/news/articles/c23mrprk952o",
            "upvotes": 3641,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afdf/live/ca544700-3dd3-11f0-8853-41527df633df.jpg",
            "top_comments": [
                "This is a real tragedy. These trucks take bees from thousands of keepers down to California for events like almond plant pollination. If they can’t clean it up in a way that gives the bees time to find their own queens among the wreckage, almost all of them are doomed. And it’ll be a total loss for the farmers, pending insurance. California farmers need to find more bees or not get pollinated, Washington farmers need to replace the bees they’ve raised. Local region gets a bunch of stressed out honeybees with nowhere to go. It’ll take some really careful mitigation to recover it all, on top of handling the accident and the surrounding humanity. \n\nAlso, ridiculous that our farming infrastructure requires bee imports for pollination. How about boost the habitat around the farms and cut down on the monoculture crops? All the highways and stormwater ditches should be no-mow in the dry summer. Retain moisture in the vegetation and give a wildlife coordinator to connect habitat fragments and boost pollination. And save on public works maintenance costs. The problem for these bees is that there are no flowers most of the summer, and then a mega monoculture blooms and expects there to be billions of bees and butterflies to support it. But also here’s neurological pesticides like neonics to kill the “bad bugs.” You reap what you sow. ",
                "there are roughly 30,000 bees in a hive at this time of year.\n\n33 hives to reach a million.\n\n250x33 is 8250 hive boxes.\n\na Langstroth hive is roughly 20x16x12 inches.  So you'd get 6 on a standard pallet layer, maybe 3 layers preparatory for doublestacking.. that's 458 pallets.\n\nI think the deputy making the announcement was off by a factor of 4 to 5.  Still a terrifying event, though.",
                "I’m surprised that 250 million bees is only one truckload",
                "Watch out! Incoming pollination!",
                "[removed]",
                "Flat country, looks like a straight, quiet two-lane road, no intersection, no other cars, how did his load end up sideways in the ditch?\n\nEdit: NYT photo suggests it was turning right and couldn't roll the front out far enough to miss the ditch with the rear wheels. That's why the tractor was in the left lane.",
                "Wu Tang Killer Bees. \n\nThey gonna swarm. ",
                "That’s one way to create a lot of buzz.",
                "[Nice Cage clears throat]",
                "Someone call the Texas bee lady! \n\n\"And it was another great day of saving the beeeeeeez\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "PBS sues Trump over executive order to cut funding",
            "external_url": "https://www.cnbc.com/2025/05/30/pbs-trump-funding-sesame-street.html",
            "upvotes": 43505,
            "date": "05/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103943-1739913080624-gettyimages-2200462311-331a9475_idjtyoi9.jpeg?v=1748643066&w=1920&h=1080",
            "top_comments": [
                ">PBS disputes those charged assertions in the strongest possible terms. But regardless of any policy disagreements over the role of public television, our Constitution and laws forbid the President from serving as the arbiter of the content of PBS’s programming, including by attempting to defund PBS.\n\n\n\n>Lest there be any doubt that the Executive Branch should have no power to influence CPB’s decision-making, Congress enacted a specific “\\[p\\]rohibition”: no “department, agency, officer, or employee of the United States” may “exercise any direction, supervision, or control over public telecommunications, or over \\[CPB\\] or any of its grantees”—including with respect to “the content or distribution of public telecommunications programs and services.” 47 U.S.C. § 398(a), (c) (emphases added).\n\nPerfectly clear violation of the letter and spirt of the law. Open and shut case, no legal authority. Supreme Court 6-3 victory for Trump.",
                "Where are all these \"savings\" going? How is this making America great? Whose lives are being lifted up and made better because PBS funding was cut?",
                "So PBS *AND* NPR are suing the President?!?",
                "We need another Mr. Rogers to go in front of congress and explain why funding is necessary.",
                "Trump has a personal beef with PBS because Sesame Street has been mocking him since 1988 with the Ronald Grump character.",
                "Good for PBS!!!  Don't just knuckle under like everyone else does",
                "**PBS IS SUPPORTED BY 70% OF AMERICANS ON BOTH SIDES OF THE POLITICAL SPECTRUM AND ONLY COSTS TAXPAYERS $1.60 A YEAR.**\n\nThis is one of the few things this country agrees on. We MUST FIGHT TO KEEP THESE INSTITUTIONS ALIVE. If this funding is rescinded, this will devastate smaller markets where access to information and educational resources are needed most.\n\nIt may feel hopeless and pointless, but contact your representatives once again for this--it truly does make a difference. **WE ONLY NEED 4 REPUBLICANS TO FLIP on the recision package that's coming.** 5calls.org is a great resource for this. If we don't fight for these institutions, they are going to take everything away from us. If you grew up on Mr Rogers, Reading Rainbow or Sesame Street, it's time to return the favor.\n\n**Don't go down without a fight!!**",
                "Link to the complaint:  [https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0\\_2.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0_2.pdf)",
                "You might be able to stand on Fifth Ave. and do what you like Mr. President, but you can go fuck yourself on Sesame Street, and stay fucked!",
                "Here come all the Republicans to protect free speech. /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Homeland Security cops handcuff one of Rep. Nadler's aides in chaotic day at NY fed building",
            "external_url": "https://gothamist.com/news/homeland-security-cops-handcuff-one-of-rep-nadlers-aides-in-chaotic-day-at-ny-fed-building",
            "upvotes": 3909,
            "date": "05/31/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/351582/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "These people are out of control.",
                "Welcome to our new police state",
                "To clarify none of the aides was arrested in the end but this is still very worrying.\n\n\nEdit: Also apparently this happened on Wednesday but it is only being reported now.",
                "How is this not getting more press ",
                "If Jerry does not have that officer arrested and charged with state crimes we're fucked.\n\nThe only way we get through this is if states challenge Trump",
                "They’ll start arresting members of congress and federal judges soon.  This is just the warm up act.",
                "Welcome to the end of game of conservative politics. Straight up fucking fascism. Every single time.",
                "The 21st Century 4th Reich is in full swing. We now have black shirts instead of the brown shirts.",
                "Add the popo to the list of people who will be on trial for \"following orders.\"",
                "Jeezus this is the most ridiculous timeline \n\nBuckle up!  We got four more years of this insanity 😭"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Olympic boxing champ Imane Khelif must undergo genetic sex screening to fight for new governing body",
            "external_url": "https://apnews.com/article/imane-khelif-boxing-sex-screening-88f16b5e421fb59e9411a440e279ae3f",
            "upvotes": 7887,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If Khelif passes this screening, do you think JK Rowling and all the other TERFs will issue an apology?",
                "I was just wondering how she’s been. This seems like discrimination. Does every athlete get gender testing or just the few they think don’t look girly enough? Wth",
                "Anyone who thinks this is a rational and normal thing to demand would be called an idiot by themselves 10 years ago.",
                "Oof, they want to make sex testing mandatory for all athletes. World Boxing about to discover real fast just how wild the natural variance of biological sex characteristics is…",
                "Honestly this seems less invasive than inspecting genitals. Send some blood, look at the chromosomes, get everyone to shut up.",
                "Imagine just not being attractive enough to some random people and suddenly they question whether you're allowed to do what you love to do. That's the fucked up world we're in now.",
                "IMO, genetic testing and hormonal testing should happen by default.",
                "She has a vagina. She was born with it. How is that not enough? \n\nImagine being too strong to be considered a woman. I guess wonder woman is actually a man now...",
                "I will support this only if all male competitors must undergo the same screening.",
                "It's almost as if there is a controversy and they want to get to the bottom of it.\n\nFor those claiming she's a natural born woman, this would confirm your position as correct. \n\nWhat's the problem?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Shots fired at Irish peacekeepers in Lebannon",
            "external_url": "https://www.bbc.com/news/articles/c1e64v01edno",
            "upvotes": 3179,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9e2f/live/c629d8e0-3caf-11f0-af73-bd09b8e49b0c.jpg",
            "top_comments": [
                "[removed]",
                "*Speaking to Irish broadcaster RTÉ on Thursday, Simon Harris, also the Irish Minister for Foreign Affairs said he would contact the Israeli government over what he termed as an \"utterly inappropriate, utterly unacceptable\" attack on Irish peacekeeping troops.*",
                "« Shots fired »\n\nI love how the medias can’t named who shot at those Irish soldiers. You have to read the full article to understand that Israel is responsible",
                "Everyone assumed it was the IDF from the headline, and yes you are correct.",
                "Oh I wonder who shot at them?\n\nIf it was Hamas, or Hezbollah, or any official terrorist organisation, there wouldn't be any doubt. The article would state it plainly, in the headline, in the first sentence. The only way to know whonjt was is the Irish themselves saying it was the IDF",
                "Ha lol. \n\nI got banned permanently from r/worldnews for commenting on this and (being Irish) complaining about the repeated attempts of the Isreali \"defence\" forces ( if you can call their sham military that) to intimidate international organisations and the UN.",
                "Israel is known for attacking UN Peacekeeping positions. They are also more than willing to kill UN peacekeepers.",
                "I don't know if Israel could have a bigger problem with terrorism than it already does, but picking a fight with the Irish would be a good way to find out.",
                "They shot at our diplomats as well. I seriously think it's time for our country to completely cut diplomatic ties with Israel. They are an enemy nation as far as I'm concerned. An enemy nation who have been ruthlessly butchering Palestinians. \n\nWe weren't intimidated by the most powerful empire in history and we won't be intimidated by Israel.",
                "Of course its the IOF"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 21050,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 4422,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.).",
                "Thanks Houlihan!  Would have loved to have shared a “lousy cup of coffee” with you!   Class act!",
                "I rode an elevator with her once. We nodded !",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "She may have been Hotlips to Hawkeye and Trapper/BJ, but she was also Major Margaret O'Houlihan, Chief Nurse of the 4077th MASH, one of the best surgical assistants in Korea, and veteran of two wars.  She was tough, intelligent, resourceful, highly protective of the women (and a few men) who worked under her, and brave as fuck.  As a character she was deep and interesting.  A great example to many people about how to be a leader and how to be a human at the same time, by showing her mistakes and flaws.\n\nEven Klinger will wear his Class As for this memorial.  Abyssinya, Margaret.",
                "I met her eons ago at a ShoWest convention in Las Vegas.  It was at a small party sponsored by one of the various studios present at the event.\n\nWe had a pleasant chat for about 5-10 minutes before she got mobbed by more fans. Absolutely lovely person.",
                "Bummer. I always liked her. RIP",
                "RIP Hot Lips Houlihan!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 9129,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "You got to wonder and ask, \"Who is next?\"",
                "What happened to ‘we just want them to come the legal way’?",
                "Just goes to show its about skin color and not legal status. They are all of legal status.",
                "Republicans a year ago: “We’re not racist, we just want people to come here the *right* way.”\n\nRepublicans today: Just kidding, if you’re not white Christians get the fuck out!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 8045,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Donnie looking out for the little guy",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House stunned as Hegseth inquiry brings up illegal wiretap claims",
            "external_url": "https://www.theguardian.com/us-news/2025/may/27/hegseth-pentagon-leak-investigation-wiretap",
            "upvotes": 3942,
            "date": "05/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/531eb17c00739d970da245fe8d17823228251b16/1023_249_3601_2882/master/3601.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=192f07ecc59f0eae9cb3a1e78d4a0bdc",
            "top_comments": [
                "So how many times is it gonna take Hegseth making everyone look like idiots before they do something about it?",
                "\" being fed dubious information by Hegseth’s personal lawyer, Tim Parlatore, who had been tasked with overseeing the investigation.\" \n\nAre. You. Fucking. KIDDING ME?! his PERSONAL lawyer is now getting involved with ANYTHING related to the Pentagon or aids in the Pentagon or fucking anything related to the US government?!?!",
                "The White House ain't stunned. The White House probably asked him to do it.\n\n\nDamn headlines are ass there days.",
                "Hah!\n\n\"But the illegal wiretap claim and Caldwell’s denials fueled a breakdown in trust between the Pentagon and the White House, where the Trump advisers tracking the investigation have privately suggested they no longer have any idea about who or what to believe.\"\n\nThis admin has spouted so many lies they don't even believe themselves anymore.",
                "Pretty obvious the trump crime family wanted him to use illegal methods of... Everything they do ",
                "Wait didn't they accuse-\n\nAh fuck it this is just par for the course",
                "If they don’t get Hegseth under control, he is going to start wiretapping kegs.",
                "He probably tapped the White House staff to get compromising materials in case they try to fire him...",
                "tRump's main criteria is that the SecDef is loyal enough to order troops to attack American citizens and politicians. ",
                "I'm sure they're stunned. Just like I'm stunned when I find the cheese my daughter has hid in her desk drawer for the 40th time."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Warning after 250 million bees escape overturned truck in US",
            "external_url": "https://www.bbc.co.uk/news/articles/c23mrprk952o",
            "upvotes": 3642,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afdf/live/ca544700-3dd3-11f0-8853-41527df633df.jpg",
            "top_comments": [
                "This is a real tragedy. These trucks take bees from thousands of keepers down to California for events like almond plant pollination. If they can’t clean it up in a way that gives the bees time to find their own queens among the wreckage, almost all of them are doomed. And it’ll be a total loss for the farmers, pending insurance. California farmers need to find more bees or not get pollinated, Washington farmers need to replace the bees they’ve raised. Local region gets a bunch of stressed out honeybees with nowhere to go. It’ll take some really careful mitigation to recover it all, on top of handling the accident and the surrounding humanity. \n\nAlso, ridiculous that our farming infrastructure requires bee imports for pollination. How about boost the habitat around the farms and cut down on the monoculture crops? All the highways and stormwater ditches should be no-mow in the dry summer. Retain moisture in the vegetation and give a wildlife coordinator to connect habitat fragments and boost pollination. And save on public works maintenance costs. The problem for these bees is that there are no flowers most of the summer, and then a mega monoculture blooms and expects there to be billions of bees and butterflies to support it. But also here’s neurological pesticides like neonics to kill the “bad bugs.” You reap what you sow. ",
                "there are roughly 30,000 bees in a hive at this time of year.\n\n33 hives to reach a million.\n\n250x33 is 8250 hive boxes.\n\na Langstroth hive is roughly 20x16x12 inches.  So you'd get 6 on a standard pallet layer, maybe 3 layers preparatory for doublestacking.. that's 458 pallets.\n\nI think the deputy making the announcement was off by a factor of 4 to 5.  Still a terrifying event, though.",
                "I’m surprised that 250 million bees is only one truckload",
                "Watch out! Incoming pollination!",
                "[removed]",
                "Flat country, looks like a straight, quiet two-lane road, no intersection, no other cars, how did his load end up sideways in the ditch?\n\nEdit: NYT photo suggests it was turning right and couldn't roll the front out far enough to miss the ditch with the rear wheels. That's why the tractor was in the left lane.",
                "Wu Tang Killer Bees. \n\nThey gonna swarm. ",
                "That’s one way to create a lot of buzz.",
                "[Nice Cage clears throat]",
                "Someone call the Texas bee lady! \n\n\"And it was another great day of saving the beeeeeeez\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Homeland Security cops handcuff one of Rep. Nadler's aides in chaotic day at NY fed building",
            "external_url": "https://gothamist.com/news/homeland-security-cops-handcuff-one-of-rep-nadlers-aides-in-chaotic-day-at-ny-fed-building",
            "upvotes": 3907,
            "date": "05/31/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/351582/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "These people are out of control.",
                "Welcome to our new police state",
                "To clarify none of the aides was arrested in the end but this is still very worrying.\n\n\nEdit: Also apparently this happened on Wednesday but it is only being reported now.",
                "How is this not getting more press ",
                "If Jerry does not have that officer arrested and charged with state crimes we're fucked.\n\nThe only way we get through this is if states challenge Trump",
                "They’ll start arresting members of congress and federal judges soon.  This is just the warm up act.",
                "Welcome to the end of game of conservative politics. Straight up fucking fascism. Every single time.",
                "The 21st Century 4th Reich is in full swing. We now have black shirts instead of the brown shirts.",
                "Add the popo to the list of people who will be on trial for \"following orders.\"",
                "Jeezus this is the most ridiculous timeline \n\nBuckle up!  We got four more years of this insanity 😭"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Shots fired at Irish peacekeepers in Lebannon",
            "external_url": "https://www.bbc.com/news/articles/c1e64v01edno",
            "upvotes": 3185,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9e2f/live/c629d8e0-3caf-11f0-af73-bd09b8e49b0c.jpg",
            "top_comments": [
                "[removed]",
                "*Speaking to Irish broadcaster RTÉ on Thursday, Simon Harris, also the Irish Minister for Foreign Affairs said he would contact the Israeli government over what he termed as an \"utterly inappropriate, utterly unacceptable\" attack on Irish peacekeeping troops.*",
                "« Shots fired »\n\nI love how the medias can’t named who shot at those Irish soldiers. You have to read the full article to understand that Israel is responsible",
                "Everyone assumed it was the IDF from the headline, and yes you are correct.",
                "Oh I wonder who shot at them?\n\nIf it was Hamas, or Hezbollah, or any official terrorist organisation, there wouldn't be any doubt. The article would state it plainly, in the headline, in the first sentence. The only way to know whonjt was is the Irish themselves saying it was the IDF",
                "Ha lol. \n\nI got banned permanently from r/worldnews for commenting on this and (being Irish) complaining about the repeated attempts of the Isreali \"defence\" forces ( if you can call their sham military that) to intimidate international organisations and the UN.",
                "Israel is known for attacking UN Peacekeeping positions. They are also more than willing to kill UN peacekeepers.",
                "I don't know if Israel could have a bigger problem with terrorism than it already does, but picking a fight with the Irish would be a good way to find out.",
                "They shot at our diplomats as well. I seriously think it's time for our country to completely cut diplomatic ties with Israel. They are an enemy nation as far as I'm concerned. An enemy nation who have been ruthlessly butchering Palestinians. \n\nWe weren't intimidated by the most powerful empire in history and we won't be intimidated by Israel.",
                "Of course its the IOF"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Olympic boxing champ Imane Khelif must undergo genetic sex screening to fight for new governing body",
            "external_url": "https://apnews.com/article/imane-khelif-boxing-sex-screening-88f16b5e421fb59e9411a440e279ae3f",
            "upvotes": 7877,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If Khelif passes this screening, do you think JK Rowling and all the other TERFs will issue an apology?",
                "I was just wondering how she’s been. This seems like discrimination. Does every athlete get gender testing or just the few they think don’t look girly enough? Wth",
                "Anyone who thinks this is a rational and normal thing to demand would be called an idiot by themselves 10 years ago.",
                "Oof, they want to make sex testing mandatory for all athletes. World Boxing about to discover real fast just how wild the natural variance of biological sex characteristics is…",
                "Honestly this seems less invasive than inspecting genitals. Send some blood, look at the chromosomes, get everyone to shut up.",
                "Imagine just not being attractive enough to some random people and suddenly they question whether you're allowed to do what you love to do. That's the fucked up world we're in now.",
                "IMO, genetic testing and hormonal testing should happen by default.",
                "She has a vagina. She was born with it. How is that not enough? \n\nImagine being too strong to be considered a woman. I guess wonder woman is actually a man now...",
                "I will support this only if all male competitors must undergo the same screening.",
                "It's almost as if there is a controversy and they want to get to the bottom of it.\n\nFor those claiming she's a natural born woman, this would confirm your position as correct. \n\nWhat's the problem?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "PBS sues Trump over executive order to cut funding",
            "external_url": "https://www.cnbc.com/2025/05/30/pbs-trump-funding-sesame-street.html",
            "upvotes": 43499,
            "date": "05/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103943-1739913080624-gettyimages-2200462311-331a9475_idjtyoi9.jpeg?v=1748643066&w=1920&h=1080",
            "top_comments": [
                ">PBS disputes those charged assertions in the strongest possible terms. But regardless of any policy disagreements over the role of public television, our Constitution and laws forbid the President from serving as the arbiter of the content of PBS’s programming, including by attempting to defund PBS.\n\n\n\n>Lest there be any doubt that the Executive Branch should have no power to influence CPB’s decision-making, Congress enacted a specific “\\[p\\]rohibition”: no “department, agency, officer, or employee of the United States” may “exercise any direction, supervision, or control over public telecommunications, or over \\[CPB\\] or any of its grantees”—including with respect to “the content or distribution of public telecommunications programs and services.” 47 U.S.C. § 398(a), (c) (emphases added).\n\nPerfectly clear violation of the letter and spirt of the law. Open and shut case, no legal authority. Supreme Court 6-3 victory for Trump.",
                "Where are all these \"savings\" going? How is this making America great? Whose lives are being lifted up and made better because PBS funding was cut?",
                "So PBS *AND* NPR are suing the President?!?",
                "We need another Mr. Rogers to go in front of congress and explain why funding is necessary.",
                "Trump has a personal beef with PBS because Sesame Street has been mocking him since 1988 with the Ronald Grump character.",
                "Good for PBS!!!  Don't just knuckle under like everyone else does",
                "**PBS IS SUPPORTED BY 70% OF AMERICANS ON BOTH SIDES OF THE POLITICAL SPECTRUM AND ONLY COSTS TAXPAYERS $1.60 A YEAR.**\n\nThis is one of the few things this country agrees on. We MUST FIGHT TO KEEP THESE INSTITUTIONS ALIVE. If this funding is rescinded, this will devastate smaller markets where access to information and educational resources are needed most.\n\nIt may feel hopeless and pointless, but contact your representatives once again for this--it truly does make a difference. **WE ONLY NEED 4 REPUBLICANS TO FLIP on the recision package that's coming.** 5calls.org is a great resource for this. If we don't fight for these institutions, they are going to take everything away from us. If you grew up on Mr Rogers, Reading Rainbow or Sesame Street, it's time to return the favor.\n\n**Don't go down without a fight!!**",
                "Link to the complaint:  [https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0\\_2.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0_2.pdf)",
                "You might be able to stand on Fifth Ave. and do what you like Mr. President, but you can go fuck yourself on Sesame Street, and stay fucked!",
                "Here come all the Republicans to protect free speech. /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 4421,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.).",
                "Thanks Houlihan!  Would have loved to have shared a “lousy cup of coffee” with you!   Class act!",
                "I rode an elevator with her once. We nodded !",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "She may have been Hotlips to Hawkeye and Trapper/BJ, but she was also Major Margaret O'Houlihan, Chief Nurse of the 4077th MASH, one of the best surgical assistants in Korea, and veteran of two wars.  She was tough, intelligent, resourceful, highly protective of the women (and a few men) who worked under her, and brave as fuck.  As a character she was deep and interesting.  A great example to many people about how to be a leader and how to be a human at the same time, by showing her mistakes and flaws.\n\nEven Klinger will wear his Class As for this memorial.  Abyssinya, Margaret.",
                "I met her eons ago at a ShoWest convention in Las Vegas.  It was at a small party sponsored by one of the various studios present at the event.\n\nWe had a pleasant chat for about 5-10 minutes before she got mobbed by more fans. Absolutely lovely person.",
                "Bummer. I always liked her. RIP",
                "RIP Hot Lips Houlihan!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 1108,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?",
                "Well, at least it's an *aFordable* mistake",
                "Oh shit is it the 1995 Ford f150? Do I need to call my dealer?",
                "If you check the mustang subreddit this has been an issue for a long time and an over the air update won't fix things from 2016.\n\nThey were literally tearing the camera cable from opening and closing the trunk.",
                "Basically everything built during the chip shortage, interesting",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "My volvo just had a similar recall, annoyingly they couldn’t fix it with an over the air update so I had to go into the dealership just for a software update. Oh and the only reason I learned about the recall was through carfax Volvo never contacted me."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "U.S. Job Corps Centers to Close by June 2025: Thousands of Students and Staff Affected",
            "external_url": "https://tnj.com/u-s-job-corps-centers-to-close-by-june-2025/",
            "upvotes": 1775,
            "date": "05/30/2025",
            "thumbnail": "https://cms.tnj.com/wp-content/uploads/2025/05/Job-Corps-Centers-.jpeg",
            "top_comments": [
                "republicans: get a job, bums!\n\nalso republicans: Let's make it as hard as possible to get a job.",
                "I thought trades were the future? This really sucks.",
                "So much for the trade schools. These job corps were a great place. Figured they were on the chopping block. ",
                "And of course, Congress is also planning to take away health insurance for Medicaid recipients unless they are enrolled in something like this. ",
                "I dropped out of high school and got my GED. My dad made me go to a Job Corps in Montana where I earned a high school diploma and learned the electrical construction trade. It was a great experience for me and I've been an electrician for over thirty years now. \n\nThis is a shame to shut it down.",
                "They aren't wasting time kicking people out either. My son found out Job Corps was being shutdown yesterday on the 29th, received his plane ticket today (the 30th), and will being flown back home on Monday (the 2nd). Less than a week from learning they are being closed and being shipped out.\n\nWhile we are happy to have him back and will support him in anyway we can, a lot of his classmates come from troubled or abusive homes. And Job Corps what they chance to break free. Some of them have been told they aren't welcome back home and are suddenly facing homelessness. They are just being sent to the closest airport to where they came from and then being left to their own devices.\n\nedit: just an addendum. We live 3 hours from the airport my son is going to be arriving at. There was no communication with us to make sure anyone would be able to be there to pick him up. He didn't find out until early evening, so he called me to tell me his flight time about 20 minutes before my offices closed for the weekend. Now I'm lucky that I have a job that I can take time off from with short notice to go pick him on Monday. But I've definitely had jobs in the past that would have refused to let me take time off with such short notice. \n\nCompare this to when he joined Job Corp and they took care of all the transportation. They picked him up from home and took him to the closest Job Corp facility and from there took him to the airport. How many of these kids are just being flown out, and even if their parents want to go get them, are not able to do so? Maybe they don't have a reliable vehicle, maybe they can't afford the trip, maybe they can't get time off from work. There are many reasons why they might not be able to drop everything and pick their child up with so little notice.",
                "I graduated from a jobcorps center its unfortunate the program is ending.\n\nThe article does mention they are working in alternative programs but its still a shame.",
                "This really sucks.  I grew up dirt poor (think no electricity) and my only path out was Job Corps.  They got me a drivers license, a diploma and I got a CNA (nurse assistant) certificate there.  The staff was all stellar.\n\n\n I ended up only working as a CNA for a year or so, but the license and diploma helped me get where I am today.  I am now 39 and own my own home and car.\n\n\nIts really depressing other kids growing up the way I did, will have one less way out of it.",
                "Shit, this is the first news I've heard of the Job Corps program being shuttered. While the article doesn't blame Trump directly, I have a feeling it's because of his administration's choices.\n\nI had just suggested Job Corps to a young friend a few week ago. Scratch that option, I guess.",
                "My dad worked on the admin side of things for Job Corps. This really breaks my heart. He was always befriend a couple students as they moved through the programs. They provided housing, school materials, food, health programs, and more. It changed a lot of lives! This is horrible news!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 9135,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "You got to wonder and ask, \"Who is next?\"",
                "What happened to ‘we just want them to come the legal way’?",
                "Just goes to show its about skin color and not legal status. They are all of legal status.",
                "Republicans a year ago: “We’re not racist, we just want people to come here the *right* way.”\n\nRepublicans today: Just kidding, if you’re not white Christians get the fuck out!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "White House stunned as Hegseth inquiry brings up illegal wiretap claims",
            "external_url": "https://www.theguardian.com/us-news/2025/may/27/hegseth-pentagon-leak-investigation-wiretap",
            "upvotes": 3947,
            "date": "05/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/531eb17c00739d970da245fe8d17823228251b16/1023_249_3601_2882/master/3601.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=192f07ecc59f0eae9cb3a1e78d4a0bdc",
            "top_comments": [
                "So how many times is it gonna take Hegseth making everyone look like idiots before they do something about it?",
                "\" being fed dubious information by Hegseth’s personal lawyer, Tim Parlatore, who had been tasked with overseeing the investigation.\" \n\nAre. You. Fucking. KIDDING ME?! his PERSONAL lawyer is now getting involved with ANYTHING related to the Pentagon or aids in the Pentagon or fucking anything related to the US government?!?!",
                "The White House ain't stunned. The White House probably asked him to do it.\n\n\nDamn headlines are ass there days.",
                "Hah!\n\n\"But the illegal wiretap claim and Caldwell’s denials fueled a breakdown in trust between the Pentagon and the White House, where the Trump advisers tracking the investigation have privately suggested they no longer have any idea about who or what to believe.\"\n\nThis admin has spouted so many lies they don't even believe themselves anymore.",
                "Pretty obvious the trump crime family wanted him to use illegal methods of... Everything they do ",
                "Wait didn't they accuse-\n\nAh fuck it this is just par for the course",
                "If they don’t get Hegseth under control, he is going to start wiretapping kegs.",
                "He probably tapped the White House staff to get compromising materials in case they try to fire him...",
                "tRump's main criteria is that the SecDef is loyal enough to order troops to attack American citizens and politicians. ",
                "I'm sure they're stunned. Just like I'm stunned when I find the cheese my daughter has hid in her desk drawer for the 40th time."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Warning after 250 million bees escape overturned truck in US",
            "external_url": "https://www.bbc.co.uk/news/articles/c23mrprk952o",
            "upvotes": 3650,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afdf/live/ca544700-3dd3-11f0-8853-41527df633df.jpg",
            "top_comments": [
                "This is a real tragedy. These trucks take bees from thousands of keepers down to California for events like almond plant pollination. If they can’t clean it up in a way that gives the bees time to find their own queens among the wreckage, almost all of them are doomed. And it’ll be a total loss for the farmers, pending insurance. California farmers need to find more bees or not get pollinated, Washington farmers need to replace the bees they’ve raised. Local region gets a bunch of stressed out honeybees with nowhere to go. It’ll take some really careful mitigation to recover it all, on top of handling the accident and the surrounding humanity. \n\nAlso, ridiculous that our farming infrastructure requires bee imports for pollination. How about boost the habitat around the farms and cut down on the monoculture crops? All the highways and stormwater ditches should be no-mow in the dry summer. Retain moisture in the vegetation and give a wildlife coordinator to connect habitat fragments and boost pollination. And save on public works maintenance costs. The problem for these bees is that there are no flowers most of the summer, and then a mega monoculture blooms and expects there to be billions of bees and butterflies to support it. But also here’s neurological pesticides like neonics to kill the “bad bugs.” You reap what you sow. ",
                "there are roughly 30,000 bees in a hive at this time of year.\n\n33 hives to reach a million.\n\n250x33 is 8250 hive boxes.\n\na Langstroth hive is roughly 20x16x12 inches.  So you'd get 6 on a standard pallet layer, maybe 3 layers preparatory for doublestacking.. that's 458 pallets.\n\nI think the deputy making the announcement was off by a factor of 4 to 5.  Still a terrifying event, though.",
                "I’m surprised that 250 million bees is only one truckload",
                "Watch out! Incoming pollination!",
                "[removed]",
                "Flat country, looks like a straight, quiet two-lane road, no intersection, no other cars, how did his load end up sideways in the ditch?\n\nEdit: NYT photo suggests it was turning right and couldn't roll the front out far enough to miss the ditch with the rear wheels. That's why the tractor was in the left lane.",
                "Wu Tang Killer Bees. \n\nThey gonna swarm. ",
                "That’s one way to create a lot of buzz.",
                "[Nice Cage clears throat]",
                "Someone call the Texas bee lady! \n\n\"And it was another great day of saving the beeeeeeez\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "PBS sues Trump over executive order to cut funding",
            "external_url": "https://www.cnbc.com/2025/05/30/pbs-trump-funding-sesame-street.html",
            "upvotes": 43512,
            "date": "05/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103943-1739913080624-gettyimages-2200462311-331a9475_idjtyoi9.jpeg?v=1748643066&w=1920&h=1080",
            "top_comments": [
                ">PBS disputes those charged assertions in the strongest possible terms. But regardless of any policy disagreements over the role of public television, our Constitution and laws forbid the President from serving as the arbiter of the content of PBS’s programming, including by attempting to defund PBS.\n\n\n\n>Lest there be any doubt that the Executive Branch should have no power to influence CPB’s decision-making, Congress enacted a specific “\\[p\\]rohibition”: no “department, agency, officer, or employee of the United States” may “exercise any direction, supervision, or control over public telecommunications, or over \\[CPB\\] or any of its grantees”—including with respect to “the content or distribution of public telecommunications programs and services.” 47 U.S.C. § 398(a), (c) (emphases added).\n\nPerfectly clear violation of the letter and spirt of the law. Open and shut case, no legal authority. Supreme Court 6-3 victory for Trump.",
                "Where are all these \"savings\" going? How is this making America great? Whose lives are being lifted up and made better because PBS funding was cut?",
                "So PBS *AND* NPR are suing the President?!?",
                "We need another Mr. Rogers to go in front of congress and explain why funding is necessary.",
                "Trump has a personal beef with PBS because Sesame Street has been mocking him since 1988 with the Ronald Grump character.",
                "Good for PBS!!!  Don't just knuckle under like everyone else does",
                "**PBS IS SUPPORTED BY 70% OF AMERICANS ON BOTH SIDES OF THE POLITICAL SPECTRUM AND ONLY COSTS TAXPAYERS $1.60 A YEAR.**\n\nThis is one of the few things this country agrees on. We MUST FIGHT TO KEEP THESE INSTITUTIONS ALIVE. If this funding is rescinded, this will devastate smaller markets where access to information and educational resources are needed most.\n\nIt may feel hopeless and pointless, but contact your representatives once again for this--it truly does make a difference. **WE ONLY NEED 4 REPUBLICANS TO FLIP on the recision package that's coming.** 5calls.org is a great resource for this. If we don't fight for these institutions, they are going to take everything away from us. If you grew up on Mr Rogers, Reading Rainbow or Sesame Street, it's time to return the favor.\n\n**Don't go down without a fight!!**",
                "Link to the complaint:  [https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0\\_2.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0_2.pdf)",
                "You might be able to stand on Fifth Ave. and do what you like Mr. President, but you can go fuck yourself on Sesame Street, and stay fucked!",
                "Here come all the Republicans to protect free speech. /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Homeland Security cops handcuff one of Rep. Nadler's aides in chaotic day at NY fed building",
            "external_url": "https://gothamist.com/news/homeland-security-cops-handcuff-one-of-rep-nadlers-aides-in-chaotic-day-at-ny-fed-building",
            "upvotes": 3912,
            "date": "05/31/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/351582/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "These people are out of control.",
                "Welcome to our new police state",
                "To clarify none of the aides was arrested in the end but this is still very worrying.\n\n\nEdit: Also apparently this happened on Wednesday but it is only being reported now.",
                "How is this not getting more press ",
                "If Jerry does not have that officer arrested and charged with state crimes we're fucked.\n\nThe only way we get through this is if states challenge Trump",
                "They’ll start arresting members of congress and federal judges soon.  This is just the warm up act.",
                "Welcome to the end of game of conservative politics. Straight up fucking fascism. Every single time.",
                "The 21st Century 4th Reich is in full swing. We now have black shirts instead of the brown shirts.",
                "Add the popo to the list of people who will be on trial for \"following orders.\"",
                "Jeezus this is the most ridiculous timeline \n\nBuckle up!  We got four more years of this insanity 😭"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Olympic boxing champ Imane Khelif must undergo genetic sex screening to fight for new governing body",
            "external_url": "https://apnews.com/article/imane-khelif-boxing-sex-screening-88f16b5e421fb59e9411a440e279ae3f",
            "upvotes": 7883,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If Khelif passes this screening, do you think JK Rowling and all the other TERFs will issue an apology?",
                "I was just wondering how she’s been. This seems like discrimination. Does every athlete get gender testing or just the few they think don’t look girly enough? Wth",
                "Anyone who thinks this is a rational and normal thing to demand would be called an idiot by themselves 10 years ago.",
                "Oof, they want to make sex testing mandatory for all athletes. World Boxing about to discover real fast just how wild the natural variance of biological sex characteristics is…",
                "Honestly this seems less invasive than inspecting genitals. Send some blood, look at the chromosomes, get everyone to shut up.",
                "Imagine just not being attractive enough to some random people and suddenly they question whether you're allowed to do what you love to do. That's the fucked up world we're in now.",
                "IMO, genetic testing and hormonal testing should happen by default.",
                "She has a vagina. She was born with it. How is that not enough? \n\nImagine being too strong to be considered a woman. I guess wonder woman is actually a man now...",
                "I will support this only if all male competitors must undergo the same screening.",
                "It's almost as if there is a controversy and they want to get to the bottom of it.\n\nFor those claiming she's a natural born woman, this would confirm your position as correct. \n\nWhat's the problem?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Shots fired at Irish peacekeepers in Lebannon",
            "external_url": "https://www.bbc.com/news/articles/c1e64v01edno",
            "upvotes": 3179,
            "date": "05/31/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9e2f/live/c629d8e0-3caf-11f0-af73-bd09b8e49b0c.jpg",
            "top_comments": [
                "[removed]",
                "*Speaking to Irish broadcaster RTÉ on Thursday, Simon Harris, also the Irish Minister for Foreign Affairs said he would contact the Israeli government over what he termed as an \"utterly inappropriate, utterly unacceptable\" attack on Irish peacekeeping troops.*",
                "« Shots fired »\n\nI love how the medias can’t named who shot at those Irish soldiers. You have to read the full article to understand that Israel is responsible",
                "Everyone assumed it was the IDF from the headline, and yes you are correct.",
                "Oh I wonder who shot at them?\n\nIf it was Hamas, or Hezbollah, or any official terrorist organisation, there wouldn't be any doubt. The article would state it plainly, in the headline, in the first sentence. The only way to know whonjt was is the Irish themselves saying it was the IDF",
                "Ha lol. \n\nI got banned permanently from r/worldnews for commenting on this and (being Irish) complaining about the repeated attempts of the Isreali \"defence\" forces ( if you can call their sham military that) to intimidate international organisations and the UN.",
                "Israel is known for attacking UN Peacekeeping positions. They are also more than willing to kill UN peacekeepers.",
                "I don't know if Israel could have a bigger problem with terrorism than it already does, but picking a fight with the Irish would be a good way to find out.",
                "They shot at our diplomats as well. I seriously think it's time for our country to completely cut diplomatic ties with Israel. They are an enemy nation as far as I'm concerned. An enemy nation who have been ruthlessly butchering Palestinians. \n\nWe weren't intimidated by the most powerful empire in history and we won't be intimidated by Israel.",
                "Of course its the IOF"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 21040,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 4424,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.).",
                "Thanks Houlihan!  Would have loved to have shared a “lousy cup of coffee” with you!   Class act!",
                "I rode an elevator with her once. We nodded !",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "She may have been Hotlips to Hawkeye and Trapper/BJ, but she was also Major Margaret O'Houlihan, Chief Nurse of the 4077th MASH, one of the best surgical assistants in Korea, and veteran of two wars.  She was tough, intelligent, resourceful, highly protective of the women (and a few men) who worked under her, and brave as fuck.  As a character she was deep and interesting.  A great example to many people about how to be a leader and how to be a human at the same time, by showing her mistakes and flaws.\n\nEven Klinger will wear his Class As for this memorial.  Abyssinya, Margaret.",
                "I met her eons ago at a ShoWest convention in Las Vegas.  It was at a small party sponsored by one of the various studios present at the event.\n\nWe had a pleasant chat for about 5-10 minutes before she got mobbed by more fans. Absolutely lovely person.",
                "Bummer. I always liked her. RIP",
                "RIP Hot Lips Houlihan!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 9126,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "You got to wonder and ask, \"Who is next?\"",
                "What happened to ‘we just want them to come the legal way’?",
                "Just goes to show its about skin color and not legal status. They are all of legal status.",
                "Republicans a year ago: “We’re not racist, we just want people to come here the *right* way.”\n\nRepublicans today: Just kidding, if you’re not white Christians get the fuck out!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 8040,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Donnie looking out for the little guy",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/31/2025 16:09:28 UTC"
}