{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 11872,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "Scary AF that the US is a country that will disappear people to make a political statement."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 11085,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "Second worst trip a Kennedy made to Texas",
                "Killer showing up to the scene of his crime is a real psychopath move",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 35486,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "Pulled up carrying $220k. Dies in custody. No one follows procedures for a death in custody. I wonder where that $ is now. I wonder if it was $220k or a lot lot more.",
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "1971, Ahmed Timol, anti-apartheid activist, \"died by suicide in police custody\" UNTIL they discovered the truth in 2017. He was tortured and then thrown out of the 10th floor. 72 others \"died in police custody\" stories and many others in the  regime of South Africa. Along with countless others in violently oppressive regimes across history and the planet. \n\n[NPR article ](https://www.npr.org/sections/thetwo-way/2017/10/12/557399388/four-decades-later-south-african-court-rules-that-activist-was-murdered)",
                "I was told nothing like this would happen.\nEdit: Turns out my grandmas full of shit huh"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 3631,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad.",
                "How were they a threat behind and closed chain link fence?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 6836,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "It was never about DEI, it was never about abortion, it was never about Christianity, and it was never about bathrooms.\n\nIt’s been about white supremacy all along.",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "Nazi’s doing Nazi stuff, fantastic",
                "Why is it they are always on the side of awful evil shit?",
                "That's General Tubman to you. "
            ],
            "aggregate_sentiment": 26.0
        },
        {
            "category": "HOT",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 797,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "well done Trump voters, well done.  Good thing you base your Presidential vote on the most inconsequential of issues to own the libs, I would hate to think where this country would be this morning if Kamala was president and YOU didn't make bathrooms a top priority for this country.  Crisis adverted, am I right?",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "Why do I feel like Xi is going to do something stupid too."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 9329,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "who cares. f the ruzzan comrade",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good riddance to wayne gretzky, dudes an orange sponge supporter and should stay the fk away from Canada for good I expect."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 6749,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "White house strategy is to argue against anything other than total power to the president.",
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "Those admin officials do not have immunity.  Lock them the fuck up until they return the guy",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "We need to reestablish the separation of powers and the fact that no one is above the law or the Constitution. \n\nTrump and his goons all have to follow the law, period. \n\nAlso, Kilmar's family is doing a great job of drawing attention to this. The pictures and signs are very effective. I hope they've contacted the ACLU, Amnesty International, and UN because this is a human rights issue.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "The amount of things Trump supporters have to keep defending must be exhausting."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 647,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "What about the penguins? Who is going to defend them? 😱",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "Huuuuuuge mistake years ago when Helen Clark disbanded our RNZAF strike force. We should invest back into that.",
                "If Trump can claim Greenland. Why can't China claim NZ.",
                "America withdrawing from the world will force other countries to begin researching nuclear weapons development.",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 3156,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Pocatello Police shoot autistic teenager while responding to domestic call",
            "external_url": "https://www.kmvt.com/2025/04/07/pocatello-police-shoot-autistic-teenager-while-responding-domestic-call/",
            "upvotes": 46,
            "date": "04/07/2025",
            "thumbnail": "https://gray-kmvt-prod.gtv-cdn.com/resizer/v2/EPAZLXWQPBBOTJ2ALGRCZMZ3UY.png?auth=06398c1c47f56dd42ebbb9be6803ce3b1a08deee233b6aa01e25c46c2fc723f7&width=1200&height=600&smart=true",
            "top_comments": [
                "“So this wasn’t a really dangerous situation, and the police were more called to come in and help the family de-escalate and get it under control.”\n\nThe police are an uncontrolled force. People need to understand they are not there to help you or deescalate things. They are generally there to arrest someone or shoot something. If you aren't happy for one of those things to possibly happen, do not call the police.",
                "Didn't even attempt to help or de-escalate, just ran up and opened fire. Never call the fucking cops for help.",
                "When will we learn not to send mental health specialists and not just armed officers into situations like this."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Australia PM candidate ditches plan to end work from home",
            "external_url": "https://www.bbc.com/news/articles/c70zkdr7758o",
            "upvotes": 47,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e52a/live/d85fbac0-134c-11f0-bcf9-7f0eae09d30e.jpg",
            "top_comments": [
                "Backflip, then backflip, then backflip ... did we forget his promise to introduce a Trump/Musk style DOGE to Australia?\n\nAnd all those cosy photos of Dutton at fund-raisers organised by oligarch billionaire Gina Rhinehart?\n\nWith all those backflips before the election, I wonder how many will he do in the other direction if he actually gets power?",
                "That dickhead is as trustable as the idiot he is trying to copy.\n\nThat idiot is heading us into shit financial times during which we don't want dickhead in charge.",
                "Yeah, but he wants to work from Kirrbilli."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 114,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "The federal government is going to absolutely devastate a lot of smaller American cities with this stuff.",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "M23 rebels and Congolese government hold first direct talks in Qatar after months of conflict",
            "external_url": "https://www.zimsphere.co.zw/2025/04/m23-rebels-and-congolese-government.html",
            "upvotes": 16,
            "date": "04/07/2025",
            "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjG14fEE6Ln1LqSr4b_274Faa5KG6Pt6OSzlhMvpeH_oxQolZQwjYrBz5X5ZFUnHqjJc1nEOdgDwWh4eD6Fe9QqFf3CjlBEV_1QVMHcW2BdVhxH90pJQ5vxnWeNWpIa4PMSgJ57BFjSGQ_uA6BVvubwelNEaRXX7z6R6giFZM6bm6afjMTqvpInSfx-90A5/w680/THHAEPWSYVKFXGCK5LWJUCFCT4.jpg",
            "top_comments": [
                "Good. I really hope this doesn't spread again to neighbouring countries, the loss of life will be insane. Last thing we want is a 3rd Congo war."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Hearing on landmark $2.8 billion NCAA settlement could lock in seismic changes for college sports",
            "external_url": "https://www.nbcnews.com/sports/college-basketball/hearing-landmark-28-billion-ncaa-settlement-lock-seismic-changes-colle-rcna199950",
            "upvotes": 51,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-alijah-martin-mb-1157-a18bcf.jpg",
            "top_comments": [
                "This means Boeheim gets his wins back, right?",
                "Tough time for universities these days on several fronts.",
                "So there would be less scholarships available for students and each athlete gets one?  Seems ass backwards.  Strip the charade away of even being students.   Americans don’t like minor leagues.   Maybe they won’t get tired of rooting for a logo but I think they will.",
                "Probably missing some details. This is problem with US.  Everything is monetarized. Shouldn’t the primary goal be to make university more affordable and accessible?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 11878,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "Scary AF that the US is a country that will disappear people to make a political statement."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 794,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "well done Trump voters, well done.  Good thing you base your Presidential vote on the most inconsequential of issues to own the libs, I would hate to think where this country would be this morning if Kamala was president and YOU didn't make bathrooms a top priority for this country.  Crisis adverted, am I right?",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "Why do I feel like Xi is going to do something stupid too."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 652,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "What about the penguins? Who is going to defend them? 😱",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "Huuuuuuge mistake years ago when Helen Clark disbanded our RNZAF strike force. We should invest back into that.",
                "If Trump can claim Greenland. Why can't China claim NZ.",
                "America withdrawing from the world will force other countries to begin researching nuclear weapons development.",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 3629,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad.",
                "How were they a threat behind and closed chain link fence?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 11089,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "Second worst trip a Kennedy made to Texas",
                "Killer showing up to the scene of his crime is a real psychopath move",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 11895,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "Scary AF that the US is a country that will disappear people to make a political statement."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "RISING",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 793,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "well done Trump voters, well done.  Good thing you base your Presidential vote on the most inconsequential of issues to own the libs, I would hate to think where this country would be this morning if Kamala was president and YOU didn't make bathrooms a top priority for this country.  Crisis adverted, am I right?",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "Why do I feel like Xi is going to do something stupid too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 653,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "What about the penguins? Who is going to defend them? 😱",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "Huuuuuuge mistake years ago when Helen Clark disbanded our RNZAF strike force. We should invest back into that.",
                "If Trump can claim Greenland. Why can't China claim NZ.",
                "America withdrawing from the world will force other countries to begin researching nuclear weapons development.",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 3628,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad.",
                "How were they a threat behind and closed chain link fence?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 11093,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "Second worst trip a Kennedy made to Texas",
                "Killer showing up to the scene of his crime is a real psychopath move",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 35491,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "Pulled up carrying $220k. Dies in custody. No one follows procedures for a death in custody. I wonder where that $ is now. I wonder if it was $220k or a lot lot more.",
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "1971, Ahmed Timol, anti-apartheid activist, \"died by suicide in police custody\" UNTIL they discovered the truth in 2017. He was tortured and then thrown out of the 10th floor. 72 others \"died in police custody\" stories and many others in the  regime of South Africa. Along with countless others in violently oppressive regimes across history and the planet. \n\n[NPR article ](https://www.npr.org/sections/thetwo-way/2017/10/12/557399388/four-decades-later-south-african-court-rules-that-activist-was-murdered)",
                "I was told nothing like this would happen.\nEdit: Turns out my grandmas full of shit huh"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 6836,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "It was never about DEI, it was never about abortion, it was never about Christianity, and it was never about bathrooms.\n\nIt’s been about white supremacy all along.",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "Nazi’s doing Nazi stuff, fantastic",
                "Why is it they are always on the side of awful evil shit?",
                "That's General Tubman to you. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 9333,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "who cares. f the ruzzan comrade",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good riddance to wayne gretzky, dudes an orange sponge supporter and should stay the fk away from Canada for good I expect."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 6753,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "White house strategy is to argue against anything other than total power to the president.",
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "Those admin officials do not have immunity.  Lock them the fuck up until they return the guy",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "We need to reestablish the separation of powers and the fact that no one is above the law or the Constitution. \n\nTrump and his goons all have to follow the law, period. \n\nAlso, Kilmar's family is doing a great job of drawing attention to this. The pictures and signs are very effective. I hope they've contacted the ACLU, Amnesty International, and UN because this is a human rights issue.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "The amount of things Trump supporters have to keep defending must be exhausting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 3167,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/07/2025 12:16:27 UTC"
}