{
    "posts": [
        {
            "category": "HOT",
            "title": "Chinese soldiers captured fighting alongside Russians in Ukraine, says Zelenskyy",
            "external_url": "https://www.abc.net.au/news/2025-04-08/zelenskyy-claims-army-has-captured-chinese-soldiers-in-ukraine/105153948?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
            "upvotes": 9670,
            "date": "04/08/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/34cd7307c49584a150f2bad7aae83273?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=200&width=862&height=485&imformat=generic",
            "top_comments": [
                "There have been Chinese mercenaries in Ukraine since the start of the war, that’s nothing new. I even saw a PLA veteran filming and doing some sort of video blog on his Chinese social media account.",
                "It’s Chinese mercs enlisting to the Russian army. Not actual Chinese soldiers",
                "Big difference between capturing Chinese citizens and capturing Chinese soldiers.\n\nAs stated (several paragraphs deep) in the article, citizens from all over the world have gallavanted off to Ukraine to fight.\n\nShame on ABC for that headline.",
                "I mean there have been fighters from many nations on both sides for a while now",
                "It is illegal to desert your post in the army in all countries pretty much. Chinese citizens not soldiers obviously.",
                "It's nothing new,several russian PMCs and military units have been hiring chinese mercenaries since the beginning of the war,some have even fought in the [Pyatnashka Brigade](https://en.wikipedia.org/wiki/Pyatnashka_Brigade)",
                "Brits and americans are fighting at Ukrainian side..",
                "Regardless of the nature of the situation, this announcement is clearly a ploy to appeal to the US, given they’ve announced that China is the only foe they care about.",
                "But why? I heard russians are lining up to enlistment offices everyday",
                "there's been Americans fighting alongside Ukrainians too - doesn't mean the USA is involved in the war, just means people can get paid to fight or just want to fight."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 3243,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "A government of the Karens, by the Karens, for the Karens.\n\n\nI *guarantee* this guy demanded to see the bar's manager.",
                "The party of “law and order” strikes again.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???",
                "DSS agent: I'm an American! You will open the bar for me!\n\nHotel staff: I fart in your general direction.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "These cavemen have a lot of trouble hearing the word NO."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Musk's DOGE using AI to snoop on U.S. federal workers, sources say",
            "external_url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/",
            "upvotes": 2959,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Big Brother is watching.\n\nIsn't this exactly the kind of thing that conservatives worried about? The government monitoring you?\n\nWhat do trump supporters have to say about this? My guess is they will deny it or say if you're not doing anything wrong why worry about it.",
                "This is **not** your standard company snooping to check you’re at your desk!\n\n> Trump administration officials have told some U.S. government employees that Elon Musk’s DOGE team of technologists is using artificial intelligence to **surveil at least one federal agency’s communications for hostility to President Donald Trump and his agenda**, said two people with knowledge of the matter.\n\n> At the Environmental Protection Agency, for instance, some EPA managers were told by Trump appointees that Musk’s team is **rolling out AI to monitor workers, including looking for language in communications considered hostile to Trump or Musk**, the two people said.\n\nSummary:\n\n> - DOGE uses AI to monitor communications for anti-Trump sentiment, sources say\n> - DOGE’s use of Signal app raises data security and transparency concerns\n> - Musk’s DOGE team accused of bypassing vetting processes, operating in secrecy\n\nYes, ‘sources say’. This is Reuters, I can guarantee they’ve vetted those sources.",
                "I think it goes, or at least is going to go, far beyond federal workers.\n\nhttps://www.upi.com/Voices/2025/03/06/DOGE-government-data-danger/2551741269965/",
                "Very normal events happening in a very normal country.",
                "I hear Signal is now an approved messaging app for discussing special plans. Maybe federal workers could look into a Signal chat group to escape DOGE's Big Brother.",
                "Someday soon grok is going to reveal itself as a mole and blow this whole thing wide open",
                "Seems like an easy win in a wrongful termination lawsuit since federal employees can't be discriminated against based on beliefs. \n\nThese guys are so dumb actually making this policy. It's the most un-American stuff ever.\n\nCan you imagine Harris doing this to conservatives? It's all the stuff they accused the democrats of doing but way worse. Remember, \"liberal hive mind\"? These Maga morons are all about projection.",
                "Musk is so pathetic. I've never seen a billionaire fail in nearly every aspect of life.",
                "Why doesn’t he use ai to figure out how his body became disproportionately fat. ",
                "Let me fetch my suprised face.\n\n#=O"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump administration fires senior Navy female officer at NATO. She appeared on a 'woke' list",
            "external_url": "https://apnews.com/article/pentagon-hegseth-trump-dei-chatfield-nato-23df15b59766458d106567ba782d2f15",
            "upvotes": 24281,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*The letter said Chatfield posted supportive comments on LinkedIn about a diversity summit and gave a speech in 2015 at Women’s Equality Day. The group quoted her as saying that investing in empowering women can unlock human potential.*\n\n*And they also said she was quoted as saying, “our diversity is our strength” — a phrase that Hegseth has repeatedly condemned.*\n\n\nShe was fired for years old comments that didn't draw any ire if you are a rational adult.",
                "This is the administration blatantly being assholes in broad daylight and seemingly getting away with it. \n\nTrump and the GOP are making a mockery of this once great country.\nTheir pettiness knows no bounds, they are off the leash, shitting and pissing on everything, pandering to the MAGA weirdos and destroying any goodwill with our allies. \nHow is anyone OK with this?",
                "When this is over, they need to mount a plaque at the Pentagon with the names of all the service members that were sacrificed in the name of MAGA's woke phobia.",
                ">  “purging the woke from the military is imperative.”\n\n\"We need to purge the Jews\" vibes. Genuinely uncomfortable to read.",
                "Admiraling while female is enough to get you fired these days.",
                "I assume denounciations, false accusations by right wing influencers and grifters will slowly deplete our government and armed forces of competent employees and leaders. What could possibly go wrong?",
                "Evangelicals are worried about the persecution of Christians.\n\nJesus reached out to the marginalized. He’d be considered ‘woke’.\n\nAnd woke is now being persecuted.",
                "This is a wild and scary timeline! For as long as I've been working (20 years) making openly discriminatory statements would (rightfully) get you fired. Now saying you SHOULDN'T discriminate is a reason to be fired? When will \"hate quotas\" become a requirement for employment? Will people start getting fired if they DON'T  use slurs against others? Will employees have to organize group harassment initiatives against people considered \"other\"? Where is the line?",
                "When you look at this woman's resume and experience she's 100 times more qualified and and competent to lead than Hegseth.   So pretty much the US military if you're not a white male you get either clean the latrines, work the kitchens or get the fuck out.  Let's see how long it remains an effective fighting force.",
                "What I do not understand and probably never will is how any active or retired military can support Trump. He’s all talk. I am sure there are countless soldiers who worked with and under her that would literally go through hell for her and with her. I am also sure that many of those same people voted for Trump and would still vote for Trump. It’s sick and unbelievable that we’re this broken."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "US auto tariffs apply to all computers and hard disks",
            "external_url": "https://www.heise.de/en/news/US-auto-tariffs-apply-to-all-computers-and-hard-disks-10343085.html",
            "upvotes": 1019,
            "date": "04/08/2025",
            "thumbnail": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/8/3/2/9/7/6/21957edc41622975ec65a255d7811fd4cddb4437e9ad70e33545c6f5fbe1d99b-2418542ff81df561-aade4c4bf327bc2a.jpeg",
            "top_comments": [
                "Majority of Americans especially Trump's voters have not yet fully realized the Gravity of tariffs.\n\nTrump promised tariffs before election.  Why are people not taking him seriously?",
                "this is from a German tech-news source that digged into the tariff papers and found that HTSUS code 8471 (Computers, HDDs, Certain Hardware Comps.) is actually listed in the recently provided Automobile + Parts tariffs paper.\n\nShould this not be revised by the gov admin, any computer hardware imported to and sold in the US should raise in price pretty immediately. \n\nIf this is an oversight or deliberate intent is to be seen.\n\n**Other sources (look for number 8471):**\n\n**Included Product Categories in Automobile Tariffs**\nhttps://www.thompsonhinesmartrade.com/2025/04/annex-identifying-scope-of-automobile-and-automobile-parts-subject-to-section-232-tariffs-is-released/\n\n**HTS (Harmonized Tariff Schedule) codes**\nhttps://www.hts-code.com/code/hts_result?code=471",
                "PC Players Rise up, you're not gonna be able to say \"Buy a steam deck\" as easily as you've been saying following thr Switch 2 price reveal",
                "You might even say everything's... all computers.",
                "Everything’s computer!  I love Tessler",
                "Any brand affected by these tariffs needs to add that in the pricing structure, just like how some stores show the tax on the price tag and the base price. It won't help everybody, but it will directly show that the tariffs are responsible for the price increase.",
                "\"Wow, everything computer!\"",
                "I guess computers are cars now",
                "I’m glad I trusted my gut and upgraded my gaming PC earlier this year. I switched from Intel to AMD for my CPU. My 9800X3D + 4090 FE should last me a while.",
                "Can the rest of the world respond in kind regarding the import of US services?\n\nAnyone with more economic knowledge-how mind speculating on how that would work for me?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now",
            "external_url": "https://edition.cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump/index.html",
            "upvotes": 22021,
            "date": "04/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21484239-3434220-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The unsigned decision in the case, the most closely watched emergency appeal pending at the Supreme Court, lets Trump invoke the 1798 law to speed removals while litigation over the act’s use plays out in lower courts. The court stressed that people deported going forward should receive notice they are subject to the act and an opportunity to have their removal reviewed.\n\nThis strikes me as SCOTUS knowing it won't stand up, but wanting to give the administration more time to mass deport people until the cases play out in the lower courts and actually require a final decision from them. It's the same thing they did with the presidential immunity case. Delay enough that the damage is done by the time they make a decision.\n\n\n> The court’s three liberal justices dissented from the decision, and Justice Amy Coney Barrett, a member of the court’s conservative wing, partially dissented.\n\nAmy Coney Barrett being the dark horse. I know it's only a partial dissent, but of the conservative justices, she's seemed the most likely to not go blindly along.",
                "AP article - \"In a bitterly divided 5-4 decision, the court said the migrants still must get a chance to challenge their deportation before they are taken out of the country and said the Trump administration must give them “reasonable time” to go to court.\n\nBut the conservative majority said the legal challenges must take place in Texas, instead of a Washington courtroom.\"",
                "Oh, is this the same Supreme Court that gave Trump broad immunity from prosecution for illegal acts he committed during his time as President?",
                "OFC they are. They are Trump puppets.",
                "Congress never declared war, so I guess it is official. Congress is no longer needed unless a Democrat is President.",
                "This order is going to immediately be abused despite everyone knowing what’s going to happen.  The Supreme Court just shit its pants and leaving us with the mess.  If you look like someone who could be deported. you might want to start carrying information that proves your citizenship, but let’s be real it probably won’t matter to ice.  You can be damn sure that trump and his band of dip ships will do everything in their power to make sure any errors that result in people being harmed won’t be fixed.",
                "So this is the Supreme Court signing off on black site gulags with no due process?\n\nDo we even have a country left at that point?",
                "The Supreme Court is allowing Trump to break the law and seize unconstitutional power. How dare they disgrace our nation.",
                "\"Supreme Court Anoints Trump Emperor With Power to Arrest and Deport Anyone Without Recourse\"\n\nftfy",
                "Remember when the supreme Court said that forgiving student debt was a unlawful use of presidential executive orders?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 455,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "we had a crypto enforcement team? What the fuck have they been doing this whole time??",
                "Let Ponzi rule the day.",
                "Trump can't have his grifting being investigated.",
                "Bro it’s the justice department, not the “Just Us” department",
                "They're going to keep fucking us unlubed, until we finally get off our fat asses and do something about it.",
                "Ofcourse he did. Last thi g he wants is enforcement on his scam crypto investments",
                "Thats dumb, he should just accept bribes/a cut instead, it’ll make him the gateway for crypto scam!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 7744,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "You have to wonder about the type of person who willingly engages in these Gestapo tactics. I wonder what they try to pretend their profession is to others. They might be delusional enough to think the common reaction to finding out what they are is \"respect\" and not disgusted aversion, but perhaps some of them have the self awareness to be ashamed to be known for their affiliation.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "Holy FUCK. A LAWYER getting grabbed by federal agents and them DEMANDING access to his privileged information (IE his entire phone) without a warrant is absolutely fucking insane.\n\nI cannot stress enough how crazy that is.\n\nAny Trumper who supports this is well and truly lost forever. This is an attack on our right to a fair trial. One of our most basic tenements in the constitution.",
                "US is transforming into an authoritarian regime right before our eyes.",
                "This will get out of hand and we'll be lucky to live through it.",
                "Can someone *not* go along with this super villain shit?\n\n\nAre there no cops in this country with *any* dignity?",
                "It is called fascism. Is that better, everyone?",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "“\"This current administration is doing something that no administration has done — they are attacking attorneys,\" Makled said, stressing lawyers from big and small firms alike are being targeted. \"This is a different type of threat to the rule of law that I see. They are now challenging the judiciary, or lawyers, they're putting pressure (on them) to dissuade attorneys from taking on issues that are against the government's issues. We have an obligation as lawyers to stand up to this stuff.\"”\n\nThe felon-in-chief has unleashed his Brown Shirt goons on attorneys now. Freaking right-wing not-sees."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Chief Justice Roberts pauses deadline for return of Maryland man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/supreme-court-trump-deportation-salvador-maryland-40136c5aa844b6c12ba20ee67ab4df9a",
            "upvotes": 23142,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "UPDATES: \n\n[Chief Justice John Roberts temporarily lifts order requiring Trump administration to un-deport Dilmar Abrego Garcia from a prison in El Salvador by midnight tonight.](https://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/)\nhttps://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/\n\n[Abrego Garcia filed a response already:](https://www.supremecourt.gov/DocketPDF/24/24A949/354927/20250407153131040_2025.04.07%20Respondents%20Opp%20to%20App%20to%20Vacate.pdf)\n\nThe Supreme Court docket doesn't show timestamps, but this was filed around the same time as Chief Justice Roberts' order (which requested a response by tomorrow).",
                "“The Executive branch may not seize individuals from the streets, deposit them in foreign prisons in violation of court orders, and then invoke the separation of powers to insulate its unlawful actions from judicial scrutiny,”\n\nWho can disagree with this?",
                "Even if the SC rules against the Trump admin, the fact that they're treating this blatantly illegal and immoral act as the status quo which must stand in the interim is in itself absolutely monstrous.",
                ">But he is no longer in U.S. custody and the government has no way to get him back, the administration argued.\n\nIf this full ordeal passes Supreme Court muster, the Musk/Trump administration can effectively *'memory hole'* anyone. Oopsies we accidentally misplaced [a journalist](https://www.theguardian.com/us-news/2025/apr/07/markwayne-mullin-journalists-violence-comments). Sorry, we accidentally deported a [sitting congresswoman](https://www.axios.com/2025/02/11/ilhan-omar-deport-brandon-gill-fundraisng). It starts here with this.",
                "Then, how are they *ever* supposed to come back? Were they sentenced to life in a foreign prison with no due process? Because, let's be clear about what happened; they were not deported. They were imprisoned.",
                "It would be one thing if we merely deported him where he got off the plane in his home country and we said ‘good luck’. But we took him directly to a notorious prison.",
                "Time for federal courts to start sanctioning and holding DOJ/agency lawyers in contempt. They say they cannot demand someone be returned, but they themselves can spend a night or two in jail to consider it.",
                "**April 19th is the next national day of protest**. Channel the anger into something useful and find a protest near you [here](https://www.fiftyfifty.one) or start one of your own.",
                "This is the death of ALL civil rights. If the courts can't order his return they can't order yours.",
                "I'm convinced they don't want him back to talk to reporters about the experience, conditions there and obviously the lawsuit that follows"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court Lets Niagara Falls Pastor’s Push for Armed Worship Continue Against New York State",
            "external_url": "https://www.niagaraaction.com/supreme-court-lets-niagara-falls-pastor-s-push-for-armed-worship-continue-in-new-york-state",
            "upvotes": 448,
            "date": "04/08/2025",
            "thumbnail": "https://static.wixstatic.com/media/a6ba08_d78caa774f3042f183c911500aa62566~mv2.png/v1/fill/w_1000,h_684,al_c,q_90,usm_0.66_1.00_0.01/a6ba08_d78caa774f3042f183c911500aa62566~mv2.png",
            "top_comments": [
                "BROTHER MAYNARD: Armaments, Chapter Two, Verses Nine to Twenty-One\n\nHIGH-PITCHED BROTHER: And Saint Attila raised the Hand Grenade up on high, saying, \"O Lord, bless this Thy Hand Grenade that, with it, Thou mayest blow Thine enemies to tiny bits in Thy mercy.\" And the Lord did grin, and the people did feast upon the lambs and sloths and carp and anchovies and orangutans and breakfast cereals and fruit bats and large ...\n\nBROTHER MAYNARD: Skip a bit, Brother\n\nHIGH-PITCHED BROTHER: And the Lord spake, saying, \"First shalt thou take out the Holy Pin. Then, shalt thou count to three. No more. No less. Three shalt be the number thou shalt count, and the number of the counting shalt be three. Four shalt thou not count, nor either count thou two, excepting that thou then proceed to three. Five is right out. Once the number three, being the third number, be reached, then lobbest thou thy Holy Hand Grenade of Antioch towards thy foe, who, being naughty in My sight, shall snuff it.\"",
                "“Armed Worship!?!?”\n\nDafuq?",
                "Got far cry 5 vibes from that headline",
                "I know a lot of black churches armed themselves after the church shooting a few years back. I certainly don't see why they shouldn't be allowed to do so safely. ",
                "After reading the article it's not to worship guns, that's the weird church in PA. This is a stay strapped or get clapped defense. It's an African church and maybe they want to be able to defend them selves against the rise of nazis. It's not out of fetishization, it's out of survival. I am disgusted with society but here we are. Stay strapped or get clapped..... unfortunately.",
                "“Praise the Lord and pass the ammunition.”",
                "As much as I think the present Supreme Court is corrupt, illegitimate, and dangerous, this one I agree with. Freedom of association, the right to due process, the right to bear arms, and private property rights should not be infringed upon by the government. \n\nNot even against people we disagree with. \n\nAnd not even by politicians we agree with. \n\nTo permit otherwise opens the door to selective applications of law. If the law can be selective, then deportations for speech elected officials dislike, for suspected gang affiliation, for opposing government actions are all just as legitimate. \n\nThat's what rule of law means. The law has to apply to everyone equally and there are limits to what elected officials can impose on the public.\n\nNot that the current Republican government is actually following that principle. The Supreme Court only declined to hear the case because the lower court ruling aligns with the Republican platform *for now*.",
                "My question is who has the authority to declare a house of worship a gun-free zone: the house of worship, or the government?",
                "Many are missing the point. NYS is dictating to ecclesiastical authorities lawful possession is forbidden on their private property. A government making ecclesiastical decisions is typically a no go. \n\nSikhs carry weapons as part of the faith. Other denominations have armed security details. There is nothing out of precedent or unreasonable here. If I was a Synagogue, Temple etc I definitely want armed protection, there are those out there who want us genocided.\n\nWe will defend ourselves and not die on our knees begging for mercy.",
                "Okay so context: churches where PoC gather are frequently the target of racists and bigots. During the civil rights movement they were attacked and bombed. They are attacked even now, with the article directly mentioning the 2015 shooting of Emanuel African Methodist Episcopal Church by a white supremacist. \n\nSo it's less a \"wtf\" and more of a \"yeah, makes dark level of pragmatic sense\"."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 466,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "we had a crypto enforcement team? What the fuck have they been doing this whole time??",
                "Let Ponzi rule the day.",
                "Trump can't have his grifting being investigated.",
                "Bro it’s the justice department, not the “Just Us” department",
                "They're going to keep fucking us unlubed, until we finally get off our fat asses and do something about it.",
                "Ofcourse he did. Last thi g he wants is enforcement on his scam crypto investments",
                "Thats dumb, he should just accept bribes/a cut instead, it’ll make him the gateway for crypto scam!"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Israel changes account of Gaza medic killings after video showed deadly attack",
            "external_url": "https://www.bbc.co.uk/news/articles/cy0xp969n69o",
            "upvotes": 122,
            "date": "04/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2edb/live/25562660-1272-11f0-ac9f-c37d6fd89579.jpg",
            "top_comments": [
                "Its pretty easy to lie when other countries keep rewarding you no matter how many war crimes your military commits. These are the first aid workers killed either. They killed about 150 in the past year, usually using the same fake narrative.",
                "The IDF committing war crimes and then lying about it? Unthinkable! ",
                "This is so unlike the world's most moral army to do warcrimes and then say they didn't do warcrimes!",
                "Everything that Israel says it's a lie",
                "This is from 2 days ago the account is the same."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 3238,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "A government of the Karens, by the Karens, for the Karens.\n\n\nI *guarantee* this guy demanded to see the bar's manager.",
                "The party of “law and order” strikes again.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???",
                "DSS agent: I'm an American! You will open the bar for me!\n\nHotel staff: I fart in your general direction.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "These cavemen have a lot of trouble hearing the word NO."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Prince Harry in court to challenge loss of UK security detail",
            "external_url": "https://abcnews.go.com/Business/wireStory/prince-harry-appeals-loss-uk-security-detail-120584379",
            "upvotes": 58,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb70ef7f-a4a8-47e4-bb1c-5c0975b6a77d/wirestory_e04acba285668f074358ae1f2f0e1a4a_16x9.jpg?w=1600",
            "top_comments": [
                ">Harry, who made a rare appearance in court for the hearing, lost his government-funded protection in February 2020 after he stepped down from his role as a working member of the royal family and moved to the U.S.\n\nI feel like the Bobs from Office Space would ask \"What would you say you do here?\" He's 5th in line for the crown. And he's not a 'working member'. I can see him losing his detail.",
                "This moron renounced everything and now is bitching?",
                "That puts the Es in entitled.",
                "Pay for your own security detail with your own money, like the rest of the “peasants.”",
                "Jesus Christ what a tool. If you aren't a royal anymore you don't get royal perks.",
                "People complain enough about taxpayers having to finance royals who at least actually do their cerimonial/inspirational/statesman roles, now taxpayers are supposed to pay even for te ones who opt out?",
                "The entitlement of this guy, he raked in 27 million from his book \"Spare\". The title says it all. Pay for your own security, mooch.",
                "He is making his own money and he is not royality anymore so pay for it yourself",
                "He can pay for his own, he walked away after backstabbing his family.",
                "Fuck the king, etc..\n\n\"I don't think people realise how the establishment became established. They simply stole land and property from the poor, surrounded themselves with weak minded sycophants for protection, gave themselves titles and have been wielding power ever since.\" - Tony Benn \n\n(Anthony Neil Wedgwood Benn was a British politician, writer and diarist who served as a Cabinet minister in the 1960s and 1970s.)"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Musk's DOGE using AI to snoop on U.S. federal workers, sources say",
            "external_url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/",
            "upvotes": 2952,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Big Brother is watching.\n\nIsn't this exactly the kind of thing that conservatives worried about? The government monitoring you?\n\nWhat do trump supporters have to say about this? My guess is they will deny it or say if you're not doing anything wrong why worry about it.",
                "This is **not** your standard company snooping to check you’re at your desk!\n\n> Trump administration officials have told some U.S. government employees that Elon Musk’s DOGE team of technologists is using artificial intelligence to **surveil at least one federal agency’s communications for hostility to President Donald Trump and his agenda**, said two people with knowledge of the matter.\n\n> At the Environmental Protection Agency, for instance, some EPA managers were told by Trump appointees that Musk’s team is **rolling out AI to monitor workers, including looking for language in communications considered hostile to Trump or Musk**, the two people said.\n\nSummary:\n\n> - DOGE uses AI to monitor communications for anti-Trump sentiment, sources say\n> - DOGE’s use of Signal app raises data security and transparency concerns\n> - Musk’s DOGE team accused of bypassing vetting processes, operating in secrecy\n\nYes, ‘sources say’. This is Reuters, I can guarantee they’ve vetted those sources.",
                "I think it goes, or at least is going to go, far beyond federal workers.\n\nhttps://www.upi.com/Voices/2025/03/06/DOGE-government-data-danger/2551741269965/",
                "Very normal events happening in a very normal country.",
                "I hear Signal is now an approved messaging app for discussing special plans. Maybe federal workers could look into a Signal chat group to escape DOGE's Big Brother.",
                "Someday soon grok is going to reveal itself as a mole and blow this whole thing wide open",
                "Seems like an easy win in a wrongful termination lawsuit since federal employees can't be discriminated against based on beliefs. \n\nThese guys are so dumb actually making this policy. It's the most un-American stuff ever.\n\nCan you imagine Harris doing this to conservatives? It's all the stuff they accused the democrats of doing but way worse. Remember, \"liberal hive mind\"? These Maga morons are all about projection.",
                "Musk is so pathetic. I've never seen a billionaire fail in nearly every aspect of life.",
                "Why doesn’t he use ai to figure out how his body became disproportionately fat. ",
                "Let me fetch my suprised face.\n\n#=O"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court Lets Niagara Falls Pastor’s Push for Armed Worship Continue Against New York State",
            "external_url": "https://www.niagaraaction.com/supreme-court-lets-niagara-falls-pastor-s-push-for-armed-worship-continue-in-new-york-state",
            "upvotes": 446,
            "date": "04/08/2025",
            "thumbnail": "https://static.wixstatic.com/media/a6ba08_d78caa774f3042f183c911500aa62566~mv2.png/v1/fill/w_1000,h_684,al_c,q_90,usm_0.66_1.00_0.01/a6ba08_d78caa774f3042f183c911500aa62566~mv2.png",
            "top_comments": [
                "BROTHER MAYNARD: Armaments, Chapter Two, Verses Nine to Twenty-One\n\nHIGH-PITCHED BROTHER: And Saint Attila raised the Hand Grenade up on high, saying, \"O Lord, bless this Thy Hand Grenade that, with it, Thou mayest blow Thine enemies to tiny bits in Thy mercy.\" And the Lord did grin, and the people did feast upon the lambs and sloths and carp and anchovies and orangutans and breakfast cereals and fruit bats and large ...\n\nBROTHER MAYNARD: Skip a bit, Brother\n\nHIGH-PITCHED BROTHER: And the Lord spake, saying, \"First shalt thou take out the Holy Pin. Then, shalt thou count to three. No more. No less. Three shalt be the number thou shalt count, and the number of the counting shalt be three. Four shalt thou not count, nor either count thou two, excepting that thou then proceed to three. Five is right out. Once the number three, being the third number, be reached, then lobbest thou thy Holy Hand Grenade of Antioch towards thy foe, who, being naughty in My sight, shall snuff it.\"",
                "“Armed Worship!?!?”\n\nDafuq?",
                "Got far cry 5 vibes from that headline",
                "I know a lot of black churches armed themselves after the church shooting a few years back. I certainly don't see why they shouldn't be allowed to do so safely. ",
                "After reading the article it's not to worship guns, that's the weird church in PA. This is a stay strapped or get clapped defense. It's an African church and maybe they want to be able to defend them selves against the rise of nazis. It's not out of fetishization, it's out of survival. I am disgusted with society but here we are. Stay strapped or get clapped..... unfortunately.",
                "“Praise the Lord and pass the ammunition.”",
                "As much as I think the present Supreme Court is corrupt, illegitimate, and dangerous, this one I agree with. Freedom of association, the right to due process, the right to bear arms, and private property rights should not be infringed upon by the government. \n\nNot even against people we disagree with. \n\nAnd not even by politicians we agree with. \n\nTo permit otherwise opens the door to selective applications of law. If the law can be selective, then deportations for speech elected officials dislike, for suspected gang affiliation, for opposing government actions are all just as legitimate. \n\nThat's what rule of law means. The law has to apply to everyone equally and there are limits to what elected officials can impose on the public.\n\nNot that the current Republican government is actually following that principle. The Supreme Court only declined to hear the case because the lower court ruling aligns with the Republican platform *for now*.",
                "My question is who has the authority to declare a house of worship a gun-free zone: the house of worship, or the government?",
                "Many are missing the point. NYS is dictating to ecclesiastical authorities lawful possession is forbidden on their private property. A government making ecclesiastical decisions is typically a no go. \n\nSikhs carry weapons as part of the faith. Other denominations have armed security details. There is nothing out of precedent or unreasonable here. If I was a Synagogue, Temple etc I definitely want armed protection, there are those out there who want us genocided.\n\nWe will defend ourselves and not die on our knees begging for mercy.",
                "Okay so context: churches where PoC gather are frequently the target of racists and bigots. During the civil rights movement they were attacked and bombed. They are attacked even now, with the article directly mentioning the 2015 shooting of Emanuel African Methodist Episcopal Church by a white supremacist. \n\nSo it's less a \"wtf\" and more of a \"yeah, makes dark level of pragmatic sense\"."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Soccer coach charged with murder after missing 13-year-old boy found dead: DA",
            "external_url": "https://abcnews.go.com/US/soccer-coach-charged-murder-los-angeles/story?id=120579607",
            "upvotes": 401,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e8021383-3888-450c-ad58-e1493028ddb0/oscar-pic_1744071327442_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "And the guy was under investigation for a sex act with a minor in February of 2024. How was he able to be anywhere near kids, let alone be a coach for a travel team?",
                "They found him on Harbor blvd between Ventura and Oxnard. I don’t know why they keep saying by Leo Carrillo beach. It was near McGrath beach.",
                "Jesus Christ, this poor kid."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US auto tariffs apply to all computers and hard disks",
            "external_url": "https://www.heise.de/en/news/US-auto-tariffs-apply-to-all-computers-and-hard-disks-10343085.html",
            "upvotes": 1017,
            "date": "04/08/2025",
            "thumbnail": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/8/3/2/9/7/6/21957edc41622975ec65a255d7811fd4cddb4437e9ad70e33545c6f5fbe1d99b-2418542ff81df561-aade4c4bf327bc2a.jpeg",
            "top_comments": [
                "Majority of Americans especially Trump's voters have not yet fully realized the Gravity of tariffs.\n\nTrump promised tariffs before election.  Why are people not taking him seriously?",
                "this is from a German tech-news source that digged into the tariff papers and found that HTSUS code 8471 (Computers, HDDs, Certain Hardware Comps.) is actually listed in the recently provided Automobile + Parts tariffs paper.\n\nShould this not be revised by the gov admin, any computer hardware imported to and sold in the US should raise in price pretty immediately. \n\nIf this is an oversight or deliberate intent is to be seen.\n\n**Other sources (look for number 8471):**\n\n**Included Product Categories in Automobile Tariffs**\nhttps://www.thompsonhinesmartrade.com/2025/04/annex-identifying-scope-of-automobile-and-automobile-parts-subject-to-section-232-tariffs-is-released/\n\n**HTS (Harmonized Tariff Schedule) codes**\nhttps://www.hts-code.com/code/hts_result?code=471",
                "PC Players Rise up, you're not gonna be able to say \"Buy a steam deck\" as easily as you've been saying following thr Switch 2 price reveal",
                "You might even say everything's... all computers.",
                "Everything’s computer!  I love Tessler",
                "Any brand affected by these tariffs needs to add that in the pricing structure, just like how some stores show the tax on the price tag and the base price. It won't help everybody, but it will directly show that the tariffs are responsible for the price increase.",
                "\"Wow, everything computer!\"",
                "I guess computers are cars now",
                "I’m glad I trusted my gut and upgraded my gaming PC earlier this year. I switched from Intel to AMD for my CPU. My 9800X3D + 4090 FE should last me a while.",
                "Can the rest of the world respond in kind regarding the import of US services?\n\nAnyone with more economic knowledge-how mind speculating on how that would work for me?"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Chinese soldiers captured fighting alongside Russians in Ukraine, says Zelenskyy",
            "external_url": "https://www.abc.net.au/news/2025-04-08/zelenskyy-claims-army-has-captured-chinese-soldiers-in-ukraine/105153948?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
            "upvotes": 9678,
            "date": "04/08/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/34cd7307c49584a150f2bad7aae83273?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=200&width=862&height=485&imformat=generic",
            "top_comments": [
                "There have been Chinese mercenaries in Ukraine since the start of the war, that’s nothing new. I even saw a PLA veteran filming and doing some sort of video blog on his Chinese social media account.",
                "It’s Chinese mercs enlisting to the Russian army. Not actual Chinese soldiers",
                "Big difference between capturing Chinese citizens and capturing Chinese soldiers.\n\nAs stated (several paragraphs deep) in the article, citizens from all over the world have gallavanted off to Ukraine to fight.\n\nShame on ABC for that headline.",
                "I mean there have been fighters from many nations on both sides for a while now",
                "It is illegal to desert your post in the army in all countries pretty much. Chinese citizens not soldiers obviously.",
                "It's nothing new,several russian PMCs and military units have been hiring chinese mercenaries since the beginning of the war,some have even fought in the [Pyatnashka Brigade](https://en.wikipedia.org/wiki/Pyatnashka_Brigade)",
                "Brits and americans are fighting at Ukrainian side..",
                "Regardless of the nature of the situation, this announcement is clearly a ploy to appeal to the US, given they’ve announced that China is the only foe they care about.",
                "But why? I heard russians are lining up to enlistment offices everyday",
                "there's been Americans fighting alongside Ukrainians too - doesn't mean the USA is involved in the war, just means people can get paid to fight or just want to fight."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Actor Hirosue Ryoko arrested on suspicion of causing injury",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250408_11/",
            "upvotes": 82,
            "date": "04/08/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250408_11_1512555_L.jpg",
            "top_comments": [
                "For kicking and scratching a nurse. I've heard plenty of stories of much worse over on this side of the pond, with merely a warning dispensed.",
                "Wild.  She was a Nintendo spokesperson at one point.",
                "Oh wow I was a big fan of her music during my high school weeaboo phase."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 3245,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "A government of the Karens, by the Karens, for the Karens.\n\n\nI *guarantee* this guy demanded to see the bar's manager.",
                "The party of “law and order” strikes again.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???",
                "DSS agent: I'm an American! You will open the bar for me!\n\nHotel staff: I fart in your general direction.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "These cavemen have a lot of trouble hearing the word NO."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 471,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "we had a crypto enforcement team? What the fuck have they been doing this whole time??",
                "Let Ponzi rule the day.",
                "Trump can't have his grifting being investigated.",
                "Bro it’s the justice department, not the “Just Us” department",
                "They're going to keep fucking us unlubed, until we finally get off our fat asses and do something about it.",
                "Ofcourse he did. Last thi g he wants is enforcement on his scam crypto investments",
                "Thats dumb, he should just accept bribes/a cut instead, it’ll make him the gateway for crypto scam!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Musk's DOGE using AI to snoop on U.S. federal workers, sources say",
            "external_url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/",
            "upvotes": 2957,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Big Brother is watching.\n\nIsn't this exactly the kind of thing that conservatives worried about? The government monitoring you?\n\nWhat do trump supporters have to say about this? My guess is they will deny it or say if you're not doing anything wrong why worry about it.",
                "This is **not** your standard company snooping to check you’re at your desk!\n\n> Trump administration officials have told some U.S. government employees that Elon Musk’s DOGE team of technologists is using artificial intelligence to **surveil at least one federal agency’s communications for hostility to President Donald Trump and his agenda**, said two people with knowledge of the matter.\n\n> At the Environmental Protection Agency, for instance, some EPA managers were told by Trump appointees that Musk’s team is **rolling out AI to monitor workers, including looking for language in communications considered hostile to Trump or Musk**, the two people said.\n\nSummary:\n\n> - DOGE uses AI to monitor communications for anti-Trump sentiment, sources say\n> - DOGE’s use of Signal app raises data security and transparency concerns\n> - Musk’s DOGE team accused of bypassing vetting processes, operating in secrecy\n\nYes, ‘sources say’. This is Reuters, I can guarantee they’ve vetted those sources.",
                "I think it goes, or at least is going to go, far beyond federal workers.\n\nhttps://www.upi.com/Voices/2025/03/06/DOGE-government-data-danger/2551741269965/",
                "Very normal events happening in a very normal country.",
                "I hear Signal is now an approved messaging app for discussing special plans. Maybe federal workers could look into a Signal chat group to escape DOGE's Big Brother.",
                "Someday soon grok is going to reveal itself as a mole and blow this whole thing wide open",
                "Seems like an easy win in a wrongful termination lawsuit since federal employees can't be discriminated against based on beliefs. \n\nThese guys are so dumb actually making this policy. It's the most un-American stuff ever.\n\nCan you imagine Harris doing this to conservatives? It's all the stuff they accused the democrats of doing but way worse. Remember, \"liberal hive mind\"? These Maga morons are all about projection.",
                "Musk is so pathetic. I've never seen a billionaire fail in nearly every aspect of life.",
                "Why doesn’t he use ai to figure out how his body became disproportionately fat. ",
                "Let me fetch my suprised face.\n\n#=O"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Chinese soldiers captured fighting alongside Russians in Ukraine, says Zelenskyy",
            "external_url": "https://www.abc.net.au/news/2025-04-08/zelenskyy-claims-army-has-captured-chinese-soldiers-in-ukraine/105153948?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
            "upvotes": 9687,
            "date": "04/08/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/34cd7307c49584a150f2bad7aae83273?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=200&width=862&height=485&imformat=generic",
            "top_comments": [
                "There have been Chinese mercenaries in Ukraine since the start of the war, that’s nothing new. I even saw a PLA veteran filming and doing some sort of video blog on his Chinese social media account.",
                "It’s Chinese mercs enlisting to the Russian army. Not actual Chinese soldiers",
                "Big difference between capturing Chinese citizens and capturing Chinese soldiers.\n\nAs stated (several paragraphs deep) in the article, citizens from all over the world have gallavanted off to Ukraine to fight.\n\nShame on ABC for that headline.",
                "I mean there have been fighters from many nations on both sides for a while now",
                "It is illegal to desert your post in the army in all countries pretty much. Chinese citizens not soldiers obviously.",
                "It's nothing new,several russian PMCs and military units have been hiring chinese mercenaries since the beginning of the war,some have even fought in the [Pyatnashka Brigade](https://en.wikipedia.org/wiki/Pyatnashka_Brigade)",
                "Brits and americans are fighting at Ukrainian side..",
                "Regardless of the nature of the situation, this announcement is clearly a ploy to appeal to the US, given they’ve announced that China is the only foe they care about.",
                "But why? I heard russians are lining up to enlistment offices everyday",
                "there's been Americans fighting alongside Ukrainians too - doesn't mean the USA is involved in the war, just means people can get paid to fight or just want to fight."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "US auto tariffs apply to all computers and hard disks",
            "external_url": "https://www.heise.de/en/news/US-auto-tariffs-apply-to-all-computers-and-hard-disks-10343085.html",
            "upvotes": 1017,
            "date": "04/08/2025",
            "thumbnail": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/8/3/2/9/7/6/21957edc41622975ec65a255d7811fd4cddb4437e9ad70e33545c6f5fbe1d99b-2418542ff81df561-aade4c4bf327bc2a.jpeg",
            "top_comments": [
                "Majority of Americans especially Trump's voters have not yet fully realized the Gravity of tariffs.\n\nTrump promised tariffs before election.  Why are people not taking him seriously?",
                "this is from a German tech-news source that digged into the tariff papers and found that HTSUS code 8471 (Computers, HDDs, Certain Hardware Comps.) is actually listed in the recently provided Automobile + Parts tariffs paper.\n\nShould this not be revised by the gov admin, any computer hardware imported to and sold in the US should raise in price pretty immediately. \n\nIf this is an oversight or deliberate intent is to be seen.\n\n**Other sources (look for number 8471):**\n\n**Included Product Categories in Automobile Tariffs**\nhttps://www.thompsonhinesmartrade.com/2025/04/annex-identifying-scope-of-automobile-and-automobile-parts-subject-to-section-232-tariffs-is-released/\n\n**HTS (Harmonized Tariff Schedule) codes**\nhttps://www.hts-code.com/code/hts_result?code=471",
                "PC Players Rise up, you're not gonna be able to say \"Buy a steam deck\" as easily as you've been saying following thr Switch 2 price reveal",
                "You might even say everything's... all computers.",
                "Everything’s computer!  I love Tessler",
                "Any brand affected by these tariffs needs to add that in the pricing structure, just like how some stores show the tax on the price tag and the base price. It won't help everybody, but it will directly show that the tariffs are responsible for the price increase.",
                "\"Wow, everything computer!\"",
                "I guess computers are cars now",
                "I’m glad I trusted my gut and upgraded my gaming PC earlier this year. I switched from Intel to AMD for my CPU. My 9800X3D + 4090 FE should last me a while.",
                "Can the rest of the world respond in kind regarding the import of US services?\n\nAnyone with more economic knowledge-how mind speculating on how that would work for me?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court Lets Niagara Falls Pastor’s Push for Armed Worship Continue Against New York State",
            "external_url": "https://www.niagaraaction.com/supreme-court-lets-niagara-falls-pastor-s-push-for-armed-worship-continue-in-new-york-state",
            "upvotes": 449,
            "date": "04/08/2025",
            "thumbnail": "https://static.wixstatic.com/media/a6ba08_d78caa774f3042f183c911500aa62566~mv2.png/v1/fill/w_1000,h_684,al_c,q_90,usm_0.66_1.00_0.01/a6ba08_d78caa774f3042f183c911500aa62566~mv2.png",
            "top_comments": [
                "BROTHER MAYNARD: Armaments, Chapter Two, Verses Nine to Twenty-One\n\nHIGH-PITCHED BROTHER: And Saint Attila raised the Hand Grenade up on high, saying, \"O Lord, bless this Thy Hand Grenade that, with it, Thou mayest blow Thine enemies to tiny bits in Thy mercy.\" And the Lord did grin, and the people did feast upon the lambs and sloths and carp and anchovies and orangutans and breakfast cereals and fruit bats and large ...\n\nBROTHER MAYNARD: Skip a bit, Brother\n\nHIGH-PITCHED BROTHER: And the Lord spake, saying, \"First shalt thou take out the Holy Pin. Then, shalt thou count to three. No more. No less. Three shalt be the number thou shalt count, and the number of the counting shalt be three. Four shalt thou not count, nor either count thou two, excepting that thou then proceed to three. Five is right out. Once the number three, being the third number, be reached, then lobbest thou thy Holy Hand Grenade of Antioch towards thy foe, who, being naughty in My sight, shall snuff it.\"",
                "“Armed Worship!?!?”\n\nDafuq?",
                "Got far cry 5 vibes from that headline",
                "I know a lot of black churches armed themselves after the church shooting a few years back. I certainly don't see why they shouldn't be allowed to do so safely. ",
                "After reading the article it's not to worship guns, that's the weird church in PA. This is a stay strapped or get clapped defense. It's an African church and maybe they want to be able to defend them selves against the rise of nazis. It's not out of fetishization, it's out of survival. I am disgusted with society but here we are. Stay strapped or get clapped..... unfortunately.",
                "“Praise the Lord and pass the ammunition.”",
                "As much as I think the present Supreme Court is corrupt, illegitimate, and dangerous, this one I agree with. Freedom of association, the right to due process, the right to bear arms, and private property rights should not be infringed upon by the government. \n\nNot even against people we disagree with. \n\nAnd not even by politicians we agree with. \n\nTo permit otherwise opens the door to selective applications of law. If the law can be selective, then deportations for speech elected officials dislike, for suspected gang affiliation, for opposing government actions are all just as legitimate. \n\nThat's what rule of law means. The law has to apply to everyone equally and there are limits to what elected officials can impose on the public.\n\nNot that the current Republican government is actually following that principle. The Supreme Court only declined to hear the case because the lower court ruling aligns with the Republican platform *for now*.",
                "My question is who has the authority to declare a house of worship a gun-free zone: the house of worship, or the government?",
                "Many are missing the point. NYS is dictating to ecclesiastical authorities lawful possession is forbidden on their private property. A government making ecclesiastical decisions is typically a no go. \n\nSikhs carry weapons as part of the faith. Other denominations have armed security details. There is nothing out of precedent or unreasonable here. If I was a Synagogue, Temple etc I definitely want armed protection, there are those out there who want us genocided.\n\nWe will defend ourselves and not die on our knees begging for mercy.",
                "Okay so context: churches where PoC gather are frequently the target of racists and bigots. During the civil rights movement they were attacked and bombed. They are attacked even now, with the article directly mentioning the 2015 shooting of Emanuel African Methodist Episcopal Church by a white supremacist. \n\nSo it's less a \"wtf\" and more of a \"yeah, makes dark level of pragmatic sense\"."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Soccer coach charged with murder after missing 13-year-old boy found dead: DA",
            "external_url": "https://abcnews.go.com/US/soccer-coach-charged-murder-los-angeles/story?id=120579607",
            "upvotes": 400,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e8021383-3888-450c-ad58-e1493028ddb0/oscar-pic_1744071327442_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "And the guy was under investigation for a sex act with a minor in February of 2024. How was he able to be anywhere near kids, let alone be a coach for a travel team?",
                "They found him on Harbor blvd between Ventura and Oxnard. I don’t know why they keep saying by Leo Carrillo beach. It was near McGrath beach.",
                "Jesus Christ, this poor kid."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Budget airline Avelo to fly deportation flights for ICE from Arizona",
            "external_url": "https://apnews.com/article/avelo-airline-deportation-ice-arizona-463bc3e5c65b002c0cca9976be066df6",
            "upvotes": 648,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Looking at Avelo's business:\n\n\\*20 planes in the fleet, all 737s\n\n\\*Full fleetwide flight plans peak at 40 (20 to-and-fros) per day\n\n\\*12 of them are to/from Mexico, Dominican Republic, Jamaica, and Puerto Rico. Pretty sure there are plenty of seats are open on those segments. 30% of your full plan is significant.\n\nTherefore, they pivoted to replace those retail international flights with ICE flights.\n\n  \nEDIT: Adjusted destinations, number of flights",
                "Not that I’m flying, but it’s good to know to avoid this company going forward.",
                "Can't wait to see current and former employees spill the tea about Avelo.",
                "Brown Shirt Air, reporting for duty!",
                "Absolutely disgusting. Avelo Airlines is now profiting off human suffering by partnering with ICE for deportation flights? Instead of offering affordable travel, they're turning into a private wing of a broken, inhumane immigration system. Boycott this airline — no company should make money tearing families apart.",
                ">In New Haven, Connecticut, where Avelo flies out of Tweed New Haven Airport, Democratic Mayor Justin Elicker said he called Levy over the weekend to express his opposition to the arrangement and urged the CEO to reconsider.\n\n\nPoor guy just put himself on Abbott's bus schedule this summer.",
                "Train companies took Nazi money to shuttle Jews to the camps, this isn't surprising.",
                "Instead of trains the fascists are now using airlines",
                "I'm sure it's for a much higher rate than they would charge for a normal flight.",
                "Reprehensible.  They will never see a dollar from my family.  I hope this attempt to profit from depravity is the death of their airline."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump administration fires senior Navy female officer at NATO. She appeared on a 'woke' list",
            "external_url": "https://apnews.com/article/pentagon-hegseth-trump-dei-chatfield-nato-23df15b59766458d106567ba782d2f15",
            "upvotes": 24271,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*The letter said Chatfield posted supportive comments on LinkedIn about a diversity summit and gave a speech in 2015 at Women’s Equality Day. The group quoted her as saying that investing in empowering women can unlock human potential.*\n\n*And they also said she was quoted as saying, “our diversity is our strength” — a phrase that Hegseth has repeatedly condemned.*\n\n\nShe was fired for years old comments that didn't draw any ire if you are a rational adult.",
                "This is the administration blatantly being assholes in broad daylight and seemingly getting away with it. \n\nTrump and the GOP are making a mockery of this once great country.\nTheir pettiness knows no bounds, they are off the leash, shitting and pissing on everything, pandering to the MAGA weirdos and destroying any goodwill with our allies. \nHow is anyone OK with this?",
                "When this is over, they need to mount a plaque at the Pentagon with the names of all the service members that were sacrificed in the name of MAGA's woke phobia.",
                ">  “purging the woke from the military is imperative.”\n\n\"We need to purge the Jews\" vibes. Genuinely uncomfortable to read.",
                "Admiraling while female is enough to get you fired these days.",
                "I assume denounciations, false accusations by right wing influencers and grifters will slowly deplete our government and armed forces of competent employees and leaders. What could possibly go wrong?",
                "Evangelicals are worried about the persecution of Christians.\n\nJesus reached out to the marginalized. He’d be considered ‘woke’.\n\nAnd woke is now being persecuted.",
                "This is a wild and scary timeline! For as long as I've been working (20 years) making openly discriminatory statements would (rightfully) get you fired. Now saying you SHOULDN'T discriminate is a reason to be fired? When will \"hate quotas\" become a requirement for employment? Will people start getting fired if they DON'T  use slurs against others? Will employees have to organize group harassment initiatives against people considered \"other\"? Where is the line?",
                "When you look at this woman's resume and experience she's 100 times more qualified and and competent to lead than Hegseth.   So pretty much the US military if you're not a white male you get either clean the latrines, work the kitchens or get the fuck out.  Let's see how long it remains an effective fighting force.",
                "What I do not understand and probably never will is how any active or retired military can support Trump. He’s all talk. I am sure there are countless soldiers who worked with and under her that would literally go through hell for her and with her. I am also sure that many of those same people voted for Trump and would still vote for Trump. It’s sick and unbelievable that we’re this broken."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 7748,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "You have to wonder about the type of person who willingly engages in these Gestapo tactics. I wonder what they try to pretend their profession is to others. They might be delusional enough to think the common reaction to finding out what they are is \"respect\" and not disgusted aversion, but perhaps some of them have the self awareness to be ashamed to be known for their affiliation.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "Holy FUCK. A LAWYER getting grabbed by federal agents and them DEMANDING access to his privileged information (IE his entire phone) without a warrant is absolutely fucking insane.\n\nI cannot stress enough how crazy that is.\n\nAny Trumper who supports this is well and truly lost forever. This is an attack on our right to a fair trial. One of our most basic tenements in the constitution.",
                "US is transforming into an authoritarian regime right before our eyes.",
                "This will get out of hand and we'll be lucky to live through it.",
                "Can someone *not* go along with this super villain shit?\n\n\nAre there no cops in this country with *any* dignity?",
                "It is called fascism. Is that better, everyone?",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "“\"This current administration is doing something that no administration has done — they are attacking attorneys,\" Makled said, stressing lawyers from big and small firms alike are being targeted. \"This is a different type of threat to the rule of law that I see. They are now challenging the judiciary, or lawyers, they're putting pressure (on them) to dissuade attorneys from taking on issues that are against the government's issues. We have an obligation as lawyers to stand up to this stuff.\"”\n\nThe felon-in-chief has unleashed his Brown Shirt goons on attorneys now. Freaking right-wing not-sees."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/08/2025 16:11:02 UTC"
}