{
    "posts": [
        {
            "category": "HOT",
            "title": "China to impose 34% retaliatory tariff on all goods imported from the U.S.",
            "external_url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 17916,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080",
            "top_comments": [
                "Conservatives - Fall 2024 - “Eggs are too damn high.”\n\nConservatives - Apr 2025 - “New taxes on almost everything…sounds good.”",
                "Has any country in history ever started a trade war with the entire planet and won?",
                "China has the largest manufacturing base in the world - naïve to expect they wouldn’t hit back.",
                "What DT has done will be chronicled in history books not only for how he manipulated data to serve his interests, but also for how he influenced collective minds through falsehoods, expecting other political actors to fall into his trap. Fortunately, most of the world is no longer willing to dance to his tune or validate his tactics.",
                "So uh..... farmers fucked?",
                "The republican base will see this and believe its “growing pains”. There is no amount of pain they can suffer before it’s Trumps fault \n\nNo matter what happens in the next 4 years, it will always be Biden and the democrats fault",
                "aaaaand there goes the American farmer exports...",
                "American dollar stores are going to have to become $1.34 stores.",
                "Yep. Trump and the complicit congress just ceded world leadership to China. It's not just the tariffs. It's how it was done. We are SO OBVIOUSLY not someone you can depend on.\n\nThanks voters. Trump is the moron doing it, but you were the people who chose this.",
                "We have 3 branches of government. One led by the orange clown is trying to wreck the US and global economies to please Putin and the other 2 branches are asleep at the wheel."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 6218,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Rapist Russell Brand charged with trying to be comedian",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "Well, that went exactly as expected. Scumbag.",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill.",
                "Since he's become a Christian there's been a huge smear campaign against him. Stop this harassment of Christians NOW!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 2865,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "“I want to thank God for trusting me with this mission...\"\n\nChristianity detected, opinion rejected.",
                "I’m sure the comments and discourse will be very positive",
                "Reading the comments have been mind blowing as someone who used to compete in fencing. \n\nIn my experience, gender absolutely made a difference. For reference, I couldn't even score a hit against some of the best men's junior Olympic fencers. But I won scoring wrist flicks back to back against some of the top female fencers for the junior leagues in the country.\n\nBut I absolutely wouldn't be surprised if the disqualified athlete has conservative ideals and their refusal to compete had performative and metaphoric reasons. \n\nBut can we please not speak beyond our lived experiences? It's very weird to read people who have never fenced, or have fenced a little bit say the sport is entirely technique. In my experience, this isn't the case and I'm quite confident some of the best fencers I knew for both male and female divisions would not perform the same competing against each other.",
                "So I feel like this needs to be added, for the 'obviously Sullivan had an unfair advantage' crowd.\n\nI think [this](https://member.usafencing.org/details/tournaments/9012) was the event (fits the time and location).  Specifically in the Division IA Women's Foil, I don't see Sullivan's name in any other event.  \n\nSullivan ended up 24th out of 39, with Turner being 39th as DNF.\n\nIf Sullivan had an advantage, it appears to have been marginal at best.  If you are worried about the 'Majesty of competition', I should note that it does not appear the national news gave a damn about this competition until there was culture war content to be made out of the proceedings."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "C.E.O. Choked Man Who Danced Barefoot on Cruise Ship, U.S. Says",
            "external_url": "https://www.nytimes.com/2025/04/03/us/ceo-choking-virgin-cruise.html?unlocked_article_code=1.9E4.lCTP.l-u2TGKPZe2C&smid=re-share",
            "upvotes": 2214,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The White Lotus writers just got an idea for season 4",
                "Thought he was Tony Soprano telling that guy to take off his hat",
                "Can’t handle someone dancing barefoot? Don’t go on a cruise. Better yet, don’t leave your house",
                "Is everyone going crazy!",
                "It’s weird to me this guy is going on a cruise with all the poors. Doesn’t he have his own yacht?",
                "The CEO can’t handle what to do when hearing “no,” or “f*** you,” or a middle finger. Because he surrounds himself with yes men at work, he expects the rest of his life to follow.",
                "So let me get this straight; dude was just vibing out then the perpetrator's wife, who can't mind their own fucking business, comes over to tell him to put on his shoes. He's like nah and gives her the bird then perp is like \"Know what's a really good idea? Fuck everyone's whole vibe up and attempt to kill someone.\" Yeah nah lock his ass up like anyone else would be. I don't give a flying fuck what company he leads.",
                "Well he is rich so we all know the eventual outcome",
                "Passanger: \"I'm having such a great time on my vacation.\"\n\nCEO: \"I'LL FUCKING KILL YOU!\"",
                "\"The altercation began shortly after Mr. DeGiorgio’s wife had confronted the man about barefoot dancing, telling him, “Look, we are all grown-ups here — can you put your shoes on?” Mr. DeGiorgio’s wife told investigators that the man had made a crude remark to her, and the security video showed him giving her the middle finger, according to the F.B.I.\n\nSo that was all it took for DeGiorgio to choke this man and threaten to kill him?  Because his shitty wife was ordering people to do what she wanted?   Oh fuck no.  Have fun in federal court, dickface."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "US NSA director Timothy Haugh fired, Washington Post reports",
            "external_url": "https://www.reuters.com/world/us/us-nsa-director-timothy-haugh-fired-washington-post-reports-2025-04-04/",
            "upvotes": 9915,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He testified at the senate hearing that there were risks to using Signal. When the team cheats but you don't, you get benched for not being a team player.",
                "Wonder if this is related to Laura Loomer's visit to the Oval Office yesterday that led to the firing of three NSC officials.",
                "The director and the No. 2 official at the National Security Agency were ousted from their positions Thursday, according to a defense official and three sources with knowledge of the matter.\n\nIt was not immediately clear why Air Force Gen. Timothy Haugh and his deputy were dismissed, the sources said.",
                "They have purged most of the military and intelligence agency leadership. Scary stuff. ",
                "He must have been too competent and not a toady.",
                "Oh, we're changing NSA oversight after a far right meeting with the president.\n\nYeah that sounds safe and in no way concerning.",
                "Because they were not \"loyal\"? How did this insidious concept creep into the administration vernacular without sounding alarm bells? People have forgotten how democracy works. Everyone isn't supposed to just agree with the President and do whatever he says.",
                "New NSA director will be hulk hogan mmw",
                "Reading up on him his studies were Russia related.  Can’t have a career intelligence officer that knows the in and out of Russia be the top spy.",
                "I fear corruption. We're taking full 180 on US. I don't know how to feel about the future of humanity."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 18898,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "Award for the most incompetent government of all time?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.\n\n>Kennedy said that the elimination of the Centers for Disease Control and Prevention’s **entire Lead Poisoning Prevention and Surveillance Branch** was among the mistakes.",
                "They fired thousands of employees trying to get a public relations win. Thats it.\n\nPathetic, amateur shit.",
                "The incompetence of this administration is just mind blowing...",
                "Everything the current administration does is a mistake",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them.",
                "How do you accidentally lay off people?",
                ">\"Personnel that should not have been cut, were cut. We're reinstating them. **And that was always the plan. Part of the DOGE, we talked about this from the beginning, is we're going to do 80% cuts, but 20% of those are going to have to be reinstated, because we'll make mistakes**,\" Kennedy said, speaking to reporters at a stop in Virginia.\n\nSo they purposely decided to be reckless and fuck with the lives and livelihoods of what, tens of thousands of people unnecessarily? Not to mention completely eliminating entire agencies that they will now have to hope they can somehow put back together again?\n\nWHAT THE FUCK WAS THE RUSH? Why did they try to speed run a four year term in four weeks? How is it a \"mistake\" when you purposely fuck shit up?? You literally cannot *plan to make a mistake*. They just planned to be destructive because they could. It's like Elon completely lapsed into insanity and smeared shit on the walls for weeks, and now Robert F. Kennedy of all people has to try to clean it up.\n\nHow can anyone, no matter how batshit crazy they are, stand there and expect what he is saying to be ok or seem normal to anyone?",
                "They're seriously just firing people to fire people. It's the dumbest concept in the world.\n\nIt's fine if it's your tech bro company, but not when it's the goddamn US government that the people of this country rely on."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 22545,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "The clown show continues",
                "Another grifter. Jesus fuck.",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "All you rural red state small towns get ready to lose your only hospital. If they stop or drastically reduce federal funding for Medicare/ Medicaid, that will bankrupt the rural hospital industry.  Small to non-existent margins. A disproportionate share of poor folks and charity care. A national marketplace for trained healthcare staff, supplies and pharmaceuticals. It will be too much to shift to other sources. Hope folks like driving 2-3 hours for healthcare. Ambulance service will be iffy. There will be unnecessary deaths from both age and accidents.  Not to say the system we have now is the greatest,  but cutting without a real , thoughtful plan will destroy things that will be very difficult to put back together.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "Wait til they install Alex Jones as Director of the CIA"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Powell sees tariffs raising inflation and says Fed will wait before further rate moves",
            "external_url": "https://www.cnbc.com/2025/04/04/powell-sees-tariffs-raising-inflation-and-says-fed-will-wait-before-further-rate-moves.html",
            "upvotes": 470,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118505-1742409620024-gettyimages-2205294449-AFP_377H7W8.jpeg?v=1742409650&w=1920&h=1080",
            "top_comments": [
                "The only adult left in the House because Trump can’t fire him yet.",
                "With those tarrifs in effect companies will just start passing on the extra costs to the consumer.\n\nThere is now going to be an worldwide recession due to a global trade started by that idiot and his stupid tarrifs.",
                "Man with handwritten \"slow\" sign about to get run over by orange-haired driver with four JATO units strapped to his car heading straight for cliff wall.",
                "> Our obligation is to keep longer-term inflation expectations well anchored and to make certain that a one-time increase in the price level does not become an ongoing inflation problem,” Powell said in prepared remarks. “We are well positioned to wait for greater clarity before considering any adjustments to our policy stance. It is too soon to say what will be the appropriate path for monetary policy.”\nThe remarks came shortly after Trump called on Powell to “stop playing politics” and cut interest rates because inflation is down.\n\nAccusing someone else of political grandstanding is rich coming from Trump.",
                "Shocker. Who could have seen this coming? \n\nApparently not the serial bankrupter in the white house.",
                ">Powell noted that the announced tariffs were “significantly larger than expected.”\n\nBankrupting a casino should've been an indicator",
                "Powell is no match for the random machinations of a very stable jenius",
                "Hold your ground JPOW.  The orange fucker is trying to strong arm you!",
                "Raise may be an understatement.",
                "This man is proof that republicans are not all trash"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "South Korea president Yoon Suk Yeol removed from office after impeachment upheld by court",
            "external_url": "https://www.theguardian.com/world/2025/apr/04/south-korea-president-yoon-suk-yeol-impeachment-verdict-results-removal",
            "upvotes": 4968,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7e35f53af66efc35b0242cd0d374aed76dba896d/0_260_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0144373a4894000309d7292281bb0ae",
            "top_comments": [
                "Bastard deserves to be impeached for the clumsy way he tried to seize power and dismantle democracy in Korea. Now we have wait to see if his followers accept things or continue making trouble.",
                "Unanimous verdict from all 8 justices",
                "Can we have some of that sweet rule of law and democracy in the US, please?",
                "Is impeachment trending? I hope so.",
                "Means new Elections within 60 days",
                "The USA is the only first world country WITHOUT Universal healthcare.\n\nThe USA is the only country that allowed a TRAITOR to invade the Oval Office, the People's House.\n\n[https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents](https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents)",
                "The facts of the case were so clear cut, at least as a bystander. There didn't seem to be much of a defense either on the part of Yoon. \n\nGlad he's impeached. fingers crossed for criminal charges.",
                "Someday America may become a developed country with a proper judiciary and rule of law",
                "Man this road was a precarious one, but it's finally over. Even though the judge's proclamation was pretty clear, I was on edge until he finally said the word impeached.",
                "worst Korean ever.  along with his wife."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Palestinian man tortured to death by Hamas militants after criticizing group and attending protests, family says",
            "external_url": "https://www.cnn.com/2025/04/01/middleeast/uday-rabie-palestinian-tortured-hamas-intl-latam/index.html",
            "upvotes": 357,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/whatsapp-image-2025-04-01-at-4-45-29-pm.jpeg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " Hamas has literally posted videos of themselves torturing or killing Palestinians who protested against them.  They used the ceasefire to settle old scores.\n\nThey post all these videos themselves in order to intimidate the opposition.  I won't post them because they are NSFL and I'd probably catch a ban but if anyone sends me a DM I will send you the links to the videos on other social media.  Again they are NSFL so don't say I didn't warn you",
                "I've said it before, you can support both Israel and Palestine. That is logically consistent.\n\nWhat you can't do is support both Hamas and Palestine. That is logically *inconsistent*.",
                "Still wondering why Bibi had so much cash smuggled to Hamas back in the day and why the Israelis aren't crucifying him for it.",
                "Does not fit the preferred narrative. Please downplay and ignore.",
                "THIS kind of behavior is why I balked at \"Queers for Palestine\" and just the outright naievete of that crowd. I both don't want anyone slaughtered in the street while just trying to live their lives (especially not with my tax dollars), *and* refuse to carry water for a fundamentalist terrorist group that hates what I love and exploits the very people they claim to be fighting to protect (while their leaders comfortably collect money from a safe distance away). But of course, nuance is \"boring\" and is shouted down.",
                "Looks like there’s still work to do",
                "Netanyahu kills tens of thousands of Palestinians, primarily women and children, but we get a news story about one Palestinian killed by Hamas. I'm so glad I decided against becoming a journalist.",
                "Why don't Hamas attack the new settlements?  Not promoting violence, just puzzled."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Powell sees tariffs raising inflation and says Fed will wait before further rate moves",
            "external_url": "https://www.cnbc.com/2025/04/04/powell-sees-tariffs-raising-inflation-and-says-fed-will-wait-before-further-rate-moves.html",
            "upvotes": 469,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118505-1742409620024-gettyimages-2205294449-AFP_377H7W8.jpeg?v=1742409650&w=1920&h=1080",
            "top_comments": [
                "The only adult left in the House because Trump can’t fire him yet.",
                "With those tarrifs in effect companies will just start passing on the extra costs to the consumer.\n\nThere is now going to be an worldwide recession due to a global trade started by that idiot and his stupid tarrifs.",
                "Man with handwritten \"slow\" sign about to get run over by orange-haired driver with four JATO units strapped to his car heading straight for cliff wall.",
                "> Our obligation is to keep longer-term inflation expectations well anchored and to make certain that a one-time increase in the price level does not become an ongoing inflation problem,” Powell said in prepared remarks. “We are well positioned to wait for greater clarity before considering any adjustments to our policy stance. It is too soon to say what will be the appropriate path for monetary policy.”\nThe remarks came shortly after Trump called on Powell to “stop playing politics” and cut interest rates because inflation is down.\n\nAccusing someone else of political grandstanding is rich coming from Trump.",
                "Shocker. Who could have seen this coming? \n\nApparently not the serial bankrupter in the white house.",
                ">Powell noted that the announced tariffs were “significantly larger than expected.”\n\nBankrupting a casino should've been an indicator",
                "Powell is no match for the random machinations of a very stable jenius",
                "Hold your ground JPOW.  The orange fucker is trying to strong arm you!",
                "Raise may be an understatement.",
                "This man is proof that republicans are not all trash"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Sean 'Diddy' Combs latest: Federal prosecutors file 3rd superseding indictment",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-latest-federal-prosecutors-file-3rd/story?id=120488472&cid=social_twitter_abcn",
            "upvotes": 159,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/109e14c9-c718-4fb7-b6ce-283ef43d148b/sean-diddy-combs-ap-jef-250404_1743777196047_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“The new indictment against Combs adds an additional charge of sex trafficking and an additional charge of transportation to engage in prostitution, exposing Combs to the possibility of additional prison time if convicted.”\n\nTrial set to start May5th. Can’t imagine the horrific shit that will be exposed through trial.",
                "People like Diddy have no place in society. It’s unfortunate that this will likely be dragged out with victims old traumas being revisited. I hope they get paid and some sort of closure with it all.",
                "You have to be a complete piece of shit when federal prosecutors in both the Biden and Trump Administrations are nailing you to the wall.",
                "Send him soap on a rope"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 2867,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "“I want to thank God for trusting me with this mission...\"\n\nChristianity detected, opinion rejected.",
                "I’m sure the comments and discourse will be very positive",
                "Reading the comments have been mind blowing as someone who used to compete in fencing. \n\nIn my experience, gender absolutely made a difference. For reference, I couldn't even score a hit against some of the best men's junior Olympic fencers. But I won scoring wrist flicks back to back against some of the top female fencers for the junior leagues in the country.\n\nBut I absolutely wouldn't be surprised if the disqualified athlete has conservative ideals and their refusal to compete had performative and metaphoric reasons. \n\nBut can we please not speak beyond our lived experiences? It's very weird to read people who have never fenced, or have fenced a little bit say the sport is entirely technique. In my experience, this isn't the case and I'm quite confident some of the best fencers I knew for both male and female divisions would not perform the same competing against each other.",
                "So I feel like this needs to be added, for the 'obviously Sullivan had an unfair advantage' crowd.\n\nI think [this](https://member.usafencing.org/details/tournaments/9012) was the event (fits the time and location).  Specifically in the Division IA Women's Foil, I don't see Sullivan's name in any other event.  \n\nSullivan ended up 24th out of 39, with Turner being 39th as DNF.\n\nIf Sullivan had an advantage, it appears to have been marginal at best.  If you are worried about the 'Majesty of competition', I should note that it does not appear the national news gave a damn about this competition until there was culture war content to be made out of the proceedings."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Internal memo outlines stark impacts of federal downsizing on Alaska regional fishery agency",
            "external_url": "https://alaskabeacon.com/2025/04/03/internal-memo-outlines-stark-impacts-of-federal-downsizing-on-alaska-regional-fishery-agency/",
            "upvotes": 48,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Now if they would get rid of the NMFS cops that come on your vessel fully kitted out like they are about to go into urban warfare."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Sell-off worsens for markets worldwide after China retaliates against Trump's tariffs",
            "external_url": "https://apnews.com/article/market-rates-trump-tariffs-d86db525c370e9da834e6dfb76e23b86",
            "upvotes": 324,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I fear the global economy is about to fall off a precipise.",
                "If only Congress would do their job.\n\nBut maybe the other oligarchs will tire of this and force their hand.",
                "Hey Trump voters, are we winning yet?",
                "[deleted]",
                "~~3200~~ 3500 off the Dow since Trump Liberated us.  I truly am tired of so much winning.\n\nBut hey, after today we'll be a whole 5% done with his Term.\n\n^^Is ^^10am ^^too ^^early ^^to ^^drink ^^an ^^entire ^^bottle ^^of ^^Jameson? ^^Asking ^^for ^^a ^^friend.\n\n*Edit",
                "I'm amazed by how one man can do so much damage to the world. The power of the US President is astounding. And the best part is the US elected an old senile clown and gave him this power.",
                "China should kick Tesla out.",
                "\"If the DOW drops 1000 points in 2 days the president ahould be IMOEACHED!\"\n\n-Donald Trump, 2012",
                ">So far there are few, if any winners, in financial markets from the trade war.\n\nI bet Trumps billionaire buddies who had the inside info and shorted the market are making out like bandits.",
                "I imagine there are some very rich people salivating at the mouth right now, just waiting for the dip to hit its bottom so they can buy in before it turns and make even more moneyz."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Colleges say the Trump administration is using new tactics to expel international students",
            "external_url": "https://apnews.com/article/college-international-student-f1-visa-ice-trump-7a1d186c06a5fdb2f64506dcf208105a",
            "upvotes": 169,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR: student visas are getting revoked for unclear reasons, or for things that normally wouldn’t invite scrutiny, like traffic violations, without any clear connections to any protests whatsoever.\n\nEdit: oh yeah, they are getting legal status removed immediately as well, which previously wasn’t the case either",
                "Isolationism is just a standard part of the fascist authoritarian movement.",
                "Stupidity is the point. Colleges are Americans engaged in manufacturing Education ... and you should be happy foreigners are paying good money to buy our degrees. \n\nIsn't this one of the industries we should be growing for export?",
                "As someone who's been an international student twice in my life--and been friends to countless ones in my home country--if I were an international student in the US right now I'd be trying my best to get out of the country ASAP.\n\n\nRight now the deportations seem to be mostly related to the war in Gaza so I'm sure many students think \"that has nothing to do with me; I'm safe,\" but what will the new reason be next month? And the month after that? The administration is straight-up anti-immigration and I guarantee that things are going to get worse, not better."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Rejected by 16 colleges, hired by Google. Now he's suing some of the schools for anti-Asian discrimination",
            "external_url": "https://www.latimes.com/california/story/2025-04-04/rejected-by-16-colleges-hired-by-google-now-hes-suing-some-of-the-schools-for-anti-asian-discrimination",
            "upvotes": 0,
            "date": "04/04/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/b0800ab/2147483647/strip/true/crop/1634x858+0+31/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdb%2F0c%2Fc375c7c84ef88a38a7bd1a532adf%2Fstanley-zhong.jpg",
            "top_comments": [
                ">Asian Americans have long had the highest admission rates among first-year Californians compared with other racial and ethnic groups. UC’s fall 2024 enrollment data, released in January, showed that Asian Americans made up the largest group of undergrads at 36.3%.\n\nYeah, this guy ain't winning his lawsuit.",
                "I know I’m going to catch flak for this comment, but this dude would be considered pretty generic in the world of elite college admissions. High GPA, test scores, awards, started a business? Yeah, him and 25,000 other applicants at each of these schools, all competing for a few thousand seats.",
                "This silly goober helped prove the point of the colleges that rejected him by using AI to write up these even more silly lawsuits. Not the brightest bulb of the bunch.",
                "I’m not saying that Asian Americans aren’t discriminated against in college admissions because god knows I experienced it myself, but if all bro had was a 4.49 GPA, then he’s still going to have to get in line behind all the other Asian kids that did better. Idk how else to say it.\n\nMy GPA was a 5.6 (weighted) and I didn’t get into Harvard either lmao"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "High school staffer allegedly asked student to kill her husband for $2,000",
            "external_url": "https://abcnews.go.com/US/ohio-high-school-staffer-alleged-murder-for-hire-plot/story?id=120462860",
            "upvotes": 292,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/41fae5e7-6b90-4623-a33c-4b93f3b2fd6f/murder-for-hire-01-ht-jt-250403_1743710109981_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "wtf is wrong with people …",
                ">The complaint did not provide details on Demetrius' role at the high school. Ohio State Board of Education online records show she has a substitute teaching license.\n\nAnother article called her a teacher. This one calls her a staffer.\n\n\n>When asked if she had any questions, Demetrius responded, \"Who is the juvenile involved in this case?\"\n\nThis question makes me think she approached more than one kid.",
                "Not only is this morally wrong, but in what way did it make any sense to trust a high school kid to keep their mouth shut, especially for 2K. Even if the kids is some hardened gang  banger at 17 or so, this is the first thing on the list of shit he's going to flip on to get out of (or reduce) a serious charge when the time comes.",
                "I think I saw this episode of Family Guy.",
                "How do you even bring up this topic of conversation? With a student?",
                "Ah yes, famously discreet high school students are an excellent population pool for recruiting hitmen.",
                "I wouldn't trust a high schooler to do shopping for groceries, that's just bold",
                "I firmly believe than anyone who works with children should have to pass a psych eval.",
                "Stephanie Demetrius, 44, was charged with felony conspiracy for allegedly asking a juvenile at the Academy for Urban Scholars in Columbus to commit the murder, according to the probable cause affidavit.",
                "This has serious \"To Die For\" vibes"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Palestinian man tortured to death by Hamas militants after criticizing group and attending protests, family says",
            "external_url": "https://www.cnn.com/2025/04/01/middleeast/uday-rabie-palestinian-tortured-hamas-intl-latam/index.html",
            "upvotes": 355,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/whatsapp-image-2025-04-01-at-4-45-29-pm.jpeg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " Hamas has literally posted videos of themselves torturing or killing Palestinians who protested against them.  They used the ceasefire to settle old scores.\n\nThey post all these videos themselves in order to intimidate the opposition.  I won't post them because they are NSFL and I'd probably catch a ban but if anyone sends me a DM I will send you the links to the videos on other social media.  Again they are NSFL so don't say I didn't warn you",
                "I've said it before, you can support both Israel and Palestine. That is logically consistent.\n\nWhat you can't do is support both Hamas and Palestine. That is logically *inconsistent*.",
                "Still wondering why Bibi had so much cash smuggled to Hamas back in the day and why the Israelis aren't crucifying him for it.",
                "Does not fit the preferred narrative. Please downplay and ignore.",
                "THIS kind of behavior is why I balked at \"Queers for Palestine\" and just the outright naievete of that crowd. I both don't want anyone slaughtered in the street while just trying to live their lives (especially not with my tax dollars), *and* refuse to carry water for a fundamentalist terrorist group that hates what I love and exploits the very people they claim to be fighting to protect (while their leaders comfortably collect money from a safe distance away). But of course, nuance is \"boring\" and is shouted down.",
                "Looks like there’s still work to do",
                "Netanyahu kills tens of thousands of Palestinians, primarily women and children, but we get a news story about one Palestinian killed by Hamas. I'm so glad I decided against becoming a journalist.",
                "Why don't Hamas attack the new settlements?  Not promoting violence, just puzzled."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 6216,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Rapist Russell Brand charged with trying to be comedian",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "Well, that went exactly as expected. Scumbag.",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill.",
                "Since he's become a Christian there's been a huge smear campaign against him. Stop this harassment of Christians NOW!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Powell sees tariffs raising inflation and says Fed will wait before further rate moves",
            "external_url": "https://www.cnbc.com/2025/04/04/powell-sees-tariffs-raising-inflation-and-says-fed-will-wait-before-further-rate-moves.html",
            "upvotes": 474,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118505-1742409620024-gettyimages-2205294449-AFP_377H7W8.jpeg?v=1742409650&w=1920&h=1080",
            "top_comments": [
                "The only adult left in the House because Trump can’t fire him yet.",
                "With those tarrifs in effect companies will just start passing on the extra costs to the consumer.\n\nThere is now going to be an worldwide recession due to a global trade started by that idiot and his stupid tarrifs.",
                "Man with handwritten \"slow\" sign about to get run over by orange-haired driver with four JATO units strapped to his car heading straight for cliff wall.",
                "> Our obligation is to keep longer-term inflation expectations well anchored and to make certain that a one-time increase in the price level does not become an ongoing inflation problem,” Powell said in prepared remarks. “We are well positioned to wait for greater clarity before considering any adjustments to our policy stance. It is too soon to say what will be the appropriate path for monetary policy.”\nThe remarks came shortly after Trump called on Powell to “stop playing politics” and cut interest rates because inflation is down.\n\nAccusing someone else of political grandstanding is rich coming from Trump.",
                "Shocker. Who could have seen this coming? \n\nApparently not the serial bankrupter in the white house.",
                ">Powell noted that the announced tariffs were “significantly larger than expected.”\n\nBankrupting a casino should've been an indicator",
                "Powell is no match for the random machinations of a very stable jenius",
                "Hold your ground JPOW.  The orange fucker is trying to strong arm you!",
                "Raise may be an understatement.",
                "This man is proof that republicans are not all trash"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "RISING",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 2846,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "“I want to thank God for trusting me with this mission...\"\n\nChristianity detected, opinion rejected.",
                "I’m sure the comments and discourse will be very positive",
                "Reading the comments have been mind blowing as someone who used to compete in fencing. \n\nIn my experience, gender absolutely made a difference. For reference, I couldn't even score a hit against some of the best men's junior Olympic fencers. But I won scoring wrist flicks back to back against some of the top female fencers for the junior leagues in the country.\n\nBut I absolutely wouldn't be surprised if the disqualified athlete has conservative ideals and their refusal to compete had performative and metaphoric reasons. \n\nBut can we please not speak beyond our lived experiences? It's very weird to read people who have never fenced, or have fenced a little bit say the sport is entirely technique. In my experience, this isn't the case and I'm quite confident some of the best fencers I knew for both male and female divisions would not perform the same competing against each other.",
                "So I feel like this needs to be added, for the 'obviously Sullivan had an unfair advantage' crowd.\n\nI think [this](https://member.usafencing.org/details/tournaments/9012) was the event (fits the time and location).  Specifically in the Division IA Women's Foil, I don't see Sullivan's name in any other event.  \n\nSullivan ended up 24th out of 39, with Turner being 39th as DNF.\n\nIf Sullivan had an advantage, it appears to have been marginal at best.  If you are worried about the 'Majesty of competition', I should note that it does not appear the national news gave a damn about this competition until there was culture war content to be made out of the proceedings."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Palestinian man tortured to death by Hamas militants after criticizing group and attending protests, family says",
            "external_url": "https://www.cnn.com/2025/04/01/middleeast/uday-rabie-palestinian-tortured-hamas-intl-latam/index.html",
            "upvotes": 356,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/whatsapp-image-2025-04-01-at-4-45-29-pm.jpeg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " Hamas has literally posted videos of themselves torturing or killing Palestinians who protested against them.  They used the ceasefire to settle old scores.\n\nThey post all these videos themselves in order to intimidate the opposition.  I won't post them because they are NSFL and I'd probably catch a ban but if anyone sends me a DM I will send you the links to the videos on other social media.  Again they are NSFL so don't say I didn't warn you",
                "I've said it before, you can support both Israel and Palestine. That is logically consistent.\n\nWhat you can't do is support both Hamas and Palestine. That is logically *inconsistent*.",
                "Still wondering why Bibi had so much cash smuggled to Hamas back in the day and why the Israelis aren't crucifying him for it.",
                "Does not fit the preferred narrative. Please downplay and ignore.",
                "THIS kind of behavior is why I balked at \"Queers for Palestine\" and just the outright naievete of that crowd. I both don't want anyone slaughtered in the street while just trying to live their lives (especially not with my tax dollars), *and* refuse to carry water for a fundamentalist terrorist group that hates what I love and exploits the very people they claim to be fighting to protect (while their leaders comfortably collect money from a safe distance away). But of course, nuance is \"boring\" and is shouted down.",
                "Looks like there’s still work to do",
                "Netanyahu kills tens of thousands of Palestinians, primarily women and children, but we get a news story about one Palestinian killed by Hamas. I'm so glad I decided against becoming a journalist.",
                "Why don't Hamas attack the new settlements?  Not promoting violence, just puzzled."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 6213,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Rapist Russell Brand charged with trying to be comedian",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "Well, that went exactly as expected. Scumbag.",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill.",
                "Since he's become a Christian there's been a huge smear campaign against him. Stop this harassment of Christians NOW!"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Sell-off worsens for markets worldwide after China retaliates against Trump's tariffs",
            "external_url": "https://apnews.com/article/market-rates-trump-tariffs-d86db525c370e9da834e6dfb76e23b86",
            "upvotes": 321,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I fear the global economy is about to fall off a precipise.",
                "If only Congress would do their job.\n\nBut maybe the other oligarchs will tire of this and force their hand.",
                "Hey Trump voters, are we winning yet?",
                "[deleted]",
                "~~3200~~ 3500 off the Dow since Trump Liberated us.  I truly am tired of so much winning.\n\nBut hey, after today we'll be a whole 5% done with his Term.\n\n^^Is ^^10am ^^too ^^early ^^to ^^drink ^^an ^^entire ^^bottle ^^of ^^Jameson? ^^Asking ^^for ^^a ^^friend.\n\n*Edit",
                "I'm amazed by how one man can do so much damage to the world. The power of the US President is astounding. And the best part is the US elected an old senile clown and gave him this power.",
                "China should kick Tesla out.",
                "\"If the DOW drops 1000 points in 2 days the president ahould be IMOEACHED!\"\n\n-Donald Trump, 2012",
                ">So far there are few, if any winners, in financial markets from the trade war.\n\nI bet Trumps billionaire buddies who had the inside info and shorted the market are making out like bandits.",
                "I imagine there are some very rich people salivating at the mouth right now, just waiting for the dip to hit its bottom so they can buy in before it turns and make even more moneyz."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "High school staffer allegedly asked student to kill her husband for $2,000",
            "external_url": "https://abcnews.go.com/US/ohio-high-school-staffer-alleged-murder-for-hire-plot/story?id=120462860",
            "upvotes": 294,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/41fae5e7-6b90-4623-a33c-4b93f3b2fd6f/murder-for-hire-01-ht-jt-250403_1743710109981_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "wtf is wrong with people …",
                ">The complaint did not provide details on Demetrius' role at the high school. Ohio State Board of Education online records show she has a substitute teaching license.\n\nAnother article called her a teacher. This one calls her a staffer.\n\n\n>When asked if she had any questions, Demetrius responded, \"Who is the juvenile involved in this case?\"\n\nThis question makes me think she approached more than one kid.",
                "Not only is this morally wrong, but in what way did it make any sense to trust a high school kid to keep their mouth shut, especially for 2K. Even if the kids is some hardened gang  banger at 17 or so, this is the first thing on the list of shit he's going to flip on to get out of (or reduce) a serious charge when the time comes.",
                "I think I saw this episode of Family Guy.",
                "How do you even bring up this topic of conversation? With a student?",
                "Ah yes, famously discreet high school students are an excellent population pool for recruiting hitmen.",
                "I wouldn't trust a high schooler to do shopping for groceries, that's just bold",
                "I firmly believe than anyone who works with children should have to pass a psych eval.",
                "Stephanie Demetrius, 44, was charged with felony conspiracy for allegedly asking a juvenile at the Academy for Urban Scholars in Columbus to commit the murder, according to the probable cause affidavit.",
                "This has serious \"To Die For\" vibes"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "RISING",
            "title": "China to impose 34% retaliatory tariff on all goods imported from the U.S.",
            "external_url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 17898,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080",
            "top_comments": [
                "Conservatives - Fall 2024 - “Eggs are too damn high.”\n\nConservatives - Apr 2025 - “New taxes on almost everything…sounds good.”",
                "Has any country in history ever started a trade war with the entire planet and won?",
                "China has the largest manufacturing base in the world - naïve to expect they wouldn’t hit back.",
                "What DT has done will be chronicled in history books not only for how he manipulated data to serve his interests, but also for how he influenced collective minds through falsehoods, expecting other political actors to fall into his trap. Fortunately, most of the world is no longer willing to dance to his tune or validate his tactics.",
                "So uh..... farmers fucked?",
                "The republican base will see this and believe its “growing pains”. There is no amount of pain they can suffer before it’s Trumps fault \n\nNo matter what happens in the next 4 years, it will always be Biden and the democrats fault",
                "aaaaand there goes the American farmer exports...",
                "American dollar stores are going to have to become $1.34 stores.",
                "Yep. Trump and the complicit congress just ceded world leadership to China. It's not just the tariffs. It's how it was done. We are SO OBVIOUSLY not someone you can depend on.\n\nThanks voters. Trump is the moron doing it, but you were the people who chose this.",
                "We have 3 branches of government. One led by the orange clown is trying to wreck the US and global economies to please Putin and the other 2 branches are asleep at the wheel."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "C.E.O. Choked Man Who Danced Barefoot on Cruise Ship, U.S. Says",
            "external_url": "https://www.nytimes.com/2025/04/03/us/ceo-choking-virgin-cruise.html?unlocked_article_code=1.9E4.lCTP.l-u2TGKPZe2C&smid=re-share",
            "upvotes": 2219,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The White Lotus writers just got an idea for season 4",
                "Thought he was Tony Soprano telling that guy to take off his hat",
                "Can’t handle someone dancing barefoot? Don’t go on a cruise. Better yet, don’t leave your house",
                "Is everyone going crazy!",
                "It’s weird to me this guy is going on a cruise with all the poors. Doesn’t he have his own yacht?",
                "The CEO can’t handle what to do when hearing “no,” or “f*** you,” or a middle finger. Because he surrounds himself with yes men at work, he expects the rest of his life to follow.",
                "So let me get this straight; dude was just vibing out then the perpetrator's wife, who can't mind their own fucking business, comes over to tell him to put on his shoes. He's like nah and gives her the bird then perp is like \"Know what's a really good idea? Fuck everyone's whole vibe up and attempt to kill someone.\" Yeah nah lock his ass up like anyone else would be. I don't give a flying fuck what company he leads.",
                "Well he is rich so we all know the eventual outcome",
                "Passanger: \"I'm having such a great time on my vacation.\"\n\nCEO: \"I'LL FUCKING KILL YOU!\"",
                "\"The altercation began shortly after Mr. DeGiorgio’s wife had confronted the man about barefoot dancing, telling him, “Look, we are all grown-ups here — can you put your shoes on?” Mr. DeGiorgio’s wife told investigators that the man had made a crude remark to her, and the security video showed him giving her the middle finger, according to the F.B.I.\n\nSo that was all it took for DeGiorgio to choke this man and threaten to kill him?  Because his shitty wife was ordering people to do what she wanted?   Oh fuck no.  Have fun in federal court, dickface."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US NSA director Timothy Haugh fired, Washington Post reports",
            "external_url": "https://www.reuters.com/world/us/us-nsa-director-timothy-haugh-fired-washington-post-reports-2025-04-04/",
            "upvotes": 9914,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He testified at the senate hearing that there were risks to using Signal. When the team cheats but you don't, you get benched for not being a team player.",
                "Wonder if this is related to Laura Loomer's visit to the Oval Office yesterday that led to the firing of three NSC officials.",
                "The director and the No. 2 official at the National Security Agency were ousted from their positions Thursday, according to a defense official and three sources with knowledge of the matter.\n\nIt was not immediately clear why Air Force Gen. Timothy Haugh and his deputy were dismissed, the sources said.",
                "They have purged most of the military and intelligence agency leadership. Scary stuff. ",
                "He must have been too competent and not a toady.",
                "Oh, we're changing NSA oversight after a far right meeting with the president.\n\nYeah that sounds safe and in no way concerning.",
                "Because they were not \"loyal\"? How did this insidious concept creep into the administration vernacular without sounding alarm bells? People have forgotten how democracy works. Everyone isn't supposed to just agree with the President and do whatever he says.",
                "New NSA director will be hulk hogan mmw",
                "Reading up on him his studies were Russia related.  Can’t have a career intelligence officer that knows the in and out of Russia be the top spy.",
                "I fear corruption. We're taking full 180 on US. I don't know how to feel about the future of humanity."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 18892,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "Award for the most incompetent government of all time?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.\n\n>Kennedy said that the elimination of the Centers for Disease Control and Prevention’s **entire Lead Poisoning Prevention and Surveillance Branch** was among the mistakes.",
                "They fired thousands of employees trying to get a public relations win. Thats it.\n\nPathetic, amateur shit.",
                "The incompetence of this administration is just mind blowing...",
                "Everything the current administration does is a mistake",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them.",
                "How do you accidentally lay off people?",
                ">\"Personnel that should not have been cut, were cut. We're reinstating them. **And that was always the plan. Part of the DOGE, we talked about this from the beginning, is we're going to do 80% cuts, but 20% of those are going to have to be reinstated, because we'll make mistakes**,\" Kennedy said, speaking to reporters at a stop in Virginia.\n\nSo they purposely decided to be reckless and fuck with the lives and livelihoods of what, tens of thousands of people unnecessarily? Not to mention completely eliminating entire agencies that they will now have to hope they can somehow put back together again?\n\nWHAT THE FUCK WAS THE RUSH? Why did they try to speed run a four year term in four weeks? How is it a \"mistake\" when you purposely fuck shit up?? You literally cannot *plan to make a mistake*. They just planned to be destructive because they could. It's like Elon completely lapsed into insanity and smeared shit on the walls for weeks, and now Robert F. Kennedy of all people has to try to clean it up.\n\nHow can anyone, no matter how batshit crazy they are, stand there and expect what he is saying to be ok or seem normal to anyone?",
                "They're seriously just firing people to fire people. It's the dumbest concept in the world.\n\nIt's fine if it's your tech bro company, but not when it's the goddamn US government that the people of this country rely on."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/04/2025 16:09:59 UTC"
}