{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 10670,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212910470.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "Nothing says state secrets for sale, like a free jet.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "He's incapable of doing a single thing worthy of the office.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this.",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "Over under the number of days before Trump takes a controversial decision favorable to Qatar?  Id say 2 weeks."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 1844,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/c593b780-2ec6-11f0-b3e4-b7df0c3c542b.jpg",
            "top_comments": [
                "\"stop the fighting and ill build the most magnificent trump tower right on the gaza strip, it will have the best hotels and on-site gambling floor of all the casinos there!\"",
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "MAGA Official:  'We're going to take Gaza completely, and build resort casinos on every inch of the land - and, in exchange, you and all the Palestinians can go elsewhere!'\n\nHamas:  'Death to Israel and the Great Satan!!!  Wait, what???  Elsewhere???  Where exactly is elsewhere?'\n\nMAGA Official:  'Doesn't matter!  Anywhere else is fine...  Well, you're going to want to avoid Israel - and don't even think of coming to the USA!'\n\nHamas:  'And what exactly do we get for giving you absolutely everything?'\n\nMAGA Official:  'I already told you!  You get to go elsewhere!  We get Gaza, and you get to F right off!'\n\nHamas:  [Throws up hands and shrugs.]\n\nMAGA Official:  'And, next time, instead of traditional formal-robes, you should probably put on suits and say 'Thank You!'",
                "If the talks don't include the complete surrender of power of Hamas and their affiliates, then nothing will change.",
                "[removed]",
                "thought this said in the U.S, phew",
                "If this doesn't include the complete dissolution of HAMAS, then we will be in this exact same spot maybe 20 or so years down the line."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 2543,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Canada’s had this for a while. Much better alternative.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Women's healthcare choices often feel like cutting off your hand or cutting off your finger.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ",
                "Finally!",
                "question, since i'm not a woman.\n\nis a pap smear really uncomfortable because the doctor performing it or the tools/methods being used? or a combination of factors? have there been advances at the clinic level to ease this?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 2222,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)",
                "Should never have been arrested.",
                "crazy to think that they arrested her for writing an op-ed in a campus daily that probably is only read by 600 ppl tops. She isn't a student protester, organizer or pro-Pali activist. She's a psychology grad student, not even from the Levant. This is totally Orwellian.",
                "Protests and speaking out does work. We can push back!",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 4891,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "How exactly did they achieve boiling water?",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                ">Weren't there 6 of you guys? Where did Hector go?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"\n\n>But your alternator was damaged, you didn't have any battery power, how did you boil them?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"",
                "Doesn't parboiling imply they're going to cook it further with another method afterwards?",
                "Spices are an often overlooked survival necessity."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Hamas says Edan Alexander, last living American hostage in Gaza, will be released in truce efforts",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
            "upvotes": 784,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strange that Qatar gives Trump a giant jet and they bring Israel to the table enough to get hostages released.",
                "Bibi \"I really don't care, do u?\"",
                "Hanas is full of macho crap and stupidity. The macho crap is cultural, the stupidity is killing their people. \n\nThey need to wisen up and acknowledge that they screwed up.\n\nThey should surrender and disarm unilaterally. If they don’t all of Gaza will disappear.",
                "I still find it incredible Trump and Biden allowed any of this.\n\nThe deal always was if you take a US citizen hostage the marines will fuck you up.\n\nAmerica couldn’t have engineered two worse Presidents if they tried.",
                "Question is: alive or dead?",
                "Israel is to blame for the creation of hamas to begin with.",
                "[removed]",
                "Ya US citizen by convenience, in the army of a foreign state 🤣🤣🤣",
                "Another outrageous lie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "India-Pakistan ceasefire appears to hold after accusations of violations",
            "external_url": "https://www.bbc.com/news/articles/cvg9d913v20o",
            "upvotes": 1151,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Most countries do not want full scale war. There are times where they feel they need to make a show of force, and sometimes responses are necessary, but most of the time people are willing to back down. We saw the same with Israel and Iran.\n\n\nHopefully that holds here.",
                "I suppose given how close to the announcement the violations were, it was still possible to blame it on bad communications and maintain the peace. Good. Nuclear powers fighting one another isn't something we should be toying with.",
                "Cool!\n\nI’ll be back in a hour to see if this has fallen apart or not",
                "People in here seem very disappointed they can't go to war.",
                "Worldnews would have you believe war is the best possible outcome.",
                "[removed]",
                "Nothing...ever...happens.",
                "Its wild how quickly countries can agree to a ceasefire when both parties are acting in good faith.  I wish some other folks prolonging a war would follow suit.",
                "That’s because trump is such a genius.    /s",
                "Good, the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russian intelligence services responsible for the fire at Marywilska. Tusk confirms",
            "external_url": "https://www.rmf24.pl/regiony/warszawa/news-rosyjskie-sluzby-specjalne-odpowiedzialne-za-pozar-na-marywi,nId,7963472",
            "upvotes": 420,
            "date": "05/11/2025",
            "thumbnail": "https://i.iplsc.com/-/000L10VPAGFRIDAD-C316.jpeg",
            "top_comments": [
                "Wasn't there a statement at the beginning of the invasion of Ukraine that an attack on a NATO partner would be considered an act of war?",
                "The fire at the Marywilska 44 Shopping Centre was the result of actions by Russia’s special services. This was announced on Sunday evening by Prime Minister Donald Tusk, Minister of Justice and Attorney General Adam Bodnar, and Minister of the Interior and Administration Tomasz Siemoniak. “The operation was organized and directed by a known individual residing in the Russian Federation. Some of the perpetrators are already in custody; the others have been identified and are being sought,” they said in a joint statement.\n\nThe fire at the Marywilska 44 Shopping Centre in Warsaw occurred on 12 May 2024. A total of 1,400 shops and service outlets were completely destroyed by fire.\n\nOn Sunday it was reported that during the inspections at the scene of the fire—which lasted a total of 121 days—55 prosecutors and 100 police officers took part, supported by experts and technicians. More than 70 witnesses and 530 victims were interviewed.\n\nTusk, Bodnar, Siemoniak: Russia is responsible for the fire at Marywilska  \n“Based on the evidence gathered so far, we know that the fire was the result of arson commissioned by Russia’s special services,” Donald Tusk said on Sunday evening together with Tomasz Siemoniak and Adam Bodnar.\n\n“We have in-depth knowledge of the commissioning and execution of the arson, as well as how the perpetrators documented it. Their actions were organized and directed by a known individual residing in the Russian Federation. Some of the perpetrators are already in custody; the others have been identified and are being sought. The Prosecutor’s Office, the Police, and the Internal Security Agency are continuing investigative and operational activities aimed at apprehending them,” the Prime Minister and ministers wrote in their statement.\n\n“The authorities of the Republic of Poland are determined to hold the perpetrators of these disgraceful acts of sabotage—and those directing them—to account (...). Polish services are cooperating with their Lithuanian counterparts, where some of the perpetrators also carried out diversionary activities,” they added.",
                "Article 5. Now. Stop fucking around or it will just continue. These are intentional warfare operations conducted on civilian infrastructure. People have died in other state sponsored attacks by the FSB/GRU. ",
                "Alternate sources in English: [Reuters](https://www.reuters.com/world/europe/poland-says-russian-secret-service-behind-2024-fire-warsaw-shopping-centre-2025-05-11/), [CNN](https://www.cnn.com/2025/05/11/europe/poland-blames-russian-intelligence-fire-shopping-center-latam-intl)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Equipment issue again disrupts air traffic at Newark Liberty airport: FAA",
            "external_url": "https://abcnews.go.com/US/equipment-issue-disrupts-air-traffic-newark/story?id=121689373",
            "upvotes": 302,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/803ced13-8a83-42f6-b0f4-5b7a3ade37b3/newark-airport-gty-bh-250511_1746973704002_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Do they just not have it support there anymore?",
                "So Newark has been blinded 4 times, the Harry S Truman has lost 3 multimillion dollar jets, and there have been multiple near misses near Reagan. Not a great week for aviation.",
                "Where are the whistleblowers to tell us about how all the jobs that were cut are one of the reasons for this?",
                "*The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty*.\n\nWell, if any worker speaks out, he or she may get a few lines of coverage and then vanish both from a job and further coverage.",
                "Article by: Bill Hutchinson, Sam Sweeney, and Ayesha Ali \n\n>Air traffic control [problems](https://www.goodmorningamerica.com/News/video/major-flight-disruptions-newark-airport-air-traffic-controllers-121463611) continued at Newark Liberty International Airport on Sunday morning after an equipment issue prompted the Federal Aviation Administration to order a 45-minute ground stop at the New Jersey airport, officials said.\n\n>The FAA said in a statement that a telecommunications issue at the Philadelphia TRACON (terminal radar approach control) Area C facility, which guides aircraft in and out of Newark, caused the agency to issue a ground stop.\n\n>\"The FAA briefly slowed aircraft in and out of the airport while we ensured redundancies were working as designed,\" the FAA said in its [statement](https://x.com/FAANews/status/1921578482863104259).\n\n>As of 11 a.m. ET, the FAA said, \"operations have returned to normal\" at Newark Liberty.\n\n>On Sunday afternoon, the FAA released updated information, saying an audio issue, not an outage, prompted the ground stop at Newark. The agency said there were popping sounds on an unspecified number of radio frequencies. While air traffic controllers were able to communicate with aircraft, the radio system was not working correctly, prompting the switch to a backup system, the FAA said.\n\n>The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty.\n\n>On Friday morning, [radar screens at the airport went black](https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395) for approximately 90 seconds, according to the FAA. During the outage, which occurred at about 3:55 a.m. ET, air traffic controllers could be heard telling a FedEx plane that their screens had gone dark and then asking the aircraft to tell their company to apply pressure to get the problem fixed.\n\n>In another transmission, a controller told an arriving private jet that the airport just had experienced a brief radar outage and to stay at or above 3,000 feet in case the controllers couldn't get in touch during the aircraft's descent.\n\n>The FAA said that the Friday outage stemmed from a \"telecommunications outage that impacted communications and radar display at Philadelphia TRACON Area C,\" which is the facility that covers the airspace around Newark.\n\n>On April 28, an [outage at Newark Liberty](https://abcnews.go.com/US/newark-airport-outage-week-lasted-60-90-seconds/story?id=121484044) caused air traffic control computer screens to go dark for roughly 60 to 90 seconds and also prevented the controllers from talking to aircraft during the outage, multiple sources with knowledge of the incident told ABC News. As a result, the FAA halted all departures to the Newark airport, citing \"telecommunications and equipment issues at Philadelphia TRACON.\"\n\n>ABC News also confirmed a minor outage at Newark Liberty that occurred on April 30.\n\n>Following the April 29 outage, several controllers went on medical leave, calling the experience a traumatic event. The controllers are entitled to at least 45 days away from the job and must be evaluated by a doctor before they can return to work.",
                "Is there actually anything wrong with the equipment, or is this just being done to justify Trump's \"upgrade\" and privatization of the air traffic control system?",
                "Let me guess...is this related to Elon Musk's *Starlink* and/or one of his other companies? Cause it sure sounds like it. The current administration seems awfully happy to defund and gut air traffic controllers only for Musk to sweep in and \"save the day\"...or so they thought.",
                "Years of neglect has taken its toll and now the chickens have come to roost.",
                "Anyone think about moving the extension cord so people stop tripping over it?",
                "America is the birthplace of aviation. Airports in this country have no right to be so ratchet on a global scale."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 20537,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Hard to be a shittier American than a Trump supporter these days",
                "Fuck traitor trump and his weak unamerican sheep",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "He will not comply. Asked to pause would be a better title.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Massive explosion levels New Jersey home, rocks neighborhood",
            "external_url": "https://abcnews.go.com/US/massive-explosion-levels-new-jersey-home-rocks-neighborhood/story?id=121693970",
            "upvotes": 90,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1acfee5d-55c3-4773-815a-15a32f55b004/house-explosion1-nj-hd-bh-250511_1746992055023_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I got 50/50 it was either a gas leak or a meth lab.",
                "This happened in my hometown 20 years ago or so. We lived well over a mile away, I thought someone had rammed their car into our house.  \nA coworker lived across the street and down a couple from the house that exploded, he was walking up his basement stairs at the time, the blast knocked him back down the stairs.",
                "Every time this happens I'm happy my home doesn't have a gas line.",
                "This sounds scary similar to that explosion in Texas that was caused by a leaking natural gas line.",
                "\"Tranquility Court\" doesn't live up to its name",
                "> A massive explosion that leveled a New Jersey home early Sunday and reportedly killed two people was so powerful that neighbors said it sounded like a bomb going off.\n\n\nThe explosion sounded like a bomb? You don’t say.",
                "I've seen this episode of Aqua Teen Hunger Force",
                "there were two explosions, one in Ohio and the other in Michigan. Where does New Jersey come into the story? The video says Ohio & Michigan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Equipment issue again disrupts air traffic at Newark Liberty airport: FAA",
            "external_url": "https://abcnews.go.com/US/equipment-issue-disrupts-air-traffic-newark/story?id=121689373",
            "upvotes": 300,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/803ced13-8a83-42f6-b0f4-5b7a3ade37b3/newark-airport-gty-bh-250511_1746973704002_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Do they just not have it support there anymore?",
                "So Newark has been blinded 4 times, the Harry S Truman has lost 3 multimillion dollar jets, and there have been multiple near misses near Reagan. Not a great week for aviation.",
                "Where are the whistleblowers to tell us about how all the jobs that were cut are one of the reasons for this?",
                "*The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty*.\n\nWell, if any worker speaks out, he or she may get a few lines of coverage and then vanish both from a job and further coverage.",
                "Article by: Bill Hutchinson, Sam Sweeney, and Ayesha Ali \n\n>Air traffic control [problems](https://www.goodmorningamerica.com/News/video/major-flight-disruptions-newark-airport-air-traffic-controllers-121463611) continued at Newark Liberty International Airport on Sunday morning after an equipment issue prompted the Federal Aviation Administration to order a 45-minute ground stop at the New Jersey airport, officials said.\n\n>The FAA said in a statement that a telecommunications issue at the Philadelphia TRACON (terminal radar approach control) Area C facility, which guides aircraft in and out of Newark, caused the agency to issue a ground stop.\n\n>\"The FAA briefly slowed aircraft in and out of the airport while we ensured redundancies were working as designed,\" the FAA said in its [statement](https://x.com/FAANews/status/1921578482863104259).\n\n>As of 11 a.m. ET, the FAA said, \"operations have returned to normal\" at Newark Liberty.\n\n>On Sunday afternoon, the FAA released updated information, saying an audio issue, not an outage, prompted the ground stop at Newark. The agency said there were popping sounds on an unspecified number of radio frequencies. While air traffic controllers were able to communicate with aircraft, the radio system was not working correctly, prompting the switch to a backup system, the FAA said.\n\n>The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty.\n\n>On Friday morning, [radar screens at the airport went black](https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395) for approximately 90 seconds, according to the FAA. During the outage, which occurred at about 3:55 a.m. ET, air traffic controllers could be heard telling a FedEx plane that their screens had gone dark and then asking the aircraft to tell their company to apply pressure to get the problem fixed.\n\n>In another transmission, a controller told an arriving private jet that the airport just had experienced a brief radar outage and to stay at or above 3,000 feet in case the controllers couldn't get in touch during the aircraft's descent.\n\n>The FAA said that the Friday outage stemmed from a \"telecommunications outage that impacted communications and radar display at Philadelphia TRACON Area C,\" which is the facility that covers the airspace around Newark.\n\n>On April 28, an [outage at Newark Liberty](https://abcnews.go.com/US/newark-airport-outage-week-lasted-60-90-seconds/story?id=121484044) caused air traffic control computer screens to go dark for roughly 60 to 90 seconds and also prevented the controllers from talking to aircraft during the outage, multiple sources with knowledge of the incident told ABC News. As a result, the FAA halted all departures to the Newark airport, citing \"telecommunications and equipment issues at Philadelphia TRACON.\"\n\n>ABC News also confirmed a minor outage at Newark Liberty that occurred on April 30.\n\n>Following the April 29 outage, several controllers went on medical leave, calling the experience a traumatic event. The controllers are entitled to at least 45 days away from the job and must be evaluated by a doctor before they can return to work.",
                "Is there actually anything wrong with the equipment, or is this just being done to justify Trump's \"upgrade\" and privatization of the air traffic control system?",
                "Let me guess...is this related to Elon Musk's *Starlink* and/or one of his other companies? Cause it sure sounds like it. The current administration seems awfully happy to defund and gut air traffic controllers only for Musk to sweep in and \"save the day\"...or so they thought.",
                "Years of neglect has taken its toll and now the chickens have come to roost.",
                "Anyone think about moving the extension cord so people stop tripping over it?",
                "America is the birthplace of aviation. Airports in this country have no right to be so ratchet on a global scale."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russian intelligence services responsible for the fire at Marywilska. Tusk confirms",
            "external_url": "https://www.rmf24.pl/regiony/warszawa/news-rosyjskie-sluzby-specjalne-odpowiedzialne-za-pozar-na-marywi,nId,7963472",
            "upvotes": 421,
            "date": "05/11/2025",
            "thumbnail": "https://i.iplsc.com/-/000L10VPAGFRIDAD-C316.jpeg",
            "top_comments": [
                "Wasn't there a statement at the beginning of the invasion of Ukraine that an attack on a NATO partner would be considered an act of war?",
                "The fire at the Marywilska 44 Shopping Centre was the result of actions by Russia’s special services. This was announced on Sunday evening by Prime Minister Donald Tusk, Minister of Justice and Attorney General Adam Bodnar, and Minister of the Interior and Administration Tomasz Siemoniak. “The operation was organized and directed by a known individual residing in the Russian Federation. Some of the perpetrators are already in custody; the others have been identified and are being sought,” they said in a joint statement.\n\nThe fire at the Marywilska 44 Shopping Centre in Warsaw occurred on 12 May 2024. A total of 1,400 shops and service outlets were completely destroyed by fire.\n\nOn Sunday it was reported that during the inspections at the scene of the fire—which lasted a total of 121 days—55 prosecutors and 100 police officers took part, supported by experts and technicians. More than 70 witnesses and 530 victims were interviewed.\n\nTusk, Bodnar, Siemoniak: Russia is responsible for the fire at Marywilska  \n“Based on the evidence gathered so far, we know that the fire was the result of arson commissioned by Russia’s special services,” Donald Tusk said on Sunday evening together with Tomasz Siemoniak and Adam Bodnar.\n\n“We have in-depth knowledge of the commissioning and execution of the arson, as well as how the perpetrators documented it. Their actions were organized and directed by a known individual residing in the Russian Federation. Some of the perpetrators are already in custody; the others have been identified and are being sought. The Prosecutor’s Office, the Police, and the Internal Security Agency are continuing investigative and operational activities aimed at apprehending them,” the Prime Minister and ministers wrote in their statement.\n\n“The authorities of the Republic of Poland are determined to hold the perpetrators of these disgraceful acts of sabotage—and those directing them—to account (...). Polish services are cooperating with their Lithuanian counterparts, where some of the perpetrators also carried out diversionary activities,” they added.",
                "Article 5. Now. Stop fucking around or it will just continue. These are intentional warfare operations conducted on civilian infrastructure. People have died in other state sponsored attacks by the FSB/GRU. ",
                "Alternate sources in English: [Reuters](https://www.reuters.com/world/europe/poland-says-russian-secret-service-behind-2024-fire-warsaw-shopping-centre-2025-05-11/), [CNN](https://www.cnn.com/2025/05/11/europe/poland-blames-russian-intelligence-fire-shopping-center-latam-intl)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 10694,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212910470.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "Nothing says state secrets for sale, like a free jet.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "He's incapable of doing a single thing worthy of the office.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this.",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "Over under the number of days before Trump takes a controversial decision favorable to Qatar?  Id say 2 weeks."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hamas says Edan Alexander, last living American hostage in Gaza, will be released in truce efforts",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
            "upvotes": 776,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strange that Qatar gives Trump a giant jet and they bring Israel to the table enough to get hostages released.",
                "Bibi \"I really don't care, do u?\"",
                "Hanas is full of macho crap and stupidity. The macho crap is cultural, the stupidity is killing their people. \n\nThey need to wisen up and acknowledge that they screwed up.\n\nThey should surrender and disarm unilaterally. If they don’t all of Gaza will disappear.",
                "I still find it incredible Trump and Biden allowed any of this.\n\nThe deal always was if you take a US citizen hostage the marines will fuck you up.\n\nAmerica couldn’t have engineered two worse Presidents if they tried.",
                "Question is: alive or dead?",
                "Israel is to blame for the creation of hamas to begin with.",
                "[removed]",
                "Ya US citizen by convenience, in the army of a foreign state 🤣🤣🤣",
                "Another outrageous lie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 1849,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/c593b780-2ec6-11f0-b3e4-b7df0c3c542b.jpg",
            "top_comments": [
                "\"stop the fighting and ill build the most magnificent trump tower right on the gaza strip, it will have the best hotels and on-site gambling floor of all the casinos there!\"",
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "MAGA Official:  'We're going to take Gaza completely, and build resort casinos on every inch of the land - and, in exchange, you and all the Palestinians can go elsewhere!'\n\nHamas:  'Death to Israel and the Great Satan!!!  Wait, what???  Elsewhere???  Where exactly is elsewhere?'\n\nMAGA Official:  'Doesn't matter!  Anywhere else is fine...  Well, you're going to want to avoid Israel - and don't even think of coming to the USA!'\n\nHamas:  'And what exactly do we get for giving you absolutely everything?'\n\nMAGA Official:  'I already told you!  You get to go elsewhere!  We get Gaza, and you get to F right off!'\n\nHamas:  [Throws up hands and shrugs.]\n\nMAGA Official:  'And, next time, instead of traditional formal-robes, you should probably put on suits and say 'Thank You!'",
                "If the talks don't include the complete surrender of power of Hamas and their affiliates, then nothing will change.",
                "[removed]",
                "thought this said in the U.S, phew",
                "If this doesn't include the complete dissolution of HAMAS, then we will be in this exact same spot maybe 20 or so years down the line."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "1 dead, dozens injured in fiery tour bus collision near Los Angeles",
            "external_url": "https://abcnews.go.com/US/1-dead-dozens-injured-fiery-tour-bus-collision/story?id=121691111",
            "upvotes": 554,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/686f722f-a7b2-41f6-91a9-bce0ea5f548f/la-bus-crash-kabc-250511_1746979953427_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\nJesus, that's a horrific way to go. Hoping they were not conscious.",
                "Article by Bill Hutchinson\n\n>At least one person was killed and 32 others were injured in a fiery collision Sunday morning between a packed tour bus and a disabled SUV stalled on a freeway in Los Angeles County, authorities said.\n\n>The collision occurred just after 5 a.m. Pacific Time on State Route 60 near the unincorporated Los Angeles County community of Hacienda Heights east of downtown Los Angeles, according to a statement from Officer Zachary Salazar, a spokesman for the California Highway Patrol.\n\n>The tour bus was carrying 63 passengers when it collided with a Nissan Pathfinder that was disabled in the westbound lanes, the CHP said in a statement. The Nissan burst into flames as a result of the collision, the statement said.\n\n>The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\n>The fire did not spread to the tour bus but 32 of the 63 people aboard the vehicle were taken to local hospitals for treatment of injuries, according to Salazar.\n\n>The tour bus driver, identified by the CHP as Sui Sheng Du, slammed into the rear of the disabled SUV, according to a preliminary investigation by the CHP.\n\n>\"As a result of the impact, the Nissan Pathfinder became fully engulfed in flames, trapping the occupant,\" according to the CHP statement.\n\n>Following the collision, the bus veered to the right across multiple lanes of the freeway and crashed into a raised metal and wood guardrail along the right shoulder, the CHP said.\n\n>The Los Angeles County Fire Department said two bus passengers were in critical condition and the remaining victims suffered minor to moderate injuries.\n\n>Salazar said the tour bus was heading to Koreatown in downtown Los Angeles when the crash occurred. He said the bus was coming from Morongo Valley, about 110 miles east of Los Angeles.\n\n>Images of the bus taken by ABC Los Angeles station [KABC](https://abc7.com/post/1-dead-dozens-injured-fiery-crash-between-suv-tour-bus-hacienda-heights-california-highway-patrol-says/16384161/) showed substantial front-end damage to the vehicle.\n\n>It was not immediately clear what caused the SUV to become disabled, Salazar said.\n\n>The CHP said neither alcohol nor drugs appeared to be a factor in the crash.",
                "Very odd story.  Firstly, why is a bus full of tourists heading from Moreno Valley to Downtown at 5 AM?  Secondly, the 60 being a major freeway, was the Nissan just sitting in the middle of the freeway lane or pulled over to the side, and why was the driver still in the disabled car if it was in unsafe lane?",
                "If this was freeway speeds, that bus needed approximately the length of a football field to stop, something most motorists don’t know. \n\nThat is why you’re taking your life in your hands when you cut off a bus at a stoplight, or pull in front with inches to spare when you should have waited. \n\nThe bus driver could have been inattentive, but it’s possible he just didn’t have the space to stop, & it’s extremely unsafe to try to swerve at highway speeds.\n\nThis was all news to me when I trained as a bus driver & I find it ridiculously negligent that it isn’t a major part of regular driver license exams. A 30 or 40 foot bus simply does not maneuver or stop like a smaller vehicle.\n\nDrivers know to slow down if traffic is slowing down, or when approaching intersections. A vehicle essentially parked in a lane of the highway is unexpected. If the bus driver was driving into the sun, they might not have seen it in time to switch lanes safely. Or, again, they could have been completely negligent, but I don’t have enough information to say the bus driver was 100% at fault.",
                "That section of the 60 freeway is always clogged with traffic. I used to live right behind it in that same area",
                "The fact that the Nissan was stalled in the lane, effectively mean it was blocking the freeway, puts a lot of the responsibility on the bus driver to be aware of what's in front of him.\n\nThe Nissan was stopped/stalled, so it wasn't just something that happened immediately in front of the bus. It was there for a period of time before the bus impacted it. \n\nWhether the bus driver paid attention to the traffic ahead will be a key consideration.\n\nBut tragic regardless of the cause.",
                "What’s a tour bus doing at 5am in LA with passengers anyway?",
                "This is why you get out of your disabled vehicle and wait some distance up traffic on the shoulder."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ground delay replaces ground stop at Atlanta airport",
            "external_url": "https://www.fox5atlanta.com/news/atlanta-airport-ground-stop-runway",
            "upvotes": 174,
            "date": "05/11/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5atlanta.com/www.fox5atlanta.com/content/uploads/2025/05/1280/720/gettyimages-2162432124.jpg?ve=1&tl=1",
            "top_comments": [
                "Crap, I hope it clears up before I fly through",
                "Atlanta is the worst and Delta at Atlanta is even worse."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 2544,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Canada’s had this for a while. Much better alternative.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Women's healthcare choices often feel like cutting off your hand or cutting off your finger.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ",
                "Finally!",
                "question, since i'm not a woman.\n\nis a pap smear really uncomfortable because the doctor performing it or the tools/methods being used? or a combination of factors? have there been advances at the clinic level to ease this?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India-Pakistan ceasefire appears to hold after accusations of violations",
            "external_url": "https://www.bbc.com/news/articles/cvg9d913v20o",
            "upvotes": 1143,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Most countries do not want full scale war. There are times where they feel they need to make a show of force, and sometimes responses are necessary, but most of the time people are willing to back down. We saw the same with Israel and Iran.\n\n\nHopefully that holds here.",
                "I suppose given how close to the announcement the violations were, it was still possible to blame it on bad communications and maintain the peace. Good. Nuclear powers fighting one another isn't something we should be toying with.",
                "Cool!\n\nI’ll be back in a hour to see if this has fallen apart or not",
                "People in here seem very disappointed they can't go to war.",
                "Worldnews would have you believe war is the best possible outcome.",
                "[removed]",
                "Nothing...ever...happens.",
                "Its wild how quickly countries can agree to a ceasefire when both parties are acting in good faith.  I wish some other folks prolonging a war would follow suit.",
                "That’s because trump is such a genius.    /s",
                "Good, the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Equipment issue again disrupts air traffic at Newark Liberty airport: FAA",
            "external_url": "https://abcnews.go.com/US/equipment-issue-disrupts-air-traffic-newark/story?id=121689373",
            "upvotes": 302,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/803ced13-8a83-42f6-b0f4-5b7a3ade37b3/newark-airport-gty-bh-250511_1746973704002_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Do they just not have it support there anymore?",
                "So Newark has been blinded 4 times, the Harry S Truman has lost 3 multimillion dollar jets, and there have been multiple near misses near Reagan. Not a great week for aviation.",
                "Where are the whistleblowers to tell us about how all the jobs that were cut are one of the reasons for this?",
                "*The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty*.\n\nWell, if any worker speaks out, he or she may get a few lines of coverage and then vanish both from a job and further coverage.",
                "Article by: Bill Hutchinson, Sam Sweeney, and Ayesha Ali \n\n>Air traffic control [problems](https://www.goodmorningamerica.com/News/video/major-flight-disruptions-newark-airport-air-traffic-controllers-121463611) continued at Newark Liberty International Airport on Sunday morning after an equipment issue prompted the Federal Aviation Administration to order a 45-minute ground stop at the New Jersey airport, officials said.\n\n>The FAA said in a statement that a telecommunications issue at the Philadelphia TRACON (terminal radar approach control) Area C facility, which guides aircraft in and out of Newark, caused the agency to issue a ground stop.\n\n>\"The FAA briefly slowed aircraft in and out of the airport while we ensured redundancies were working as designed,\" the FAA said in its [statement](https://x.com/FAANews/status/1921578482863104259).\n\n>As of 11 a.m. ET, the FAA said, \"operations have returned to normal\" at Newark Liberty.\n\n>On Sunday afternoon, the FAA released updated information, saying an audio issue, not an outage, prompted the ground stop at Newark. The agency said there were popping sounds on an unspecified number of radio frequencies. While air traffic controllers were able to communicate with aircraft, the radio system was not working correctly, prompting the switch to a backup system, the FAA said.\n\n>The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty.\n\n>On Friday morning, [radar screens at the airport went black](https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395) for approximately 90 seconds, according to the FAA. During the outage, which occurred at about 3:55 a.m. ET, air traffic controllers could be heard telling a FedEx plane that their screens had gone dark and then asking the aircraft to tell their company to apply pressure to get the problem fixed.\n\n>In another transmission, a controller told an arriving private jet that the airport just had experienced a brief radar outage and to stay at or above 3,000 feet in case the controllers couldn't get in touch during the aircraft's descent.\n\n>The FAA said that the Friday outage stemmed from a \"telecommunications outage that impacted communications and radar display at Philadelphia TRACON Area C,\" which is the facility that covers the airspace around Newark.\n\n>On April 28, an [outage at Newark Liberty](https://abcnews.go.com/US/newark-airport-outage-week-lasted-60-90-seconds/story?id=121484044) caused air traffic control computer screens to go dark for roughly 60 to 90 seconds and also prevented the controllers from talking to aircraft during the outage, multiple sources with knowledge of the incident told ABC News. As a result, the FAA halted all departures to the Newark airport, citing \"telecommunications and equipment issues at Philadelphia TRACON.\"\n\n>ABC News also confirmed a minor outage at Newark Liberty that occurred on April 30.\n\n>Following the April 29 outage, several controllers went on medical leave, calling the experience a traumatic event. The controllers are entitled to at least 45 days away from the job and must be evaluated by a doctor before they can return to work.",
                "Is there actually anything wrong with the equipment, or is this just being done to justify Trump's \"upgrade\" and privatization of the air traffic control system?",
                "Let me guess...is this related to Elon Musk's *Starlink* and/or one of his other companies? Cause it sure sounds like it. The current administration seems awfully happy to defund and gut air traffic controllers only for Musk to sweep in and \"save the day\"...or so they thought.",
                "Years of neglect has taken its toll and now the chickens have come to roost.",
                "Anyone think about moving the extension cord so people stop tripping over it?",
                "America is the birthplace of aviation. Airports in this country have no right to be so ratchet on a global scale."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russian intelligence services responsible for the fire at Marywilska. Tusk confirms",
            "external_url": "https://www.rmf24.pl/regiony/warszawa/news-rosyjskie-sluzby-specjalne-odpowiedzialne-za-pozar-na-marywi,nId,7963472",
            "upvotes": 415,
            "date": "05/11/2025",
            "thumbnail": "https://i.iplsc.com/-/000L10VPAGFRIDAD-C316.jpeg",
            "top_comments": [
                "Wasn't there a statement at the beginning of the invasion of Ukraine that an attack on a NATO partner would be considered an act of war?",
                "The fire at the Marywilska 44 Shopping Centre was the result of actions by Russia’s special services. This was announced on Sunday evening by Prime Minister Donald Tusk, Minister of Justice and Attorney General Adam Bodnar, and Minister of the Interior and Administration Tomasz Siemoniak. “The operation was organized and directed by a known individual residing in the Russian Federation. Some of the perpetrators are already in custody; the others have been identified and are being sought,” they said in a joint statement.\n\nThe fire at the Marywilska 44 Shopping Centre in Warsaw occurred on 12 May 2024. A total of 1,400 shops and service outlets were completely destroyed by fire.\n\nOn Sunday it was reported that during the inspections at the scene of the fire—which lasted a total of 121 days—55 prosecutors and 100 police officers took part, supported by experts and technicians. More than 70 witnesses and 530 victims were interviewed.\n\nTusk, Bodnar, Siemoniak: Russia is responsible for the fire at Marywilska  \n“Based on the evidence gathered so far, we know that the fire was the result of arson commissioned by Russia’s special services,” Donald Tusk said on Sunday evening together with Tomasz Siemoniak and Adam Bodnar.\n\n“We have in-depth knowledge of the commissioning and execution of the arson, as well as how the perpetrators documented it. Their actions were organized and directed by a known individual residing in the Russian Federation. Some of the perpetrators are already in custody; the others have been identified and are being sought. The Prosecutor’s Office, the Police, and the Internal Security Agency are continuing investigative and operational activities aimed at apprehending them,” the Prime Minister and ministers wrote in their statement.\n\n“The authorities of the Republic of Poland are determined to hold the perpetrators of these disgraceful acts of sabotage—and those directing them—to account (...). Polish services are cooperating with their Lithuanian counterparts, where some of the perpetrators also carried out diversionary activities,” they added.",
                "Article 5. Now. Stop fucking around or it will just continue. These are intentional warfare operations conducted on civilian infrastructure. People have died in other state sponsored attacks by the FSB/GRU. ",
                "Alternate sources in English: [Reuters](https://www.reuters.com/world/europe/poland-says-russian-secret-service-behind-2024-fire-warsaw-shopping-centre-2025-05-11/), [CNN](https://www.cnn.com/2025/05/11/europe/poland-blames-russian-intelligence-fire-shopping-center-latam-intl)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 10706,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212910470.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "Nothing says state secrets for sale, like a free jet.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "He's incapable of doing a single thing worthy of the office.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this.",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "Over under the number of days before Trump takes a controversial decision favorable to Qatar?  Id say 2 weeks."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 2543,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Canada’s had this for a while. Much better alternative.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Women's healthcare choices often feel like cutting off your hand or cutting off your finger.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ",
                "Finally!",
                "question, since i'm not a woman.\n\nis a pap smear really uncomfortable because the doctor performing it or the tools/methods being used? or a combination of factors? have there been advances at the clinic level to ease this?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hamas says Edan Alexander, last living American hostage in Gaza, will be released in truce efforts",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
            "upvotes": 781,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strange that Qatar gives Trump a giant jet and they bring Israel to the table enough to get hostages released.",
                "Bibi \"I really don't care, do u?\"",
                "Hanas is full of macho crap and stupidity. The macho crap is cultural, the stupidity is killing their people. \n\nThey need to wisen up and acknowledge that they screwed up.\n\nThey should surrender and disarm unilaterally. If they don’t all of Gaza will disappear.",
                "I still find it incredible Trump and Biden allowed any of this.\n\nThe deal always was if you take a US citizen hostage the marines will fuck you up.\n\nAmerica couldn’t have engineered two worse Presidents if they tried.",
                "Question is: alive or dead?",
                "Israel is to blame for the creation of hamas to begin with.",
                "[removed]",
                "Ya US citizen by convenience, in the army of a foreign state 🤣🤣🤣",
                "Another outrageous lie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 2227,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)",
                "Should never have been arrested.",
                "crazy to think that they arrested her for writing an op-ed in a campus daily that probably is only read by 600 ppl tops. She isn't a student protester, organizer or pro-Pali activist. She's a psychology grad student, not even from the Levant. This is totally Orwellian.",
                "Protests and speaking out does work. We can push back!",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 1844,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/c593b780-2ec6-11f0-b3e4-b7df0c3c542b.jpg",
            "top_comments": [
                "\"stop the fighting and ill build the most magnificent trump tower right on the gaza strip, it will have the best hotels and on-site gambling floor of all the casinos there!\"",
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "MAGA Official:  'We're going to take Gaza completely, and build resort casinos on every inch of the land - and, in exchange, you and all the Palestinians can go elsewhere!'\n\nHamas:  'Death to Israel and the Great Satan!!!  Wait, what???  Elsewhere???  Where exactly is elsewhere?'\n\nMAGA Official:  'Doesn't matter!  Anywhere else is fine...  Well, you're going to want to avoid Israel - and don't even think of coming to the USA!'\n\nHamas:  'And what exactly do we get for giving you absolutely everything?'\n\nMAGA Official:  'I already told you!  You get to go elsewhere!  We get Gaza, and you get to F right off!'\n\nHamas:  [Throws up hands and shrugs.]\n\nMAGA Official:  'And, next time, instead of traditional formal-robes, you should probably put on suits and say 'Thank You!'",
                "If the talks don't include the complete surrender of power of Hamas and their affiliates, then nothing will change.",
                "[removed]",
                "thought this said in the U.S, phew",
                "If this doesn't include the complete dissolution of HAMAS, then we will be in this exact same spot maybe 20 or so years down the line."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "India-Pakistan ceasefire appears to hold after accusations of violations",
            "external_url": "https://www.bbc.com/news/articles/cvg9d913v20o",
            "upvotes": 1143,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Most countries do not want full scale war. There are times where they feel they need to make a show of force, and sometimes responses are necessary, but most of the time people are willing to back down. We saw the same with Israel and Iran.\n\n\nHopefully that holds here.",
                "I suppose given how close to the announcement the violations were, it was still possible to blame it on bad communications and maintain the peace. Good. Nuclear powers fighting one another isn't something we should be toying with.",
                "Cool!\n\nI’ll be back in a hour to see if this has fallen apart or not",
                "People in here seem very disappointed they can't go to war.",
                "Worldnews would have you believe war is the best possible outcome.",
                "[removed]",
                "Nothing...ever...happens.",
                "Its wild how quickly countries can agree to a ceasefire when both parties are acting in good faith.  I wish some other folks prolonging a war would follow suit.",
                "That’s because trump is such a genius.    /s",
                "Good, the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "1 dead, dozens injured in fiery tour bus collision near Los Angeles",
            "external_url": "https://abcnews.go.com/US/1-dead-dozens-injured-fiery-tour-bus-collision/story?id=121691111",
            "upvotes": 555,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/686f722f-a7b2-41f6-91a9-bce0ea5f548f/la-bus-crash-kabc-250511_1746979953427_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\nJesus, that's a horrific way to go. Hoping they were not conscious.",
                "Article by Bill Hutchinson\n\n>At least one person was killed and 32 others were injured in a fiery collision Sunday morning between a packed tour bus and a disabled SUV stalled on a freeway in Los Angeles County, authorities said.\n\n>The collision occurred just after 5 a.m. Pacific Time on State Route 60 near the unincorporated Los Angeles County community of Hacienda Heights east of downtown Los Angeles, according to a statement from Officer Zachary Salazar, a spokesman for the California Highway Patrol.\n\n>The tour bus was carrying 63 passengers when it collided with a Nissan Pathfinder that was disabled in the westbound lanes, the CHP said in a statement. The Nissan burst into flames as a result of the collision, the statement said.\n\n>The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\n>The fire did not spread to the tour bus but 32 of the 63 people aboard the vehicle were taken to local hospitals for treatment of injuries, according to Salazar.\n\n>The tour bus driver, identified by the CHP as Sui Sheng Du, slammed into the rear of the disabled SUV, according to a preliminary investigation by the CHP.\n\n>\"As a result of the impact, the Nissan Pathfinder became fully engulfed in flames, trapping the occupant,\" according to the CHP statement.\n\n>Following the collision, the bus veered to the right across multiple lanes of the freeway and crashed into a raised metal and wood guardrail along the right shoulder, the CHP said.\n\n>The Los Angeles County Fire Department said two bus passengers were in critical condition and the remaining victims suffered minor to moderate injuries.\n\n>Salazar said the tour bus was heading to Koreatown in downtown Los Angeles when the crash occurred. He said the bus was coming from Morongo Valley, about 110 miles east of Los Angeles.\n\n>Images of the bus taken by ABC Los Angeles station [KABC](https://abc7.com/post/1-dead-dozens-injured-fiery-crash-between-suv-tour-bus-hacienda-heights-california-highway-patrol-says/16384161/) showed substantial front-end damage to the vehicle.\n\n>It was not immediately clear what caused the SUV to become disabled, Salazar said.\n\n>The CHP said neither alcohol nor drugs appeared to be a factor in the crash.",
                "Very odd story.  Firstly, why is a bus full of tourists heading from Moreno Valley to Downtown at 5 AM?  Secondly, the 60 being a major freeway, was the Nissan just sitting in the middle of the freeway lane or pulled over to the side, and why was the driver still in the disabled car if it was in unsafe lane?",
                "If this was freeway speeds, that bus needed approximately the length of a football field to stop, something most motorists don’t know. \n\nThat is why you’re taking your life in your hands when you cut off a bus at a stoplight, or pull in front with inches to spare when you should have waited. \n\nThe bus driver could have been inattentive, but it’s possible he just didn’t have the space to stop, & it’s extremely unsafe to try to swerve at highway speeds.\n\nThis was all news to me when I trained as a bus driver & I find it ridiculously negligent that it isn’t a major part of regular driver license exams. A 30 or 40 foot bus simply does not maneuver or stop like a smaller vehicle.\n\nDrivers know to slow down if traffic is slowing down, or when approaching intersections. A vehicle essentially parked in a lane of the highway is unexpected. If the bus driver was driving into the sun, they might not have seen it in time to switch lanes safely. Or, again, they could have been completely negligent, but I don’t have enough information to say the bus driver was 100% at fault.",
                "That section of the 60 freeway is always clogged with traffic. I used to live right behind it in that same area",
                "The fact that the Nissan was stalled in the lane, effectively mean it was blocking the freeway, puts a lot of the responsibility on the bus driver to be aware of what's in front of him.\n\nThe Nissan was stopped/stalled, so it wasn't just something that happened immediately in front of the bus. It was there for a period of time before the bus impacted it. \n\nWhether the bus driver paid attention to the traffic ahead will be a key consideration.\n\nBut tragic regardless of the cause.",
                "What’s a tour bus doing at 5am in LA with passengers anyway?",
                "This is why you get out of your disabled vehicle and wait some distance up traffic on the shoulder."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 4893,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "How exactly did they achieve boiling water?",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                ">Weren't there 6 of you guys? Where did Hector go?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"\n\n>But your alternator was damaged, you didn't have any battery power, how did you boil them?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"",
                "Doesn't parboiling imply they're going to cook it further with another method afterwards?",
                "Spices are an often overlooked survival necessity."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/12/2025 00:46:06 UTC"
}