{
    "posts": [
        {
            "category": "HOT",
            "title": "PBS sues Trump over executive order to cut funding",
            "external_url": "https://www.cnbc.com/2025/05/30/pbs-trump-funding-sesame-street.html",
            "upvotes": 18260,
            "date": "05/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103943-1739913080624-gettyimages-2200462311-331a9475_idjtyoi9.jpeg?v=1748643066&w=1920&h=1080",
            "top_comments": [
                "Where are all these \"savings\" going? How is this making America great? Whose lives are being lifted up and made better because PBS funding was cut?",
                ">PBS disputes those charged assertions in the strongest possible terms. But regardless of any policy disagreements over the role of public television, our Constitution and laws forbid the President from serving as the arbiter of the content of PBS’s programming, including by attempting to defund PBS.\n\n\n\n>Lest there be any doubt that the Executive Branch should have no power to influence CPB’s decision-making, Congress enacted a specific “\\[p\\]rohibition”: no “department, agency, officer, or employee of the United States” may “exercise any direction, supervision, or control over public telecommunications, or over \\[CPB\\] or any of its grantees”—including with respect to “the content or distribution of public telecommunications programs and services.” 47 U.S.C. § 398(a), (c) (emphases added).\n\nPerfectly clear violation of the letter and spirt of the law. Open and shut case, no legal authority. Supreme Court 6-3 victory for Trump.",
                "We need another Mr. Rogers to go in front of congress and explain why funding is necessary.",
                "Link to the complaint:  [https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0\\_2.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0_2.pdf)",
                "Good for PBS!!!  Don't just knuckle under like everyone else does",
                "**PBS IS SUPPORTED BY 70% OF AMERICANS ON BOTH SIDES OF THE POLITICAL SPECTRUM AND ONLY COSTS TAXPAYERS $1.60 A YEAR.**\n\nThis is one of the few things this country agrees on. We MUST FIGHT TO KEEP THESE INSTITUTIONS ALIVE. If this funding is rescinded, this will devastate smaller markets where access to information and educational resources are needed most.\n\nIt may feel hopeless and pointless, but contact your representatives once again for this--it truly does make a difference. **WE ONLY NEED 4 REPUBLICANS TO FLIP on the recision package that's coming.** 5calls.org is a great resource for this. If we don't fight for these institutions, they are going to take everything away from us. If you grew up on Mr Rogers, Reading Rainbow or Sesame Street, it's time to return the favor.\n\n**Don't go down without a fight!!**",
                "You might be able to stand on Fifth Ave. and do what you like Mr. President, but you can go fuck yourself on Sesame Street, and stay fucked!",
                "Here come all the Republicans to protect free speech. /s",
                "Imagine being so vile and evil that you’re gonna cut PBS funding and spin it like you’re saving America money 😂😂😂",
                "So PBS *AND* NPR are suing the President?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Olympic boxing champ Imane Khelif must undergo genetic sex screening to fight for new governing body",
            "external_url": "https://apnews.com/article/imane-khelif-boxing-sex-screening-88f16b5e421fb59e9411a440e279ae3f",
            "upvotes": 3642,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If Khelif passes this screening, do you think JK Rowling and all the other TERFs will issue an apology?",
                "Anyone who thinks this is a rational and normal thing to demand would be called an idiot by themselves 10 years ago.",
                "I was just wondering how she’s been. This seems like discrimination. Does every athlete get gender testing or just the few they think don’t look girly enough? Wth",
                "Oof, they want to make sex testing mandatory for all athletes. World Boxing about to discover real fast just how wild the natural variance of biological sex characteristics is…",
                "Imagine just not being attractive enough to some random people and suddenly they question whether you're allowed to do what you love to do. That's the fucked up world we're in now.",
                "Honestly this seems less invasive than inspecting genitals. Send some blood, look at the chromosomes, get everyone to shut up.",
                "She has a vagina. She was born with it. How is that not enough? \n\nImagine being too strong to be considered a woman. I guess wonder woman is actually a man now...",
                "I will support this only if all male competitors must undergo the same screening.",
                "IMO, genetic testing and hormonal testing should happen by default.",
                "It's almost as if there is a controversy and they want to get to the bottom of it.\n\nFor those claiming she's a natural born woman, this would confirm your position as correct. \n\nWhat's the problem?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 17051,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 3279,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.).",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "I rode an elevator with her once. We nodded !",
                "Thanks Houlihan!  Would have loved to share a “lousy cup of coffee” with you!   Class act!",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "She was so great in M\\*A\\*S\\*H. She really took that role from ditzy \"Hotlips\" to Margaret Houlihan. with solid character development. RIP Loretta",
                "Bummer. I always liked her. RIP",
                "RIP Hot Lips Houlihan!",
                "I met her eons ago at a ShoWest convention in Las Vegas.  It was at a small party sponsored by one of the various studios present at the event.\n\nWe had a pleasant chat for about 5-10 minutes before she got mobbed by more fans. Absolutely lovely person."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 6583,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "You got to wonder and ask, \"Who is next?\"",
                "What happened to ‘we just want them to come the legal way’?",
                "I thought the issue was with ILLEGAL immigrants. If they’re kicking out half a million LEGAL immigrants, then isn’t the only reasoning left xenophobia & racism?",
                "The Make America White Again party once again gets what they want"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 6436,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 2019,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "Is that even a crime anymore??",
                "What's everyone's guess on the \"friendly\" foreign country?  \n\nMy first thought was Israel, but upon closer review of the available info, I'm leaning towards Canada or a big EU country like U.K., France, or Germany.",
                "> Laatsch, who was hired by the Defense Intelligence Agency in August 2019, most recently worked as a data scientist and IT specialist for information security in the agency's Insider Threat Division\n\nI feel like this is one of the worst divisions you could try to leak information from"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 733,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?",
                "Well, at least it's an *aFordable* mistake",
                "Basically everything built during the chip shortage, interesting",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "My volvo just had a similar recall, annoyingly they couldn’t fix it with an over the air update so I had to go into the dealership just for a software update. Oh and the only reason I learned about the recall was through carfax Volvo never contacted me.",
                "Oh shit is it the 1995 Ford f150? Do I need to call my dealer?",
                "Bronco but not Bronco Sport?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 2293,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ah yes, the true reason for the fracture in Expedition 33",
                "About 5 years ago my city in Canada (Halifax) passed a law to force people to smoke only in designated areas, and everybody just ignored it. Most people have already forgotten about it, even though the law is probably still on the books. \n\nSmoking is banned on sidewalk patios though, unlike in France, and that law does get enforced.",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "So what is a chic-looking man in a striped shirt with a tiny mustache supposed to do while sitting at an outdoor cafe?",
                "But wait how will Paris maintain its outdoor carpet of cigarette butts? Will people have to walk on bare ground like barbarians?",
                "[deleted]",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This sounds unenforceable.",
                "Makes no sense if they’re not going to have proper designated smoking areas at regular intervals at least. Everyone will just ignore this if it’s too restrictive ",
                "That sounds like a monumental task in a country where 1/3 of the population smokes.\n\nEdit: curious why this guy downvoted, literally just pointing out the % of smokers in France and saying this won’t be easy, didn’t even say if I was for or against. Seems like a weird thing to downvote unless you think I’m lying about how prevalent smoking is there which you can google to verify."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 864,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "This is an incredible story. I encourage everyone to read the article. We should all be so lucky as to have a spouse (or friend) like his wife. What an incredible woman. 3 hours in cold water holding her husband’s head so he can breathe. Had to wipe my eyes there for a  moment.",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "dude needs to go buy some lottery tix.",
                "Man almost got nutty puttied 💀",
                "Stuck between a rock and a wet place",
                "That’s the youngest looking 60 yr olds I’ve ever seen!",
                "A good reminder to stay on trails and *don't hike alone*.",
                "Im pretty sure my wife would hold my head out of the icy water to prevent me from dying but I think she'd mull it over for a couple seconds first..",
                "Florida Man vs Alaska Man would be an interesting competition..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Olympic boxing champ Imane Khelif must undergo genetic sex screening to fight for new governing body",
            "external_url": "https://apnews.com/article/imane-khelif-boxing-sex-screening-88f16b5e421fb59e9411a440e279ae3f",
            "upvotes": 3651,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If Khelif passes this screening, do you think JK Rowling and all the other TERFs will issue an apology?",
                "Anyone who thinks this is a rational and normal thing to demand would be called an idiot by themselves 10 years ago.",
                "I was just wondering how she’s been. This seems like discrimination. Does every athlete get gender testing or just the few they think don’t look girly enough? Wth",
                "Oof, they want to make sex testing mandatory for all athletes. World Boxing about to discover real fast just how wild the natural variance of biological sex characteristics is…",
                "Imagine just not being attractive enough to some random people and suddenly they question whether you're allowed to do what you love to do. That's the fucked up world we're in now.",
                "Honestly this seems less invasive than inspecting genitals. Send some blood, look at the chromosomes, get everyone to shut up.",
                "She has a vagina. She was born with it. How is that not enough? \n\nImagine being too strong to be considered a woman. I guess wonder woman is actually a man now...",
                "I will support this only if all male competitors must undergo the same screening.",
                "IMO, genetic testing and hormonal testing should happen by default.",
                "It's almost as if there is a controversy and they want to get to the bottom of it.\n\nFor those claiming she's a natural born woman, this would confirm your position as correct. \n\nWhat's the problem?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "PBS sues Trump over executive order to cut funding",
            "external_url": "https://www.cnbc.com/2025/05/30/pbs-trump-funding-sesame-street.html",
            "upvotes": 18267,
            "date": "05/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103943-1739913080624-gettyimages-2200462311-331a9475_idjtyoi9.jpeg?v=1748643066&w=1920&h=1080",
            "top_comments": [
                "Where are all these \"savings\" going? How is this making America great? Whose lives are being lifted up and made better because PBS funding was cut?",
                ">PBS disputes those charged assertions in the strongest possible terms. But regardless of any policy disagreements over the role of public television, our Constitution and laws forbid the President from serving as the arbiter of the content of PBS’s programming, including by attempting to defund PBS.\n\n\n\n>Lest there be any doubt that the Executive Branch should have no power to influence CPB’s decision-making, Congress enacted a specific “\\[p\\]rohibition”: no “department, agency, officer, or employee of the United States” may “exercise any direction, supervision, or control over public telecommunications, or over \\[CPB\\] or any of its grantees”—including with respect to “the content or distribution of public telecommunications programs and services.” 47 U.S.C. § 398(a), (c) (emphases added).\n\nPerfectly clear violation of the letter and spirt of the law. Open and shut case, no legal authority. Supreme Court 6-3 victory for Trump.",
                "We need another Mr. Rogers to go in front of congress and explain why funding is necessary.",
                "Link to the complaint:  [https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0\\_2.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0_2.pdf)",
                "Good for PBS!!!  Don't just knuckle under like everyone else does",
                "**PBS IS SUPPORTED BY 70% OF AMERICANS ON BOTH SIDES OF THE POLITICAL SPECTRUM AND ONLY COSTS TAXPAYERS $1.60 A YEAR.**\n\nThis is one of the few things this country agrees on. We MUST FIGHT TO KEEP THESE INSTITUTIONS ALIVE. If this funding is rescinded, this will devastate smaller markets where access to information and educational resources are needed most.\n\nIt may feel hopeless and pointless, but contact your representatives once again for this--it truly does make a difference. **WE ONLY NEED 4 REPUBLICANS TO FLIP on the recision package that's coming.** 5calls.org is a great resource for this. If we don't fight for these institutions, they are going to take everything away from us. If you grew up on Mr Rogers, Reading Rainbow or Sesame Street, it's time to return the favor.\n\n**Don't go down without a fight!!**",
                "You might be able to stand on Fifth Ave. and do what you like Mr. President, but you can go fuck yourself on Sesame Street, and stay fucked!",
                "Here come all the Republicans to protect free speech. /s",
                "Imagine being so vile and evil that you’re gonna cut PBS funding and spin it like you’re saving America money 😂😂😂",
                "So PBS *AND* NPR are suing the President?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 3274,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.).",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "I rode an elevator with her once. We nodded !",
                "Thanks Houlihan!  Would have loved to share a “lousy cup of coffee” with you!   Class act!",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "She was so great in M\\*A\\*S\\*H. She really took that role from ditzy \"Hotlips\" to Margaret Houlihan. with solid character development. RIP Loretta",
                "Bummer. I always liked her. RIP",
                "RIP Hot Lips Houlihan!",
                "I met her eons ago at a ShoWest convention in Las Vegas.  It was at a small party sponsored by one of the various studios present at the event.\n\nWe had a pleasant chat for about 5-10 minutes before she got mobbed by more fans. Absolutely lovely person."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 737,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?",
                "Well, at least it's an *aFordable* mistake",
                "Basically everything built during the chip shortage, interesting",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "My volvo just had a similar recall, annoyingly they couldn’t fix it with an over the air update so I had to go into the dealership just for a software update. Oh and the only reason I learned about the recall was through carfax Volvo never contacted me.",
                "Oh shit is it the 1995 Ford f150? Do I need to call my dealer?",
                "Bronco but not Bronco Sport?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "U.S. Job Corps Centers to Close by June 2025: Thousands of Students and Staff Affected",
            "external_url": "https://tnj.com/u-s-job-corps-centers-to-close-by-june-2025/",
            "upvotes": 177,
            "date": "05/30/2025",
            "thumbnail": "https://cms.tnj.com/wp-content/uploads/2025/05/Job-Corps-Centers-.jpeg",
            "top_comments": [
                "So much for the trade schools. These job corps were a great place. Figured they were on the chopping block. ",
                "And of course, Congress is also planning to take away health insurance for Medicaid recipients unless they are enrolled in something like this. ",
                "republicans: get a job, bums!\n\nalso republicans: Let's make it as hard as possible to get a job.",
                "I thought trades were the future? This really sucks.",
                "I graduated from a jobcorps center its unfortunate the program is ending.\n\nThe article does mention they are working in alternative programs but its still a shame.",
                "So nobody actually read why they are closing...."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 6586,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "You got to wonder and ask, \"Who is next?\"",
                "What happened to ‘we just want them to come the legal way’?",
                "I thought the issue was with ILLEGAL immigrants. If they’re kicking out half a million LEGAL immigrants, then isn’t the only reasoning left xenophobia & racism?",
                "The Make America White Again party once again gets what they want"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 869,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "This is an incredible story. I encourage everyone to read the article. We should all be so lucky as to have a spouse (or friend) like his wife. What an incredible woman. 3 hours in cold water holding her husband’s head so he can breathe. Had to wipe my eyes there for a  moment.",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "dude needs to go buy some lottery tix.",
                "Man almost got nutty puttied 💀",
                "Stuck between a rock and a wet place",
                "That’s the youngest looking 60 yr olds I’ve ever seen!",
                "A good reminder to stay on trails and *don't hike alone*.",
                "Im pretty sure my wife would hold my head out of the icy water to prevent me from dying but I think she'd mull it over for a couple seconds first..",
                "Florida Man vs Alaska Man would be an interesting competition..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Argentine court declares mistrial over death of soccer star Maradona",
            "external_url": "https://www.abc.net.au/news/2025-05-30/mistrial-declared-in-death-of-soccer-star-maradona/105356336",
            "upvotes": 262,
            "date": "05/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5ddc7453aae2006dd80f67f52ac9de96?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=437&width=862&height=485&imformat=generic",
            "top_comments": [
                "Bro was face deep in cocaine since he retired. Don't think any amount of care would have helped.",
                ">The defendants say Maradona was a difficult patient who did not allow himself to be treated.\n\nNo coke for you if you're in the hospital.",
                "He was killed by the hand of God.",
                "Maradona would’ve loved watching Messi win the World Cup for Argentina in 2022.",
                "She deserves it for what she did to Weird Al.",
                "To be fair, he contributed more than enough to his death. Pity though."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 2017,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "Is that even a crime anymore??",
                "What's everyone's guess on the \"friendly\" foreign country?  \n\nMy first thought was Israel, but upon closer review of the available info, I'm leaning towards Canada or a big EU country like U.K., France, or Germany.",
                "> Laatsch, who was hired by the Defense Intelligence Agency in August 2019, most recently worked as a data scientist and IT specialist for information security in the agency's Insider Threat Division\n\nI feel like this is one of the worst divisions you could try to leak information from"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 17058,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "PBS sues Trump over executive order to cut funding",
            "external_url": "https://www.cnbc.com/2025/05/30/pbs-trump-funding-sesame-street.html",
            "upvotes": 18254,
            "date": "05/30/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108103943-1739913080624-gettyimages-2200462311-331a9475_idjtyoi9.jpeg?v=1748643066&w=1920&h=1080",
            "top_comments": [
                "Where are all these \"savings\" going? How is this making America great? Whose lives are being lifted up and made better because PBS funding was cut?",
                ">PBS disputes those charged assertions in the strongest possible terms. But regardless of any policy disagreements over the role of public television, our Constitution and laws forbid the President from serving as the arbiter of the content of PBS’s programming, including by attempting to defund PBS.\n\n\n\n>Lest there be any doubt that the Executive Branch should have no power to influence CPB’s decision-making, Congress enacted a specific “\\[p\\]rohibition”: no “department, agency, officer, or employee of the United States” may “exercise any direction, supervision, or control over public telecommunications, or over \\[CPB\\] or any of its grantees”—including with respect to “the content or distribution of public telecommunications programs and services.” 47 U.S.C. § 398(a), (c) (emphases added).\n\nPerfectly clear violation of the letter and spirt of the law. Open and shut case, no legal authority. Supreme Court 6-3 victory for Trump.",
                "We need another Mr. Rogers to go in front of congress and explain why funding is necessary.",
                "Link to the complaint:  [https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0\\_2.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.281165/gov.uscourts.dcd.281165.1.0_2.pdf)",
                "Good for PBS!!!  Don't just knuckle under like everyone else does",
                "**PBS IS SUPPORTED BY 70% OF AMERICANS ON BOTH SIDES OF THE POLITICAL SPECTRUM AND ONLY COSTS TAXPAYERS $1.60 A YEAR.**\n\nThis is one of the few things this country agrees on. We MUST FIGHT TO KEEP THESE INSTITUTIONS ALIVE. If this funding is rescinded, this will devastate smaller markets where access to information and educational resources are needed most.\n\nIt may feel hopeless and pointless, but contact your representatives once again for this--it truly does make a difference. **WE ONLY NEED 4 REPUBLICANS TO FLIP on the recision package that's coming.** 5calls.org is a great resource for this. If we don't fight for these institutions, they are going to take everything away from us. If you grew up on Mr Rogers, Reading Rainbow or Sesame Street, it's time to return the favor.\n\n**Don't go down without a fight!!**",
                "You might be able to stand on Fifth Ave. and do what you like Mr. President, but you can go fuck yourself on Sesame Street, and stay fucked!",
                "Here come all the Republicans to protect free speech. /s",
                "Imagine being so vile and evil that you’re gonna cut PBS funding and spin it like you’re saving America money 😂😂😂",
                "So PBS *AND* NPR are suing the President?!?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 3280,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.).",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "I rode an elevator with her once. We nodded !",
                "Thanks Houlihan!  Would have loved to share a “lousy cup of coffee” with you!   Class act!",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "She was so great in M\\*A\\*S\\*H. She really took that role from ditzy \"Hotlips\" to Margaret Houlihan. with solid character development. RIP Loretta",
                "Bummer. I always liked her. RIP",
                "RIP Hot Lips Houlihan!",
                "I met her eons ago at a ShoWest convention in Las Vegas.  It was at a small party sponsored by one of the various studios present at the event.\n\nWe had a pleasant chat for about 5-10 minutes before she got mobbed by more fans. Absolutely lovely person."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Olympic boxing champ Imane Khelif must undergo genetic sex screening to fight for new governing body",
            "external_url": "https://apnews.com/article/imane-khelif-boxing-sex-screening-88f16b5e421fb59e9411a440e279ae3f",
            "upvotes": 3650,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If Khelif passes this screening, do you think JK Rowling and all the other TERFs will issue an apology?",
                "Anyone who thinks this is a rational and normal thing to demand would be called an idiot by themselves 10 years ago.",
                "I was just wondering how she’s been. This seems like discrimination. Does every athlete get gender testing or just the few they think don’t look girly enough? Wth",
                "Oof, they want to make sex testing mandatory for all athletes. World Boxing about to discover real fast just how wild the natural variance of biological sex characteristics is…",
                "Imagine just not being attractive enough to some random people and suddenly they question whether you're allowed to do what you love to do. That's the fucked up world we're in now.",
                "Honestly this seems less invasive than inspecting genitals. Send some blood, look at the chromosomes, get everyone to shut up.",
                "She has a vagina. She was born with it. How is that not enough? \n\nImagine being too strong to be considered a woman. I guess wonder woman is actually a man now...",
                "I will support this only if all male competitors must undergo the same screening.",
                "IMO, genetic testing and hormonal testing should happen by default.",
                "It's almost as if there is a controversy and they want to get to the bottom of it.\n\nFor those claiming she's a natural born woman, this would confirm your position as correct. \n\nWhat's the problem?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 732,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?",
                "Well, at least it's an *aFordable* mistake",
                "Basically everything built during the chip shortage, interesting",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "My volvo just had a similar recall, annoyingly they couldn’t fix it with an over the air update so I had to go into the dealership just for a software update. Oh and the only reason I learned about the recall was through carfax Volvo never contacted me.",
                "Oh shit is it the 1995 Ford f150? Do I need to call my dealer?",
                "Bronco but not Bronco Sport?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 6592,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "You got to wonder and ask, \"Who is next?\"",
                "What happened to ‘we just want them to come the legal way’?",
                "I thought the issue was with ILLEGAL immigrants. If they’re kicking out half a million LEGAL immigrants, then isn’t the only reasoning left xenophobia & racism?",
                "The Make America White Again party once again gets what they want"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 17050,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 2023,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "Is that even a crime anymore??",
                "What's everyone's guess on the \"friendly\" foreign country?  \n\nMy first thought was Israel, but upon closer review of the available info, I'm leaning towards Canada or a big EU country like U.K., France, or Germany.",
                "> Laatsch, who was hired by the Defense Intelligence Agency in August 2019, most recently worked as a data scientist and IT specialist for information security in the agency's Insider Threat Division\n\nI feel like this is one of the worst divisions you could try to leak information from"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 864,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "This is an incredible story. I encourage everyone to read the article. We should all be so lucky as to have a spouse (or friend) like his wife. What an incredible woman. 3 hours in cold water holding her husband’s head so he can breathe. Had to wipe my eyes there for a  moment.",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "dude needs to go buy some lottery tix.",
                "Man almost got nutty puttied 💀",
                "Stuck between a rock and a wet place",
                "That’s the youngest looking 60 yr olds I’ve ever seen!",
                "A good reminder to stay on trails and *don't hike alone*.",
                "Im pretty sure my wife would hold my head out of the icy water to prevent me from dying but I think she'd mull it over for a couple seconds first..",
                "Florida Man vs Alaska Man would be an interesting competition..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Argentine court declares mistrial over death of soccer star Maradona",
            "external_url": "https://www.abc.net.au/news/2025-05-30/mistrial-declared-in-death-of-soccer-star-maradona/105356336",
            "upvotes": 263,
            "date": "05/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5ddc7453aae2006dd80f67f52ac9de96?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=437&width=862&height=485&imformat=generic",
            "top_comments": [
                "Bro was face deep in cocaine since he retired. Don't think any amount of care would have helped.",
                ">The defendants say Maradona was a difficult patient who did not allow himself to be treated.\n\nNo coke for you if you're in the hospital.",
                "He was killed by the hand of God.",
                "Maradona would’ve loved watching Messi win the World Cup for Argentina in 2022.",
                "She deserves it for what she did to Weird Al.",
                "To be fair, he contributed more than enough to his death. Pity though."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 6445,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/31/2025 00:42:44 UTC"
}