{
    "posts": [
        {
            "category": "HOT",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 8421,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "This is unfucking believable.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "I think when one can buy democracy at that point democracy is dead.",
                "This is the exact shit that leads to violence. When you take away all the rules for yourself and continue to fuck with people's lives without giving them a legitimate means to fight back...",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 27777,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Get Bill Burr you cowards"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 14337,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "The whole world hates you Elon. You are universally despised.",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Great, hit him where it hurts, his wealth.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 4670,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "Isn't this a privately funded nonprofit? Why the fuck is the DC Police invading a nonprofit? It's like invading a food bank. WTF."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 3033,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is for when the DOJ accidentally adds him to their Discord chat.",
                "I know he won’t have internet but will he have a webcam?",
                "So what are his chances of avoiding life in prison with no parole?",
                "The man killed a mass murderer who preyed on sick people. He should be given the key to the city; not locked up in a cell.",
                "And fix the crappy Civ 7 UI as well, hopefully.",
                "Sweet. I have issues with the new civ's UI",
                "Me in high school: I need a powerful pc for school work, mom! Word and powerpoint and research.\n\nI hope they let him install some games.",
                "Finally Civ VII is about to get debugged",
                "Does this mean I can send him nudes",
                "Can he get access to a 3D printer?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 12524,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "Obviously a merit-based hire.",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "He sneaks the scotch around for big bro.",
                "Is he the one tasked with downsizing it into a trigon?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 1869,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "We really are watching the Rise of the Turd Reich.",
                "And their response will likely be “fuck off” in French.",
                "Hmm, maybe American companies should comply with French labor laws.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "Does Trump even know what country he's \"President\" of?",
                "At least Nero knew how to play the violin.",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 1704,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "Dudes read The Jungle like an instruction manual.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "The Jungle was not a map to success.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "First ones on the line should be the 🐷 advocating for it.",
                "RFK says that bacteria are natural part of meat, so are worms. Eat up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 1789,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "Too bad there's no one left at NASA to study it.",
                "With the US going to shit at least this some good news",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "I am just glad someone is having a good year. Good for you, little rover!",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "Bad news for the great filter theory",
                "What a discovery, chipmunks dig up lawns on Mars too.\n\nedit: you downvoters are no fucking fun losers who didn't look at the article."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 739,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Having listened to ATC recordings for years, one of the points people overlook is many of the smaller airports have controllers with general aviation experience themselves. \n\nWhen shit hits the fan, having someone on the radio who can immediately provide guidance and calm based on their own piloting experience in the region isn't really replaceable. \n\nYou're losing that too.",
                "Wow this looks really bad.",
                "The surprising thing is not the plane crashing but people left at the FAA who can speak on its behalf!",
                "How big of a plane are these usually? I'm assuming this is one of those small ones, maybe a handful of people?",
                "How many incidents is this since the new administration?  Seems too many to be coincidental.",
                "So what did the air traffic controllers have to say about this?\n\nWait there aren't those anymore",
                "Shit that’s like 10 airplanes in 1 month trumps worse than 911",
                "At least they survived."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Tufts University student can’t be deported to Turkiye without court order",
            "external_url": "https://www.aljazeera.com/news/2025/3/29/tufts-university-student-cant-be-deported-to-turkiye-without-court-order",
            "upvotes": 91,
            "date": "03/30/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/03/2025-03-29T153633Z_1009514615_RC2WMDA48OKK_RTRMADP_3_USA-TRUMP-TUFTS-1743266741.jpg?resize=1200%2C675",
            "top_comments": [
                "Trump could just do it anyways. He hasn't taken the courts seriously yet, why would he start now? Why would he? There clearly aren't any consequences for doing whatever the heck he wants. The courts haven't been handing out subpoenas and keep extending their TROs to point to where they are a toothless.",
                "Of course she can't, that won't stop Trump from disappearing her anyways.  He hates the Constitution and the Amendments within, she's just one of the first to be taken in his campaign.  There's only one way to stop this.",
                "This fear doesn't help Americans at all .. it hurts us",
                "We remember the Black Brotherhood"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 8414,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "This is unfucking believable.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "I think when one can buy democracy at that point democracy is dead.",
                "This is the exact shit that leads to violence. When you take away all the rules for yourself and continue to fuck with people's lives without giving them a legitimate means to fight back...",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 4665,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "Isn't this a privately funded nonprofit? Why the fuck is the DC Police invading a nonprofit? It's like invading a food bank. WTF."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 1863,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "We really are watching the Rise of the Turd Reich.",
                "And their response will likely be “fuck off” in French.",
                "Hmm, maybe American companies should comply with French labor laws.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "Does Trump even know what country he's \"President\" of?",
                "At least Nero knew how to play the violin.",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 3030,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is for when the DOJ accidentally adds him to their Discord chat.",
                "I know he won’t have internet but will he have a webcam?",
                "So what are his chances of avoiding life in prison with no parole?",
                "The man killed a mass murderer who preyed on sick people. He should be given the key to the city; not locked up in a cell.",
                "And fix the crappy Civ 7 UI as well, hopefully.",
                "Sweet. I have issues with the new civ's UI",
                "Me in high school: I need a powerful pc for school work, mom! Word and powerpoint and research.\n\nI hope they let him install some games.",
                "Finally Civ VII is about to get debugged",
                "Does this mean I can send him nudes",
                "Can he get access to a 3D printer?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 747,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Having listened to ATC recordings for years, one of the points people overlook is many of the smaller airports have controllers with general aviation experience themselves. \n\nWhen shit hits the fan, having someone on the radio who can immediately provide guidance and calm based on their own piloting experience in the region isn't really replaceable. \n\nYou're losing that too.",
                "Wow this looks really bad.",
                "The surprising thing is not the plane crashing but people left at the FAA who can speak on its behalf!",
                "How big of a plane are these usually? I'm assuming this is one of those small ones, maybe a handful of people?",
                "How many incidents is this since the new administration?  Seems too many to be coincidental.",
                "So what did the air traffic controllers have to say about this?\n\nWait there aren't those anymore",
                "Shit that’s like 10 airplanes in 1 month trumps worse than 911",
                "At least they survived."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 1706,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "Dudes read The Jungle like an instruction manual.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "The Jungle was not a map to success.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "First ones on the line should be the 🐷 advocating for it.",
                "RFK says that bacteria are natural part of meat, so are worms. Eat up."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 14338,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "The whole world hates you Elon. You are universally despised.",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Great, hit him where it hurts, his wealth.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 27784,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Get Bill Burr you cowards"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Artificial sweetener surcralose (aka E955) confuses brain and increases hunger, study says | CNN",
            "external_url": "https://www.cnn.com/2025/03/29/health/artificial-sweetener-sucralose-hunger-signals-wellness/index.html",
            "upvotes": 243,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2162322149.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Study funded by Big Sugar",
                "The research on non-caloric sweetned beverages goes back and forth but the RCTs I can find lean in the direction of weight loss from replacing sweetned beverages with them though not massively.\n\n\nhttps://onlinelibrary.wiley.com/doi/10.1111/obr.13652\n\n\n“It is complicated to make general recommendations for ASB consumption as different artificial sweeteners differ substantially in chemical structure and effect.19, 48 Despite the diverse nature of the artificial sweeteners, they are often pooled in one single group in meta-analyses, and more studies of the individual substances and consequences of long-term use is needed.49 Still, for now, they appear better than the caloric alternative in regard to preventing weight gain or obtaining a small weight loss.50 Future research is warranted on how to increase global access to potable water and long-term health effects of consuming ASBs.”",
                "it also can cause migraines",
                "So can it help those who want to gain weight? Or do calories turn this increased hunger off?",
                "Treating all sweetened fizzy drinks the same way we treat cigarettes is probably a good move at this point. So many people are addicted to that stuff.",
                "Sucralose tastes like chlorine to me."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 8408,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "This is unfucking believable.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "I think when one can buy democracy at that point democracy is dead.",
                "This is the exact shit that leads to violence. When you take away all the rules for yourself and continue to fuck with people's lives without giving them a legitimate means to fight back...",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 3036,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is for when the DOJ accidentally adds him to their Discord chat.",
                "I know he won’t have internet but will he have a webcam?",
                "So what are his chances of avoiding life in prison with no parole?",
                "The man killed a mass murderer who preyed on sick people. He should be given the key to the city; not locked up in a cell.",
                "And fix the crappy Civ 7 UI as well, hopefully.",
                "Sweet. I have issues with the new civ's UI",
                "Me in high school: I need a powerful pc for school work, mom! Word and powerpoint and research.\n\nI hope they let him install some games.",
                "Finally Civ VII is about to get debugged",
                "Does this mean I can send him nudes",
                "Can he get access to a 3D printer?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 4677,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "Isn't this a privately funded nonprofit? Why the fuck is the DC Police invading a nonprofit? It's like invading a food bank. WTF."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 14341,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "The whole world hates you Elon. You are universally despised.",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Great, hit him where it hurts, his wealth.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 1708,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "Dudes read The Jungle like an instruction manual.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "The Jungle was not a map to success.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "First ones on the line should be the 🐷 advocating for it.",
                "RFK says that bacteria are natural part of meat, so are worms. Eat up."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 748,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Having listened to ATC recordings for years, one of the points people overlook is many of the smaller airports have controllers with general aviation experience themselves. \n\nWhen shit hits the fan, having someone on the radio who can immediately provide guidance and calm based on their own piloting experience in the region isn't really replaceable. \n\nYou're losing that too.",
                "Wow this looks really bad.",
                "The surprising thing is not the plane crashing but people left at the FAA who can speak on its behalf!",
                "How big of a plane are these usually? I'm assuming this is one of those small ones, maybe a handful of people?",
                "How many incidents is this since the new administration?  Seems too many to be coincidental.",
                "So what did the air traffic controllers have to say about this?\n\nWait there aren't those anymore",
                "Shit that’s like 10 airplanes in 1 month trumps worse than 911",
                "At least they survived."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 1867,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "We really are watching the Rise of the Turd Reich.",
                "And their response will likely be “fuck off” in French.",
                "Hmm, maybe American companies should comply with French labor laws.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "Does Trump even know what country he's \"President\" of?",
                "At least Nero knew how to play the violin.",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 27775,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Get Bill Burr you cowards"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 12524,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "Obviously a merit-based hire.",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "He sneaks the scotch around for big bro.",
                "Is he the one tasked with downsizing it into a trigon?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 1792,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "Too bad there's no one left at NASA to study it.",
                "With the US going to shit at least this some good news",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "I am just glad someone is having a good year. Good for you, little rover!",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "Bad news for the great filter theory",
                "What a discovery, chipmunks dig up lawns on Mars too.\n\nedit: you downvoters are no fucking fun losers who didn't look at the article."
            ],
            "aggregate_sentiment": 82.0
        }
    ],
    "last_updated": "03/30/2025 08:10:17 UTC"
}