{
    "posts": [
        {
            "category": "HOT",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 9466,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "This kind of buries the lede. They're essentially accusing Biden of embezzling $20 billion and stashing it in a private bank, but softening the headlines makes it sound like just more funding cuts. Zeldin is literally trying to frame this as a heist.",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 18421,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Imagine being Putin and planning for this day for so long and finally seeing it come together.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "Minnesota is a blue state but all the farm areas are red as hell.  Good hit those soybeans, I have no more empthany for those people.  \n\nFarmers in Blue States really get me upset (I grew up among them), Minnesota has some of the best social programs and protections in the nation and all of them just shit on the Gov and everyone from the Twin Cities.  They themselves benefit from these programs and then talk about how great Christie Noem is from South Dakota.  GO FUCKING MOVE THERE THEN (yeah i know she's not the gov now) \n\nThey also hate anyone who accepts any assistance or benefits like snap or welfare, yet they're the biggest welfare queens I've ever met.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "If this keeps up, 2025 will go down as the beginning of The Great Tariff War.  The worst taxation since our ancestor threw tea into the harbor in protest.",
                "They should have hit tech. That's all trump cares about because they stand in his room. Mark Twitter for being blocked, tons of valid reasons. Mark Apple because they store data in the US.\n\nMake them bleed where they live, they don't care about farmers."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 4454,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "Getting harder and harder to hate the French ffs",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "Clearly a baguette class submarine",
                "This is not nearly as big a deal as some people think.",
                "I hope it stays there until trump is out of office",
                "I love the French.\n\nMacron should request that the U.S. return the Statue of Liberty since \"they arent using it\" anymore."
            ],
            "aggregate_sentiment": 53.0
        },
        {
            "category": "HOT",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 2689,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Oh the same thing bigots have done for decades to justify their actions. ",
                "Bullshit. Zero of these types of people read studies"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 830,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "Elon Musk fails again",
                "Leon at it again and he said he could have done it during Bidens term. He can't even do it with months of prep.\n\nI'm sure Trump will have a SpaceX rocket in front of the Whitehouse in a few days, fellating Leon's ego so he doesn't cry again.",
                "Well, it's better than having the rocket blow up.",
                "All political nonsense aside we really need to get those people home safe. Being in space this long can’t be healthy.",
                "But Elon told us Biden admin was holding him back! Muskrat would never lie to us right? ",
                "Planet Earth is blue\nAnd there’s nothing I can do",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 19047,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/14bf/live/25cd65b0-ff4c-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "The sinking of a boat was what got the US involved in both world wars. \n\nA shame the only balls Trump has are the set in his mouth, attached to Putin.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "I’m no conspiracy theorist but the coincidences here are astounding. Hope this guy doesn’t mysteriously die in custody.",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Russians and boats don’t seem to mix well.",
                "Trump is going to pardon him and send him on his way to Russia.  Also a nice apology letter for wrecking a Russian ship."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 2421,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "I'm not inclined to believe any \"jailhouse confession\" revealed by another inmate. I'm supposed to believe that a person in jail decided to confess to a crime to someone they just met? And I'm supposed to believe this other person already in jail is somehow an honest person and should be believed; and that they're not getting some kind of benefit for their testimony? No thanks.\n\nWhat I don't understand is that in this case, the nature of the murder was clearly not completely self-defense. It seems like they could have gotten a conviction anyway, so I don't understand why they decided they needed this tainted testimony other than they wanted to get a death penalty conviction for personal reasons.",
                "She was let off on a technicality. After reading the article, I really doubt she was actually innocent. How does a lamp get shoved down somebody's throat in self-defense?",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "She owes the Dept of Corrections money bc she wasn’t entitled to all that free room and board.  -Texas prosecutors",
                "It is incredibly difficult to get a conviction overturned.\n\n#never talk to a cop sans lawyer… cops don’t want justice they just want to close the case",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 1393,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "Fascism, pure and simple",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Why did they send him to Louisiana?",
                "This is perhaps the most egregious First Amendment violation of many of our lifetimes.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Can someone please tell me exactly what this guy has done?",
                "Trump's regime and his supporters: Fuck the Constitution!",
                "For what? He hasn't been charged with anything as far as I know other than being a political pawn."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 1823,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "So thankful someone found her in time. Something similar happened to my coworker’s husband some years ago. They were relocating to a new state for a job. Husband was the last to travel alone after closing up the old house. He was driving through a mountainous area and veered off the road. His car landed in a very wooded area many feet below the highway and not visible. He was pinned hanging upside down and could not get down or out of the car. Couldn’t reach the phone and the battery eventually died. Authorities were reluctant to do deep search because he had not been missing 24 hours. They said he could have stopped off to eat or rest. She reached out to friends and family and anyone who would help. They were able to narrow down the search area on the basis of his last conversation with his wife. The only reason they finally found him was a bright red dolly fell out of his truck during the accident and the handle was sticking out of a visible area. This is why you should always let someone know of your travel plans and check in once in a while and keep your phone charged.",
                "Johnny Martinez is the man who saw her from atop a large tractor. An incredible stroke of luck that he saw her and to quickly take action. What a hero.",
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                ">Vanderwall said Martinez could spot the car because he was driving a tall tractor.\n\n>\"I myself had traveled that road at least three to four times since she crashed and did not see her,\" Vanderwall noted.\n\nThat's some serious luck right there, or just fate.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. ",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "Our phones track us and share our locations all the time. Is there no reason the phone company couldn't have shared her last known point with investigators?",
                "Whoa…Amazing how she improvised getting water in her system an effort to live"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "upvotes": 3325,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c4d/live/c42f5a20-ff32-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "\"Scrutiny is growing over whether flying thousands of them across the world, and the infrastructure required to host them, is undermining the cause.\"\n\nNo shit.",
                "Genius idea. Absolutely flawless with the PR and optics on this one. \n\nAlmost if you could had this meeting, literally anywhere else with road access but no, let’s build a brand new road and destroy trees and the eco system.\n\nSome times I could swear people have their last two brain cells fighting it out for third place.",
                "I thought this was posted in r/nottheonion",
                "Remind me why people can't just zoom or video call to these things? Why do they HAVE to be there physically?",
                "A road paved with irony.",
                "How do these people know when to inhale and exhale?",
                "Just as bad when everyone flies their private jets to a climate summit and not just do a zoom meeting.",
                "🤦‍♂️We are speedrunning the demise of life on this planet",
                "Sacrifice and rules and laws and limits for the littles and the poors, for those on the 'commanding heights' only the most opulent consumption, destruction, waste and gluttony.  \n\nThere should be - but aren't - real karmic-level consequences and cost to this kind of hypocrisy and and betrayal for those who perpetrate it and those who profit from it.  \n\nMost of the actual agenda and action I see on 'climate change' and 'sustainability' is focused on profiting from it while consolidating power and wealth and resources.  \n\nShame and retribution!  ",
                "Don't they know that they can do a Teams or a Zoom meeting? "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 48,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "Why does he look like a slightly older Mark Zuckerberg?",
                "So now we're going to have more cancer in addition to everything else.  MAGA is MAGA-ing for sure.",
                "Looks like PFAs, microplastics and other various chemicals are back on the Menu! And drinking water too!",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "Immensely disheartening, though not surprising",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "\"Sure, we destroyed the climate and thus the world.  But for those last few years we really created a lot of shareholder value\"",
                "So when is enough enough? When do we actually stand up and do something?",
                "This is comic-book villain shit right here.",
                "These cunts are evil and subhuman."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 833,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "Elon Musk fails again",
                "Leon at it again and he said he could have done it during Bidens term. He can't even do it with months of prep.\n\nI'm sure Trump will have a SpaceX rocket in front of the Whitehouse in a few days, fellating Leon's ego so he doesn't cry again.",
                "Well, it's better than having the rocket blow up.",
                "All political nonsense aside we really need to get those people home safe. Being in space this long can’t be healthy.",
                "But Elon told us Biden admin was holding him back! Muskrat would never lie to us right? ",
                "Planet Earth is blue\nAnd there’s nothing I can do",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Israel to occupy Syrian southern territory for ‘unlimited time’, says minister | Syria",
            "external_url": "https://www.theguardian.com/world/2025/mar/12/israel-to-occupy-syrian-southern-territory-for-unlimited-time-says-minister",
            "upvotes": 36,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e4f6302824bc1c9f72d2eecba91d7b5858529f3/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=debc208a7e25cdd0d0e95622faeaa7bc",
            "top_comments": [
                "So kind of like Nazis",
                "Israel's really planing to just take over the entire fucking Arabian Peninsula, aren't they? Same way the US wants to absorb Canada and Mexico, and Russia's planning to take all of Europe.",
                "This is why they pushed to remove Assad and destabilize the county. This will only continue until greater Israel is achieved. \n\nThe Jewish people and the world need to stand up to these Nazis that use antisemitism as a shield to continue this land grab.",
                "Trying to revive the Kingdom of Israel eh?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Britain’s oldest drag queen Maisie Trollette dies aged 91",
            "external_url": "https://www.bbc.com/news/articles/cm2yjnvjem3o",
            "upvotes": 357,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6d2b/live/3acc56d0-ff63-11ef-9c50-1fc1966647c9.png",
            "top_comments": [
                "I read that as “Bidens oldest drag queen”.  My eyes have never been that confusedly widened.",
                "You know, I don't understand why all this drama about drag queens. I have heard far worse stories about what the clergymen were doing to women and children especially the Catholic clergymen. People hear those stories on a daily basis yet drag queens get more attention than priests. I am not myself someone who believe that a man can become a woman or vice versa but still I don't get all the drama. Is life really that good in the West that they had to invent problems? I find that so entitled.",
                "I want to make a joke about another drag queen but i'll just say RIP.",
                "Drag queens are just fancy clowns. Change my mind.",
                "Honestly like any other wanna be or celebrety who da fuck cares , Kim who cares , Kanye who cares the diddler who cares let him rot in jail . Auge knight who cares he’s already in jail shit . They all want click baits and attention just the the big companies corporations no more dei no more deversity who wanna bet they won’t be a pride month this year ?",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 2693,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Oh the same thing bigots have done for decades to justify their actions. ",
                "Bullshit. Zero of these types of people read studies"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Victims identified in Mississippi medical helicopter crash",
            "external_url": "https://www.wdbj7.com/2025/03/12/victims-identified-mississippi-medical-helicopter-crash/",
            "upvotes": 113,
            "date": "03/12/2025",
            "thumbnail": "https://gray-wdbj-prod.gtv-cdn.com/resizer/v2/77776RDVWNDBRKNMGAX4KQGULI.png?auth=442c944370331cfb98c7ca84fb5841254a0bd5ed8def36bfbf05d2a3b9de86a3&width=1200&height=600&smart=true",
            "top_comments": [
                "My wife is a doctor (family medicine, Primary Care physician) she did her residency at UMMC. \n\nThis is tragic news. I don't think she ever knew any of the pilots personally, but she saw them all the time when she did her hospital rotations coming in and out. I remember her saying they took their job very seriously and always looked like a \"military unit\" when they would pack up and run to the helipad.\n\nLiving in Jackson MS, by UMMC I'd see/ hear the helicopter take off and land frequently. If I remember correctly you can see one of the landing pads right off of I-55. The pessimist in me always had intrusive thoughts of \"it would suck if that helicopter ever crashed\". I feel shame ever having that thought.\n\nWe have friends who are still living in Jackson MS who also work at UMMC, they have been posting non-stop about this."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 1398,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "Fascism, pure and simple",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Why did they send him to Louisiana?",
                "This is perhaps the most egregious First Amendment violation of many of our lifetimes.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Can someone please tell me exactly what this guy has done?",
                "Trump's regime and his supporters: Fuck the Constitution!",
                "For what? He hasn't been charged with anything as far as I know other than being a political pawn."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 4452,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "Getting harder and harder to hate the French ffs",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "Clearly a baguette class submarine",
                "This is not nearly as big a deal as some people think.",
                "I hope it stays there until trump is out of office",
                "I love the French.\n\nMacron should request that the U.S. return the Statue of Liberty since \"they arent using it\" anymore."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 9472,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "This kind of buries the lede. They're essentially accusing Biden of embezzling $20 billion and stashing it in a private bank, but softening the headlines makes it sound like just more funding cuts. Zeldin is literally trying to frame this as a heist.",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "German spy agency concluded COVID virus likely leaked from lab, papers say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/german-spy-agency-concluded-covid-virus-likely-leaked-lab-papers-say-2025-03-12/",
            "upvotes": 1451,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That virus appears to be a comical string of incompetence.\n\nThe city not informing the govt of the virus outbreak so they could have their yearly outdoor celebration in November 2019 was another part of that...\n\nGreat job.",
                "...and the crowd goes mild...",
                "What are these comments",
                "This article doesn't sound very sure of its report...",
                "I’m honestly confused about this. This information is from 2020, and I swear I remember reading another article in nature with more recent information saying that it came from bats based on genomic data. I’m curious what kind of information the German secret service has for them to be 80-90% sure it’s a lab leak, because that’s…pretty damn high, and I don’t think there’s as much reason to distrust the German government TBH, but how does that jive with the genomic data? \n\nI hate how political this has become because obviously it’s important to know where it came from in order to prevent future outbreaks. I feel like every few months we get an article that says with high confidence that it came from bats or from a lab. Of course the complete opacity of the Chinese government doesn’t help with this at all. \n\nIt’s also important to remember that we may not have the answer for some time. For example we still don’t know the specific source of Ebola even though it was first discovered over 40 years ago.",
                "I still think that “investigations” that claim it’s a lab leak are more concerned with politics than actually determining the source of the virus and how the reduce the possibility of another virus mutating and becoming a worldwide pandemic (essentially inevitable now).",
                "Yall... read the article. THEN go read the actual paper this conclusion is based on. \n\nThe paper is from 2020. It has been pretty throughly debunked. Many times. \n\nNo new information has been released. It's just a clickbait article. It's definitely not the \"gotcha\" people want it to be.",
                "Why even put this out, if it is low confidence?\n\n\nThe Vikings will win the superbowl next year.  \n\n\nEventhough I have low confidence with that declaration you should bet your life savings on it.",
                "Crazy how saying this back in 2021 would paint you as a wacko conspiracy theorist.",
                "And the propaganda machine revs up"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 2692,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Oh the same thing bigots have done for decades to justify their actions. ",
                "Bullshit. Zero of these types of people read studies"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 818,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "Elon Musk fails again",
                "Leon at it again and he said he could have done it during Bidens term. He can't even do it with months of prep.\n\nI'm sure Trump will have a SpaceX rocket in front of the Whitehouse in a few days, fellating Leon's ego so he doesn't cry again.",
                "Well, it's better than having the rocket blow up.",
                "All political nonsense aside we really need to get those people home safe. Being in space this long can’t be healthy.",
                "Planet Earth is blue\nAnd there’s nothing I can do",
                "But Elon told us Biden admin was holding him back! Muskrat would never lie to us right? ",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 1400,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "Fascism, pure and simple",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Why did they send him to Louisiana?",
                "This is perhaps the most egregious First Amendment violation of many of our lifetimes.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Can someone please tell me exactly what this guy has done?",
                "Trump's regime and his supporters: Fuck the Constitution!",
                "For what? He hasn't been charged with anything as far as I know other than being a political pawn."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Britain’s oldest drag queen Maisie Trollette dies aged 91",
            "external_url": "https://www.bbc.com/news/articles/cm2yjnvjem3o",
            "upvotes": 357,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6d2b/live/3acc56d0-ff63-11ef-9c50-1fc1966647c9.png",
            "top_comments": [
                "I read that as “Bidens oldest drag queen”.  My eyes have never been that confusedly widened.",
                "You know, I don't understand why all this drama about drag queens. I have heard far worse stories about what the clergymen were doing to women and children especially the Catholic clergymen. People hear those stories on a daily basis yet drag queens get more attention than priests. I am not myself someone who believe that a man can become a woman or vice versa but still I don't get all the drama. Is life really that good in the West that they had to invent problems? I find that so entitled.",
                "I want to make a joke about another drag queen but i'll just say RIP.",
                "Drag queens are just fancy clowns. Change my mind.",
                "Honestly like any other wanna be or celebrety who da fuck cares , Kim who cares , Kanye who cares the diddler who cares let him rot in jail . Auge knight who cares he’s already in jail shit . They all want click baits and attention just the the big companies corporations no more dei no more deversity who wanna bet they won’t be a pride month this year ?",
                "[removed]"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 4456,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "Getting harder and harder to hate the French ffs",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "Clearly a baguette class submarine",
                "This is not nearly as big a deal as some people think.",
                "I hope it stays there until trump is out of office",
                "I love the French.\n\nMacron should request that the U.S. return the Statue of Liberty since \"they arent using it\" anymore."
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "RISING",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 9477,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "This kind of buries the lede. They're essentially accusing Biden of embezzling $20 billion and stashing it in a private bank, but softening the headlines makes it sound like just more funding cuts. Zeldin is literally trying to frame this as a heist.",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 18417,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Imagine being Putin and planning for this day for so long and finally seeing it come together.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "Minnesota is a blue state but all the farm areas are red as hell.  Good hit those soybeans, I have no more empthany for those people.  \n\nFarmers in Blue States really get me upset (I grew up among them), Minnesota has some of the best social programs and protections in the nation and all of them just shit on the Gov and everyone from the Twin Cities.  They themselves benefit from these programs and then talk about how great Christie Noem is from South Dakota.  GO FUCKING MOVE THERE THEN (yeah i know she's not the gov now) \n\nThey also hate anyone who accepts any assistance or benefits like snap or welfare, yet they're the biggest welfare queens I've ever met.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "If this keeps up, 2025 will go down as the beginning of The Great Tariff War.  The worst taxation since our ancestor threw tea into the harbor in protest.",
                "They should have hit tech. That's all trump cares about because they stand in his room. Mark Twitter for being blocked, tons of valid reasons. Mark Apple because they store data in the US.\n\nMake them bleed where they live, they don't care about farmers."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Astronauts launching to space will finally relieve the pair who flew on Boeing's troubled capsule",
            "external_url": "https://www.nbcnews.com/science/space/astronauts-space-station-launch-nasa-boeing-return-rcna194880",
            "upvotes": 864,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250307-spacex-nasa-ISS-crew-10-mn-0905-582721.jpg",
            "top_comments": [
                "will “hopefully” relieve\n\nI have zero faith in any of these groups anymore.",
                "They're *still* up there?",
                "Standing by for what happens when they return to Earth. I expect Trump will brag he had to rescue them because Biden had stranded them on purpose. Now, when the decision was made for them to extend their stay and return the malfunctioning Boeing brick unmanned, it was stated at  that time they would return in March 2025.",
                "To clarify \n\nNo the reason they are up their isn't a political reason. \n\nThey are still up their so they can finish up their experiments they have the ability to leave any time they want just the planned date is the most optimal.",
                "I cannot imagine anyone thinking space travel is a good idea with Trump in office and President Musk bulldozing our institutions.  What happens when NASA ceases to function, with no funding and no leadership, while these people are living in a failing structure miles from Earth?  \n\nYeah.  This sounds like a failure waiting to happen.",
                "No one is “stranded”. They could return whenever they wanted to but decided to be professional and do thier jobs “well, we are here, they have a mission in March we can go back on, let’s make the most of our time here and do science things and space stuff until then.”\n\nPretty simple really",
                "Imagine being stuck on the space station since September.  I know they aren’t isolated from the *information* of everything that has happened since then…. but I feel like their first walk through a store they’re going to get hit by the general public’s bad vibes and go “oh shit“",
                "God the spacex suites look like shit",
                "I just want to know the financial compensation",
                "Geese, they have been up there so long I expect them to have started speaking belter from “The Expanse”"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 1830,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "So thankful someone found her in time. Something similar happened to my coworker’s husband some years ago. They were relocating to a new state for a job. Husband was the last to travel alone after closing up the old house. He was driving through a mountainous area and veered off the road. His car landed in a very wooded area many feet below the highway and not visible. He was pinned hanging upside down and could not get down or out of the car. Couldn’t reach the phone and the battery eventually died. Authorities were reluctant to do deep search because he had not been missing 24 hours. They said he could have stopped off to eat or rest. She reached out to friends and family and anyone who would help. They were able to narrow down the search area on the basis of his last conversation with his wife. The only reason they finally found him was a bright red dolly fell out of his truck during the accident and the handle was sticking out of a visible area. This is why you should always let someone know of your travel plans and check in once in a while and keep your phone charged.",
                "Johnny Martinez is the man who saw her from atop a large tractor. An incredible stroke of luck that he saw her and to quickly take action. What a hero.",
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                ">Vanderwall said Martinez could spot the car because he was driving a tall tractor.\n\n>\"I myself had traveled that road at least three to four times since she crashed and did not see her,\" Vanderwall noted.\n\nThat's some serious luck right there, or just fate.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. ",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "Our phones track us and share our locations all the time. Is there no reason the phone company couldn't have shared her last known point with investigators?",
                "Whoa…Amazing how she improvised getting water in her system an effort to live"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "German spy agency concluded COVID virus likely leaked from lab, papers say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/german-spy-agency-concluded-covid-virus-likely-leaked-lab-papers-say-2025-03-12/",
            "upvotes": 1450,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That virus appears to be a comical string of incompetence.\n\nThe city not informing the govt of the virus outbreak so they could have their yearly outdoor celebration in November 2019 was another part of that...\n\nGreat job.",
                "...and the crowd goes mild...",
                "What are these comments",
                "This article doesn't sound very sure of its report...",
                "I’m honestly confused about this. This information is from 2020, and I swear I remember reading another article in nature with more recent information saying that it came from bats based on genomic data. I’m curious what kind of information the German secret service has for them to be 80-90% sure it’s a lab leak, because that’s…pretty damn high, and I don’t think there’s as much reason to distrust the German government TBH, but how does that jive with the genomic data? \n\nI hate how political this has become because obviously it’s important to know where it came from in order to prevent future outbreaks. I feel like every few months we get an article that says with high confidence that it came from bats or from a lab. Of course the complete opacity of the Chinese government doesn’t help with this at all. \n\nIt’s also important to remember that we may not have the answer for some time. For example we still don’t know the specific source of Ebola even though it was first discovered over 40 years ago.",
                "I still think that “investigations” that claim it’s a lab leak are more concerned with politics than actually determining the source of the virus and how the reduce the possibility of another virus mutating and becoming a worldwide pandemic (essentially inevitable now).",
                "Yall... read the article. THEN go read the actual paper this conclusion is based on. \n\nThe paper is from 2020. It has been pretty throughly debunked. Many times. \n\nNo new information has been released. It's just a clickbait article. It's definitely not the \"gotcha\" people want it to be.",
                "Why even put this out, if it is low confidence?\n\n\nThe Vikings will win the superbowl next year.  \n\n\nEventhough I have low confidence with that declaration you should bet your life savings on it.",
                "Crazy how saying this back in 2021 would paint you as a wacko conspiracy theorist.",
                "And the propaganda machine revs up"
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/13/2025 00:40:22 UTC"
}