{
    "posts": [
        {
            "category": "HOT",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 12322,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "Now we see what happens if the executive branch says “nah”",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)",
                "Who wants to bet that the Trump administration was stonewalling because they know Garcia is dead."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Planes clip wings at DCA with members of Congress on board",
            "external_url": "https://www.fox5dc.com/news/planes-collide-dca-per-members-congress-board",
            "upvotes": 8360,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2025/04/1280/720/gettyimages-2206556196-scaled.jpg?ve=1&tl=1",
            "top_comments": [
                "Flying to DCA is like playing a game of Russian Roulette.",
                "Based on the tweets, looks like 3 Congresspeople were involved:\n\n* Josh Gottheimer - NJ (Dem)\n* Nick LaLota - NY (Rep)\n* Grace Meng - NY (Dem)",
                "Now Congress will finally do something about it. Because Congress, especially Republicans, don't take any action unless it benefits them. ",
                "I hope this is a reminder to policymakers that when we say the agencies and programs they’re defunding benefit everyone, we literally mean *everyone*. Safety in transportation, health, food, weather — I could go on — is everyone’s business.",
                "Maybe dismantling the FAA was not a good idea?",
                "DOGE gutting the FAA means this will be increasingly common.",
                "If only Congress had some kind of funding and oversight role... Oh well...",
                "I’m about to google their voting records.  I was talking to people at work about how after the first few times I just thought the media was giving it extra attention because it was already in the cycle but it was getting weird, that was a few weeks ago",
                "About time the Congress clowns feel real world consequences for their bullshit",
                ">“Aviation mishaps are at an all-time high, and the Trump administration's reckless decision to fire FAA control staff has put us all in danger.”\n\nHonestly, it's scary, you know, thinking about how quickly things can go wrong, especially when critical safety measures are cut... the political games shouldn't be interfering with something so vital, and I really hope those involved in this incident are okay, because that's the main thing, and it does make you think twice about flying."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 4774,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "Make showers golden again",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "The syphilis has finally taken control of trumps brain. 🧠"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "USDA to close down DC headquarters, lay off thousands of workers: report",
            "external_url": "https://www.fox5dc.com/news/usda-close-down-dc-headquarters-lay-off-thousands-workers-report",
            "upvotes": 12987,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2024/01/1280/720/Dept-of-Agriculture.jpg?ve=1&tl=1",
            "top_comments": [
                "As an FYI- the USDA is not just food. They also oversee RD, or Rural Development which a portion of subsidized housing very similar to HUD or Section 8. This housing subsidy helps very low income households pay rent each month. \n\n  \nLosing funding would make millions of people homeless.",
                "What the fuck. \n\nSo we can't get fruit from Mexico and our own farms no longer have insurance to cover the increasing terrible storms",
                "Cool, this should have zero negative ramifications",
                "Eh, my food was too safe anyway. Time to take a life altering gamble every time I eat a meal I guess....",
                "This is a plot to get more small farms to fail so large corps can buy the land",
                "I've been watching the new Daredevil series. Every episode, I'm disappointed by the sad truth that Wilson Fisk is less destructive than our own president.",
                "Welcome to The Jungle",
                "USDA's main funding—70% is to school lunch, WIC, SNAP and rural home loans. Crop insurance and rural infrastructure are important too. Gonna be a big hit to rural schools combined with DOE cuts.",
                "Glad I’m not looking for jobs in DC, which would probably going to be the unemployment capital of the U.S.",
                "Its so wonderful to wake up each day, go online, and see what other terrible, unconstitutional, illegal ccr4p Felon47 has done to further destroy our once great nation....i pr4y daily that you know who has a massive myocardial infarction...."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Florida teacher loses job for calling student by ‘preferred’ name",
            "external_url": "https://www.clickorlando.com/news/local/2025/04/09/florida-teacher-loses-job-for-calling-student-by-preferred-name/",
            "upvotes": 28385,
            "date": "04/10/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/TBZTHJYBJ563IwLrah5g/1744232082153_1920x1080_thumbnail.jpg?_a=DATAdtfiZAA0",
            "top_comments": [
                "I remember a recent Townhall where a citizen called the chairperson \"Madam Chairwoman\" and the chair said \"I would prefer you call me Mr. Chairman,\" and the citizen responded with \"Per the resolution you just passed, I cannot be compelled to use your preferred pronouns, Madam Chairwoman.\"",
                "So does this apply to nicknames, or just trans kids?",
                "My wife is a Florida teacher, she cannot call students named Samuel, \"Sam\". She cannot call students named Samantha, \"Sam\". She can't call someone named Robert, \"Bobby\", unless she has a signed note by the parents allowing it. No, I'm not joking.\n\nShe also teaches 8 non-verbal special needs students, that have so far cut her face several times, choked her (kindergarten), and given her several bloody lips. These are kindergarteners. Many don't even live in a house, they live in shelters, or in a vehicle. The schools have codewords for those students, and offer no help. My wife is the one that gives them the stability their lives lack, and her thanks is being given more and more non-verbal, no IEP (they have no special education plan) and that makes it near impossible to teach the OTHER 30 kids in her class. She's also forced to teach them all together. So while one kid is hitting another, another kid is ripping books, and another has now absconded, with no teacher's aide, she has to deal with all that at the same time. \n\nEducation in Florida is in real danger.",
                "They aren't just firing her, the state of Florida is taking action to revoke her teachers license so she can never work as a teacher again. This is all happening because her parents contacted the school board to whine about this teacher using their child's preferred name. Imagine how guilty their kid is going to feel for being used to destroy the career of such a beloved compassionate teacher.",
                "The party of freedom is all about telling everyone what they can't do.",
                "> “BPS supports parents’ rights to be the primary decision-makers in their children’s lives, and Florida law affirms their right to be informed.\n\n\n   \n\nUnless, of course, parents want to direct their transgender child's health care in a way that the state of Florida doesn't like. Then it's \"fuck off, we know best.\"",
                "Using the name the kid prefers is grounds for dismissal? What kind of bizarro world is this?",
                "I still don’t understand how this law isn’t a direct violation of the first amendment. We’re supposed to have freedom of speech but can get fired for calling someone the “wrong” name?",
                "Ok, I’ll tell my son to let me know the next time his asshole coach calls him “ buddy” or “dude” or “bud” or “son”",
                "\"The teacher is working under a ten-month contract... Calhoun worked for the school district for eleven years\"\n\nHere is a good indication that Education is not considered a Profession in the fine state of Florida."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Police shoot best-selling author and wife of Weezer bassist, saying she pointed gun at officers",
            "external_url": "https://www.nbcnews.com/news/us-news/police-shoot-wife-weezers-bassist-say-pointed-gun-officers-rcna200543",
            "upvotes": 8799,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-scott-shriner-weezer-bassist-wife-jillian-lauren-shriner-2015-ac-1021p-c88a84.jpg",
            "top_comments": [
                "can't wait to see this body cam",
                "Gosh, this story sure has changed since yesterday. From \"she came out the front door shooting\" to \"she was in her back yard with a gun protecting her property\". This is a prime example of \"A lie can travel halfway around the world before the truth can get its boots on.\"",
                "*A best-selling author was shot by police and accused of attempted murder after authorities said she pointed a gun at officers who were searching for hit-and-run suspects in a residential Los Angeles neighborhood.*\n\n*Police said Shriner was not involved in the hit-and-run incident and the shooting is being investigated by LAPD’s Force Investigation Division.*\n\n*The department said officers encountered Shriner in the backyard of her home in Eagle Rock, north of downtown Los Angeles, Tuesday afternoon after the California Highway Patrol requested help finding three hit-and-run suspects allegedly involved in a crash on a nearby freeway.*\n\nSo she armed herself because strangers were in her yard and they shot her?",
                "Love how they tried to charge her to get out of shit. Show the body cam footage.",
                "she was in her own backyard? wow",
                "This was on her property, I'm willing to bet a musician with a net worth north of 10 million has security cameras.",
                "> In a Wednesday night news conference, Detective Meghan Aguilar said that it was not clear from body-worn police video what happened in the moments before the shooting, or whether she fired at officers.\n\n> Aguilar said that police body-worn police camera had not provided “a clear view of what she did with that firearm” or said it was “not clear if she fired at officers or not.”\n\nNot clear what happened or if she even shot her gun, but yet she’s still charged with attempted murder…make it make sense.\n\n> One of the hit-and-run suspects was found, cited and released, the department said. Two others were not located\n\n🤡",
                "Thank you for highlighting her achievement rather than her marriage",
                "What's with these homies shooting my girl",
                "“One of the hit-and-run suspects was found, cited and released, the department said. Two others were not located.”\n\nShe got shot over something that wasn’t even bad enough to arrest the original suspect? Fuck that!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. stocks slide again as euphoria over Trump's tariff pause starts to fade",
            "external_url": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
            "upvotes": 7093,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2Fc7%2F92a79a2c4836b9771d5e43dfba5d%2Fgettyimages-2208870658-1.jpg",
            "top_comments": [
                "The fomo yesterday gave way to math and realism overnight.",
                "You can bend a paperclip a few times. It'll hold.\n\nKeep bending it again and again and it breaks.",
                "China is now at 145% after clarification this morning and there’s still that’s blanket 10% on everyone else, and Mexico and Canada still at 25%.\n\nSo like, it’s not over, shits still going to get expensive and we won’t be able to afford the same amount of stuff we can right now.\n\nOh well. They’re doing an investigation on price gouging eggs! They’re fixing the eggs y’all!\n\nEdit: We are on track to wipe out most gains from yesterday, and might hit a circuit breaker today. Hope people didn't celebrate it, cause now they may look dumb.",
                "All this \"Yay! The market is up!\" Is so stupid\n\nIts still down over 6% in a month and down over 10% from the high\n\nTrump is still a disaster for the economy, its just less bad than it was 2 days ago, but its still bad lol",
                "Bond market is cratering and the Dow riding on feels. These bounces are all money making chances for the billionaires with inside scoops.",
                "Insider trading isn't a crime if youre the one writing the rules",
                "Do not try and play this market. Either you sold a week ago, or just buckle down.",
                "All the money was made yesterday, give them a few weeks, and they'll repeat what they did again.... They may have to investigate themselves for insider trading, but they won't find any wrong doing...",
                "When the timing’s right, we’re gonna see a tweet that he’s “dealing” with China just for a little boost. At this point the US economy might as well just be a pump and dump meme.",
                "If you want to see how corrupt the media is, look at all the headlines after the tariff reversal. \n\n“Stock Market soars” \n\n“US Stocks rally after Trump Tariff Reprieve” \n\n “US stocks skyrocket higher after Trump signals shift in trade policy”\n\nEvery headline puts a positive spin while completely ignoring the fact that it was an intentional and unnecessary drop because of stupid tariff threats. (And let’s not ignore that anyone with inside knowledge cashed out huge)."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "U.S. ambassador to Ukraine to resign her post early",
            "external_url": "https://www.cbsnews.com/news/bridget-brink-ambassador-to-ukraine-to-resign-sources/",
            "upvotes": 3217,
            "date": "04/10/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/10/39b5229b-43e7-4278-9303-4c8ce520d77f/thumbnail/1200x630/f91eb02747ff504eca7374fdba13b771/gettyimages-1400649409.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "She already submitted her resignation per article IN JANUARY but it was rejected by Rubio. \n\nI don’t blame her. On the other hand, I want her to stay…",
                "Rubio had opted to keep her on despite her resignation letter in January. I can't imagine the Trump administration has made her job easier though.",
                "How would you like to be the president of a country defending itself from the Russian military invasion, and your formerly strongest supporter was doing this:\n> Mr. Trump continues to sit on the nearly $4 billion in remaining U.S. military aid already designated for Ukraine.",
                "Explain in tariffs and spray tan terms.",
                "At a guess, she was unwilling to deliver Trump's \"Surrender to Russia or we kill you\" ultimatum.",
                "> “We will know soon enough, in a matter of weeks, not months, whether Russia is serious about peace or not. I hope they are.”\n\nIt's genuinely concerning that the Ambassador felt driven to resign, wouldn't you agree? The fact that vital military aid continues to be held back, really hinders Ukraine's ability to defend itself... it's a troubling situation, to say the least, and it's hard to imagine how much more pressure someone in that position could handle. I mean, it just all feels terribly wrong, all things considered.",
                "Bridget Brink is an exceptionally bright human being with a career dedicated to public service. She was appointed to ambassador positions by both Trump and Biden, and when I had the occasion to hear her talk in person she was incredibly well spoken.",
                "I wonder if this has to do with the word Russian.\n\nAfter a Russian missile hit Kryvi Rih a couple weeks ago she released a statement that condemned missiles falling on playgrounds...without specifying it was a *Russian* missile and leaving it ambiguous. \n\nPresident Zelensky condemned her response and accused the US of being afraid to say the word Russan. She since visited underground schools in Kharkiv and made sure to say that they are built to shelter from Russia missiles. \n\nIt was a goof, possibly a policy within the Whitehouse that advised her not to be critical of Russia and it cost her credibility with Ukrainians after a very impactful missile strike killed 9 children and sent Ukraine into a period of mourning.",
                "Russia is doing nothing to bring this war to an end. Ukraine is just defending itself. That's the only true narrative.",
                "Apparently the Whitehouse places equal blame for the Russian invasion.\n\n Putin has no interest in ending its occupation. If he was serious he wouldn't be bombing Ukraine every day, building up Russian troop numbers or involving North Korea and China. He's a bad faith actor."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. slaps 145% tariff on China in sharpest trade escalation yet",
            "external_url": "https://www.thestreet.com/crypto/policy/u-s-slaps-145-tariff-on-china-in-sharpest-trade-escalation-yet",
            "upvotes": 5261,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "wake me up when it hits 400%",
                "Heh I legit laughed, this is just so silly it is getting funny now. We are in cartoon territory.",
                "I believe this is the source \n\nhttps://www.cnbc.com/2025/04/10/china-trump-tariffs-live-updates.html",
                "Pushing china to a consumer based economy is going to destroy ours in the process. There are no winners in a trade war.",
                "Exhausting timeline this is. It's April and already 2025 has lasted 10 years.",
                "Another day, another arbitrary number from the senile old fool.",
                "Tomorrow it will be gone. Next week it will be back. It's exhausting keeping up with a demented man who acts on their ego and refuses help from experts who don't agree with him. ",
                ">The steep 145% rate effectively shuts down many categories of Chinese imports and is expected to send ripple effects through global supply chains. \n\nThis will be worse than the the pandemic supply chain problems.",
                "TJ MAXX, Marshall’s, home goods, Walmart, target, and about 1000 other companies are pissing their pants. INB4 their stock tanks, it’s gobbled up by investment firms, and Trump comes to an agreement with China which send stock prices soaring. ",
                "I wonder if they'll ever realize that it's not China that pays those tariffs."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Helicopter crashes in the Hudson River, NYPD says",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/10/helicopter-crashes-hudson-river-nypd-says/",
            "upvotes": 1641,
            "date": "04/10/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/IMZJKEMN4FGCDNA4UG42FL7YRM.jpg?auth=bb39d266455187d6f533d94d3bf1cc1ad0ec1db976f21db9ffe98bb5b6080edf&width=1200&height=600&smart=true",
            "top_comments": [
                "“The helicopter was carrying a pilot, two adults and three children, according to law enforcement sources. \n\nThe family members were tourists from Spain, sources said.”",
                "What a horrible year for aviation over bodies of water.",
                "I love flying, but you will never catch me on any kind of sightseeing company's helicopters.",
                "The video I saw of it falling [looks like it had lost its tail](https://x.com/xpertcommander/status/1910424640595312989)… so sad",
                "[NBC reporting ](http://nbcnewyork.com/new-york-city/helicopter-crash-hudson-river-live-updates/6220718/)that at least 5 people were on board, with 3 of them being children. Confirmed fatalities. Two of the kids taken to the hospital in critical condition.\n\nSounds like it was a family on a helicopter tour\n\nedit:[ AP is reporting that all 6 on board died](https://apnews.com/article/new-york-helicopter-crash-e0368ea529659ee1513d92dcbf05a28d)",
                "As awful as this is, its lucky it didn’t crash into a busy street or a building",
                "Looks like it broke apart in the air \n\n[https://x.com/dinoshanr/status/1910419164021621172](https://x.com/dinoshanr/status/1910419164021621172)",
                "There's a lot of things that fly and hover crashing lately. Is everyone drunk?",
                "Oh so now we know what happens when you disband the agency that checks the planes and helicopters for safety!",
                "[deleted]"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "He Was Held Captive in His Room for Decades. Then He Set It on Fire.",
            "external_url": "https://www.nytimes.com/2025/04/08/nyregion/ct-waterbury-captive.html?unlocked_article_code=1.-04.4HNi.zGM-0_RhfEmN&smid=url-share",
            "upvotes": 2,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I do not think I have read something so tragic - yet uplifting - in a long time. I had to share it."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Tourist helicopter crashes in Hudson River in New York City, all 6 on board killed",
            "external_url": "https://abcnews.go.com/US/helicopter-crashes-hudson-river-new-york-city/story?id=120691975",
            "upvotes": 38,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7379b5d6-5467-43f4-b5cd-0a11bac25b6f/helicopter-crash-07-ht-jt-250410_1744320561326_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "From what I read of the article something hit the rotor, busted off a chunk of one and a fragment hit the engine causing it to explode and fall into the river. At least that's what I was able to gather. What the hell could do that to a helicopter? A drone maybe?",
                "This had to be the worst air disaster year in us history. Let's fire more expert personnel"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 12250,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "Now we see what happens if the executive branch says “nah”",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)",
                "Who wants to bet that the Trump administration was stonewalling because they know Garcia is dead."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Apple airlifts 600 tons of iPhones from India 'to beat' Trump tariffs, sources say",
            "external_url": "https://www.reuters.com/technology/apple-airlifts-600-tons-iphones-india-to-beat-trump-tariffs-sources-say-2025-04-10/",
            "upvotes": 306,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They will still charge like it’s tariffed.",
                ">implying the total cargo of 600 tons comprised about 1.5 million iPhones\n\nWe can live without the newest iPhone, any chance of filling a few planes with prescription drugs?",
                "Omg when Trump finds out he will be so pissed at Tim Apple!",
                "How does this beat tariffs though?",
                "To avoid paying tariffs set up by the guy whose ass they kissed lol",
                "Isn't that just smuggling?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 4788,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "Make showers golden again",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "The syphilis has finally taken control of trumps brain. 🧠"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Gun goes off in child's bag in Maryland school days after similar gunfire in Virginia",
            "external_url": "https://www.nbcwashington.com/news/local/gun-goes-off-in-childs-bag-in-maryland-school-days-after-similar-gunfire-in-virginia/3889130/?utm_source=fark&utm_medium=website&utm_content=link&ICID=ref_fark",
            "upvotes": 833,
            "date": "04/10/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/charles-county-school-chopper-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The good news:\n\n> The child’s parents were arrested and charged with recklessly leaving a loaded, unsecured firearm so as to endanger the life or limb of a child under 14.",
                "9 years old, wow. Fumbling through his backpack for a piece of paper while it was in his lap and accidentally discharged the gun.",
                "Teachers should require the kids turn in their guns at the beginning of each class. Otherwise they are just too distracting.",
                "I'm all for responsible gun ownership.\n\n\nProblem is that too many gun owners think responsibility is a liberal conspiracy.",
                "Only in the US will you see this type of shit occur regularly, and a huge number of people content to do absolutely nothing.\n\nAnd a big contingent of people that will vehemently oppose any discussion about measures that can be taken to prevent this kind of occurrence. ",
                "Parents who mishandle guns that cause situations like this deserve severe prison time.\n\nI know it is unethical to remove parents from a kid, but there has to be examples made that if you do this, you go to prison for a long time and lose access to your kids.",
                "Child carrying loaded gun in US school lunch bag.\nOkay, I can see that.",
                "Maryland is pretty good about gun laws. They will go after the parents. ",
                "america wont restrict gun-access but they'll restrict voter rights. MURRICA",
                "Man it almost sounds like this kid is bringing a gun to school out of fear of all these shootings, it’s\nSad. Also fuck the parents for not securing their guns properly."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Planes clip wings at DCA with members of Congress on board",
            "external_url": "https://www.fox5dc.com/news/planes-collide-dca-per-members-congress-board",
            "upvotes": 8366,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2025/04/1280/720/gettyimages-2206556196-scaled.jpg?ve=1&tl=1",
            "top_comments": [
                "Flying to DCA is like playing a game of Russian Roulette.",
                "Based on the tweets, looks like 3 Congresspeople were involved:\n\n* Josh Gottheimer - NJ (Dem)\n* Nick LaLota - NY (Rep)\n* Grace Meng - NY (Dem)",
                "Now Congress will finally do something about it. Because Congress, especially Republicans, don't take any action unless it benefits them. ",
                "I hope this is a reminder to policymakers that when we say the agencies and programs they’re defunding benefit everyone, we literally mean *everyone*. Safety in transportation, health, food, weather — I could go on — is everyone’s business.",
                "Maybe dismantling the FAA was not a good idea?",
                "DOGE gutting the FAA means this will be increasingly common.",
                "If only Congress had some kind of funding and oversight role... Oh well...",
                "I’m about to google their voting records.  I was talking to people at work about how after the first few times I just thought the media was giving it extra attention because it was already in the cycle but it was getting weird, that was a few weeks ago",
                "About time the Congress clowns feel real world consequences for their bullshit",
                ">“Aviation mishaps are at an all-time high, and the Trump administration's reckless decision to fire FAA control staff has put us all in danger.”\n\nHonestly, it's scary, you know, thinking about how quickly things can go wrong, especially when critical safety measures are cut... the political games shouldn't be interfering with something so vital, and I really hope those involved in this incident are okay, because that's the main thing, and it does make you think twice about flying."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Helicopter crashes in the Hudson River, NYPD says",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/10/helicopter-crashes-hudson-river-nypd-says/",
            "upvotes": 1645,
            "date": "04/10/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/IMZJKEMN4FGCDNA4UG42FL7YRM.jpg?auth=bb39d266455187d6f533d94d3bf1cc1ad0ec1db976f21db9ffe98bb5b6080edf&width=1200&height=600&smart=true",
            "top_comments": [
                "“The helicopter was carrying a pilot, two adults and three children, according to law enforcement sources. \n\nThe family members were tourists from Spain, sources said.”",
                "What a horrible year for aviation over bodies of water.",
                "I love flying, but you will never catch me on any kind of sightseeing company's helicopters.",
                "The video I saw of it falling [looks like it had lost its tail](https://x.com/xpertcommander/status/1910424640595312989)… so sad",
                "[NBC reporting ](http://nbcnewyork.com/new-york-city/helicopter-crash-hudson-river-live-updates/6220718/)that at least 5 people were on board, with 3 of them being children. Confirmed fatalities. Two of the kids taken to the hospital in critical condition.\n\nSounds like it was a family on a helicopter tour\n\nedit:[ AP is reporting that all 6 on board died](https://apnews.com/article/new-york-helicopter-crash-e0368ea529659ee1513d92dcbf05a28d)",
                "As awful as this is, its lucky it didn’t crash into a busy street or a building",
                "Looks like it broke apart in the air \n\n[https://x.com/dinoshanr/status/1910419164021621172](https://x.com/dinoshanr/status/1910419164021621172)",
                "There's a lot of things that fly and hover crashing lately. Is everyone drunk?",
                "Oh so now we know what happens when you disband the agency that checks the planes and helicopters for safety!",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man injured in ‘incident’ involving 9 Jacksonville jailers dies",
            "external_url": "https://jaxtrib.org/2025/04/10/man-injured-in-incident-involving-9-jacksonville-jailers-dies/",
            "upvotes": 770,
            "date": "04/10/2025",
            "thumbnail": "https://jaxtrib.org/wp-content/uploads/2025/04/90195773_174422786991294_r_fitted.jpeg",
            "top_comments": [
                "**Murdered**  is the word that they were looking for",
                "An overview of what’s known so far:\n- Charles Faggart was arrested April 1 in Jacksonville, Florida on two misdemeanor charges: simple assault and criminal mischief.\n- On April 7, an “incident” involving eight Jacksonville Sheriff’s Office correctional officers and one correctional sergeant occurred at the Jacksonville jail. (Faggart was subsequently hospitalized, but it’s been known by loved ones since that day that he was brain dead.)\n- On April 8, Jacksonville Sheriff T.K. Waters announced the suspension of the officers, saying that the injuries to the inmate (the sheriff’s office did not identify him as Faggart) were “bad, very bad, bad enough for me to come out here and tell the public about it.\"\n- On April 9, Sheriff Waters announced that the sheriff’s office was requesting the involvement of the FBI in the investigation into the “incident”.\n- On April 10, the family attorney announced Faggart’s death.\n\nNo details or video of the incident or the names of the officers involved have been released.",
                "They murdered him and tried to cover it up.\n\n\nThere needs to be a third party citizen board in charge of overseeing jails and prisons. But there won't be.",
                "That’s one hell of an “incident”.  Sounds more like 9 people beating a man to death to me.",
                "Before jumping to conclusions, let's just give them time to investigate themselves and determine they did nothing wrong.",
                "Faggart is a very unfortunate last name.  That can’t have been an easy childhood.",
                "Reminder:  the man was awaiting trial. “innocent until proven guilty” is a fundamental presumption of law. Therefore, an innocent man is dead.",
                "Proud that I helped flip it blue, and left 9 months ago. Terrible, incompetent place. Over a million people now, and still incredible corruption, no investment or vision. Hella racist. It's terrible because it is absolutely beautiful up there, and obviously a ton of charm and great people left behind. I hope they nail the investigation and prove to the rest of the country they're really turning a new leaf. That poor family....",
                "So they beat him to death and they’re going to get away with it. Fuck this place",
                "> \"We know there is video. We know there are witnesses. We know there are answers. And we are demanding them.\"\n\nThis call for transparency rings loudly in the face of such disturbing secrecy from law enforcement. Body cams should be made public and all accounts from those present must be thoroughly investigated. Anything less would be unacceptable and further erode trust between communities and authorities."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Unsecured penguin caused helicopter crash in South Africa",
            "external_url": "https://www.bbc.com/news/articles/cn5xx036p4vo",
            "upvotes": 234,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9182/live/1deab150-1620-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "These tariff retaliations are getting out of hand.",
                "When will people learn… penguins can’t fly",
                "Activist penguins protesting tariffs will not be allowed in airports, despite being dressed for the occasion.",
                "Just smile and wave boys 👋 👋 👋 🐧 🐧 🐧 ",
                "Forgot to account for the penguin.  Such a rookie mistake.  \n\n\n> The aviation authority said the pilot conducted a \"risk assessment\" but omitted to include the transport of the penguin on board which \"was not in accordance with the Civil Aviation Regulations (CAR) 2011\".\n\nI’m glad all, including the penguin, were ok.  \n\n\n> While the helicopter sustained substantial damage, both the pilot and passengers were uninjured and the penguin was unharmed.",
                "See what happens when you tariff penguins? Fucking teorrirism.",
                "A warning for Trump to never mess with them.",
                "Secure your small, flightless birds people.  It’s not like they know any better!",
                "Should have slammed them with more tariffs.",
                "Heard and McDonald Islands draw first blood. It has begun."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 12321,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "Now we see what happens if the executive branch says “nah”",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)",
                "Who wants to bet that the Trump administration was stonewalling because they know Garcia is dead."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Planes clip wings at DCA with members of Congress on board",
            "external_url": "https://www.fox5dc.com/news/planes-collide-dca-per-members-congress-board",
            "upvotes": 8367,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2025/04/1280/720/gettyimages-2206556196-scaled.jpg?ve=1&tl=1",
            "top_comments": [
                "Flying to DCA is like playing a game of Russian Roulette.",
                "Based on the tweets, looks like 3 Congresspeople were involved:\n\n* Josh Gottheimer - NJ (Dem)\n* Nick LaLota - NY (Rep)\n* Grace Meng - NY (Dem)",
                "Now Congress will finally do something about it. Because Congress, especially Republicans, don't take any action unless it benefits them. ",
                "I hope this is a reminder to policymakers that when we say the agencies and programs they’re defunding benefit everyone, we literally mean *everyone*. Safety in transportation, health, food, weather — I could go on — is everyone’s business.",
                "Maybe dismantling the FAA was not a good idea?",
                "DOGE gutting the FAA means this will be increasingly common.",
                "If only Congress had some kind of funding and oversight role... Oh well...",
                "I’m about to google their voting records.  I was talking to people at work about how after the first few times I just thought the media was giving it extra attention because it was already in the cycle but it was getting weird, that was a few weeks ago",
                "About time the Congress clowns feel real world consequences for their bullshit",
                ">“Aviation mishaps are at an all-time high, and the Trump administration's reckless decision to fire FAA control staff has put us all in danger.”\n\nHonestly, it's scary, you know, thinking about how quickly things can go wrong, especially when critical safety measures are cut... the political games shouldn't be interfering with something so vital, and I really hope those involved in this incident are okay, because that's the main thing, and it does make you think twice about flying."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Gun goes off in child's bag in Maryland school days after similar gunfire in Virginia",
            "external_url": "https://www.nbcwashington.com/news/local/gun-goes-off-in-childs-bag-in-maryland-school-days-after-similar-gunfire-in-virginia/3889130/?utm_source=fark&utm_medium=website&utm_content=link&ICID=ref_fark",
            "upvotes": 833,
            "date": "04/10/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/charles-county-school-chopper-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The good news:\n\n> The child’s parents were arrested and charged with recklessly leaving a loaded, unsecured firearm so as to endanger the life or limb of a child under 14.",
                "9 years old, wow. Fumbling through his backpack for a piece of paper while it was in his lap and accidentally discharged the gun.",
                "Teachers should require the kids turn in their guns at the beginning of each class. Otherwise they are just too distracting.",
                "I'm all for responsible gun ownership.\n\n\nProblem is that too many gun owners think responsibility is a liberal conspiracy.",
                "Only in the US will you see this type of shit occur regularly, and a huge number of people content to do absolutely nothing.\n\nAnd a big contingent of people that will vehemently oppose any discussion about measures that can be taken to prevent this kind of occurrence. ",
                "Parents who mishandle guns that cause situations like this deserve severe prison time.\n\nI know it is unethical to remove parents from a kid, but there has to be examples made that if you do this, you go to prison for a long time and lose access to your kids.",
                "Child carrying loaded gun in US school lunch bag.\nOkay, I can see that.",
                "Maryland is pretty good about gun laws. They will go after the parents. ",
                "america wont restrict gun-access but they'll restrict voter rights. MURRICA",
                "Man it almost sounds like this kid is bringing a gun to school out of fear of all these shootings, it’s\nSad. Also fuck the parents for not securing their guns properly."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Apple airlifts 600 tons of iPhones from India 'to beat' Trump tariffs, sources say",
            "external_url": "https://www.reuters.com/technology/apple-airlifts-600-tons-iphones-india-to-beat-trump-tariffs-sources-say-2025-04-10/",
            "upvotes": 306,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They will still charge like it’s tariffed.",
                ">implying the total cargo of 600 tons comprised about 1.5 million iPhones\n\nWe can live without the newest iPhone, any chance of filling a few planes with prescription drugs?",
                "Omg when Trump finds out he will be so pissed at Tim Apple!",
                "How does this beat tariffs though?",
                "To avoid paying tariffs set up by the guy whose ass they kissed lol",
                "Isn't that just smuggling?"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "600 pounds of marijuana stolen from Colorado State Patrol evidence trailer",
            "external_url": "https://www.cbsnews.com/colorado/news/600-pounds-marijuana-stolen-colorado-state-patrol-evidence-trailer/",
            "upvotes": 1975,
            "date": "04/10/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/09/07/f34763e9-3dee-4b80-8995-7da7f19b1835/thumbnail/1200x630/e8d4ed11947b3b99ca6abb12e59ecbf8/colorado-state-patrol-csp-generic.png?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "Be on the lookout for a rookie raiding your local 7/11!",
                "“CSP said since this incident, they have completed a review that has identified gaps in the evidence facility’s security processes.” Ya don’t say?",
                "No reason to worry. It'll wind up being burned.",
                "That damn Johnny Chimpo is at it again!",
                "A 2007 Honda CRV isn't what always comes to mind when pulling off a 600lb weed heist, the older Chevrolet Silverado extended cab just makes sense though.",
                "I'm betting on the 15 year veteran with Cheeto stained fingers.",
                "On an unrelated note, a hundred pizzas just got sent to police headquarters.",
                "I bet that number changes every time it gets reported. One case of stolen drugs, and everybody gets to use it as a scapegoat .",
                "Just in time for the 4/20 holiday.",
                "Bet they can't blame it on the rats this time"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S. ambassador to Ukraine to resign her post early",
            "external_url": "https://www.cbsnews.com/news/bridget-brink-ambassador-to-ukraine-to-resign-sources/",
            "upvotes": 3218,
            "date": "04/10/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/10/39b5229b-43e7-4278-9303-4c8ce520d77f/thumbnail/1200x630/f91eb02747ff504eca7374fdba13b771/gettyimages-1400649409.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "She already submitted her resignation per article IN JANUARY but it was rejected by Rubio. \n\nI don’t blame her. On the other hand, I want her to stay…",
                "Rubio had opted to keep her on despite her resignation letter in January. I can't imagine the Trump administration has made her job easier though.",
                "How would you like to be the president of a country defending itself from the Russian military invasion, and your formerly strongest supporter was doing this:\n> Mr. Trump continues to sit on the nearly $4 billion in remaining U.S. military aid already designated for Ukraine.",
                "Explain in tariffs and spray tan terms.",
                "At a guess, she was unwilling to deliver Trump's \"Surrender to Russia or we kill you\" ultimatum.",
                "> “We will know soon enough, in a matter of weeks, not months, whether Russia is serious about peace or not. I hope they are.”\n\nIt's genuinely concerning that the Ambassador felt driven to resign, wouldn't you agree? The fact that vital military aid continues to be held back, really hinders Ukraine's ability to defend itself... it's a troubling situation, to say the least, and it's hard to imagine how much more pressure someone in that position could handle. I mean, it just all feels terribly wrong, all things considered.",
                "Bridget Brink is an exceptionally bright human being with a career dedicated to public service. She was appointed to ambassador positions by both Trump and Biden, and when I had the occasion to hear her talk in person she was incredibly well spoken.",
                "I wonder if this has to do with the word Russian.\n\nAfter a Russian missile hit Kryvi Rih a couple weeks ago she released a statement that condemned missiles falling on playgrounds...without specifying it was a *Russian* missile and leaving it ambiguous. \n\nPresident Zelensky condemned her response and accused the US of being afraid to say the word Russan. She since visited underground schools in Kharkiv and made sure to say that they are built to shelter from Russia missiles. \n\nIt was a goof, possibly a policy within the Whitehouse that advised her not to be critical of Russia and it cost her credibility with Ukrainians after a very impactful missile strike killed 9 children and sent Ukraine into a period of mourning.",
                "Russia is doing nothing to bring this war to an end. Ukraine is just defending itself. That's the only true narrative.",
                "Apparently the Whitehouse places equal blame for the Russian invasion.\n\n Putin has no interest in ending its occupation. If he was serious he wouldn't be bombing Ukraine every day, building up Russian troop numbers or involving North Korea and China. He's a bad faith actor."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 4782,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "Make showers golden again",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "The syphilis has finally taken control of trumps brain. 🧠"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Helicopter crashes in the Hudson River, NYPD says",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/10/helicopter-crashes-hudson-river-nypd-says/",
            "upvotes": 1638,
            "date": "04/10/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/IMZJKEMN4FGCDNA4UG42FL7YRM.jpg?auth=bb39d266455187d6f533d94d3bf1cc1ad0ec1db976f21db9ffe98bb5b6080edf&width=1200&height=600&smart=true",
            "top_comments": [
                "“The helicopter was carrying a pilot, two adults and three children, according to law enforcement sources. \n\nThe family members were tourists from Spain, sources said.”",
                "What a horrible year for aviation over bodies of water.",
                "I love flying, but you will never catch me on any kind of sightseeing company's helicopters.",
                "The video I saw of it falling [looks like it had lost its tail](https://x.com/xpertcommander/status/1910424640595312989)… so sad",
                "[NBC reporting ](http://nbcnewyork.com/new-york-city/helicopter-crash-hudson-river-live-updates/6220718/)that at least 5 people were on board, with 3 of them being children. Confirmed fatalities. Two of the kids taken to the hospital in critical condition.\n\nSounds like it was a family on a helicopter tour\n\nedit:[ AP is reporting that all 6 on board died](https://apnews.com/article/new-york-helicopter-crash-e0368ea529659ee1513d92dcbf05a28d)",
                "As awful as this is, its lucky it didn’t crash into a busy street or a building",
                "Looks like it broke apart in the air \n\n[https://x.com/dinoshanr/status/1910419164021621172](https://x.com/dinoshanr/status/1910419164021621172)",
                "There's a lot of things that fly and hover crashing lately. Is everyone drunk?",
                "Oh so now we know what happens when you disband the agency that checks the planes and helicopters for safety!",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "U.S. stocks slide again as euphoria over Trump's tariff pause starts to fade",
            "external_url": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
            "upvotes": 7100,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2Fc7%2F92a79a2c4836b9771d5e43dfba5d%2Fgettyimages-2208870658-1.jpg",
            "top_comments": [
                "The fomo yesterday gave way to math and realism overnight.",
                "You can bend a paperclip a few times. It'll hold.\n\nKeep bending it again and again and it breaks.",
                "China is now at 145% after clarification this morning and there’s still that’s blanket 10% on everyone else, and Mexico and Canada still at 25%.\n\nSo like, it’s not over, shits still going to get expensive and we won’t be able to afford the same amount of stuff we can right now.\n\nOh well. They’re doing an investigation on price gouging eggs! They’re fixing the eggs y’all!\n\nEdit: We are on track to wipe out most gains from yesterday, and might hit a circuit breaker today. Hope people didn't celebrate it, cause now they may look dumb.",
                "All this \"Yay! The market is up!\" Is so stupid\n\nIts still down over 6% in a month and down over 10% from the high\n\nTrump is still a disaster for the economy, its just less bad than it was 2 days ago, but its still bad lol",
                "Bond market is cratering and the Dow riding on feels. These bounces are all money making chances for the billionaires with inside scoops.",
                "Insider trading isn't a crime if youre the one writing the rules",
                "Do not try and play this market. Either you sold a week ago, or just buckle down.",
                "All the money was made yesterday, give them a few weeks, and they'll repeat what they did again.... They may have to investigate themselves for insider trading, but they won't find any wrong doing...",
                "When the timing’s right, we’re gonna see a tweet that he’s “dealing” with China just for a little boost. At this point the US economy might as well just be a pump and dump meme.",
                "If you want to see how corrupt the media is, look at all the headlines after the tariff reversal. \n\n“Stock Market soars” \n\n“US Stocks rally after Trump Tariff Reprieve” \n\n “US stocks skyrocket higher after Trump signals shift in trade policy”\n\nEvery headline puts a positive spin while completely ignoring the fact that it was an intentional and unnecessary drop because of stupid tariff threats. (And let’s not ignore that anyone with inside knowledge cashed out huge)."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "USDA to close down DC headquarters, lay off thousands of workers: report",
            "external_url": "https://www.fox5dc.com/news/usda-close-down-dc-headquarters-lay-off-thousands-workers-report",
            "upvotes": 12989,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2024/01/1280/720/Dept-of-Agriculture.jpg?ve=1&tl=1",
            "top_comments": [
                "As an FYI- the USDA is not just food. They also oversee RD, or Rural Development which a portion of subsidized housing very similar to HUD or Section 8. This housing subsidy helps very low income households pay rent each month. \n\n  \nLosing funding would make millions of people homeless.",
                "What the fuck. \n\nSo we can't get fruit from Mexico and our own farms no longer have insurance to cover the increasing terrible storms",
                "Cool, this should have zero negative ramifications",
                "Eh, my food was too safe anyway. Time to take a life altering gamble every time I eat a meal I guess....",
                "This is a plot to get more small farms to fail so large corps can buy the land",
                "I've been watching the new Daredevil series. Every episode, I'm disappointed by the sad truth that Wilson Fisk is less destructive than our own president.",
                "Welcome to The Jungle",
                "USDA's main funding—70% is to school lunch, WIC, SNAP and rural home loans. Crop insurance and rural infrastructure are important too. Gonna be a big hit to rural schools combined with DOE cuts.",
                "Glad I’m not looking for jobs in DC, which would probably going to be the unemployment capital of the U.S.",
                "Its so wonderful to wake up each day, go online, and see what other terrible, unconstitutional, illegal ccr4p Felon47 has done to further destroy our once great nation....i pr4y daily that you know who has a massive myocardial infarction...."
            ],
            "aggregate_sentiment": 37.0
        }
    ],
    "last_updated": "04/11/2025 00:41:48 UTC"
}