{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 23006,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If they say “yes” to him, Then the constitution no longer matters.",
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "Wow.  If the Supreme Court gives in to this......................then this is the end of the country as we know it.  No one will have a claim anymore to citizenship because any fancy lawyer can come along and justify a reason you have no jurisdiction here, no matter who you are.   The Founding Fathers themselves had no jurisdiction because, at the time, they were British subjects.  Now what?   Donald Trump cannot get away with this, or we're all done."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 9503,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This will fast track to SCOTUS",
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "Trump is the opposite of the saying, \"When uou do things right, people won't be sure you've done anything at all.\"  Like love or hate, Biden, all you want, at least for 4 years, we didn't have to deal with new shit every day.",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "This is why DOGE was deleting records and shredding paperwork. By mass deleting everything to non recoverability, they can’t actually rehire anyone because they have no paperwork to enable them to do so. It was a deliberate choice to destroy those records just in case they were forced to reinstate them, or if they were all thrown out of office and new management took over.",
                "Alright so the obvious question will be: “what happens when the Trump Administration tells this judge to kick rocks”?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 6298,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "> In a lengthy statement, Weldon said he assumed the White House withdrew his nomination because Sen. Susan Collins, R-Maine, had reservations, and Cassidy also planned to vote against him. \n\nOK, that's the excuse. What's the real reason? Because I find it hard to believe Collins having \"reservations\" is ever a showstopper.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What happened, did it turn out that he was qualified for the job?",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Canadians who visit US for more than 30 days will be fingerprinted",
            "external_url": "https://www.theguardian.com/world/2025/mar/13/canada-fingerprint-visit-us",
            "upvotes": 7740,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ba10c375cb1e5b1586ed64ae5133e0ac2597c5f2/0_120_3600_2161/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=668367ca2ae33ce304afbb4d7814f743",
            "top_comments": [
                "1996. The USA had Clinton, Canada had Chretien. The US economy was roaring, and the dot com boom was just taking off. And I learned in geography class that our nations had the largest friendly border in the world.\n\nFive years later the worst terrorist attack on US soil occurred. 15 of the hijackers were Saudi nationals. None of the terrorists entered through the Canadian border. For the first and only time, the USA invoked Article 5 of NATO, and Canada fought alongside the US for damn near two decades in Afghanistan. 165 of our soldiers died fighting for the US.\n\nToday the Trump administration - after cutting a deal with the enemy Taliban, one of the world's most repressive regimes - now takes a friendlier attitude to Saudi Arabia than it does Canada.  A sickening betrayal and a reversal on more than a century of friendship that will harm Canada, but it will also do the USA more harm than good.",
                "Canada to employ large handed border agents to cavity search US visitors.",
                "Canadians who come and stay for more than 30 days are likely to be wealthy snowbirds.\n\nDiscouraging them from visiting and treating them like criminals is a weird strategy. \n\nDo Canadians suddenly become criminal troublemakers after 30 days?\n\nA lot of European, Pacific, and Central and South American beach towns thank the USA for the boost in polite, wealthy tourists.",
                "I would just suggest that our Canadian friends not come here if you don’t absolutely have to. Our government is hostile, chaotic, unstable, and untrustworthy right now. Many of us are hoping to fix that problem in the future, but it is going to take a while to get there.",
                "Just like US midwesterners, there are a good sized number of Canadians who spend their winters in the US south and it’s a lot of money to the towns who cater to them. Many Canadians have been already reconsidering their winter homes and  I suspect this will be the last straw for most.  It will be devastating to these communities when Canadian dollars decide to stay in Canada   ",
                "From an American, Canadians please don't come here if this is going to happen. We care about you and your safety. Stay out of here until we can burn this shit out.",
                "It has been embarrassing to be an American since November…. Apologies to my Canadian friends",
                "I'm canadian and my partner and I were planning to go back to NYC for our 15th anniversary. We go to the US every 2 years or so, each time spending ~5k$ for hotels, foods, drinks and entertainment over the course of a weekend.\n\nWe decided to forgo going to the US, we'll be going elsewhere in Canada or doing longer Europe trips.\n\nShit like this changes habits and will _decimate_ the US tourism industry.\n\nI can live without a broadway show, I can't live with being treated as a criminal for trying to give you guys money.",
                "As long as Trump is in power, I will never travel to the US to spend my hard earned money again.",
                "Fellow Canadians, if war ever breaks out I will be helping you guys"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Dow slides and S&P closes in correction as Trump’s trade war escalates",
            "external_url": "https://www.cnn.com/2025/03/13/investing/us-stocks-global-trade-tensions",
            "upvotes": 2990,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25062863572137.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The stock market is not the problem. It's the recession that I'm worried about.\n\nPeople will lose their jobs just when their 401Ks are low. Sad.",
                "Honestly, Donald just seems like the kind of guy to preheat a microwave.",
                "Let’s see how long the money puts up with this",
                "Trump 💩is killing the USA",
                "trump and his minions are going to make a killing  make it fall buy cheap",
                "Jesus fucking Christ ! Can I please get 1 decade where this bullshit doesn't happen?",
                "It really should not be this easy to fuck things up this much.",
                "Great Depression 2 is here, y'all.",
                "Is \"correction\" another term for economic suicide?",
                "But it will be the greatest depression anyone has ever seen.  They will write about it …"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Jewish protesters flood Trump Tower's lobby to demand the Columbia University activist's release",
            "external_url": "https://apnews.com/article/columbia-university-protests-khalil-trump-tower-8e2f455134a2f1b82458e32aecbb59f7",
            "upvotes": 5545,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Jewish people having a problem with agents of the state disappearing someone without the government publicly saying what he did wrong?\n\nWeird.",
                "As a jew -- and one who certainly does not agree with everything this activist says -- much, MUCH more of this please.\n\nNo extrajudicial governmental disappearances. Ever. No matter the disagreement. That is a hallmark of fascism, as if we needed any further evidence of the unhinged authoritarian tendencies of this administration.",
                "trump: they’re all Palestinians, members of Hamas just like Schumer…",
                "Ok but Fox News was telling me these were all anti semetic protesters who hate America. Why would they say that? /s",
                "Okay, how long until they're labeled as Hamas supporters and/or paid agitators?",
                "Hell yeah! Solidarity",
                "Wonder if Jon Stewart is ready to call him fascist yet",
                "Many Jews in the US are not supporters of Trump and his policies. What Trump is doing is an attack on our freedom.",
                "\"Its not just the right of the person who speaks to be heard, it is the right of everyone in the audience to listen and to hear, and every time you silence somebody you make yourself a prisoner of your own action because you deny yourself the right to hear something.\"\n\n\" Bear in mind, ladies and gentlemen, that every time you violate or propose to violate the free speech of someone else you, in potentia, you're making a rod for your own back because the other question raised by justice Oliver Wendell Holmes is simply this: \"Whose going to decide? To whom do you reward the right to decide which speech is harmful? Or who is the harmful speaker? Or to determine in advance what are the harmful consequences going to be that we know enough about in advance to prevent? To whom would you give this job? To whom are you going to award the task of being the censor?\"\n\n- Christopher Hitchens - On free Speech",
                "Let me guess, they're anti-semitic too?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "British Columbia woman detained at U.S. border, sent to Arizona detention facility in chains",
            "external_url": "https://vancouversun.com/news/bc-woman-detained-at-us-border-sent-to-arizona-detention-facility",
            "upvotes": 31273,
            "date": "03/13/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/jasmine-mooney_294005028.jpg",
            "top_comments": [
                "\"We eventually learned that about 30 people, including Jasmine, were removed from their cells at 3 a.m. and transferred to the San Luis Detention Center in Arizona. They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.”\n\nCruel and unusual.",
                "\n#Canadian Woman Detained at US Border in Harrowing Ordeal\n\nA British Columbia woman has found herself trapped in a nightmare after being unexpectedly detained at the US border and transferred to an Arizona detention centre under conditions her family describes as inhumane.\n\nJasmine Mooney, a 35-year-old businesswoman from Abbotsford, was attempting to enter the United States through the San Ysidro border crossing between Mexico and San Diego on 3 March. She had hoped to apply for a Trade NAFTA (TN) work visa, but her paperwork was incomplete. Instead of being turned away or allowed to rectify the issue, she was arrested by US border officers and placed in detention.\n\nWhat followed has left her mother, Alexis Eagles, desperate for answers. After three nights at a San Diego detention centre, Mooney was handed over to US Immigration and Customs Enforcement. For a brief moment, her family thought she had been released when an online tracking system marked her as free. Then she vanished.\n\nPanic set in when hours turned into a full day with no word from her. Eventually, the family learned that Mooney and around thirty others had been pulled from their cells in the middle of the night and transported to the San Luis Detention Center in Arizona. There, according to reports from inside, she has been crammed into a concrete cell with no natural light, harsh fluorescent bulbs that never switch off, no proper bedding and limited bathroom facilities.\n\nMooney has not been charged with any crime. She has no criminal record. She has simply been caught in a bureaucratic nightmare that has left her in chains, awaiting a resolution that remains unclear.\n\nHer mother is not disputing the right of US authorities to refuse Mooney entry. She does, however, take issue with the treatment her daughter is enduring. Mooney herself, in text messages to a business partner, described the conditions as \"inhumane.\" The women in detention are sleeping on mats, the food is barely edible, and the lights make proper rest impossible. Despite the circumstances, Mooney has tried to stay strong, telling her friend that she is in a better position than others and must keep going.\n\nMooney is no stranger to hard work. She built a career in Vancouver’s hospitality industry after moving there from the Yukon in 2008, later expanding into the health and wellness sector. Her most recent work had her involved in Los Angeles, where she had previously been granted a TN work visa. That visa was revoked in November last year when she attempted to return to the US after a vacation. This time, hoping to secure another visa, she took the route that had worked for her before, crossing from Mexico. It was a decision that led to an ordeal beyond anything she could have imagined.\n\nHer business partner, BJ McCaslin, has been in touch with her through a prison communication app and is deeply concerned. He does not understand why she remains detained when there is no evidence of wrongdoing.\n\nGlobal Affairs Canada has acknowledged Mooney's detention and confirmed that consular officials are in contact with US authorities. Beyond that, they say little can be done. While governments may express concern, they rarely intervene when another country enforces its own immigration rules.\n\nThat leaves Mooney and her family in an agonising state of limbo. They are not asking for special treatment, only basic human decency. For now, all they can do is wait, and hope that her ordeal does not stretch on indefinitely.",
                "THIS is another reason for Canadians to avoid all US travel.",
                "Perhaps countries should issue travel advisories for the U.S.",
                "And the other people in her situation don't even have a resourceful Canadian mom to get attention to their cause, so even if the poor woman who in no way deserves this random act of cruelty by the US regime is released the problem remains",
                "The Terror begins. To be clear, this woman was detained because her application to renew her work visa was incomplete. That's it. That's all she did and she ended up in a cell for a week with nothing but a mat and rotten food.",
                "How're the US supposed to host the world cup next year if they're putting loads of people in chains??\n\nI have a feeling foreigners may want to stay away and stadiums will be empty af",
                "Why not just turn her back? There’s no reason to lock her up. I hope they get the ACLU involved. She has constitutional rights and they’re being violated.",
                "So I’ve been reading a book recently (When Mckinsey comes to town) and it says during the first Trump admiration many ICE employees had begun to find the work distasteful based on the orders coming from the government at that time, as well as bad press. As a result ICE was struggling to find and retain employees. The solution? Change hiring practices to recruit neckbeards who get a kick out of having the power to detain and arrest people. Basically adult Eric Cartmans demanding “respect ma authoritah!” It’s all Trump loyalists now. Same goes for many police forces.",
                "Historically, paperwork issues like this at the US border result in immediate deportation. Like, *immediate.* Guards grab you and frog-march you to the next flight to your home country with zero recourse. \n\nWhile that’s already ridiculous, this woman’s case is a new level. They already had the chance to deport her the “traditional” way. They refused. They chose instead to retain her in this country and imprison her at taxpayer expense. \n\nTrump supporters, make it make sense. Why are your boys keeping them here instead of sending them home, if they are so scary and dangerous?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1137,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "[removed]",
                "I hope Elon loses another 30 billion this week ….",
                "Are they sure it wasn’t the self driving software?",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. ",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "How do you steal a Tesla when everything’s computer?",
                "What did the river do to deserve that?",
                "Just put that shit in some rice"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Ayo Edebiri ‘got insane death threats’ after Elon Musk shared fake report about Pirates of the Caribbean casting | Movies",
            "external_url": "https://www.theguardian.com/film/2025/mar/12/ayo-edebiri-got-insane-death-threats-after-elon-musk-shared-fake-report-about-pirates-of-the-caribbean-casting",
            "upvotes": 11011,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f177e2f93bdfbad4a59315adf7ca12135d9e10d0/0_0_3828_2297/master/3828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6c37eab200b27b17b52533c0edb15ce",
            "top_comments": [
                "> The Bear actor called Musk a fascist and an idiot after his reaction to a post from a rightwing account that claimed she was replacing Johnny Depp.\n\nThis man needs to lose another hundred billion+ in net worth and fade into obscurity. We also need to stop ignoring the severity of online harassment.",
                "> Responding to Edebiri’s post on Wednesday, the owner of the original account said: “I clearly stated ‘reportedly’ because it was the latest information coming from credible Hollywood sources. And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.\n\nSome people are fucking cultish and weird",
                "A dark-skinned person in the Caribbean? Who would have thought?",
                "[removed]",
                "The owner of the X account said, \"And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.” \n\nI can't even..",
                "Now that the government is a goner well never get this but boy do we need to start revamping how society treats digital threata in general and especially anonymous digital threats.",
                "She is fucking Caribbean!! People are insane.",
                "Why can’t the x outage be more permanent!?",
                "I remember in the 90s and early 2000s there was serious concern about online cyber bullying and death threats. There was a lot of talk about passing laws to stop it and most closely regulate these platforms. \n\nThen big tech got into bed with the government and everyone became “free speech absolutists”. \n\nNo other culture at no other point in history would allow this sort of shit to persist like we have.",
                "Elon about to clarify: \"This is Ukraine's fault\"."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Columbia University expels some students who seized building last year, suspends others",
            "external_url": "https://www.cbsnews.com/newyork/news/columbia-university-protest-expulsions-suspension/",
            "upvotes": 1438,
            "date": "03/13/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/04/30/b9b52e61-44ff-4e31-9d62-7323ffe2f139/thumbnail/1200x630/130ddf3519e72011a40229f1bee35cbb/gettyimages-2150288162.jpg?v=906a31f1d4c74cf15e139a5e9bae4f67",
            "top_comments": [
                ">temporarily revoked the diplomas of some students who have since graduated.\n\nWhat does \"temporarily revoked\" mean? How do they get unrevoked?",
                "Honestly isnt the consequences of a protest what make it so impactful? Its not like we look at the civil rights movement and give it so much reverance because black people were politely asked to leave the white only restaurant. ",
                "https://en.wikipedia.org/wiki/1968_Columbia_University_protests\n\nThe protests of 1968 and the way the university handled them led to a decrease in donations for 20 years.  \n\nFor a University it really isn't learning...",
                "Say what you want about their right to protest but you ain’t doing yourself any favors by committing a hostile takeover of a university building",
                "Columbia invited NAZI’s to speak on their campus in the 1930’s and expelled the students protesting AGAINST NAZI’s. Fuck them. The school, not the protestors.",
                "For those who this that this is wrong due to the first amendment, you should really make sure you k ow what the first amendment does.\n\nIt means THE GOVERMENT cannot punish you for things like speech. Columbia can punish you for speech it doesn't like, and probably laid out situations like this in the student handbook",
                "Yeah i don’t really see an issue expelling kids who actively took over a building. People protesting in outside shouldn’t have any action done against them.",
                "This just in: First Amendment still doesn’t cover occupying buildings and vandalism. Using Trump pardoning rioters doesn’t make it less true, it just means Colombia has higher standards ",
                "[deleted]",
                "Are they doing this expecting Trump to reverse the recent cuts to grant funding, or are they only doing it to stop Trump from cutting even more funding?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Apple accused of discrimination for telling employee to stop wearing jewellery supporting Gaza",
            "external_url": "https://www.abc.net.au/news/2025-03-13/apple-accused-discrimination-jewellery-supporting-gaza/105042996",
            "upvotes": 4,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2b158d5aa18917d229c4f2bd195f2dbf?impolicy=wcms_watermark_news&cropH=2354&cropW=4185&xPos=414&yPos=1147&width=862&height=485&imformat=generic",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 326,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "Because they're making shit up.",
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "The don't know what malfeasance means so ...",
                "Conservatives: The rules were you weren't going to fact-check!",
                "The judicial branch is the only (faint) hope left.",
                "If we ever get a presidential election again, Chutkan to the Supreme Court please.",
                "An oil tycoon is running the EPA what do you think his agenda is."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Federal Cuts Prompt Johns Hopkins to Cut More Than 2,000 Workers",
            "external_url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.304.EFUS.chI-h1pFmD5L&smid=nytcore-android-share",
            "upvotes": 207,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Someone who needed medical care might die. But hey - those three trans kids in the entire state of Idaho won’t get to play sports so worth it, amiright?",
                "Hey let’s screw up the best medical research hospital in the whole freaking world. That sounds like a great idea! /s",
                "Are we great again yet?",
                "So this is what so called conservatives completely miss in the fed cut conversation. Absolutely no concept of the multiplier effect of government spending. At this point I’m convinced that they fall into one of two camps:  The truly clueless and the 1% who are trying to intentionally drive markets into the dirt so they can snatch up the bargains.",
                "2000 more families with upended lives",
                "There's going to be so many down stream job losses from this. Most of these cuts were well paid middle-class jobs. How many restaurants, landscapers, maids and pretty much anything that's not a basic need might go under because they just lost 10-20% of their business? And how many more from those going out of business?",
                "This is like refusing to water a tree that will later provide fruit and shade.",
                "While the Trump admin is ultimately at fault, it's also wild that JHU is laying off people while sitting on their 13 BILLION dollar endowment. They notably laid people off during COVID and didn't touch the endowment then either.",
                "Ok I hate all these cuts to research funding. But I can say, admin bloat is a real problem in medical schools that resounds with med students across the country. Just as two examples:\n\nI was asked to write a thank you letter by a scholarship coordinator. I asked if I needed to do it again since I did it last year. She didn't know and asked scholarship coordinator II who didn't know and asked some other donor coordinator to get an answer. \n\nAnother time I had to shoot a question about rural housing on an away rotation from housing coordinator, to south west housing coordinator, to the rotation site's housing coordinator. I was one of 2 students that month in that town. We have our own on campus housing coordinator. \n\nFurther our dual degree coordinator was doing a bad job that both students and the co-directors complained multiple times. The Dean said they couldn't fire her. Only wait for someone to retire to move her over to something else. Took 2 years. It's weird. \n\nMedical schools struggle to find ways to deal with stricter budgets and will cut things like research and journal club food and out of town speakers and lab resources....but loooove admin bloat for whatever reason",
                "The federal cuts are obviously bad, but doesn’t Johns Hopkins have like a $13 billion endowment? That seems more than enough to keep those people employed.\n\nGives me similar vibes as a billionaire laying off their household staff because taxes went up and then complaining about that as being the reason for the lost jobs."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1135,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "[removed]",
                "I hope Elon loses another 30 billion this week ….",
                "Are they sure it wasn’t the self driving software?",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. ",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "How do you steal a Tesla when everything’s computer?",
                "What did the river do to deserve that?",
                "Just put that shit in some rice"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Columbia University expels some students who seized building last year, suspends others",
            "external_url": "https://www.cbsnews.com/newyork/news/columbia-university-protest-expulsions-suspension/",
            "upvotes": 1438,
            "date": "03/13/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/04/30/b9b52e61-44ff-4e31-9d62-7323ffe2f139/thumbnail/1200x630/130ddf3519e72011a40229f1bee35cbb/gettyimages-2150288162.jpg?v=906a31f1d4c74cf15e139a5e9bae4f67",
            "top_comments": [
                ">temporarily revoked the diplomas of some students who have since graduated.\n\nWhat does \"temporarily revoked\" mean? How do they get unrevoked?",
                "Honestly isnt the consequences of a protest what make it so impactful? Its not like we look at the civil rights movement and give it so much reverance because black people were politely asked to leave the white only restaurant. ",
                "https://en.wikipedia.org/wiki/1968_Columbia_University_protests\n\nThe protests of 1968 and the way the university handled them led to a decrease in donations for 20 years.  \n\nFor a University it really isn't learning...",
                "Say what you want about their right to protest but you ain’t doing yourself any favors by committing a hostile takeover of a university building",
                "Columbia invited NAZI’s to speak on their campus in the 1930’s and expelled the students protesting AGAINST NAZI’s. Fuck them. The school, not the protestors.",
                "For those who this that this is wrong due to the first amendment, you should really make sure you k ow what the first amendment does.\n\nIt means THE GOVERMENT cannot punish you for things like speech. Columbia can punish you for speech it doesn't like, and probably laid out situations like this in the student handbook",
                "Yeah i don’t really see an issue expelling kids who actively took over a building. People protesting in outside shouldn’t have any action done against them.",
                "This just in: First Amendment still doesn’t cover occupying buildings and vandalism. Using Trump pardoning rioters doesn’t make it less true, it just means Colombia has higher standards ",
                "[deleted]",
                "Are they doing this expecting Trump to reverse the recent cuts to grant funding, or are they only doing it to stop Trump from cutting even more funding?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Seattle man shot in argument after throwing chicken bone out car window",
            "external_url": "https://www.fox13seattle.com/news/seattle-shot-argument-chicken-bone",
            "upvotes": 201,
            "date": "03/13/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/03/1280/720/vlcsnap-2025-03-10-21h13m09s571.jpg?ve=1&tl=1",
            "top_comments": [
                "I live in Atlanta and people do this shit (throwing chicken bones wherever the fuck they want) and it's annoying as hell\n\n\nIt's such a problem that \"WingsOfAtl\" was a thing on IG\n\n\nTruly fuck people who throw chicken bones everywhere",
                "Guess that guy really did have a bone to pick with him",
                "Sounds like everyone involved is absolute trash.",
                "Not to downplay the crazy in this story, but who throws chicken bones out a window?  Is it difficult to hold onto the bones until you're done and then put them in the trash?  He didn't deserve to get shot over it, but that was trashy (pun might be intended).",
                "Anddd .... he's fund raising for his medical bills (per the article, no donations as of 7:15 pm EST).\n\nWhile I don't support chicken bone shooters, I don't support chicken bones litterers either. It'll interesting to see how much he gets.",
                "In the criminal justice system, poultry-based offences are considered especially hen-nous.\n\nIn Seattle, the dedicated detectives who investigate these vicious fowlenies are members of an elite squad known as the Special Chickens Unit.\n\nThese are their stories.\n\nBUCK BUCK",
                "Safeway is fine and all, but i would straight up shoot someone for some Ezell's Fried Chicken.",
                "Sheesh. Over a bone? Dun dun dun… the plot chickens.",
                "🎵Chicken wing, chicken wing🎵\n\n🎵Hot dog and b-🎵   \\*blam\\* \\*blam\\*",
                "At least the guy almost died for something truly worthwhile. /s"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Judge orders thousands of fired probationary federal employees reinstated",
            "external_url": "https://abcnews.go.com/Politics/judge-order-fired-probationary-federal-employees-reinstated/story?id=119759494&utm_source=firefox-newtab-en-us",
            "upvotes": 1654,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/33527c63-6061-4041-9e5e-40638ea47a20/va-sign-gty-jt-250305_1741204881419_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> He also prohibited the Office of Personnel Management from issuing any guidance about whether employees can be terminated.\n\nThis is getting to the heart of the matter.  This is like if the accounting department called the engineering department and started laying people off.  When they don't have that power - their job is to check the numbers and pay the bills.  HR has the power to lay someone off **as directed by the department with that ability**.\n\nAll along, DOGE has been showing up, declaring they have the power to fire people, cancel contracts, and halt spending - but they can't seem to show where Congress authorized them.\n\n> The judge slammed the attorney representing the Justice Department for refusing to make OPM Acting Director Charles Ezell available for cross-examination and for withdrawing his sworn declaration, which the judge called a \"sham.\"\n\nRight.  Because in the end - they **don't** have that power, and they've been acting like they do.  And now that people are pulling back the sheet and saying \"Hey - who is this ketamine burned out weirdo behind the curtain - they're a humbug!\" we see this is just a coup by another name.\n\nIt's not about saving money.  It's about executive outreach masquerading as \"fixing problems\" when it's really taking Congress's power to decide where money is spent and saying \"No - I don't like that law so I'll just ignore it.  Oh - and find money to pay for Starlink contracts, and let's get rid of the people investigating why the fuck Space X rockets are allowed to blow up and reroute flights and threaten people's lives.\"",
                "Assuming they will get back pay, now we paid all of these employees to do nothing for weeks. I saw a park ranger on MSNBC and she said she saw a memo they were getting back pay.",
                "Been something of a fan of Alsup ever since he went to the effort of teaching himself Java to make a better informed ruling in the first round of the Oracle v Google case years ago. This is a guy who should have been elevated to the 9th Circuit or even SCOTUS under Obama or Biden. May not always agree with the rulings I see coming from his bench, but you can generally be sure they were well considered and based on the law.",
                "Another well thought out Musk plan. \"Fake it until you make it\" stuff.",
                "Is this the glimmer of hope for the US?",
                "Can a judge order the firing of the main clown 🤡 that’s in charge?\n\nI know the answer but it’s wishful thinking.",
                "And Emperor Musk will just ignore it. The courts are powerless without a way to physically enforce their rulings.",
                "Don’t go back without double pay.",
                "Republicans are praising him for saving money or something but he’s literally just wasting time and money and resources doing stupid impulsive shit",
                "After Schumer fucks us tomorrow, the firings will be legal."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 23014,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If they say “yes” to him, Then the constitution no longer matters.",
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "Wow.  If the Supreme Court gives in to this......................then this is the end of the country as we know it.  No one will have a claim anymore to citizenship because any fancy lawyer can come along and justify a reason you have no jurisdiction here, no matter who you are.   The Founding Fathers themselves had no jurisdiction because, at the time, they were British subjects.  Now what?   Donald Trump cannot get away with this, or we're all done."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Dow slides and S&P closes in correction as Trump’s trade war escalates",
            "external_url": "https://www.cnn.com/2025/03/13/investing/us-stocks-global-trade-tensions",
            "upvotes": 2987,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25062863572137.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The stock market is not the problem. It's the recession that I'm worried about.\n\nPeople will lose their jobs just when their 401Ks are low. Sad.",
                "Honestly, Donald just seems like the kind of guy to preheat a microwave.",
                "Let’s see how long the money puts up with this",
                "Trump 💩is killing the USA",
                "trump and his minions are going to make a killing  make it fall buy cheap",
                "Jesus fucking Christ ! Can I please get 1 decade where this bullshit doesn't happen?",
                "It really should not be this easy to fuck things up this much.",
                "Great Depression 2 is here, y'all.",
                "Is \"correction\" another term for economic suicide?",
                "But it will be the greatest depression anyone has ever seen.  They will write about it …"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Cop delivers pizza after delivery driver finds 8-foot alligator hiding under customer's car",
            "external_url": "https://abcnews.go.com/US/cop-delivers-pizza-after-delivery-driver-finds-8/story?id=119743080",
            "upvotes": 153,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4bff9eae-2228-4363-a8f9-3590d1ca70c0/alligator-pizza-delivery_1741850952876_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "Read the title, thought it must be Florida, clicked the link -> Florida.",
                "Plot twist, the pizza was for the alligator 🐊 🍕",
                "I lived in south Florida for five years and this is so common. I love how the old gal was so nonplussed about the whole situation. She clearly has been in the Sunshine State for a while.",
                "Alligator ordered delivery.",
                " 30 years of delivering pizza in Florida. I’m guessing a young kid new transplant to Florida. This happens almost everyday. I pass by at least two that I can see on my way to work everyday. Plus, call FWC, cops don’t get paid to wrestle scaley puppers.",
                "Holy smokes that’s pretty crazy!",
                "I laughed cus the cop was trying to be firm with her, and then we saw him holding her phone to take a photo of the alligator for her 😆",
                "\"How much was the pizza?\"\n\n\"I have no idea, I'm not the pizza man\".\n\n  \nAfter the lady wouldn't get away from the damn alligator, haha.",
                "A Hero in Blue, A Pizza in Hand!\n\nA delivery driver was in for a shock when an 8-foot alligator lurked under a customer’s car. Instead of just calling animal control, a kind-hearted cop stepped in—not just to handle the gator but also to deliver the pizza!\n\nNow that’s what we call \"protect & serve\"—with extra cheese! 🔥"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 329,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "Because they're making shit up.",
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "The don't know what malfeasance means so ...",
                "Conservatives: The rules were you weren't going to fact-check!",
                "The judicial branch is the only (faint) hope left.",
                "If we ever get a presidential election again, Chutkan to the Supreme Court please.",
                "An oil tycoon is running the EPA what do you think his agenda is."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Federal Cuts Prompt Johns Hopkins to Cut More Than 2,000 Workers",
            "external_url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.304.EFUS.chI-h1pFmD5L&smid=nytcore-android-share",
            "upvotes": 207,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Someone who needed medical care might die. But hey - those three trans kids in the entire state of Idaho won’t get to play sports so worth it, amiright?",
                "Hey let’s screw up the best medical research hospital in the whole freaking world. That sounds like a great idea! /s",
                "Are we great again yet?",
                "So this is what so called conservatives completely miss in the fed cut conversation. Absolutely no concept of the multiplier effect of government spending. At this point I’m convinced that they fall into one of two camps:  The truly clueless and the 1% who are trying to intentionally drive markets into the dirt so they can snatch up the bargains.",
                "2000 more families with upended lives",
                "There's going to be so many down stream job losses from this. Most of these cuts were well paid middle-class jobs. How many restaurants, landscapers, maids and pretty much anything that's not a basic need might go under because they just lost 10-20% of their business? And how many more from those going out of business?",
                "This is like refusing to water a tree that will later provide fruit and shade.",
                "While the Trump admin is ultimately at fault, it's also wild that JHU is laying off people while sitting on their 13 BILLION dollar endowment. They notably laid people off during COVID and didn't touch the endowment then either.",
                "Ok I hate all these cuts to research funding. But I can say, admin bloat is a real problem in medical schools that resounds with med students across the country. Just as two examples:\n\nI was asked to write a thank you letter by a scholarship coordinator. I asked if I needed to do it again since I did it last year. She didn't know and asked scholarship coordinator II who didn't know and asked some other donor coordinator to get an answer. \n\nAnother time I had to shoot a question about rural housing on an away rotation from housing coordinator, to south west housing coordinator, to the rotation site's housing coordinator. I was one of 2 students that month in that town. We have our own on campus housing coordinator. \n\nFurther our dual degree coordinator was doing a bad job that both students and the co-directors complained multiple times. The Dean said they couldn't fire her. Only wait for someone to retire to move her over to something else. Took 2 years. It's weird. \n\nMedical schools struggle to find ways to deal with stricter budgets and will cut things like research and journal club food and out of town speakers and lab resources....but loooove admin bloat for whatever reason",
                "The federal cuts are obviously bad, but doesn’t Johns Hopkins have like a $13 billion endowment? That seems more than enough to keep those people employed.\n\nGives me similar vibes as a billionaire laying off their household staff because taxes went up and then complaining about that as being the reason for the lost jobs."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1134,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "[removed]",
                "I hope Elon loses another 30 billion this week ….",
                "Are they sure it wasn’t the self driving software?",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. ",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "How do you steal a Tesla when everything’s computer?",
                "What did the river do to deserve that?",
                "Just put that shit in some rice"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Jewish protesters flood Trump Tower's lobby to demand the Columbia University activist's release",
            "external_url": "https://apnews.com/article/columbia-university-protests-khalil-trump-tower-8e2f455134a2f1b82458e32aecbb59f7",
            "upvotes": 5549,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Jewish people having a problem with agents of the state disappearing someone without the government publicly saying what he did wrong?\n\nWeird.",
                "As a jew -- and one who certainly does not agree with everything this activist says -- much, MUCH more of this please.\n\nNo extrajudicial governmental disappearances. Ever. No matter the disagreement. That is a hallmark of fascism, as if we needed any further evidence of the unhinged authoritarian tendencies of this administration.",
                "trump: they’re all Palestinians, members of Hamas just like Schumer…",
                "Ok but Fox News was telling me these were all anti semetic protesters who hate America. Why would they say that? /s",
                "Okay, how long until they're labeled as Hamas supporters and/or paid agitators?",
                "Hell yeah! Solidarity",
                "Wonder if Jon Stewart is ready to call him fascist yet",
                "Many Jews in the US are not supporters of Trump and his policies. What Trump is doing is an attack on our freedom.",
                "\"Its not just the right of the person who speaks to be heard, it is the right of everyone in the audience to listen and to hear, and every time you silence somebody you make yourself a prisoner of your own action because you deny yourself the right to hear something.\"\n\n\" Bear in mind, ladies and gentlemen, that every time you violate or propose to violate the free speech of someone else you, in potentia, you're making a rod for your own back because the other question raised by justice Oliver Wendell Holmes is simply this: \"Whose going to decide? To whom do you reward the right to decide which speech is harmful? Or who is the harmful speaker? Or to determine in advance what are the harmful consequences going to be that we know enough about in advance to prevent? To whom would you give this job? To whom are you going to award the task of being the censor?\"\n\n- Christopher Hitchens - On free Speech",
                "Let me guess, they're anti-semitic too?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 9500,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This will fast track to SCOTUS",
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "Trump is the opposite of the saying, \"When uou do things right, people won't be sure you've done anything at all.\"  Like love or hate, Biden, all you want, at least for 4 years, we didn't have to deal with new shit every day.",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "This is why DOGE was deleting records and shredding paperwork. By mass deleting everything to non recoverability, they can’t actually rehire anyone because they have no paperwork to enable them to do so. It was a deliberate choice to destroy those records just in case they were forced to reinstate them, or if they were all thrown out of office and new management took over.",
                "Alright so the obvious question will be: “what happens when the Trump Administration tells this judge to kick rocks”?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Columbia University expels some students who seized building last year, suspends others",
            "external_url": "https://www.cbsnews.com/newyork/news/columbia-university-protest-expulsions-suspension/",
            "upvotes": 1439,
            "date": "03/13/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/04/30/b9b52e61-44ff-4e31-9d62-7323ffe2f139/thumbnail/1200x630/130ddf3519e72011a40229f1bee35cbb/gettyimages-2150288162.jpg?v=906a31f1d4c74cf15e139a5e9bae4f67",
            "top_comments": [
                ">temporarily revoked the diplomas of some students who have since graduated.\n\nWhat does \"temporarily revoked\" mean? How do they get unrevoked?",
                "Honestly isnt the consequences of a protest what make it so impactful? Its not like we look at the civil rights movement and give it so much reverance because black people were politely asked to leave the white only restaurant. ",
                "https://en.wikipedia.org/wiki/1968_Columbia_University_protests\n\nThe protests of 1968 and the way the university handled them led to a decrease in donations for 20 years.  \n\nFor a University it really isn't learning...",
                "Say what you want about their right to protest but you ain’t doing yourself any favors by committing a hostile takeover of a university building",
                "Columbia invited NAZI’s to speak on their campus in the 1930’s and expelled the students protesting AGAINST NAZI’s. Fuck them. The school, not the protestors.",
                "For those who this that this is wrong due to the first amendment, you should really make sure you k ow what the first amendment does.\n\nIt means THE GOVERMENT cannot punish you for things like speech. Columbia can punish you for speech it doesn't like, and probably laid out situations like this in the student handbook",
                "Yeah i don’t really see an issue expelling kids who actively took over a building. People protesting in outside shouldn’t have any action done against them.",
                "This just in: First Amendment still doesn’t cover occupying buildings and vandalism. Using Trump pardoning rioters doesn’t make it less true, it just means Colombia has higher standards ",
                "[deleted]",
                "Are they doing this expecting Trump to reverse the recent cuts to grant funding, or are they only doing it to stop Trump from cutting even more funding?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Judge orders thousands of fired probationary federal employees reinstated",
            "external_url": "https://abcnews.go.com/Politics/judge-order-fired-probationary-federal-employees-reinstated/story?id=119759494&utm_source=firefox-newtab-en-us",
            "upvotes": 1651,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/33527c63-6061-4041-9e5e-40638ea47a20/va-sign-gty-jt-250305_1741204881419_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> He also prohibited the Office of Personnel Management from issuing any guidance about whether employees can be terminated.\n\nThis is getting to the heart of the matter.  This is like if the accounting department called the engineering department and started laying people off.  When they don't have that power - their job is to check the numbers and pay the bills.  HR has the power to lay someone off **as directed by the department with that ability**.\n\nAll along, DOGE has been showing up, declaring they have the power to fire people, cancel contracts, and halt spending - but they can't seem to show where Congress authorized them.\n\n> The judge slammed the attorney representing the Justice Department for refusing to make OPM Acting Director Charles Ezell available for cross-examination and for withdrawing his sworn declaration, which the judge called a \"sham.\"\n\nRight.  Because in the end - they **don't** have that power, and they've been acting like they do.  And now that people are pulling back the sheet and saying \"Hey - who is this ketamine burned out weirdo behind the curtain - they're a humbug!\" we see this is just a coup by another name.\n\nIt's not about saving money.  It's about executive outreach masquerading as \"fixing problems\" when it's really taking Congress's power to decide where money is spent and saying \"No - I don't like that law so I'll just ignore it.  Oh - and find money to pay for Starlink contracts, and let's get rid of the people investigating why the fuck Space X rockets are allowed to blow up and reroute flights and threaten people's lives.\"",
                "Assuming they will get back pay, now we paid all of these employees to do nothing for weeks. I saw a park ranger on MSNBC and she said she saw a memo they were getting back pay.",
                "Been something of a fan of Alsup ever since he went to the effort of teaching himself Java to make a better informed ruling in the first round of the Oracle v Google case years ago. This is a guy who should have been elevated to the 9th Circuit or even SCOTUS under Obama or Biden. May not always agree with the rulings I see coming from his bench, but you can generally be sure they were well considered and based on the law.",
                "Another well thought out Musk plan. \"Fake it until you make it\" stuff.",
                "Is this the glimmer of hope for the US?",
                "Can a judge order the firing of the main clown 🤡 that’s in charge?\n\nI know the answer but it’s wishful thinking.",
                "And Emperor Musk will just ignore it. The courts are powerless without a way to physically enforce their rulings.",
                "Don’t go back without double pay.",
                "Republicans are praising him for saving money or something but he’s literally just wasting time and money and resources doing stupid impulsive shit",
                "After Schumer fucks us tomorrow, the firings will be legal."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Dow slides and S&P closes in correction as Trump’s trade war escalates",
            "external_url": "https://www.cnn.com/2025/03/13/investing/us-stocks-global-trade-tensions",
            "upvotes": 2988,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25062863572137.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The stock market is not the problem. It's the recession that I'm worried about.\n\nPeople will lose their jobs just when their 401Ks are low. Sad.",
                "Honestly, Donald just seems like the kind of guy to preheat a microwave.",
                "Let’s see how long the money puts up with this",
                "Trump 💩is killing the USA",
                "trump and his minions are going to make a killing  make it fall buy cheap",
                "Jesus fucking Christ ! Can I please get 1 decade where this bullshit doesn't happen?",
                "It really should not be this easy to fuck things up this much.",
                "Great Depression 2 is here, y'all.",
                "Is \"correction\" another term for economic suicide?",
                "But it will be the greatest depression anyone has ever seen.  They will write about it …"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 23012,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If they say “yes” to him, Then the constitution no longer matters.",
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "Wow.  If the Supreme Court gives in to this......................then this is the end of the country as we know it.  No one will have a claim anymore to citizenship because any fancy lawyer can come along and justify a reason you have no jurisdiction here, no matter who you are.   The Founding Fathers themselves had no jurisdiction because, at the time, they were British subjects.  Now what?   Donald Trump cannot get away with this, or we're all done."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Meta stops former Facebook director from promoting critical memoir",
            "external_url": "https://www.bbc.com/news/articles/cq5zyq0250wo",
            "upvotes": 3541,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/355c/live/da2d5260-fda1-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "Getting  way more press than this book would have ever gotten without arbitration .",
                "That’s funny the news of the legal injunction is far better than any marketing she could have provided.  I’m going to buy a copy now.",
                "Are you you talking about the book \"[Careless People by Sarah Wynn-Williams](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237)\", available now to purchase?\n\n(Just because she can't promote it, doesn't meant the rest of us can't.)",
                "“Your honor, I object!\n\n“And why is that, Mr. Zuckerberg?”\n\n“Because it’s devastating to my case!”",
                "\n>During the emergency hearing the arbitrator, Nicholas Gowen, found Meta had provided enough evidence that Ms Wynn-Williams had potentially violated her severance contract.\n\n>Following the decision, Meta spokesperson Andy Stone said in a post on X: \"This ruling affirms that Sarah Wynn-Williams' false and defamatory book should never have been published.\"\n\nUmm, no it doesn't",
                "\\#1 best seller on amazon:  \n[https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr\\_1\\_1?sr=8-1](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr_1_1?sr=8-1)\n\nLOL, meta, failed again.",
                "The BBC article says \"Meta has won an emergency ruling in the US to temporarily stop a former director of Facebook from promoting or further distributing copies of her memoir.\"\n\nIs this Streisand effect in action? Amazon's still selling it... seems like she just can't promote it... but Zuck's doing that himself.",
                "I deleted my facebook account last month after 16 years of pretty heavy use. \n\nI've heard you can't delete it in the states, can only deactivate, but in Canada you can permanently delete. I strongly suggest doing that if you have an account. Also remove all their apps from your phone. Don't let them earn off of your data.",
                "And to think, I may have never heard about the next book I'm going to read.",
                "The book is called \"Careless People.\" I will absolutely be buying a copy as the next book I read."
            ],
            "aggregate_sentiment": 28.0
        }
    ],
    "last_updated": "03/14/2025 04:10:28 UTC"
}