{
    "posts": [
        {
            "category": "HOT",
            "title": "An Oregon man who quit his job to set sail with his cat arrives to cheering fans in Hawaii",
            "external_url": "https://apnews.com/article/sailing-cat-phoenix-oregon-hawaii-d6dbdaea88e09c9b6d24fba61d8729a3",
            "upvotes": 4663,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "News snippet:\n“HONOLULU (AP) — An Oregon man who quit his job at a tire company and liquidated his retirement savings to set sail for Hawaii with his cat, Phoenix, reached his destination Saturday, welcomed by cheering fans at the end of a weekslong journey that he documented for his mass of followers on social media.\n\nOliver Widger, who also was greeted by Hawaii Gov. Josh Green at the Waikiki Yacht Club on Oahu, acknowledged he was nervous facing the crowd, which included reporters. Widger said he was feeling “really weird” — not seasick, but, “I just feel like I have to, like, hold on to things to not fall over.”\nHe became an online sensation with his story, which followed a diagnosis four years ago with a syndrome that carried a risk of paralysis and made him realize he disliked his managerial job. He quit his job with “no money, no plan” and $10,000 of debt — and the goal of buying a sailboat and sailing around the world. \n\nHe taught himself to sail mostly via YouTube and moved from Portland to the Oregon coast. He spent months refitting the $50,000 boat he bought.\n\nHe set sail for Hawaii with Phoenix in late April, documenting their experiences for his more than 1 million followers on TikTok and 1.7 million followers on Instagram. He said he thinks his story, which made national news, resonated with people. \n“I think a lot of people are, you know, you’re grinding at your job all day long and it doesn’t really matter how much money you make at this point, everybody’s just trying to do enough to get by and that just wears you out,” he said. “It’s just the world’s in a weird place, and I think people have seen that it’s possible to break.",
                "I could not begin to imagine the juxtaposition of being totally solitary (all due respect to Phoenix the cat) for weeks, and then to arrive to a big crowd gathered for just you to socialize. I suppose it’s a different kind of “solitary” when he’s locked into social media, but still has to be night and day. \n\nThe magnitude of accomplishment isn’t the same, but I believe he and Charles Lindbergh could see eye to eye on what that feeling was like. ",
                "I'm bummed the journey is over, but I'm glad I got to see it! It was really cool to watch him pull off his dream in real(ish) time.",
                "I had to scroll to the 4th picture just to see the cat!",
                "To answer the first question on everybody's mind:\n\nYes, the article has a picture of the cat.",
                "I'm glad he made it.  Wasn't terribly worried, the weather had been nice and he had constant communications.  But still, things happen at sea.\n\nMakes me think of Steve and Alix over in Massachusetts, with their massive multi-year project to build a sail ship called *Arabella* and start taking her around the world.  When she got put in the water for the first time it was a huge deal.",
                "Sailing from the West Coast to Hawaii is not actually that uncommon is it?   Or maybe the solo part is.  After teaching yourself.",
                "I wonder how he went from quitting his job being $10k in debt, to buying a $60k sailboat? Maybe took a loan? Just curious.",
                "Native Hawaiians: God damn it, not another cat.",
                "It takes some serious balls to set sail across the Pacific Ocean by yourself.. that's f****** crazy."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Florida man who shot and poisoned dolphins sentenced to 1 month",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-man-shot-poisoned-dolphins-sentenced-1-month-rcna208937",
            "upvotes": 5665,
            "date": "05/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-florida-dolphin-shooting-poison-rc-922p-edf349.jpg",
            "top_comments": [
                ">A Florida man who shot dolphins attracted to baited fishing lines cast from boats he operated was sentenced to 30 days in prison and one year of supervised release.\n\n>Zackery Brandon Barfield, 31, not only shot the bottlenose dolphins but also used poisoned bait after growing frustrated that they were eating from his charter fishing clients, according to prosecutors, who said the crimes happened in 2022 and 2023.\n\n>Prosecutors and federal law enforcement with the National Oceanic and Atmospheric Administration said Barfield shot at five dolphins, killing at least one, and used poisoned bait on dozens more during outings from Panama City.\n\n>“He knew the regulations protecting dolphins, yet he killed them anyway — once in front of children,” federal environmental prosecutor Adam Gustafson said Friday in a statement. Barfield’s attorney in the case did not immediately respond to a request for comment Saturday.\n\n>Barfield opened fire while two elementary school-aged children were on board and, separately, while more than a dozen fishermen were on board boats he operated, prosecutors said.\n\n>He used poisoned bait even more prodigiously, they said.\n\n>\"Barfield fed an estimated 24–70 dolphins poison-laden baitfish on charter trips that he captained,\" NOAA Fisheries said in a separate statement Friday.\n\nHe was mad because the dolphins were doing a better job at catching the fish than his customers were. \n\nIt’s a light sentence considering how long he was doing this and how many dolphins he cruelly killed. He should really lose his boat because he has no business being in the boat charter business after this.",
                "Too light a punishment for that ass.",
                "What a piece of shit. Should be going to prison for a long time, never be allowed to fish ever again, and his company should be seized.",
                "Florida should at least pretend to care about marine life.",
                "1 month? f**k that, should be years in jail",
                "I’m from the area, all of the locals are pissed at the joke of a sentence he received, absolutely no recourse for those poor animals",
                "1 so-called month, for **purposely** murdering dolphins...and he doesn't even lose his boating license or his boat. JFC, the American judicial system is a complete joke.",
                "And he will lose his fishing license in Florida for life right? This is the final part of the judgement, right? He will pay a fine, serve time, and never legally harvest a fish ever again, right?",
                "Is he going to remain in business?\n\nThis is where being a billionaire would be useful. I could open a \"We don't kill dolphins\" charter business right by him, with big, beautiful boats, low prices, and advertised heavily.\n\nI'd consider that a public good and set up a foundation to fund it.",
                "Another great example at how horribly inadequate our laws protecting animals are.\nThis guy is a psychopath and should lose everything.  F this broken system."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Second suspected sabotage in France as power cut hits Nice, affecting 45,000 homes",
            "external_url": "https://www.bbc.com/news/articles/c20xvnge3qno",
            "upvotes": 1894,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/487c/live/42ea3640-395e-11f0-a1b9-9b7594c95a97.jpg",
            "top_comments": [
                "A second major power outage in France within two days has raised serious concerns about potential sabotage.\nAfter a suspected arson attack in Cannes disrupted the film festival, another fire hit a power substation in Nice early Sunday. It cut electricity to 45,000 homes, the airport, and the tram network.\n\nAuthorities found signs of forced entry and vehicle tracks at the scene, suggesting it was no accident. French police have launched an investigation into possible organized sabotage.",
                "Probing for weak points. ",
                "We must start cutting cables in russia as well. Find their weak points and choke them. What are we waiting for? This is already war with them.",
                "I'm not saying it's the Ruzzis, but it was the Ruzzis.",
                "“It’s not *nice* to have our power out for so long.”\n\nIs it Nice, or is it not nice? Make up your mind!",
                "They tried this in the states a little while back and didn't accomplish much because Americans tend to try to shoot everything. I seem to recall several outages where they found bullet holes.\n\n\nDepartment of Energy data suggests suspicious energy grid disruptions are on the rise, especially in the Western U.S., historically a white supremacist stronghold. In reports filed to the DOE, power grid operators identified 200 instances of vandalism, suspicious activity, sabotage or physical attacks in 2023, comprising 58% of all reported incidents. (Other reports cited factors like severe weather, cyberattacks or equipment failures.) That represents a large increase over the last five years. In 2017, just 9.3% of reported disturbances noted suspicious circumstances, a number that rises to 20-to-30% from 2018 to 2021. Over the past decade, roughly half of these attacks happened in the West. \n\nThe FBI made arrests in three different white supremacist plots involving substations, all interrupted in 2020. In one case, three men who met through a neo-Nazi chat room planned to shoot up substations to take down the national energy grid. They were caught only because a man the group was recruiting lost his phone; the person who found it found Nazi propaganda on it and turned it over to the police. In the government’s sentencing memorandum for one of the men, prosecutors said they “planned to attack substations with powerful rifles that would penetrate the transformers” because they believed it would “cause confusion and unrest” and cost the government millions. “There was even discussion that their plan could succeed in producing a race war and the next Great Depression,” the memo says. All three pleaded guilty to one count of conspiring to provide material support to terrorists; one still awaits sentencing, and the other two are serving five- and seven-year prison terms.\n\nAnother three men were arrested at a Las Vegas Black Lives Matter protest with Molotov cocktails in their car, according to a Department of Justice statement. The government alleges that the men, who claimed to be members of the far-right “Boogaloo” movement, had also plotted to firebomb a substation. Two pled guilty and were sentenced to between four and 20 years, while a third received life in prison.\n\nThe FBI also charged four men in another 2020 plot that involved conspiring to destroy an energy facility, as well as stealing military gear to carry out the attack. Two of them pleaded guilty; the other two pleaded not guilty and are still awaiting trial. Court documents allege that two of the co-conspirators met online in a neo-Nazi forum and recruited others, and the group shared photos of themselves giving the Nazi “Sieg Heil” salute. In a detention hearing for one of the accused, Chris Little, a special agent for the Naval Criminal Investigative Service (NCIS), testified that one of the men had compiled a list of assassination targets associated with the Black Lives Matter movement. Little testified that the person also handwrote a list of intersections in cities across the West, including Boise, Portland, Seattle and San Francisco. Every intersection contained energy infrastructure. \n\nThe men, Little testified, wanted to create an outage because it “diverts the police, causes chaos from the outage itself, causes damage to the equipment, takes a long time to replace and causes an outage of significant length.” They planned to use that chaos “to create a favorable operating environment to conduct an assassination.” In the far-right movement, this twisted logic falls under the banner of an ideology called “accelerationism”: the belief that accelerating the collapse of society will enable white people to take over and rebuild the world they want.",
                "I’m sorry to hear that France was going through the same shit the US did a few years ago. When yallqueda was shooting at transformer stations.",
                "a rag tag team of thieves just pulled off a heist to remember",
                "The world is heading towards war.",
                "That doesn't sound very Nice."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia launches largest air attack yet on Ukraine",
            "external_url": "https://www.bbc.com/news/articles/cx2rx8kxdm4o",
            "upvotes": 1925,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/77a6/live/f474bf40-3989-11f0-ad10-b91b1b1069c6.jpg",
            "top_comments": [
                "Peace talks are just a stall tactic while they rearm themselves.",
                "Russia sending a message to Trump, “nice phone call the other day. This is our response. We know you are our bitch. We do what we want and we know you won’t do anything about it.”",
                "Trump’s “Peace On Day One” promise is looking like his biggest policy failure",
                "I thought they were running out of munitions...",
                "Has it been 24 hours yet?",
                "This will all be over when Trump tweets “STOP VLAD” again.",
                "Piece of shit terrorist russians",
                "Good job Shlump . I guess his talking to Putin really left an impression on him . The clown of the whole world right now",
                "As long as Putin lives, peace talks are a fantasy.",
                "Stop Vlad Stop!\n\ni'd add a /s but this is beyond a tragicomedy at this point. Our foreign policy has been reduced to social media tweets."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Illinois prosecutors weigh hate crime charges after lesbian attacked at McDonald's",
            "external_url": "https://www.cbsnews.com/chicago/news/kane-county-prosecutors-hate-crime-investigation-mcdonalds-attack-carpentersville/",
            "upvotes": 4029,
            "date": "05/25/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/876a2fff-120d-4ef3-a122-c9a755aa2212/thumbnail/1200x630/720d650c2bd8766b5a040fb9e4feaf5a/kady-grass.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "How is this even a discussion?? This is the definition of a hate crime…..",
                "They fucking stomped on her head!! They could have murdered her! Omg, I hope she gets the justice that is needed and I hope those worthless pieces of trash stay in prison for at least 30 years with no parole. I know it sounds too much but they could have killed her, or at the very least, caused permanent life changing damage. \n\nI hope she recovers.",
                "This kinda feels like the definition of a \"hate crime\". \n\nTwo men beating the shit out of a woman for merely trying to use the restroom all while broadcasting their prejudices during the attack - if they're not pursuing them here then what the fuck?",
                "God, that's horrible. I hope she recovers well and quickly. Once again, what a ridiculous fucking unnecessary thing to do to another human for such a stupid reason. What is the problem with humanity, man?",
                "From the article - “\"Kane County is a welcoming community,” yeah just don’t mind the blood stains on the welcome mat. It’s real telling the State prosecutor declined hate crime charges. These people have no real interest in enforcing the law. And where were the “good guys” in this restaurant trying to stop this attack?",
                "She didn't charge the 17 year old as an adult and she didn't add hate crime charges.  We have hate crime legislation in this state for a fucking reason.\n\nI called and talked to her myself last week, and this woman sucks at her job.",
                "Why do people have to deal with senseless attacks like this? It's just terrible. \n\nIt feels like you hear about stuff like this all the time. People always getting attacked at fast food places. People are terrible. Why should people have to suffer because there are these horrible people that are anti-social and have no impulse control? They probably won't be in imprisoned that long.",
                "This is a direct result of republican ideology",
                "Trump has given people permission to be their own worst selves. I fear that this is only the beginning.",
                "So this poor girl sat there trying to eat and was rushed by a bunch of kids and no one stepped in? For real? Yall just gonna let that girl get beat? Gd…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 20685,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                " now probably works for ICE instead",
                "Assuming he was immediately hired by ~~The Gestapo~~ ICE?",
                "“Have you ever been to jail?”\n\nFucking asshole. Power tripping fucking asshole.",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "So he could work with the Gestapo?",
                "Huh, before clicking on the article and even while reading it early on I assumed he resigned from the sheer fact that the teenager he arrested ultimately led to her life being completely turned upside down and the guilt just eroded him away until he was too ashamed to even wear a badge that is supposed to resemble his oath to the people. \n\nBut no, he's actually just another dickbag cop that was worried about his reputation LMAO"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Calif. mother who was kidnapped and forced to rob a bank falsely painted as a criminal in court",
            "external_url": "https://www.cbsnews.com/news/michelle-renee-kidnapped-forced-to-rob-bank-falsely-painted-as-a-criminal-in-court/",
            "upvotes": 2779,
            "date": "05/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/09/9fb83ef2-612d-47a8-86ac-43972ff2c793/thumbnail/1200x630/ed9acbec02a68ec2c961d6eb896c2acb/renee-michelle-court.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "This story is chilling. Imagine surviving a violent kidnapping, being forced to commit a crime, and then being re-victimized in court by being painted as the criminal. It really highlights how trauma survivors can be misunderstood and even punished by the very system meant to protect them. Cases like this show why victim advocacy and trauma-informed legal practices are so important.",
                "Wow this story is horrifying and those lawyers sound like absolute pieces of shit. Unreal that the woman who **confessed** got off completely.",
                "In 2019 I was SA'd by a customer at my previous job while off the clock. He was a customer that would come in, speak casually with me and he seemed cool. Exchanged numbers and spoke innocently. One day he told me he was suicidal, so I went to his house. It was a trap. It took me 6 months to find the courage to report it. His lawyer did everything he could to paint me in a negative light. It didn't work. My attacker received 50 years with 25 years suspended. The judge straight up told him, \"You're sorry to your wife. Your sorry to your kids. But the one person you've showed no remorse to the one person who deserves it the most.\"\n\nIn a separate county, I went through TWO domestic assault trials with my ex husband, both had substantial evidence of the abuse. Ie. A audio recordingfor the first assault and a physical witness to the second. The first conviction he received probation and mandatory anger management classes. He failed to complete his anger management classes. He went back to court for that. They dismissed the failure to comply. He kept the assault on his record. \n\nThe second assault, he was given 90 days in jail... with all the time suspended.\n\n\nJustice in this country is relative to where you live. You might see the book get thrown at some people. You might see people walk free. The sad fact is. There is no consistency.",
                "Patti Hearst wants a word.",
                "Haven't read the article but isn't that basically what happened to Patty Hearst when she was kidnapped too?",
                "Didn't this shit happen in a movie before?",
                "So, like Patty Hearst?",
                "Duress defense. Wins at trial. Fuck these prosecutors."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "North Korea detains 3 shipyard officials over the failed launch of a naval destroyer",
            "external_url": "https://apnews.com/article/north-korea-destroyer-officials-detained-kim-928e3e9461c799a10eb2258f99507c11",
            "upvotes": 685,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah, they’re never coming back.",
                "The destroyer has become the destroyed",
                "Detains is a weird way of saying \"Generational punishment\". Their entire bloodlines are probably wiped off the map.",
                "All those medals they wear must have overcome the buoyancy of the destroyer",
                "Say hi to the anti-aircraft gun!",
                "HR will give them a verbal warning.",
                "It is so weird that they don't have a dry dock. Are they really expensive or something?",
                "North Korea, what a great place to live and possibly die if you make a mistake at work.",
                "I mean, technically, isn't just about 100% of the population there effectively detained?  Only a tiny sliver of elites and government...erm...workers and out sourced slaves to Russia actually leaving the borders?",
                "If you think you're having a bad day, remember you could have been these guys...remember how the rest of the world reacted and how blatantly insignificant this news story was today compared to 5 yrs ago."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 7032,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "No worries for that guy. Trump will pardon him.",
                "If yall want more deep dives in Neo Nazi stuff. I implore you to check out the podcast Weird Little Guys. It’s fantastic and shows how just weird as fuck these people are.",
                "Trump administration will throw him a parade",
                "Accused neo-Nazi cult leader?\n\nPardon incoming, as soon as Krasnov stops frantically jerking off."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia hits Ukraine with massive drone, missile barrage amid prisoner exchange",
            "external_url": "https://abcnews.go.com/International/russia-hits-ukraine-massive-drone-missile-barrage-amid/story?id=122173886",
            "upvotes": 165,
            "date": "05/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/278fcdf4-4c31-48b2-bbec-eea3a1184263/Kyiv-explosion-DB-250525_1748156939198_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Putin needs to be in jail for war crimes",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia hits Ukraine with massive drone, missile barrage amid prisoner exchange",
            "external_url": "https://abcnews.go.com/International/russia-hits-ukraine-massive-drone-missile-barrage-amid/story?id=122173886",
            "upvotes": 158,
            "date": "05/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/278fcdf4-4c31-48b2-bbec-eea3a1184263/Kyiv-explosion-DB-250525_1748156939198_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Putin needs to be in jail for war crimes",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "An Oregon man who quit his job to set sail with his cat arrives to cheering fans in Hawaii",
            "external_url": "https://apnews.com/article/sailing-cat-phoenix-oregon-hawaii-d6dbdaea88e09c9b6d24fba61d8729a3",
            "upvotes": 4668,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "News snippet:\n“HONOLULU (AP) — An Oregon man who quit his job at a tire company and liquidated his retirement savings to set sail for Hawaii with his cat, Phoenix, reached his destination Saturday, welcomed by cheering fans at the end of a weekslong journey that he documented for his mass of followers on social media.\n\nOliver Widger, who also was greeted by Hawaii Gov. Josh Green at the Waikiki Yacht Club on Oahu, acknowledged he was nervous facing the crowd, which included reporters. Widger said he was feeling “really weird” — not seasick, but, “I just feel like I have to, like, hold on to things to not fall over.”\nHe became an online sensation with his story, which followed a diagnosis four years ago with a syndrome that carried a risk of paralysis and made him realize he disliked his managerial job. He quit his job with “no money, no plan” and $10,000 of debt — and the goal of buying a sailboat and sailing around the world. \n\nHe taught himself to sail mostly via YouTube and moved from Portland to the Oregon coast. He spent months refitting the $50,000 boat he bought.\n\nHe set sail for Hawaii with Phoenix in late April, documenting their experiences for his more than 1 million followers on TikTok and 1.7 million followers on Instagram. He said he thinks his story, which made national news, resonated with people. \n“I think a lot of people are, you know, you’re grinding at your job all day long and it doesn’t really matter how much money you make at this point, everybody’s just trying to do enough to get by and that just wears you out,” he said. “It’s just the world’s in a weird place, and I think people have seen that it’s possible to break.",
                "I could not begin to imagine the juxtaposition of being totally solitary (all due respect to Phoenix the cat) for weeks, and then to arrive to a big crowd gathered for just you to socialize. I suppose it’s a different kind of “solitary” when he’s locked into social media, but still has to be night and day. \n\nThe magnitude of accomplishment isn’t the same, but I believe he and Charles Lindbergh could see eye to eye on what that feeling was like. ",
                "I'm bummed the journey is over, but I'm glad I got to see it! It was really cool to watch him pull off his dream in real(ish) time.",
                "I had to scroll to the 4th picture just to see the cat!",
                "To answer the first question on everybody's mind:\n\nYes, the article has a picture of the cat.",
                "I'm glad he made it.  Wasn't terribly worried, the weather had been nice and he had constant communications.  But still, things happen at sea.\n\nMakes me think of Steve and Alix over in Massachusetts, with their massive multi-year project to build a sail ship called *Arabella* and start taking her around the world.  When she got put in the water for the first time it was a huge deal.",
                "Sailing from the West Coast to Hawaii is not actually that uncommon is it?   Or maybe the solo part is.  After teaching yourself.",
                "I wonder how he went from quitting his job being $10k in debt, to buying a $60k sailboat? Maybe took a loan? Just curious.",
                "Native Hawaiians: God damn it, not another cat.",
                "It takes some serious balls to set sail across the Pacific Ocean by yourself.. that's f****** crazy."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Second suspected sabotage in France as power cut hits Nice, affecting 45,000 homes",
            "external_url": "https://www.bbc.com/news/articles/c20xvnge3qno",
            "upvotes": 1895,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/487c/live/42ea3640-395e-11f0-a1b9-9b7594c95a97.jpg",
            "top_comments": [
                "A second major power outage in France within two days has raised serious concerns about potential sabotage.\nAfter a suspected arson attack in Cannes disrupted the film festival, another fire hit a power substation in Nice early Sunday. It cut electricity to 45,000 homes, the airport, and the tram network.\n\nAuthorities found signs of forced entry and vehicle tracks at the scene, suggesting it was no accident. French police have launched an investigation into possible organized sabotage.",
                "Probing for weak points. ",
                "We must start cutting cables in russia as well. Find their weak points and choke them. What are we waiting for? This is already war with them.",
                "I'm not saying it's the Ruzzis, but it was the Ruzzis.",
                "“It’s not *nice* to have our power out for so long.”\n\nIs it Nice, or is it not nice? Make up your mind!",
                "They tried this in the states a little while back and didn't accomplish much because Americans tend to try to shoot everything. I seem to recall several outages where they found bullet holes.\n\n\nDepartment of Energy data suggests suspicious energy grid disruptions are on the rise, especially in the Western U.S., historically a white supremacist stronghold. In reports filed to the DOE, power grid operators identified 200 instances of vandalism, suspicious activity, sabotage or physical attacks in 2023, comprising 58% of all reported incidents. (Other reports cited factors like severe weather, cyberattacks or equipment failures.) That represents a large increase over the last five years. In 2017, just 9.3% of reported disturbances noted suspicious circumstances, a number that rises to 20-to-30% from 2018 to 2021. Over the past decade, roughly half of these attacks happened in the West. \n\nThe FBI made arrests in three different white supremacist plots involving substations, all interrupted in 2020. In one case, three men who met through a neo-Nazi chat room planned to shoot up substations to take down the national energy grid. They were caught only because a man the group was recruiting lost his phone; the person who found it found Nazi propaganda on it and turned it over to the police. In the government’s sentencing memorandum for one of the men, prosecutors said they “planned to attack substations with powerful rifles that would penetrate the transformers” because they believed it would “cause confusion and unrest” and cost the government millions. “There was even discussion that their plan could succeed in producing a race war and the next Great Depression,” the memo says. All three pleaded guilty to one count of conspiring to provide material support to terrorists; one still awaits sentencing, and the other two are serving five- and seven-year prison terms.\n\nAnother three men were arrested at a Las Vegas Black Lives Matter protest with Molotov cocktails in their car, according to a Department of Justice statement. The government alleges that the men, who claimed to be members of the far-right “Boogaloo” movement, had also plotted to firebomb a substation. Two pled guilty and were sentenced to between four and 20 years, while a third received life in prison.\n\nThe FBI also charged four men in another 2020 plot that involved conspiring to destroy an energy facility, as well as stealing military gear to carry out the attack. Two of them pleaded guilty; the other two pleaded not guilty and are still awaiting trial. Court documents allege that two of the co-conspirators met online in a neo-Nazi forum and recruited others, and the group shared photos of themselves giving the Nazi “Sieg Heil” salute. In a detention hearing for one of the accused, Chris Little, a special agent for the Naval Criminal Investigative Service (NCIS), testified that one of the men had compiled a list of assassination targets associated with the Black Lives Matter movement. Little testified that the person also handwrote a list of intersections in cities across the West, including Boise, Portland, Seattle and San Francisco. Every intersection contained energy infrastructure. \n\nThe men, Little testified, wanted to create an outage because it “diverts the police, causes chaos from the outage itself, causes damage to the equipment, takes a long time to replace and causes an outage of significant length.” They planned to use that chaos “to create a favorable operating environment to conduct an assassination.” In the far-right movement, this twisted logic falls under the banner of an ideology called “accelerationism”: the belief that accelerating the collapse of society will enable white people to take over and rebuild the world they want.",
                "I’m sorry to hear that France was going through the same shit the US did a few years ago. When yallqueda was shooting at transformer stations.",
                "a rag tag team of thieves just pulled off a heist to remember",
                "The world is heading towards war.",
                "That doesn't sound very Nice."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia launches largest air attack yet on Ukraine",
            "external_url": "https://www.bbc.com/news/articles/cx2rx8kxdm4o",
            "upvotes": 1922,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/77a6/live/f474bf40-3989-11f0-ad10-b91b1b1069c6.jpg",
            "top_comments": [
                "Peace talks are just a stall tactic while they rearm themselves.",
                "Russia sending a message to Trump, “nice phone call the other day. This is our response. We know you are our bitch. We do what we want and we know you won’t do anything about it.”",
                "Trump’s “Peace On Day One” promise is looking like his biggest policy failure",
                "I thought they were running out of munitions...",
                "Has it been 24 hours yet?",
                "This will all be over when Trump tweets “STOP VLAD” again.",
                "Piece of shit terrorist russians",
                "Good job Shlump . I guess his talking to Putin really left an impression on him . The clown of the whole world right now",
                "As long as Putin lives, peace talks are a fantasy.",
                "Stop Vlad Stop!\n\ni'd add a /s but this is beyond a tragicomedy at this point. Our foreign policy has been reduced to social media tweets."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "North Korea detains 3 shipyard officials over the failed launch of a naval destroyer",
            "external_url": "https://apnews.com/article/north-korea-destroyer-officials-detained-kim-928e3e9461c799a10eb2258f99507c11",
            "upvotes": 689,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah, they’re never coming back.",
                "The destroyer has become the destroyed",
                "Detains is a weird way of saying \"Generational punishment\". Their entire bloodlines are probably wiped off the map.",
                "All those medals they wear must have overcome the buoyancy of the destroyer",
                "Say hi to the anti-aircraft gun!",
                "HR will give them a verbal warning.",
                "It is so weird that they don't have a dry dock. Are they really expensive or something?",
                "North Korea, what a great place to live and possibly die if you make a mistake at work.",
                "I mean, technically, isn't just about 100% of the population there effectively detained?  Only a tiny sliver of elites and government...erm...workers and out sourced slaves to Russia actually leaving the borders?",
                "If you think you're having a bad day, remember you could have been these guys...remember how the rest of the world reacted and how blatantly insignificant this news story was today compared to 5 yrs ago."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Florida man who shot and poisoned dolphins sentenced to 1 month",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-man-shot-poisoned-dolphins-sentenced-1-month-rcna208937",
            "upvotes": 5657,
            "date": "05/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-florida-dolphin-shooting-poison-rc-922p-edf349.jpg",
            "top_comments": [
                ">A Florida man who shot dolphins attracted to baited fishing lines cast from boats he operated was sentenced to 30 days in prison and one year of supervised release.\n\n>Zackery Brandon Barfield, 31, not only shot the bottlenose dolphins but also used poisoned bait after growing frustrated that they were eating from his charter fishing clients, according to prosecutors, who said the crimes happened in 2022 and 2023.\n\n>Prosecutors and federal law enforcement with the National Oceanic and Atmospheric Administration said Barfield shot at five dolphins, killing at least one, and used poisoned bait on dozens more during outings from Panama City.\n\n>“He knew the regulations protecting dolphins, yet he killed them anyway — once in front of children,” federal environmental prosecutor Adam Gustafson said Friday in a statement. Barfield’s attorney in the case did not immediately respond to a request for comment Saturday.\n\n>Barfield opened fire while two elementary school-aged children were on board and, separately, while more than a dozen fishermen were on board boats he operated, prosecutors said.\n\n>He used poisoned bait even more prodigiously, they said.\n\n>\"Barfield fed an estimated 24–70 dolphins poison-laden baitfish on charter trips that he captained,\" NOAA Fisheries said in a separate statement Friday.\n\nHe was mad because the dolphins were doing a better job at catching the fish than his customers were. \n\nIt’s a light sentence considering how long he was doing this and how many dolphins he cruelly killed. He should really lose his boat because he has no business being in the boat charter business after this.",
                "Too light a punishment for that ass.",
                "What a piece of shit. Should be going to prison for a long time, never be allowed to fish ever again, and his company should be seized.",
                "Florida should at least pretend to care about marine life.",
                "1 month? f**k that, should be years in jail",
                "I’m from the area, all of the locals are pissed at the joke of a sentence he received, absolutely no recourse for those poor animals",
                "1 so-called month, for **purposely** murdering dolphins...and he doesn't even lose his boating license or his boat. JFC, the American judicial system is a complete joke.",
                "And he will lose his fishing license in Florida for life right? This is the final part of the judgement, right? He will pay a fine, serve time, and never legally harvest a fish ever again, right?",
                "Is he going to remain in business?\n\nThis is where being a billionaire would be useful. I could open a \"We don't kill dolphins\" charter business right by him, with big, beautiful boats, low prices, and advertised heavily.\n\nI'd consider that a public good and set up a foundation to fund it.",
                "Another great example at how horribly inadequate our laws protecting animals are.\nThis guy is a psychopath and should lose everything.  F this broken system."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Illinois prosecutors weigh hate crime charges after lesbian attacked at McDonald's",
            "external_url": "https://www.cbsnews.com/chicago/news/kane-county-prosecutors-hate-crime-investigation-mcdonalds-attack-carpentersville/",
            "upvotes": 4032,
            "date": "05/25/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/876a2fff-120d-4ef3-a122-c9a755aa2212/thumbnail/1200x630/720d650c2bd8766b5a040fb9e4feaf5a/kady-grass.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "How is this even a discussion?? This is the definition of a hate crime…..",
                "They fucking stomped on her head!! They could have murdered her! Omg, I hope she gets the justice that is needed and I hope those worthless pieces of trash stay in prison for at least 30 years with no parole. I know it sounds too much but they could have killed her, or at the very least, caused permanent life changing damage. \n\nI hope she recovers.",
                "This kinda feels like the definition of a \"hate crime\". \n\nTwo men beating the shit out of a woman for merely trying to use the restroom all while broadcasting their prejudices during the attack - if they're not pursuing them here then what the fuck?",
                "God, that's horrible. I hope she recovers well and quickly. Once again, what a ridiculous fucking unnecessary thing to do to another human for such a stupid reason. What is the problem with humanity, man?",
                "From the article - “\"Kane County is a welcoming community,” yeah just don’t mind the blood stains on the welcome mat. It’s real telling the State prosecutor declined hate crime charges. These people have no real interest in enforcing the law. And where were the “good guys” in this restaurant trying to stop this attack?",
                "She didn't charge the 17 year old as an adult and she didn't add hate crime charges.  We have hate crime legislation in this state for a fucking reason.\n\nI called and talked to her myself last week, and this woman sucks at her job.",
                "Why do people have to deal with senseless attacks like this? It's just terrible. \n\nIt feels like you hear about stuff like this all the time. People always getting attacked at fast food places. People are terrible. Why should people have to suffer because there are these horrible people that are anti-social and have no impulse control? They probably won't be in imprisoned that long.",
                "This is a direct result of republican ideology",
                "Trump has given people permission to be their own worst selves. I fear that this is only the beginning.",
                "So this poor girl sat there trying to eat and was rushed by a bunch of kids and no one stepped in? For real? Yall just gonna let that girl get beat? Gd…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Calif. mother who was kidnapped and forced to rob a bank falsely painted as a criminal in court",
            "external_url": "https://www.cbsnews.com/news/michelle-renee-kidnapped-forced-to-rob-bank-falsely-painted-as-a-criminal-in-court/",
            "upvotes": 2779,
            "date": "05/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/09/9fb83ef2-612d-47a8-86ac-43972ff2c793/thumbnail/1200x630/ed9acbec02a68ec2c961d6eb896c2acb/renee-michelle-court.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "This story is chilling. Imagine surviving a violent kidnapping, being forced to commit a crime, and then being re-victimized in court by being painted as the criminal. It really highlights how trauma survivors can be misunderstood and even punished by the very system meant to protect them. Cases like this show why victim advocacy and trauma-informed legal practices are so important.",
                "Wow this story is horrifying and those lawyers sound like absolute pieces of shit. Unreal that the woman who **confessed** got off completely.",
                "In 2019 I was SA'd by a customer at my previous job while off the clock. He was a customer that would come in, speak casually with me and he seemed cool. Exchanged numbers and spoke innocently. One day he told me he was suicidal, so I went to his house. It was a trap. It took me 6 months to find the courage to report it. His lawyer did everything he could to paint me in a negative light. It didn't work. My attacker received 50 years with 25 years suspended. The judge straight up told him, \"You're sorry to your wife. Your sorry to your kids. But the one person you've showed no remorse to the one person who deserves it the most.\"\n\nIn a separate county, I went through TWO domestic assault trials with my ex husband, both had substantial evidence of the abuse. Ie. A audio recordingfor the first assault and a physical witness to the second. The first conviction he received probation and mandatory anger management classes. He failed to complete his anger management classes. He went back to court for that. They dismissed the failure to comply. He kept the assault on his record. \n\nThe second assault, he was given 90 days in jail... with all the time suspended.\n\n\nJustice in this country is relative to where you live. You might see the book get thrown at some people. You might see people walk free. The sad fact is. There is no consistency.",
                "Patti Hearst wants a word.",
                "Haven't read the article but isn't that basically what happened to Patty Hearst when she was kidnapped too?",
                "Didn't this shit happen in a movie before?",
                "So, like Patty Hearst?",
                "Duress defense. Wins at trial. Fuck these prosecutors."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Orthodox Christianity: Young US men joining 'masculine' Russian churches",
            "external_url": "https://www.bbc.com/news/articles/c30q5l8d4lro",
            "upvotes": 846,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ae73/live/84976680-2671-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "For anyone who didn't read the article, the men aren't leaving the US and going to Russia. These Russian Orthodox churches are here in the US. The guy in the picture is the priest of one of these churches in Georgetown, Texas.\n\nROCOR is apparently the name of the congregation, meaning Russian Orthodox Church Outside of Russia. They have a HQ in New York and are spreading. Apparently they've been established here since 1917 though (not the masculinity church, just ROCOR).",
                "Half my family is Greek Orthodox and nothing about that religion struck me as inherently 'masculine' but maybe the Russian version is different? Or maybe this isn't really 'about' religion?",
                "\"They see it as a military, rigid, disciplinary, masculine, authoritarian religion,\" Elissa says.\n\nHow is any of this what Jesus stood for lmao? I mean is this even Christianity at this point? Or is it just a boy’s social club using religion as an excuse to look more “trad”? \n\nI wonder how many of these folks have read the Bible or even could just explain some of the basic concepts of what being a Christian even means…",
                "That is very beta of them.",
                "I've seen some alt-right guys in random (predominately male, obviously) YouTube comments sections saying they converted to Russian Orthodoxy because Western churches have apparently \"lost their way\".\n\n☦ signs everywhere. Strong cultish vibes.",
                "The same young men who were [swayed towards the Right Wing over the last election cycle](https://www.americansurveycenter.org/newsletter/are-young-men-becoming-conservative/) after it was proven [Russia paid Youtubers and Podcasters to spread right-wing propaganda](https://www.npr.org/2024/09/07/nx-s1-5101895/doj-says-russia-paid-right-wing-influencers-to-spread-russian-propaganda) are heading towards the Russian orthodox church and after [several whistle-blowers claimed Trump was in collusion with Russia](https://www.google.com/amp/s/amp.cnn.com/cnn/2020/09/09/politics/dhs-whistleblower-white-supremacist-threat) and even his own son said in 2008, [\"Russians make up a pretty disproportionate cross-section of a lot of our assets. \"](https://foreignpolicy.com/2018/12/21/how-russian-money-helped-save-trumps-business/)\n\nYeah, Russia definitely owns Trump and helped him get elected.\n\nWhich more than explains why [Trump's actions are nearly exact replicas of what a Russian asset would do to Americans and their interests.](https://foreignpolicy.com/2025/03/10/trump-putin-russia-asset-spy-security-ukraine-europe-war/)",
                "The guys who are doing this ironically aren't the ones getting laid.",
                "I’m an Orthodox Christian, and this ridiculous nonsense doesn’t represent me or my Church in the slightest. This priest is a joke.",
                "As an elder millennial this is such bullshit. The older generations only worried about us being lazy and putting Avocado on too many things... Now we have to worry about Zoomers being brainwashed idiot misogynistic authoritarians...",
                "I really need to be told what's masculine by a guy wearing a dress and jewelry."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Actor Jussie Smollett to pay $50,000 to Chicago charity",
            "external_url": "https://www.bbc.com/news/articles/c2lke8l980no",
            "upvotes": 1320,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0455/live/9af94a90-37c1-11f0-8c61-1388b061cbbc.jpg",
            "top_comments": [
                ">Chicago police had wanted Smollett to pay $130,000 to cover the investigation costs, but on Thursday, Chicago's law department confirmed that the donation will be made instead.\n\nIs that the end of it? I haven't been following the criminal case any more. Was that resolved entirely?",
                "*The money will go to Building Brighter Futures Center for the Arts, an organisation that supports Chicago's underprivileged youth.*\n\nNice--but who gets to pay the 130,000 in investigative costs?  Did I hear \"Chicago tax payers.\"",
                "“America, do not commit crimes with checks”\n-Charles Barkley",
                "He’s a useless waste of space and energy",
                "Is this that French actor Dave Chappelle was talking about? :)",
                "He got off way too easy.",
                "One of the most embarassing cases I’ve ever seen in my life.",
                "Hope he doesn’t get mugged by those guys on his way to the charity. ",
                "I never want to hear from him agaim",
                "During the staged attack, one of the Osundairo brothers placed a noose around his neck. Later, back in his apartment, he still had the noose around his neck when the police arrived…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "An Oregon man who quit his job to set sail with his cat arrives to cheering fans in Hawaii",
            "external_url": "https://apnews.com/article/sailing-cat-phoenix-oregon-hawaii-d6dbdaea88e09c9b6d24fba61d8729a3",
            "upvotes": 4663,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "News snippet:\n“HONOLULU (AP) — An Oregon man who quit his job at a tire company and liquidated his retirement savings to set sail for Hawaii with his cat, Phoenix, reached his destination Saturday, welcomed by cheering fans at the end of a weekslong journey that he documented for his mass of followers on social media.\n\nOliver Widger, who also was greeted by Hawaii Gov. Josh Green at the Waikiki Yacht Club on Oahu, acknowledged he was nervous facing the crowd, which included reporters. Widger said he was feeling “really weird” — not seasick, but, “I just feel like I have to, like, hold on to things to not fall over.”\nHe became an online sensation with his story, which followed a diagnosis four years ago with a syndrome that carried a risk of paralysis and made him realize he disliked his managerial job. He quit his job with “no money, no plan” and $10,000 of debt — and the goal of buying a sailboat and sailing around the world. \n\nHe taught himself to sail mostly via YouTube and moved from Portland to the Oregon coast. He spent months refitting the $50,000 boat he bought.\n\nHe set sail for Hawaii with Phoenix in late April, documenting their experiences for his more than 1 million followers on TikTok and 1.7 million followers on Instagram. He said he thinks his story, which made national news, resonated with people. \n“I think a lot of people are, you know, you’re grinding at your job all day long and it doesn’t really matter how much money you make at this point, everybody’s just trying to do enough to get by and that just wears you out,” he said. “It’s just the world’s in a weird place, and I think people have seen that it’s possible to break.",
                "I could not begin to imagine the juxtaposition of being totally solitary (all due respect to Phoenix the cat) for weeks, and then to arrive to a big crowd gathered for just you to socialize. I suppose it’s a different kind of “solitary” when he’s locked into social media, but still has to be night and day. \n\nThe magnitude of accomplishment isn’t the same, but I believe he and Charles Lindbergh could see eye to eye on what that feeling was like. ",
                "I'm bummed the journey is over, but I'm glad I got to see it! It was really cool to watch him pull off his dream in real(ish) time.",
                "I had to scroll to the 4th picture just to see the cat!",
                "To answer the first question on everybody's mind:\n\nYes, the article has a picture of the cat.",
                "I'm glad he made it.  Wasn't terribly worried, the weather had been nice and he had constant communications.  But still, things happen at sea.\n\nMakes me think of Steve and Alix over in Massachusetts, with their massive multi-year project to build a sail ship called *Arabella* and start taking her around the world.  When she got put in the water for the first time it was a huge deal.",
                "Sailing from the West Coast to Hawaii is not actually that uncommon is it?   Or maybe the solo part is.  After teaching yourself.",
                "I wonder how he went from quitting his job being $10k in debt, to buying a $60k sailboat? Maybe took a loan? Just curious.",
                "Native Hawaiians: God damn it, not another cat.",
                "It takes some serious balls to set sail across the Pacific Ocean by yourself.. that's f****** crazy."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Second suspected sabotage in France as power cut hits Nice, affecting 45,000 homes",
            "external_url": "https://www.bbc.com/news/articles/c20xvnge3qno",
            "upvotes": 1897,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/487c/live/42ea3640-395e-11f0-a1b9-9b7594c95a97.jpg",
            "top_comments": [
                "A second major power outage in France within two days has raised serious concerns about potential sabotage.\nAfter a suspected arson attack in Cannes disrupted the film festival, another fire hit a power substation in Nice early Sunday. It cut electricity to 45,000 homes, the airport, and the tram network.\n\nAuthorities found signs of forced entry and vehicle tracks at the scene, suggesting it was no accident. French police have launched an investigation into possible organized sabotage.",
                "Probing for weak points. ",
                "We must start cutting cables in russia as well. Find their weak points and choke them. What are we waiting for? This is already war with them.",
                "I'm not saying it's the Ruzzis, but it was the Ruzzis.",
                "“It’s not *nice* to have our power out for so long.”\n\nIs it Nice, or is it not nice? Make up your mind!",
                "They tried this in the states a little while back and didn't accomplish much because Americans tend to try to shoot everything. I seem to recall several outages where they found bullet holes.\n\n\nDepartment of Energy data suggests suspicious energy grid disruptions are on the rise, especially in the Western U.S., historically a white supremacist stronghold. In reports filed to the DOE, power grid operators identified 200 instances of vandalism, suspicious activity, sabotage or physical attacks in 2023, comprising 58% of all reported incidents. (Other reports cited factors like severe weather, cyberattacks or equipment failures.) That represents a large increase over the last five years. In 2017, just 9.3% of reported disturbances noted suspicious circumstances, a number that rises to 20-to-30% from 2018 to 2021. Over the past decade, roughly half of these attacks happened in the West. \n\nThe FBI made arrests in three different white supremacist plots involving substations, all interrupted in 2020. In one case, three men who met through a neo-Nazi chat room planned to shoot up substations to take down the national energy grid. They were caught only because a man the group was recruiting lost his phone; the person who found it found Nazi propaganda on it and turned it over to the police. In the government’s sentencing memorandum for one of the men, prosecutors said they “planned to attack substations with powerful rifles that would penetrate the transformers” because they believed it would “cause confusion and unrest” and cost the government millions. “There was even discussion that their plan could succeed in producing a race war and the next Great Depression,” the memo says. All three pleaded guilty to one count of conspiring to provide material support to terrorists; one still awaits sentencing, and the other two are serving five- and seven-year prison terms.\n\nAnother three men were arrested at a Las Vegas Black Lives Matter protest with Molotov cocktails in their car, according to a Department of Justice statement. The government alleges that the men, who claimed to be members of the far-right “Boogaloo” movement, had also plotted to firebomb a substation. Two pled guilty and were sentenced to between four and 20 years, while a third received life in prison.\n\nThe FBI also charged four men in another 2020 plot that involved conspiring to destroy an energy facility, as well as stealing military gear to carry out the attack. Two of them pleaded guilty; the other two pleaded not guilty and are still awaiting trial. Court documents allege that two of the co-conspirators met online in a neo-Nazi forum and recruited others, and the group shared photos of themselves giving the Nazi “Sieg Heil” salute. In a detention hearing for one of the accused, Chris Little, a special agent for the Naval Criminal Investigative Service (NCIS), testified that one of the men had compiled a list of assassination targets associated with the Black Lives Matter movement. Little testified that the person also handwrote a list of intersections in cities across the West, including Boise, Portland, Seattle and San Francisco. Every intersection contained energy infrastructure. \n\nThe men, Little testified, wanted to create an outage because it “diverts the police, causes chaos from the outage itself, causes damage to the equipment, takes a long time to replace and causes an outage of significant length.” They planned to use that chaos “to create a favorable operating environment to conduct an assassination.” In the far-right movement, this twisted logic falls under the banner of an ideology called “accelerationism”: the belief that accelerating the collapse of society will enable white people to take over and rebuild the world they want.",
                "I’m sorry to hear that France was going through the same shit the US did a few years ago. When yallqueda was shooting at transformer stations.",
                "a rag tag team of thieves just pulled off a heist to remember",
                "The world is heading towards war.",
                "That doesn't sound very Nice."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Florida man who shot and poisoned dolphins sentenced to 1 month",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-man-shot-poisoned-dolphins-sentenced-1-month-rcna208937",
            "upvotes": 5667,
            "date": "05/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-florida-dolphin-shooting-poison-rc-922p-edf349.jpg",
            "top_comments": [
                ">A Florida man who shot dolphins attracted to baited fishing lines cast from boats he operated was sentenced to 30 days in prison and one year of supervised release.\n\n>Zackery Brandon Barfield, 31, not only shot the bottlenose dolphins but also used poisoned bait after growing frustrated that they were eating from his charter fishing clients, according to prosecutors, who said the crimes happened in 2022 and 2023.\n\n>Prosecutors and federal law enforcement with the National Oceanic and Atmospheric Administration said Barfield shot at five dolphins, killing at least one, and used poisoned bait on dozens more during outings from Panama City.\n\n>“He knew the regulations protecting dolphins, yet he killed them anyway — once in front of children,” federal environmental prosecutor Adam Gustafson said Friday in a statement. Barfield’s attorney in the case did not immediately respond to a request for comment Saturday.\n\n>Barfield opened fire while two elementary school-aged children were on board and, separately, while more than a dozen fishermen were on board boats he operated, prosecutors said.\n\n>He used poisoned bait even more prodigiously, they said.\n\n>\"Barfield fed an estimated 24–70 dolphins poison-laden baitfish on charter trips that he captained,\" NOAA Fisheries said in a separate statement Friday.\n\nHe was mad because the dolphins were doing a better job at catching the fish than his customers were. \n\nIt’s a light sentence considering how long he was doing this and how many dolphins he cruelly killed. He should really lose his boat because he has no business being in the boat charter business after this.",
                "Too light a punishment for that ass.",
                "What a piece of shit. Should be going to prison for a long time, never be allowed to fish ever again, and his company should be seized.",
                "Florida should at least pretend to care about marine life.",
                "1 month? f**k that, should be years in jail",
                "I’m from the area, all of the locals are pissed at the joke of a sentence he received, absolutely no recourse for those poor animals",
                "1 so-called month, for **purposely** murdering dolphins...and he doesn't even lose his boating license or his boat. JFC, the American judicial system is a complete joke.",
                "And he will lose his fishing license in Florida for life right? This is the final part of the judgement, right? He will pay a fine, serve time, and never legally harvest a fish ever again, right?",
                "Is he going to remain in business?\n\nThis is where being a billionaire would be useful. I could open a \"We don't kill dolphins\" charter business right by him, with big, beautiful boats, low prices, and advertised heavily.\n\nI'd consider that a public good and set up a foundation to fund it.",
                "Another great example at how horribly inadequate our laws protecting animals are.\nThis guy is a psychopath and should lose everything.  F this broken system."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia launches largest air attack yet on Ukraine",
            "external_url": "https://www.bbc.com/news/articles/cx2rx8kxdm4o",
            "upvotes": 1932,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/77a6/live/f474bf40-3989-11f0-ad10-b91b1b1069c6.jpg",
            "top_comments": [
                "Peace talks are just a stall tactic while they rearm themselves.",
                "Russia sending a message to Trump, “nice phone call the other day. This is our response. We know you are our bitch. We do what we want and we know you won’t do anything about it.”",
                "Trump’s “Peace On Day One” promise is looking like his biggest policy failure",
                "I thought they were running out of munitions...",
                "Has it been 24 hours yet?",
                "This will all be over when Trump tweets “STOP VLAD” again.",
                "Piece of shit terrorist russians",
                "Good job Shlump . I guess his talking to Putin really left an impression on him . The clown of the whole world right now",
                "As long as Putin lives, peace talks are a fantasy.",
                "Stop Vlad Stop!\n\ni'd add a /s but this is beyond a tragicomedy at this point. Our foreign policy has been reduced to social media tweets."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "North Korea detains 3 shipyard officials over the failed launch of a naval destroyer",
            "external_url": "https://apnews.com/article/north-korea-destroyer-officials-detained-kim-928e3e9461c799a10eb2258f99507c11",
            "upvotes": 684,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah, they’re never coming back.",
                "The destroyer has become the destroyed",
                "Detains is a weird way of saying \"Generational punishment\". Their entire bloodlines are probably wiped off the map.",
                "All those medals they wear must have overcome the buoyancy of the destroyer",
                "Say hi to the anti-aircraft gun!",
                "HR will give them a verbal warning.",
                "It is so weird that they don't have a dry dock. Are they really expensive or something?",
                "North Korea, what a great place to live and possibly die if you make a mistake at work.",
                "I mean, technically, isn't just about 100% of the population there effectively detained?  Only a tiny sliver of elites and government...erm...workers and out sourced slaves to Russia actually leaving the borders?",
                "If you think you're having a bad day, remember you could have been these guys...remember how the rest of the world reacted and how blatantly insignificant this news story was today compared to 5 yrs ago."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Illinois prosecutors weigh hate crime charges after lesbian attacked at McDonald's",
            "external_url": "https://www.cbsnews.com/chicago/news/kane-county-prosecutors-hate-crime-investigation-mcdonalds-attack-carpentersville/",
            "upvotes": 4028,
            "date": "05/25/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/876a2fff-120d-4ef3-a122-c9a755aa2212/thumbnail/1200x630/720d650c2bd8766b5a040fb9e4feaf5a/kady-grass.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "How is this even a discussion?? This is the definition of a hate crime…..",
                "They fucking stomped on her head!! They could have murdered her! Omg, I hope she gets the justice that is needed and I hope those worthless pieces of trash stay in prison for at least 30 years with no parole. I know it sounds too much but they could have killed her, or at the very least, caused permanent life changing damage. \n\nI hope she recovers.",
                "This kinda feels like the definition of a \"hate crime\". \n\nTwo men beating the shit out of a woman for merely trying to use the restroom all while broadcasting their prejudices during the attack - if they're not pursuing them here then what the fuck?",
                "God, that's horrible. I hope she recovers well and quickly. Once again, what a ridiculous fucking unnecessary thing to do to another human for such a stupid reason. What is the problem with humanity, man?",
                "From the article - “\"Kane County is a welcoming community,” yeah just don’t mind the blood stains on the welcome mat. It’s real telling the State prosecutor declined hate crime charges. These people have no real interest in enforcing the law. And where were the “good guys” in this restaurant trying to stop this attack?",
                "She didn't charge the 17 year old as an adult and she didn't add hate crime charges.  We have hate crime legislation in this state for a fucking reason.\n\nI called and talked to her myself last week, and this woman sucks at her job.",
                "Why do people have to deal with senseless attacks like this? It's just terrible. \n\nIt feels like you hear about stuff like this all the time. People always getting attacked at fast food places. People are terrible. Why should people have to suffer because there are these horrible people that are anti-social and have no impulse control? They probably won't be in imprisoned that long.",
                "This is a direct result of republican ideology",
                "Trump has given people permission to be their own worst selves. I fear that this is only the beginning.",
                "So this poor girl sat there trying to eat and was rushed by a bunch of kids and no one stepped in? For real? Yall just gonna let that girl get beat? Gd…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police officer who arrested Georgia teen that was detained by ICE resigns from department",
            "external_url": "https://www.cbsnews.com/news/georgia-teen-detained-by-ice-arresting-officer-resigns-dalton-police/",
            "upvotes": 20682,
            "date": "05/24/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/14/a66890fe-fa5c-45b7-a0e5-9947994fc259/thumbnail/1200x630/92a5ccbd768e0ca43319545bc7470f49/0514-cmo-galvez.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "The cop writes in his resignation letter that it wasn’t a false arrest and the department didn’t protect him from “defamation” but the department says there was video? So which one is it? Is the cop just resigning because they didn’t “protect him” by lying for him?",
                ">\"DHS said Arias Cristobal and her father should face \"consequences\" for being in the U.S. illegally.\"\n\nWhat should she have done as a three year old? Or a ten year old? Or an eighteen year old? She had no good option when her family moved her here as an infant. What was she supposed to do? Self deport as a minor! This is a VERY poor use of resources to go after people like this. This is stupid. This gives the whole nation a black eye for this type of \"enforcement.\"",
                "Holy shit, he pulled over the wrong car and then proceeded to arrest her. What a stupid and awful human being. I hope he has the type of life he deserves.",
                "It would be nice to think he resigned from the shame or the guilt of the consequences of his actions.\n\nHow sad that we live in a world where the reflex is to think it must have been some other reason that motivated him to resign.",
                " now probably works for ICE instead",
                "Assuming he was immediately hired by ~~The Gestapo~~ ICE?",
                "“Have you ever been to jail?”\n\nFucking asshole. Power tripping fucking asshole.",
                "Cop ruined the entire family's lives with a mistaken traffic stop and arrest.",
                "So he could work with the Gestapo?",
                "Huh, before clicking on the article and even while reading it early on I assumed he resigned from the sheer fact that the teenager he arrested ultimately led to her life being completely turned upside down and the guilt just eroded him away until he was too ashamed to even wear a badge that is supposed to resemble his oath to the people. \n\nBut no, he's actually just another dickbag cop that was worried about his reputation LMAO"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Calif. mother who was kidnapped and forced to rob a bank falsely painted as a criminal in court",
            "external_url": "https://www.cbsnews.com/news/michelle-renee-kidnapped-forced-to-rob-bank-falsely-painted-as-a-criminal-in-court/",
            "upvotes": 2785,
            "date": "05/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/09/9fb83ef2-612d-47a8-86ac-43972ff2c793/thumbnail/1200x630/ed9acbec02a68ec2c961d6eb896c2acb/renee-michelle-court.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "This story is chilling. Imagine surviving a violent kidnapping, being forced to commit a crime, and then being re-victimized in court by being painted as the criminal. It really highlights how trauma survivors can be misunderstood and even punished by the very system meant to protect them. Cases like this show why victim advocacy and trauma-informed legal practices are so important.",
                "Wow this story is horrifying and those lawyers sound like absolute pieces of shit. Unreal that the woman who **confessed** got off completely.",
                "In 2019 I was SA'd by a customer at my previous job while off the clock. He was a customer that would come in, speak casually with me and he seemed cool. Exchanged numbers and spoke innocently. One day he told me he was suicidal, so I went to his house. It was a trap. It took me 6 months to find the courage to report it. His lawyer did everything he could to paint me in a negative light. It didn't work. My attacker received 50 years with 25 years suspended. The judge straight up told him, \"You're sorry to your wife. Your sorry to your kids. But the one person you've showed no remorse to the one person who deserves it the most.\"\n\nIn a separate county, I went through TWO domestic assault trials with my ex husband, both had substantial evidence of the abuse. Ie. A audio recordingfor the first assault and a physical witness to the second. The first conviction he received probation and mandatory anger management classes. He failed to complete his anger management classes. He went back to court for that. They dismissed the failure to comply. He kept the assault on his record. \n\nThe second assault, he was given 90 days in jail... with all the time suspended.\n\n\nJustice in this country is relative to where you live. You might see the book get thrown at some people. You might see people walk free. The sad fact is. There is no consistency.",
                "Patti Hearst wants a word.",
                "Haven't read the article but isn't that basically what happened to Patty Hearst when she was kidnapped too?",
                "Didn't this shit happen in a movie before?",
                "So, like Patty Hearst?",
                "Duress defense. Wins at trial. Fuck these prosecutors."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Accused neo-Nazi cult leader extradited to US, as DOJ alleges ties to deadly Nashville school shooting",
            "external_url": "https://abcnews.go.com/US/accused-neo-nazi-cult-leader-extradited-us-doj/story?id=122115150",
            "upvotes": 7034,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2516295-0034-4996-b5a2-9b2817aa8e2e/antioch-high-school-shooting-scene-01-ap-jef-250523_1748016026143_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Michail Chkhikvishvili, a Georgian national arrested in Moldova last year, was arraigned Friday in U.S. federal court in Brooklyn, the DOJ said. His attorney entered a plea of not guilty to the charges and the judge ordered him detained. A status conference in the case was scheduled for June 11.\n\nIt's crazy that Nazis are still a thing. Identifying as loser seems like a weird choice.",
                "Do they got a cabinet position lined up for him yet?",
                "A Georgian national neo-Nazi? Alright, the world is a weird place, but the Nazis committed war crimes in the Caucuses during their push to the oil fields in 1942…",
                "Presidential pardon coming in 3, 2, 1",
                "Probably want to pardon him and make him ambassador",
                "Stephen Miller probably thinks of him like a brother from another mother. ",
                "No worries for that guy. Trump will pardon him.",
                "If yall want more deep dives in Neo Nazi stuff. I implore you to check out the podcast Weird Little Guys. It’s fantastic and shows how just weird as fuck these people are.",
                "Trump administration will throw him a parade",
                "Accused neo-Nazi cult leader?\n\nPardon incoming, as soon as Krasnov stops frantically jerking off."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia hits Ukraine with massive drone, missile barrage amid prisoner exchange",
            "external_url": "https://abcnews.go.com/International/russia-hits-ukraine-massive-drone-missile-barrage-amid/story?id=122173886",
            "upvotes": 161,
            "date": "05/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/278fcdf4-4c31-48b2-bbec-eea3a1184263/Kyiv-explosion-DB-250525_1748156939198_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Putin needs to be in jail for war crimes",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/25/2025 20:08:59 UTC"
}