{
    "posts": [
        {
            "category": "HOT",
            "title": "IDF admits mistakenly identifying Gaza aid workers as threat - after video of attack showed ambulances were marked",
            "external_url": "https://news.sky.com/story/idf-admits-mistakenly-identifying-gaza-aid-workers-as-threat-after-video-of-attack-showed-ambulances-were-marked-13342874",
            "upvotes": 3881,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-gaza-aid-workers_6876575.jpg?20250405094624",
            "top_comments": [
                "“15 Palestinian aid workers were killed and buried in an unmarked grave” “partially buried next to them were the ambulances, fire truck and UN vehicle”. How do you walk back a coverup like this?",
                "1. Tell the world they were Hamas\n\n2. Announce an investigation after clear evidence is shown to contradict their initial claim\n\n3. Say \"whoopsie, looks like we made a mistake\", we'll make sure to discipline those that were involved\n\n4. Do nothing and hope the world forgets about this little incident and continue to commit war crimes",
                "It's not a fucking \"mistake\" if you can clearly identify them and fire anyway.",
                "They deliberately targeted ambulances with sirens on, they deliberately executed the aid workers and they deliberately buried them in a mass grave. Phrasing it as a mistake is pure propaganda, there is no other way to view it as carrying water for Israeli crimes against humanity. You can’t even really say that these are war crimes at this point because it is a wholesale slaughter.",
                "How long before someone decides it's criminal to complain about this?",
                "Many innocent people bury their mistakes in shallow, umarked graves",
                "IDF lied. Again. We can see plain as day that this was an **ambulance** with **lights**.\n\n\nNeither do I believe they have even a single scrap of evidence to support their claim that\n\n\n> The IDF said six of the 15 people killed were linked to Hamas\n\n\nIt's always lies. Murdering aid workers and burying them **with their ambulance** to hide their crime is fucking horrendous.\n\n\nI don't believe for a minute that their soldiers don't have their own cameras, or that IDF couldn't follow up on mass murders like this *if they wanted to*. They simply don't. They don't care about wanting murder of civilians and they don't want to prosecute any of their people for it. They are carrying out a genocidal campaign with the complicity of the Western powers and everyone should be well aware of this by now.",
                "Gutless, chickenshit reporting always pushing the narrative these attacks are 'mistakes.'",
                "IDF: Whoops! Well, what are you going to do about it? Nothing? Ok.",
                "They said it was an \"accepted\" method to bury 15 Aid Workers in a mass grave \"so wild dogs didn't eat them.\"\n\nBut then why bury the uniforms, IDs, phones, 4 marked Ambulances, a Fire Engine, and a United Nations vehicle marked UN??"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "5 nurses who work on the same floor at Massachusetts hospital have brain tumors",
            "external_url": "https://www.nbcnews.com/news/rcna199798",
            "upvotes": 16932,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-newton-mass-general-brigham-newton-wellesley-hospital-google-ac-754p-6d4eef.jpg",
            "top_comments": [
                "11 employees all on the maternity ward experienced illness - I wonder what the symptoms of the other six were",
                "Reminds me of the [Kramatorsk incident where residents were exposed to gamma radiation](https://en.m.wikipedia.org/wiki/Kramatorsk_radiological_accident) due to a capsule containing highly radioactive caesium-17 being in their walls. Residents kept succumbing to leukaemia.",
                "I wonder if they all sat in the same area at work?  \n\n\nPerhaps near a shared wall with an imaging department that was not constructed properly?",
                "This happened to me. Four men on our block got brain tumours within a couple year span. All of us lived on the south side of the street. We all had different types of tumours. I was the only one that survived. One of them was Canadian rock legend Gord Downey of the Tragically Hip.",
                "When i worked in pediatric hematology/oncology as a study coordinator, one of my tasks was maintaining the cancer registry. Basically, any time someone is diagnosed with cancer, it would be put in to the state, and there were things like zip code, date, and other stuff tracked. It was purely because if stuff like this. If ever there were 3 or more cancer patients with similar/the same type of cancer in a certain zip code/area, the state and CDC would send investigators. And, now that RFK Jr and Elon are in charge, that shit will end. And it will be really really bad.",
                "In case anyone didn’t read the article, it’s three different types of benign tumor, which would not meet the definition of a cancer cluster",
                "I ran this by a doctor friend and her take was that a lot of seeming cancer clusters end up being nothing, and it's possible that screening went way up once people started worrying so they found benign tumors that would never have been found otherwise. She thought it would be more likely that there would be a variety of different cancers if you were really dealing with some kind of radiation exposure. \n\n\nI don't know, but it was a possibility I hadn't considered before. ",
                "I’m sure RFK Jr. will get to the bottom of it…",
                "Seems like low probability this should happen but there are like hundreds of thousands of hospital departments in the US, so lots of chances for something like this to occur. \n\nImprobable things happen all the time because the frequency of events in which those things might occur are also incredibly high.\n\nEdit: https://en.m.wikipedia.org/wiki/Law_of_truly_large_numbers \n\nI think of Murphy’s law as a corollary to the law of truly large numbers",
                "The hospital investigated themselves and they did nothing wrong."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Roofer says ICE arrested three of his relatives in a workplace raid.",
            "external_url": "https://www.nbcnews.com/news/us-news/roofer-says-ice-arrested-three-relatives-workplace-raid-rcna199781",
            "upvotes": 5357,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250207-ICE-ch-1610-0afc92.jpg",
            "top_comments": [
                "I didn't understand why ICE isn't raiding meat processing plants in South Dakota, farms in Iowa or construction companies in Arizona. But they did come to Duluth, Minnesota, and took two guys from a roofing company away. ICE isn't trying very hard to get rid of illegals.",
                "Curious, if they were illegal workers, why weren't their bosses also arrested for braking the law by hiring them??",
                "Hmm.....all these ICE stories seem to be mostly in blue states.  Education funding cuts?  Blue states, too.  Trump is weaponizing funding and laws and seeking his revenge.  His disciples still lap it up.",
                "> In the 2024 U.S. presidential election, exit polls indicate that approximately 55% of Latino men voted for Donald Trump, marking a significant increase from previous elections.  This surge in support contributed to Trump securing about 46% of the overall Latino vote, surpassing the previous Republican high set by George W. Bush in 2004.  Economic concerns, particularly inflation and job security, were primary factors influencing this shift among Latino voters.  Additionally, cultural values and perspectives on issues such as immigration and healthcare played roles in their voting decisions.  ￼ ￼\n\nJust leaving this here for no reason.",
                "American born Latinos need to wake up. If you think they are not considering removing you next you are in fantasyland",
                "The real purpose is to rile up people in blue states, identify them, track them and then when the time is right declare that they are threats to America and round them up and ship them off to  a re-education center (slave labor camps) and make them disappear. Sound crazy? It been done before in Germany, Russia, Chile, China, to new just a very few in the past 100 years.",
                "ICE acting like brown shirted thugs from yesteryear",
                "The US unemployment rate is 4%. Who do MAGAs think are going to do the work that immigrants are currently doing?",
                "Should start arresting business owners who employ illegal immigrants in defiance of the laws, too.",
                "I’m sure that the older you get the more conservative you become. People literally voted against their own families."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Measles outbreak in Texas hits 481 cases, with 59 new infections confirmed in last 3 days",
            "external_url": "https://abcnews.go.com/Health/measles-outbreak-texas-hits-481-cases-59-new/story?id=120485225",
            "upvotes": 4005,
            "date": "04/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*Surely the hit-and-run man who loves heroin will fix this for us!*",
                "If only there was a way to prevent this...",
                "New Mexico added 6 new cases today to their total reported case count (up to 54 from 48) for this outbreak.\n\nOklahoma is still at 10 cases.\n\nKansas added one new case this week to bring their total to 24. Most are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "This update adds 59 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 22 cases. Last Friday’s update added 78 cases. Last Tuesday’s update added 18 cases.\n\nFourteen new hospitalizations (up to 56 from 42) were reported, while no new deaths were reported for Texas. That's a significantly larger jump in the number of hospitalizations than has been reported in the past few weeks.\n\nIt's possible some facilities had delayed reporting. Some of these hospitalizations may have occurred in previous weeks and were only reported to the state this week.",
                "The most upsetting part of this is that is the innocent children who are ultimately the ones suffering due to their parent's willful negligence.  In their mind a dead child is better than a vaccinated one.",
                "People with newborns are stressing about the measles since babies can’t get the MMR vaccine until 12 months. Thanks anti-vaxxer assholes",
                "Send RFK Jr. there to investigate and visit those afflicted..",
                "Fuck Andrew Wakefield",
                "Making measles great again",
                "If only there were a vaccine to prevent something like this from happening"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "US rescuers notably absent in Myanmar quake cleanup",
            "external_url": "https://www.nbcnewyork.com/news/national-international/myanmar-earthquake-us-aid-absent/6213545/",
            "upvotes": 2739,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2207977162.jpg?quality=85&strip=all&crop=0px%2C627px%2C6000px%2C3375px&resize=1200%2C675",
            "top_comments": [
                "\"Days after the Myanmar quake, the U.S. made its first announcement of help: It was sending a three-member assessment team of non-specialist advisers from a regional USAID office in Bangkok, Thailand. Coincidentally, like hundreds of other USAID staffers around the world, the three had received layoff notices from the Trump administration on March 28 within hours of the quake, current and former USAID officials confirmed.\"",
                "According to reports US has sent 3 advisors and no rescuers ,That is callous reaction by current Oval Office .",
                "We've gone very quickly from being the World's Leader to the World's Assholes.\n\nThis absolutely does the opposite of making America great.",
                "Oh, and here's a 10% tariff for you when you rebuild.",
                "I live in Fairfax Co., and we always send our rescue teams for international disasters and they are NOT happy about having to sit on their hands.",
                "I work in emergency infrastructure response for a large municipality. As part of that I am also a member of our large state’s safety assessment program (SAP), which is what would be happening in Myanmar right now. \n\nThis is a very niche occupation that unless you work for a large agency you don’t really get much experience. In my work capacity I am handling emergency projects daily but other members of the SAP may go years without any real experience. \n\nThe point is, that it is on our best interests as a country to help other countries because valuable experience, knowledge and contacts are made that will directly benefit our abilities to respond. \n\nFEMA, SAP and other similar programs need qualified, experienced and knowledgeable members. \n\nThis presidency from a know nothing president and his team will cause damage that will be felt years from now. \n\nI mean we all know he is awful but in every thing he does when you drill down further you realize how much more harmful he is.",
                "This administration is busy firing them all.",
                "typical trump quality.",
                ">China shares a border and close ties with Myanmar. Chinese rescuers had their first success Sunday, fewer than 48 hours after the quake, when they joined hands with local people to pull an elderly man from a badly damaged hospital in the capital city of Naypyitaw.\n\n>By Wednesday, Chinese rescuers had pulled out nine survivors, including a pregnant woman and a child. In Mandalay, Chinese rescuers saved a 52-year-old man who trapped for nearly 125 hours.\n\nFor an administration that talks plenty about countering China, shit like this is boneheaded. In these developing countries, when a more pro-China and a more pro-US candidate are going head to head voters are gonna remember it was the Chinese saving them when disasters stuck.",
                "This is extremely sad. This isn't even politics - it's humanity.\nF...you Trump ! You didn't even receive 4 fallen soldiers properly ! You are golfing! Disgusting, vile creature!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Trans student’s arrest for violating Florida bathroom law is thought to be a first",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-students-arrest-violating-florida-bathroom-law-thought-first-rcna199697",
            "upvotes": 10244,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-Marcy-Rheintgen-mb-1502-a7e4b7.jpg",
            "top_comments": [
                "I think this was done to create a legal test case. Given she notified everyone beforehand.",
                "Also in Florida a cis woman lost her job at Walmart when a man went into the ladies room and accused her of being trans. They said she was a security risk because she didn’t tell a salaried manager (she told her supervisor who wasn’t salaried) about the incident. She isn’t trans. People just want to poop and there are already laws against doing dastardly and indecent things in public. Anti trans laws are just discriminatory and hateful. \n\nhttps://www.newsweek.com/woman-says-she-was-fired-after-threats-man-who-made-trans-accusation-2051777",
                "You don’t have to worry about the trans girl. The one who is more likely to assault your daughter is the republican lawmaker or preacher telling you this law is necessary.",
                "I'm curious what would happen if a bunch of ftm, like full on male presenting, people started going into female bathrooms.",
                "Transgender bathroom bans do absolutely nothing to help others. Their only purpose is to harm Transgender people.\n\nIf you don't stand up for the rights of LGBTQ+ Americans, what makes you think there will be anyone to stand up for your rights when someone decides you should be oppressed?",
                "I mean this whole thing is nonsense. I know a few trans people and they were all scared shitless of going in their new gender’s bathroom during their transition. No-one trans is doing anything in there except trying to get out again without being noticed.",
                "This was her intention, however it does highlight how absurd this law is and how non-enforceable it really is. Had she not declared her intentions, literally no one would look at her and think \"that's a dude\"",
                "Utter madness that such a law could even exist.",
                "US actually ARREST people for this?  \n\nWhat a country.",
                "It would be much more traumatic seeing her in the Men's room."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's DOGE teams cut critical funding from America's libraries, officials say",
            "external_url": "https://www.cbsnews.com/news/elon-musk-doge-cuts-libraries/",
            "upvotes": 14187,
            "date": "04/05/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/11f1c4ff-9a5e-4263-9399-e351b94120c7/thumbnail/1200x630/0dfc4742d464fbc09b89b672ffd70123/gettyimages-90748529.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "America made him the richest man in the world.  You'd think he'd be so happy and grateful he'd try to GIVE BACK?\n\nNope.  THIS is how he repays our generosity:\n\nDestroying American Institutions, Chainsawing through our assets and  investments, Terminating those working to keep the government's pact with The People, Threatening those who defy him with prison or illegal rendition.\n\nHe's proud of it.  And with billions in the bank, this compulsive liar and grifter throws bribes at American voters to recruit MORE devils to do his bidding.\n\nMusk is THE most grotesque Potter (\"It's a Wonderful Life\"), whose only friend and family is money, whose only aim in life is replacing our best hopes for America - the source of his wealth - with a dark, evil, dystopian nightmare.",
                "I live alone and paycheck to paycheck. I don’t have family I can rely on financially, and I earn JUST enough to be disqualified from food stamps, internet subsidies, and most other assistance programs. I even considered asking my employers to pay me less.\n\nThe public library has been a lifeline for me. I get free internet there (hotspot I can take home), access to the graphic design software I use for work, and even borrow kitchen and hardware tools. Unlike many programs, the library doesn’t require you to prove you’re poor — it just helps.\n\nThis is why cutting funding or undermining libraries is not just shortsighted — it’s harmful. The library gave me hope when I had to cancel my internet service. It continues to fill gaps that our safety net leaves behind.\n\nI’m attending a protest today because these “smaller” cuts and policy changes are easy for people to ignore. Part of me fears it’ll take something as big as Social Security or Medicare being touched before people realize what’s at stake.",
                "I kind of miss the days when rich people donated to libraries, museums, research, universities, and hospitals in hopes they will be remembered for their contributions to society.",
                "Explain to me again why everyone's life has to be decimated for billionaire tax cuts again.",
                "So in DOGE’s assessment libraries are waste, fraud or abuse. Libraries!\n\nBasically whichever program they don’t like is deemed to be waste.\n\nIn the past rich people would donate large sums of money for the establishment of institutions of  learning. But now the richest guy in the world is gutting libraries.  And getting off on it. (“Chainsaw!”)",
                "If anyone is wondering why Musk and Friends are targeting schools and libraries so viciously, history holds the answer. Slavery \"officially\" ended in America in 1865, but it continued for decades thanks to loopholes in the form of predatory contracts. African Americans who had been kept illiterate by slavery were tricked into signing contracts with their former masters in which they were sold land in exchange for a percentage of their crops. The contracts were routinely altered, however, to make it impossible to actually pay off that land, creating a cycle of permanent debt slavery. It wasn't until reformers from the North started opening Black schools, and the people became educated, that African Americans were able to read and understand the contracts they were signing, seek legal counsel, find representation in Washington, etc. In other words, slavery doesn't end with an amendment. It ends with education.",
                "I am a librarian that works in a state that got our IMLS grant cut. Over 2 million dollars in grant money that supports summer reading programs, statewide ebook and audiobook lending programs, braille books for patrons, also lending programs for veterans...and more.\n\nAccording to DOGE, it was \"good work getting rid of DEI waste\" or whatever b.s. they said. \n\nGood work being heartless jerks.",
                "“ I love the poorly educated”- trump \n\n‘",
                "Elon just doesn't want those pesky books distracting him from staying on top of the Path of Exile leaderboard.",
                "Information is power.\n\nKeep 'em dumb and scared."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "2 US border inspectors are charged with taking bribes to wave in people without documents",
            "external_url": "https://apnews.com/article/us-border-patrol-officers-arrested-bribes-5b08d80f56c526eec1f8f57f7abd20ff?utm_source=copy&utm_medium=share",
            "upvotes": 1846,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is why the drug cartels and human smuggling gangs aren't concerned with any size of wall or security measures. They will simply look for a pliable CBP officer, and bribe them.",
                "Y'all will never see a conservative bring this up",
                "Yup organized crime does not thrive without corruption.  These border guards are just the tip of who has dirty money.  Cops by the border secure shipments and politicians and lawmakers make sure it keepsbhappening.",
                "Meanwhile, your president is currently advertising that he's open to ~~taking bribes~~ selling golden citizenship cards for $5 million dollars",
                "This is how drugs get in too. Offer a border guard his years salary in a bribe? Easy. This has been known for decades and shows how dumb this whole crackdown is",
                "amateurs. the cost is 5mil paid directly to dear leader. \n\nlol",
                "Were they bribes or just a simple \"thank you\" after something they did? Cuz latter is completely legal ruled by SCOTUS",
                "If taking bribes is good enough for the commander in chief….. why not let the border guards take them as well? I mean as long as they pay a percentage to the big guy what’s the problem?",
                "Isn’t that trumps gold card hustle",
                "Show me a 12ft wall, and i’ll show you many different options to bypass that wall."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Venezuelans with legal status are being illegally detained in the US, lawyers say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/05/immigration-venezuelans-detained-legal-status",
            "upvotes": 1981,
            "date": "04/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b12b7f3f70a0d18c522c4fcac7de838665ec4375/0_67_5000_3002/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be549722c836513018643d0665f005bd",
            "top_comments": [
                "Slippery slope to this happening to american born people. This could happen to me and you (if it's not happening already). Political rivals, people that post the wrong message online, this could eventually happen to anyone.",
                "Republicans and conservatives are liars. Don't believe them when they pretend to be ok with immigrants who do things the legal way. They'll jump through all the hoops and move every goal post to justify hurting immigrants and minorities. \n\n\nIf they didn't love what ICE and DOGE are doing to people, they'd be out in the streets and speaking out against Trump.",
                "And the fact is Venezuelan voters okay with being paraded around to support their MAGA fied political stance it’s now clear that Daddy ain’t claiming them!",
                "If you see something shady like this happening to a friend or even a stranger. Stand with them. Resist",
                "\"Oh thank God I can get away from the Venezuelan security forces and seek refuge in the United States!\"\n\n\n\n\nMEANWHILE...",
                "They’re also supposed to be held in prisons when the get to Venezuela too, since that’s where they’ve got space for them… the fuck man",
                "I was told it would just be “the illegals”!",
                ">Venezuela qualifies for a TPS designation because of an [ongoing](https://www.congress.gov/crs-product/IF10230?s=1&r=17) crisis where its president, Nicolás Maduro, is using security forces to imprison and abuse his critics while the vast majority of citizens endure intimidation and desperate poverty. '\n\nOnly to end up here, where the same thing is unfolding.",
                "At this point, not much matters except protecting our right to say \"fuck this\" in the 2 and 4 years.\n\nThey will try to take it away. Pay attention.",
                "If this keeps up, construction in this country will come to a screeching halt. Who do they think those workers are?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 520,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "jd vance peeking in the windows",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                "Pierre Poilievres new campaign strat.",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "UK's Jaguar Land Rover to pause shipments to US over tariffs",
            "external_url": "https://www.reuters.com/business/autos-transportation/uks-jaguar-land-rover-pause-shipments-us-over-tariffs-times-says-2025-04-05/",
            "upvotes": 265,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. \n\n\nNo Jaguars?!\n\n\nNo Land Rovers??!!\n\n\nThe billionaire-infested cabinet will not allow this to stand. They'll get exempted.",
                "Isn't Jaguar taking a semester off to find themselves?",
                "Damn it! I was just about to become a multi millionaire and buy one of each",
                "People buy LR, but I don’t know who is lining up to buy the rebranded Jaguar that the internet memed on.",
                "Dozens of people will be impacted by this, dozens!",
                "✓ 'Rovers, Defenders, and Jags (oh my)  \n✓ Nintendo Switch 2 pre-orders (stings a bit)  \n✓ Stuff I missed (do tell)  \n✓ More to come",
                "Every one that will be tariffed should just stop shipments. The US will learn REAL fuckin fast then",
                "“Jaguar Land Rover will pause shipments of its Britain-made cars to the United States for a month, it said on Saturday, as it considers how to mitigate the cost of President Donald Trump's 25% tariff.\n\nJaguar Land Rover, which is owned by India's Tata Motors (TAMO.NS), opens new tab, confirmed the temporary export suspension after the Times newspaper reported the plan.”",
                "Jaguar used to make good cars. Used to..",
                "Gee, no overpriced, under-engineered jalopies from British engineers???  How will we ever survive?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
            "external_url": "https://news.sky.com/story/two-labour-mps-denied-entry-and-deported-from-israel-13343009",
            "upvotes": 228,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-labour-mps-yuan-yang_6877521.png?20250405234829",
            "top_comments": [
                "  \nThe link requires a waiver. Can you summarize the Israel's case against MPs Yuan Yang and Abtisam Mohamed or provide a clean link?",
                "A badge of honour to have on one's passport",
                "At what point do western countries start to sever ties with Israel? I mean this country treats us terribly, but still demands our money and support? Biggest welfare state in the world.\n\nEdit: below you will see an islamaphobic comment from someone who blocked me. The are trying to suggest that if you don't support Israel, you do support Islamic extremism. Israel survives because it's framed this issue as a dichotomy. The truth is, you could just not pay Israel or support any of it. It's a perfectly acceptable position that you could keep your money for yourself.",
                "Behold the so-called only democracy in the middle east.\n\n\\>document the activities of security forces and spread anti-Israel hatred\n\nSo they are against killing aid workers?",
                "Israel - \"nothing to see here, go away now.\""
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "IDF admits mistakenly identifying Gaza aid workers as threat - after video of attack showed ambulances were marked",
            "external_url": "https://news.sky.com/story/idf-admits-mistakenly-identifying-gaza-aid-workers-as-threat-after-video-of-attack-showed-ambulances-were-marked-13342874",
            "upvotes": 3880,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-gaza-aid-workers_6876575.jpg?20250405094624",
            "top_comments": [
                "“15 Palestinian aid workers were killed and buried in an unmarked grave” “partially buried next to them were the ambulances, fire truck and UN vehicle”. How do you walk back a coverup like this?",
                "1. Tell the world they were Hamas\n\n2. Announce an investigation after clear evidence is shown to contradict their initial claim\n\n3. Say \"whoopsie, looks like we made a mistake\", we'll make sure to discipline those that were involved\n\n4. Do nothing and hope the world forgets about this little incident and continue to commit war crimes",
                "It's not a fucking \"mistake\" if you can clearly identify them and fire anyway.",
                "They deliberately targeted ambulances with sirens on, they deliberately executed the aid workers and they deliberately buried them in a mass grave. Phrasing it as a mistake is pure propaganda, there is no other way to view it as carrying water for Israeli crimes against humanity. You can’t even really say that these are war crimes at this point because it is a wholesale slaughter.",
                "How long before someone decides it's criminal to complain about this?",
                "Many innocent people bury their mistakes in shallow, umarked graves",
                "IDF lied. Again. We can see plain as day that this was an **ambulance** with **lights**.\n\n\nNeither do I believe they have even a single scrap of evidence to support their claim that\n\n\n> The IDF said six of the 15 people killed were linked to Hamas\n\n\nIt's always lies. Murdering aid workers and burying them **with their ambulance** to hide their crime is fucking horrendous.\n\n\nI don't believe for a minute that their soldiers don't have their own cameras, or that IDF couldn't follow up on mass murders like this *if they wanted to*. They simply don't. They don't care about wanting murder of civilians and they don't want to prosecute any of their people for it. They are carrying out a genocidal campaign with the complicity of the Western powers and everyone should be well aware of this by now.",
                "Gutless, chickenshit reporting always pushing the narrative these attacks are 'mistakes.'",
                "IDF: Whoops! Well, what are you going to do about it? Nothing? Ok.",
                "They said it was an \"accepted\" method to bury 15 Aid Workers in a mass grave \"so wild dogs didn't eat them.\"\n\nBut then why bury the uniforms, IDs, phones, 4 marked Ambulances, a Fire Engine, and a United Nations vehicle marked UN??"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 525,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "jd vance peeking in the windows",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                "Pierre Poilievres new campaign strat.",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Labour MP Dan Norris arrested on suspicion of rape and child sex offences",
            "external_url": "https://news.sky.com/story/labour-mp-arrested-on-suspicion-of-rape-and-child-sex-offences-13342856",
            "upvotes": 238,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-dan-norris-labour_6877329.jpg?20250405183946",
            "top_comments": [
                "*He has also lost the party whip in the House of Commons and has stepped down from his role as chair of the League Against Cruel Sports.*\n\nWe must assume that the \"man in his 60s\" is indeed MP Mr Norris.  I wonder why all the dancing around in  this piece about the actual identity of the accused.",
                "It seems pedophilia is the one thing that Labor, the Tories, and the Royal Family can all agree on.",
                "like its really so easy not to be a pedo, loads of people have done it successfully \n\ncan we just like find a few of those people and put them in positions of power?",
                "He might be receiving a job opportunity from trump soon",
                "He should have been suspected from the haircut alone",
                "It's always the ones who hated Corbyn",
                "If found guilty there should be no little deals and exceptional circumstances to be brought forward. If he is a nonce then he should be tried as one and the relevant punishment given, the child / children that have suffered due to his disgusting actions will take many years of therapy if they can be (mended) at all . People of power who are part of the British little boys club that abuse and rape children SHOULD be made an example of and not be protected from punishment…😡😡"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "\"Hands Off\" Protests occur across the US. protesting Trump and Musk",
            "external_url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d",
            "upvotes": 393,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went to the protest in downtown Princeton, New Jersey and there were probably 1400 to 1600 people gathered. A huge turnout for such a small town. My son went to the protest in Boston, my eldest son to the one in Stamford, Connecticut and my sister was on the mall in Washington DC.",
                "Preliminary estimates put attendee numbers at 5 million across the country. For all the people that keep saying Americans aren't doing enough.",
                "Wasting their time...trump is still president"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US rescuers notably absent in Myanmar quake cleanup",
            "external_url": "https://www.nbcnewyork.com/news/national-international/myanmar-earthquake-us-aid-absent/6213545/",
            "upvotes": 2733,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2207977162.jpg?quality=85&strip=all&crop=0px%2C627px%2C6000px%2C3375px&resize=1200%2C675",
            "top_comments": [
                "\"Days after the Myanmar quake, the U.S. made its first announcement of help: It was sending a three-member assessment team of non-specialist advisers from a regional USAID office in Bangkok, Thailand. Coincidentally, like hundreds of other USAID staffers around the world, the three had received layoff notices from the Trump administration on March 28 within hours of the quake, current and former USAID officials confirmed.\"",
                "According to reports US has sent 3 advisors and no rescuers ,That is callous reaction by current Oval Office .",
                "We've gone very quickly from being the World's Leader to the World's Assholes.\n\nThis absolutely does the opposite of making America great.",
                "Oh, and here's a 10% tariff for you when you rebuild.",
                "I live in Fairfax Co., and we always send our rescue teams for international disasters and they are NOT happy about having to sit on their hands.",
                "I work in emergency infrastructure response for a large municipality. As part of that I am also a member of our large state’s safety assessment program (SAP), which is what would be happening in Myanmar right now. \n\nThis is a very niche occupation that unless you work for a large agency you don’t really get much experience. In my work capacity I am handling emergency projects daily but other members of the SAP may go years without any real experience. \n\nThe point is, that it is on our best interests as a country to help other countries because valuable experience, knowledge and contacts are made that will directly benefit our abilities to respond. \n\nFEMA, SAP and other similar programs need qualified, experienced and knowledgeable members. \n\nThis presidency from a know nothing president and his team will cause damage that will be felt years from now. \n\nI mean we all know he is awful but in every thing he does when you drill down further you realize how much more harmful he is.",
                "This administration is busy firing them all.",
                "typical trump quality.",
                ">China shares a border and close ties with Myanmar. Chinese rescuers had their first success Sunday, fewer than 48 hours after the quake, when they joined hands with local people to pull an elderly man from a badly damaged hospital in the capital city of Naypyitaw.\n\n>By Wednesday, Chinese rescuers had pulled out nine survivors, including a pregnant woman and a child. In Mandalay, Chinese rescuers saved a 52-year-old man who trapped for nearly 125 hours.\n\nFor an administration that talks plenty about countering China, shit like this is boneheaded. In these developing countries, when a more pro-China and a more pro-US candidate are going head to head voters are gonna remember it was the Chinese saving them when disasters stuck.",
                "This is extremely sad. This isn't even politics - it's humanity.\nF...you Trump ! You didn't even receive 4 fallen soldiers properly ! You are golfing! Disgusting, vile creature!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Appeals court judges rule in favor of tossing thousands of ballots in close NC supreme court race",
            "external_url": "https://abc7chicago.com/post/jefferson-griffin-allison-riggs-north-carolina-judges-rule-ballots-tossed-republican-candidate-supreme-court-race/16127804/",
            "upvotes": 57,
            "date": "04/05/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/15838157_012625-wtvd-griffin-v-riggs-4th-circuits-630a-vid.jpg?w=1600",
            "top_comments": [
                "Fucking ridiculous. \n\nTHIS is what a stolen election looks like.",
                ">A North Carolina appeals court sided Friday with the trailing Republican candidate\n\n>The disputed ballots are believed to favor Democratic Associate Justice Allison Riggs\n\nDidn't even need to read the article to know that was the case.",
                "Elections rigging is a hallmark of partisan politics.\n\n“Since the country's colonial days, concerns of voter fraud have inspired ever-more complicated ways to cast one's ballot. Depending on where you live, you may vote tomorrow with a lever, a punch card, a marker or a touchscreen. As election scholar Andrew Gumbel notes, **the U.S. has been both a \"living experiment in the expansion of democratic rights\" and a \"world-class laboratory for vote suppression and election-stealing techniques.”**\n\nTIME MAGAZINE, **A BRIEF HISTORY OF**, **Ballots in America,** By M.J. Stephey Monday, Nov. 03, 2008. (emphasis mine)\n\n[http://content.time.com/time/politics/article/0,8599,1855857,00.html](http://content.time.com/time/politics/article/0,8599,1855857,00.html)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "2 US border inspectors are charged with taking bribes to wave in people without documents",
            "external_url": "https://apnews.com/article/us-border-patrol-officers-arrested-bribes-5b08d80f56c526eec1f8f57f7abd20ff?utm_source=copy&utm_medium=share",
            "upvotes": 1849,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is why the drug cartels and human smuggling gangs aren't concerned with any size of wall or security measures. They will simply look for a pliable CBP officer, and bribe them.",
                "Y'all will never see a conservative bring this up",
                "Yup organized crime does not thrive without corruption.  These border guards are just the tip of who has dirty money.  Cops by the border secure shipments and politicians and lawmakers make sure it keepsbhappening.",
                "Meanwhile, your president is currently advertising that he's open to ~~taking bribes~~ selling golden citizenship cards for $5 million dollars",
                "This is how drugs get in too. Offer a border guard his years salary in a bribe? Easy. This has been known for decades and shows how dumb this whole crackdown is",
                "amateurs. the cost is 5mil paid directly to dear leader. \n\nlol",
                "Were they bribes or just a simple \"thank you\" after something they did? Cuz latter is completely legal ruled by SCOTUS",
                "If taking bribes is good enough for the commander in chief….. why not let the border guards take them as well? I mean as long as they pay a percentage to the big guy what’s the problem?",
                "Isn’t that trumps gold card hustle",
                "Show me a 12ft wall, and i’ll show you many different options to bypass that wall."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Montco man arrested, accidently sent child porn to medical office, police say",
            "external_url": "https://www.nbcphiladelphia.com/news/local/montco-man-sent-child-porn-medical-office-police/4150862/",
            "upvotes": 341,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/04/Sussmann-4-3-25.jpg?quality=85&strip=all&crop=0px%2C170px%2C463px%2C261px&resize=1200%2C675",
            "top_comments": [
                "The suspect's age jumping around by 4 years in the first two paragraphs leaves me wondering if this article might not need a bit more editing",
                ">During an investigation into that incident, court documents note, officers visited Sussmann's home, along the 1800 block of Carmel Place, where, officials claim, he permitted them to access his home computer.\n\n>Here, they allegedly found additional child sexual abuse materials -- including the same image that was allegedly sent to the medical business.\n\nHe had that and permitted them to access it. Wonder if he could've denied access and try to nuke it all",
                "Lock his ass up and throw away the key.",
                "How the fuck do you end up doing that?",
                "A strong candidate to head the Trump administration’s new department of children affairs",
                "Don’t ya hate when that happens?",
                "Still not a drag queen weird",
                "Accidentally sent videos of child sexual abuse to medical office.   \nThere, I fixed it."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "\"Hands Off\" Protests occur across the US. protesting Trump and Musk",
            "external_url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d",
            "upvotes": 401,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went to the protest in downtown Princeton, New Jersey and there were probably 1400 to 1600 people gathered. A huge turnout for such a small town. My son went to the protest in Boston, my eldest son to the one in Stamford, Connecticut and my sister was on the mall in Washington DC.",
                "Preliminary estimates put attendee numbers at 5 million across the country. For all the people that keep saying Americans aren't doing enough.",
                "Wasting their time...trump is still president"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "IDF admits mistakenly identifying Gaza aid workers as threat - after video of attack showed ambulances were marked",
            "external_url": "https://news.sky.com/story/idf-admits-mistakenly-identifying-gaza-aid-workers-as-threat-after-video-of-attack-showed-ambulances-were-marked-13342874",
            "upvotes": 3868,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-gaza-aid-workers_6876575.jpg?20250405094624",
            "top_comments": [
                "“15 Palestinian aid workers were killed and buried in an unmarked grave” “partially buried next to them were the ambulances, fire truck and UN vehicle”. How do you walk back a coverup like this?",
                "1. Tell the world they were Hamas\n\n2. Announce an investigation after clear evidence is shown to contradict their initial claim\n\n3. Say \"whoopsie, looks like we made a mistake\", we'll make sure to discipline those that were involved\n\n4. Do nothing and hope the world forgets about this little incident and continue to commit war crimes",
                "It's not a fucking \"mistake\" if you can clearly identify them and fire anyway.",
                "They deliberately targeted ambulances with sirens on, they deliberately executed the aid workers and they deliberately buried them in a mass grave. Phrasing it as a mistake is pure propaganda, there is no other way to view it as carrying water for Israeli crimes against humanity. You can’t even really say that these are war crimes at this point because it is a wholesale slaughter.",
                "How long before someone decides it's criminal to complain about this?",
                "Many innocent people bury their mistakes in shallow, umarked graves",
                "IDF lied. Again. We can see plain as day that this was an **ambulance** with **lights**.\n\n\nNeither do I believe they have even a single scrap of evidence to support their claim that\n\n\n> The IDF said six of the 15 people killed were linked to Hamas\n\n\nIt's always lies. Murdering aid workers and burying them **with their ambulance** to hide their crime is fucking horrendous.\n\n\nI don't believe for a minute that their soldiers don't have their own cameras, or that IDF couldn't follow up on mass murders like this *if they wanted to*. They simply don't. They don't care about wanting murder of civilians and they don't want to prosecute any of their people for it. They are carrying out a genocidal campaign with the complicity of the Western powers and everyone should be well aware of this by now.",
                "Gutless, chickenshit reporting always pushing the narrative these attacks are 'mistakes.'",
                "IDF: Whoops! Well, what are you going to do about it? Nothing? Ok.",
                "At this point, the IDF is a state terrorist organization."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "UK's Jaguar Land Rover to pause shipments to US over tariffs",
            "external_url": "https://www.reuters.com/business/autos-transportation/uks-jaguar-land-rover-pause-shipments-us-over-tariffs-times-says-2025-04-05/",
            "upvotes": 266,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. \n\n\nNo Jaguars?!\n\n\nNo Land Rovers??!!\n\n\nThe billionaire-infested cabinet will not allow this to stand. They'll get exempted.",
                "Isn't Jaguar taking a semester off to find themselves?",
                "Damn it! I was just about to become a multi millionaire and buy one of each",
                "People buy LR, but I don’t know who is lining up to buy the rebranded Jaguar that the internet memed on.",
                "Dozens of people will be impacted by this, dozens!",
                "✓ 'Rovers, Defenders, and Jags (oh my)  \n✓ Nintendo Switch 2 pre-orders (stings a bit)  \n✓ Stuff I missed (do tell)  \n✓ More to come",
                "Every one that will be tariffed should just stop shipments. The US will learn REAL fuckin fast then",
                "“Jaguar Land Rover will pause shipments of its Britain-made cars to the United States for a month, it said on Saturday, as it considers how to mitigate the cost of President Donald Trump's 25% tariff.\n\nJaguar Land Rover, which is owned by India's Tata Motors (TAMO.NS), opens new tab, confirmed the temporary export suspension after the Times newspaper reported the plan.”",
                "Jaguar used to make good cars. Used to..",
                "Gee, no overpriced, under-engineered jalopies from British engineers???  How will we ever survive?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 520,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "jd vance peeking in the windows",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                "Pierre Poilievres new campaign strat.",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Measles outbreak in Texas hits 481 cases, with 59 new infections confirmed in last 3 days",
            "external_url": "https://abcnews.go.com/Health/measles-outbreak-texas-hits-481-cases-59-new/story?id=120485225",
            "upvotes": 4004,
            "date": "04/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*Surely the hit-and-run man who loves heroin will fix this for us!*",
                "If only there was a way to prevent this...",
                "New Mexico added 6 new cases today to their total reported case count (up to 54 from 48) for this outbreak.\n\nOklahoma is still at 10 cases.\n\nKansas added one new case this week to bring their total to 24. Most are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "This update adds 59 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 22 cases. Last Friday’s update added 78 cases. Last Tuesday’s update added 18 cases.\n\nFourteen new hospitalizations (up to 56 from 42) were reported, while no new deaths were reported for Texas. That's a significantly larger jump in the number of hospitalizations than has been reported in the past few weeks.\n\nIt's possible some facilities had delayed reporting. Some of these hospitalizations may have occurred in previous weeks and were only reported to the state this week.",
                "The most upsetting part of this is that is the innocent children who are ultimately the ones suffering due to their parent's willful negligence.  In their mind a dead child is better than a vaccinated one.",
                "People with newborns are stressing about the measles since babies can’t get the MMR vaccine until 12 months. Thanks anti-vaxxer assholes",
                "Send RFK Jr. there to investigate and visit those afflicted..",
                "Fuck Andrew Wakefield",
                "Making measles great again",
                "If only there were a vaccine to prevent something like this from happening"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Labour MPs Yuan Yang and Abtisam Mohamed denied entry and deported from Israel",
            "external_url": "https://news.sky.com/story/two-labour-mps-denied-entry-and-deported-from-israel-13343009",
            "upvotes": 226,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-labour-mps-yuan-yang_6877521.png?20250405234829",
            "top_comments": [
                "  \nThe link requires a waiver. Can you summarize the Israel's case against MPs Yuan Yang and Abtisam Mohamed or provide a clean link?",
                "A badge of honour to have on one's passport",
                "At what point do western countries start to sever ties with Israel? I mean this country treats us terribly, but still demands our money and support? Biggest welfare state in the world.\n\nEdit: below you will see an islamaphobic comment from someone who blocked me. The are trying to suggest that if you don't support Israel, you do support Islamic extremism. Israel survives because it's framed this issue as a dichotomy. The truth is, you could just not pay Israel or support any of it. It's a perfectly acceptable position that you could keep your money for yourself.",
                "Behold the so-called only democracy in the middle east.\n\n\\>document the activities of security forces and spread anti-Israel hatred\n\nSo they are against killing aid workers?",
                "Israel - \"nothing to see here, go away now.\""
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Venezuelans with legal status are being illegally detained in the US, lawyers say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/05/immigration-venezuelans-detained-legal-status",
            "upvotes": 1978,
            "date": "04/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b12b7f3f70a0d18c522c4fcac7de838665ec4375/0_67_5000_3002/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be549722c836513018643d0665f005bd",
            "top_comments": [
                "Slippery slope to this happening to american born people. This could happen to me and you (if it's not happening already). Political rivals, people that post the wrong message online, this could eventually happen to anyone.",
                "Republicans and conservatives are liars. Don't believe them when they pretend to be ok with immigrants who do things the legal way. They'll jump through all the hoops and move every goal post to justify hurting immigrants and minorities. \n\n\nIf they didn't love what ICE and DOGE are doing to people, they'd be out in the streets and speaking out against Trump.",
                "And the fact is Venezuelan voters okay with being paraded around to support their MAGA fied political stance it’s now clear that Daddy ain’t claiming them!",
                "If you see something shady like this happening to a friend or even a stranger. Stand with them. Resist",
                "\"Oh thank God I can get away from the Venezuelan security forces and seek refuge in the United States!\"\n\n\n\n\nMEANWHILE...",
                "They’re also supposed to be held in prisons when the get to Venezuela too, since that’s where they’ve got space for them… the fuck man",
                "I was told it would just be “the illegals”!",
                ">Venezuela qualifies for a TPS designation because of an [ongoing](https://www.congress.gov/crs-product/IF10230?s=1&r=17) crisis where its president, Nicolás Maduro, is using security forces to imprison and abuse his critics while the vast majority of citizens endure intimidation and desperate poverty. '\n\nOnly to end up here, where the same thing is unfolding.",
                "At this point, not much matters except protecting our right to say \"fuck this\" in the 2 and 4 years.\n\nThey will try to take it away. Pay attention.",
                "If this keeps up, construction in this country will come to a screeching halt. Who do they think those workers are?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "US rescuers notably absent in Myanmar quake cleanup",
            "external_url": "https://www.nbcnewyork.com/news/national-international/myanmar-earthquake-us-aid-absent/6213545/",
            "upvotes": 2735,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2207977162.jpg?quality=85&strip=all&crop=0px%2C627px%2C6000px%2C3375px&resize=1200%2C675",
            "top_comments": [
                "\"Days after the Myanmar quake, the U.S. made its first announcement of help: It was sending a three-member assessment team of non-specialist advisers from a regional USAID office in Bangkok, Thailand. Coincidentally, like hundreds of other USAID staffers around the world, the three had received layoff notices from the Trump administration on March 28 within hours of the quake, current and former USAID officials confirmed.\"",
                "According to reports US has sent 3 advisors and no rescuers ,That is callous reaction by current Oval Office .",
                "We've gone very quickly from being the World's Leader to the World's Assholes.\n\nThis absolutely does the opposite of making America great.",
                "Oh, and here's a 10% tariff for you when you rebuild.",
                "I live in Fairfax Co., and we always send our rescue teams for international disasters and they are NOT happy about having to sit on their hands.",
                "I work in emergency infrastructure response for a large municipality. As part of that I am also a member of our large state’s safety assessment program (SAP), which is what would be happening in Myanmar right now. \n\nThis is a very niche occupation that unless you work for a large agency you don’t really get much experience. In my work capacity I am handling emergency projects daily but other members of the SAP may go years without any real experience. \n\nThe point is, that it is on our best interests as a country to help other countries because valuable experience, knowledge and contacts are made that will directly benefit our abilities to respond. \n\nFEMA, SAP and other similar programs need qualified, experienced and knowledgeable members. \n\nThis presidency from a know nothing president and his team will cause damage that will be felt years from now. \n\nI mean we all know he is awful but in every thing he does when you drill down further you realize how much more harmful he is.",
                "This administration is busy firing them all.",
                "typical trump quality.",
                ">China shares a border and close ties with Myanmar. Chinese rescuers had their first success Sunday, fewer than 48 hours after the quake, when they joined hands with local people to pull an elderly man from a badly damaged hospital in the capital city of Naypyitaw.\n\n>By Wednesday, Chinese rescuers had pulled out nine survivors, including a pregnant woman and a child. In Mandalay, Chinese rescuers saved a 52-year-old man who trapped for nearly 125 hours.\n\nFor an administration that talks plenty about countering China, shit like this is boneheaded. In these developing countries, when a more pro-China and a more pro-US candidate are going head to head voters are gonna remember it was the Chinese saving them when disasters stuck.",
                "This is extremely sad. This isn't even politics - it's humanity.\nF...you Trump ! You didn't even receive 4 fallen soldiers properly ! You are golfing! Disgusting, vile creature!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "2 US border inspectors are charged with taking bribes to wave in people without documents",
            "external_url": "https://apnews.com/article/us-border-patrol-officers-arrested-bribes-5b08d80f56c526eec1f8f57f7abd20ff?utm_source=copy&utm_medium=share",
            "upvotes": 1851,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is why the drug cartels and human smuggling gangs aren't concerned with any size of wall or security measures. They will simply look for a pliable CBP officer, and bribe them.",
                "Y'all will never see a conservative bring this up",
                "Yup organized crime does not thrive without corruption.  These border guards are just the tip of who has dirty money.  Cops by the border secure shipments and politicians and lawmakers make sure it keepsbhappening.",
                "Meanwhile, your president is currently advertising that he's open to ~~taking bribes~~ selling golden citizenship cards for $5 million dollars",
                "This is how drugs get in too. Offer a border guard his years salary in a bribe? Easy. This has been known for decades and shows how dumb this whole crackdown is",
                "amateurs. the cost is 5mil paid directly to dear leader. \n\nlol",
                "Were they bribes or just a simple \"thank you\" after something they did? Cuz latter is completely legal ruled by SCOTUS",
                "If taking bribes is good enough for the commander in chief….. why not let the border guards take them as well? I mean as long as they pay a percentage to the big guy what’s the problem?",
                "Isn’t that trumps gold card hustle",
                "Show me a 12ft wall, and i’ll show you many different options to bypass that wall."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Labour MP Dan Norris arrested on suspicion of rape and child sex offences",
            "external_url": "https://news.sky.com/story/labour-mp-arrested-on-suspicion-of-rape-and-child-sex-offences-13342856",
            "upvotes": 236,
            "date": "04/05/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-dan-norris-labour_6877329.jpg?20250405183946",
            "top_comments": [
                "*He has also lost the party whip in the House of Commons and has stepped down from his role as chair of the League Against Cruel Sports.*\n\nWe must assume that the \"man in his 60s\" is indeed MP Mr Norris.  I wonder why all the dancing around in  this piece about the actual identity of the accused.",
                "It seems pedophilia is the one thing that Labor, the Tories, and the Royal Family can all agree on.",
                "like its really so easy not to be a pedo, loads of people have done it successfully \n\ncan we just like find a few of those people and put them in positions of power?",
                "He might be receiving a job opportunity from trump soon",
                "He should have been suspected from the haircut alone",
                "It's always the ones who hated Corbyn",
                "If found guilty there should be no little deals and exceptional circumstances to be brought forward. If he is a nonce then he should be tried as one and the relevant punishment given, the child / children that have suffered due to his disgusting actions will take many years of therapy if they can be (mended) at all . People of power who are part of the British little boys club that abuse and rape children SHOULD be made an example of and not be protected from punishment…😡😡"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/06/2025 00:44:13 UTC"
}