{
    "posts": [
        {
            "category": "HOT",
            "title": "Man deported to El Salvador under Alien Enemies Act because of soccer logo tattoo: Attorney",
            "external_url": "https://abcnews.go.com/Politics/man-deported-el-salvador-alien-enemies-act-soccer-logo-tattoo-attorney/story?id=119983892",
            "upvotes": 8020,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c53e7039-52fc-4319-8f04-c7c14e03e5e3/salvador-deported-10-rt-gmh-250316_1742166305552_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "People still don’t realize how serious this is and that’s a problem.",
                "I recommend watching this short [youtube documentary about CECOT,](https://www.youtube.com/watch?v=BV7Q0zYDO9I) a Mega Prison in El Salvador that the US is now sending people to without Due Process. Any of us could end up there without trial if an ICE agent takes action against you, migrant or citizen.",
                "I saw a news yesterday where a mother from Venezuela recognized his son from El Salvador video being given a haircut, he was moved without any trial or process, just packed in the plane to CECOT, this is horrible.",
                "Its exactly as bad as you might suspect it is.",
                "I am not visiting the US anytime soon, if you don't even have a right for a trial, before you get shipped of to a Camp",
                "This is crazy. He’s not from El Salvador nor has any ties to El Salvador and they just arrested and shipped an innocent soccer player/coach there.",
                "Seems like a violation of the First Amendment. Also, how does everyone feel about [Latin or Greek tattoos](https://nypost.com/2024/11/13/us-news/all-of-secretary-of-defense-nominee-pete-hegseths-tattoos/)?",
                "When will people realize they’re not coming after criminals, they’re coming after everyone without white skin. This was predictable. \n\nEdit: I was mistaken, they’re coming after everyone. ",
                "In addition to the tattoo they said that 🤟 was a gang sign jfc",
                "Most nations are going to start to have to put travel warnings to the US like any other failing state going full dictatorship as Britain just did. Tourism and GDP in many reputable media reports including the St Louis Fed as to GDP both went from solid or even very good growth to BAD negative territory in less time than possibly ever before other than Trump’s Covid screwups. \n\nEither Trump/Musk never considered what losing rule of law would do to trade and alliances, or they just didn’t care at all. Musk clearly did not foresee people actually paying attention to his misdeeds and spanking him with boycotts and more for funding extremists to unseat NATO leaders and generally being an arrogant fascist unable to read a room with acts like telling our biggest spender ally’s official to “be quiet little man” about Starlink Poland is paying plenty for."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 32145,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "It is interesting to note, when the panels came off you got to see the vehicle is essentially plastic. So you get a weak aluminum unibody frame, plastic and steel alloy panels that fall off. Doesn't really sound like a vehicle for long term use. Even if it wasn't a Tesla I wouldn't touch it.",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Remember when they sneakily tried to offload $400 million worth of these to the State Department without a competitive bidding process? Lol.",
                "While they're at the dealership just keep 'em and cash out the owners. Do them all a favour."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 22381,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Position  24.  Saved you a click",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "As a born Finnish (around middle-age) this seems weird because I don't think we're \"happy\" as the word suggests. I think we are \"content\". We got everything quite stable, it's safe, quiet and not a ton of people everywhere. We got nature everywhere, we got our little houses and apartment buildings and we got hobbies.\n\nLavishing life-style, kitted out mansions and supercars have never been hip here. \n\nSure sometimes it's boring as hell, but it's stable and you don't have to fear dropping onto nothing if shit gets difficult/you get sick (unless you purposefully fuck up time after time).",
                "I was told we were going to be great.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 3514,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "Call it what it is. CWD chronic wasting disease",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "Scientists: \"Guys, can we please not dramatize this by calling it something alarmist?\"\n\nMedia: \"Scientists say don't call it zombie deer disease!\"",
                "Great timing to withdraw from the WHO and gut science and environment surveillance",
                "#\"Zombie Deer Disease\" is No Joke\n## – and Scientists are Worried\n\nA strange and deadly disease is creeping through America’s deer, elk and moose, spreading its grip from state to state and even crossing international borders. It is officially known as chronic wasting disease, or CWD, but in the media, it has earned a more lurid nickname: zombie deer disease. The label comes from its eerie symptoms, drooling, vacant stares, dramatic weight loss and animals staggering around in a disoriented daze. But scientists say the nickname is misleading and dangerously trivialises what could turn into a global crisis.\n\nCWD is always fatal and has no cure. First detected in wild deer in Colorado and Wyoming in 1981, it has since spread across 36 American states and beyond, reaching Canada, Scandinavia and South Korea. The disease is caused not by bacteria or a virus but by prions, rogue proteins that infect the brain, causing a slow but unstoppable decline. Once these prions are in the environment, they linger for years, infecting new animals through soil, water and even plants.\n\nFor now, there has been no confirmed case of CWD jumping to humans, but that does not mean the danger is not there. Scientists remember all too well what happened with BSE, or mad cow disease, which took years to leap to people, with tragic consequences. **Experts are warning that CWD could be following a similar path, particularly as thousands of people regularly eat venison from infected deer without realising it.**\n\nMichael Osterholm, an epidemiologist who has been sounding the alarm for years, says the risk is growing, yet governments are not taking it seriously enough. A recent report from 67 experts painted a bleak picture of what would happen if the disease spilt over to humans, predicting chaos in global food supplies, agriculture and trade, not to mention a major public health disaster. Despite this, surveillance and research funding are being cut just when they are needed most.\n\nSome states are making the situation worse. In Wyoming, for example, large numbers of elk and deer are fed artificial food in winter to keep their populations high. Scientists say this is a recipe for disaster, bringing animals into close contact and making it easy for the disease to spread. Meanwhile, predators like wolves and mountain lions, which naturally target sick animals and help control the spread of CWD, are being aggressively culled.\n\nIt is not just scientists who are concerned. Hunters, many of whom rely on venison as a key part of their diet, are beginning to worry about the safety of their food. Yet many deer shot by hunters are never tested for CWD, and contaminated meat is being transported across state lines, increasing the risk of further spread. In some places, infected carcasses are even being dumped in landfill sites, raising fears that the disease could find new ways to take hold in the environment.\n\nThere are no easy solutions, but ignoring the problem is not one of them. Without action, experts warn that entire populations of deer and elk could be wiped out over time. The best way to slow the disease is to let nature take its course, allow predators to do their job and stop artificially feeding wild animals in ways that help CWD thrive.\n\nScientists are watching anxiously, knowing that if CWD ever does jump to humans, the world could be facing another crisis that no one saw coming. For now, all they can do is keep warning people, even if too many are still not listening."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges",
            "external_url": "https://www.kvrr.com/2025/03/20/lawmaker-convicted-of-child-sex-crime-had-history-of-exploiting-vulnerable-boys-prosecutor-alleges/",
            "upvotes": 3427,
            "date": "03/20/2025",
            "thumbnail": "https://www.kvrr.com/content/uploads/2024/08/g/s/holmberg-ray-080824.png",
            "top_comments": [
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "> Holmberg, 81, a Republican from Grand Forks, served in the North Dakota Legislature for 45 years, resigning in 2022.\nHe was linked to the investigation of Nicholas Morgan-Derosier of Grand Forks, who, in May, was sentenced to 40 years in prison on child pornography charges.\nDuring a plea hearing, Holmberg maintained he broke no laws in the Czech Republic, referring to the age of sexual consent in that country. He said he liked getting massages and they sometimes included sexual contact.\n\nThis man seriously tried to argue that he had sex with children, but he shouldn't be charged because he did it in a country with a lower age of consent? That's when you know someone is an absolutely sick pos. Zero shame for his actions, just hating that he's been caught.",
                "On brand and not surprising",
                "r/StillNotADragQueen\n\nshould just be renamed\n\nr/YepAnotherRepublicanChildMolester",
                "Republicans are trying to normalize pedophilia",
                "I read it all, yep it was a republican. Why can’t they just go pick lady bugs off Lyndsey graham and leave the teenage boys alone. ",
                "as per usual, not a drag queen or a trans person, just your garden variety predator, an old white republican man. i'll just assume he's also the american variety of \"christian\".",
                "Child Safety Reminder:\n\nMost boys who are sexually assaulted are victimized by people outside the family.\n\nMost girls who are sexually assaulted are victimized by people inside the family. \n\nKeep your babies safe.",
                "I will make a wild guess here and not be wrong.  Republican? Against women rights? etc...",
                "It’s always *exactly* who you’d suspect, and STILL not a drag queen."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Millions of dollars stolen in Illinois SNAP benefits fraud, leaving vulnerable families at risk",
            "external_url": "https://www.cbsnews.com/chicago/news/illinois-snap-benefits-fraud-ebt-card-money-stolen/",
            "upvotes": 724,
            "date": "03/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/04/b7ccee84-596b-42ad-b1bf-295a37dc02d2/thumbnail/1200x630/4ae7b149f8d8ed01b575e4c3cb208fcb/gettyimages-1375172724.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "This has been a problem for a while, scammer steal the card data through skimming and create fake cards. They then cash everything out at the beginning of the month before the true beneficiaries get a chance.",
                "This has been such a big problem in California they just sent everyone cards with tap.",
                "Notice how quick this thread went from “families had their food money stolen” to “lol corrupt state” jabs.\n\nMeanwhile, people are literally without meals because leadership refuses to secure the system **or reimburse victims.**\n\nYes, Illinois has corruption problems — but throwing labels around doesn’t feed anyone.",
                "Check the DOGE account.",
                "Similar thing happened in Rhode Island and the victims are SoL because there’s not enough funds to replace the stolen benefits.",
                "This is so despicably low.  Stealing people basic food assistance, the small amount they try to live off, it's so fucked up.",
                "I’m not gonna lie, I have been told repeatedly throughout my life that it would cost more money to catch people scamming these programs than it’s worth.\n\nMay it’s time to rethink that\n\nEdit: I don’t give a fuck where the fraud comes from. Also failing to go after past scammers probably helped make a cottage industry out of scamming these programs. People graduate and move on to bigger scams. It was probably never a good idea to just not attempt to catch them.",
                "[deleted]",
                "I’m sure Leon has something to do with it"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Georgetown professor detained by federal immigration officials &#x2d; WTOP News",
            "external_url": "https://wtop.com/dc/2025/03/georgetown-u-professor-detained-by-federal-immigration-officials-lawsuit-says/",
            "upvotes": 1304,
            "date": "03/20/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2022/01/GettyImages-1236982823-scaled-e1643594830754.jpg",
            "top_comments": [
                "People are going to say this is justified because of an alleged tie of him promoting Hamas propaganda but if true, how can you support the gov response? It’s like if I jaywalked, the gov can then send masked goons, whisk me at night, and disappear me to another location because I technically did something wrong or perceived as wrong. Also, the next move for the gov here is to then focus on Americans that are born here and stifle their free speech which we see happening on college campuses.",
                "They know they will have a harder time silencing citizens so they go after the ones they can deport which i think is more of a message to us to “watch it”. They are going to abuse the terrorism thing so hard too. And eventually they will use that to disappear citizens.",
                "> Tricia McLaughlin, a spokesperson for the Department of Homeland Security, said in a post on X that Suri was “actively spreading Hamas propaganda and promoting antisemitism on social media.”\n\nIANAL so someone please correct me if this is wrong, but isn’t this protected speech under the first amendment?",
                "Freedom of speech only exist if you say things they agree with. Pretty soon you could be in trouble for supporting Canada, transgender etc.",
                "It's getting scarier by the day, don't let yourself think anybody is immune or off limits..",
                "Article says the professor was actively spreading Hamas propaganda on social - I'd like to see it. \n\nDoes anyone know how to find this/ his social?",
                "The US has gone full Nazi.",
                "I didn’t have ‘disappearing people’ on my America has Lost Its Mind bingo card for 2025",
                "[removed]",
                "From article:\n\n“But there’s another wrinkle here, which is that his wife, who is a U.S. citizen, appears to be the daughter of someone who served as a senior political adviser to the Hamas leadership. It’s not clear at the moment if he’s still in that capacity or served in that capacity in the past.\n\nSo there’s at least a semi-indirect family connection. We’ve seen a statement from DHS that alleges that Suri has “close connections to a known or suspected terrorist who is a senior adviser to Hamas.” And I think that is referring to his father-in-law. ”\n\nLooks like it could be more than freedom of speech. Also if his wife is US citizen he should be able to get a green card."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "SEC drops case against crypto firm with ties to Trump, CEO says",
            "external_url": "https://abcnews.go.com/US/sec-drops-case-crypto-firm-ties-trump-ceo/story?id=119963257",
            "upvotes": 1595,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/88d6eb42-3a82-4195-9843-94d0552a8534/Garlinghouse-gty-er-250319_1742416559959_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It’s all for sale now. It doesn’t matter what you do, just whether you can buy your way out of it from the Trump administration.",
                "Wow, must be a coincidence? Right?",
                "Blatant corruption. What a sad state they’re turning this country into.",
                "“Nothing to see here, move along.”  SEC",
                "Open corruption in every nook and cranny.",
                "The coming market crash will be catastrophic.",
                "Biff is king and corruption runs rampant in this timeline.",
                "It’s by far the most corrupt admin in US history, how does it stack up to the world?",
                "Rules for thee not for me.",
                "Enron 2.0 incoming in the next 4 years"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 13948,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Tessler. It's all computer.",
                "Oh oh they’re fighting back",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "So is this Counter Terrorism? Donald?",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Was this in auto pilot or just a disgruntled person trying to do terror attack?"
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "HOT",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 35257,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "What a complete shit show.",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "I’ve never seen a country shoot itself in the foot to this degree in such a short span of time. Good luck attracting anyone other than MAGA style idiots at this point.",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president.",
                "USA is now just a fat North Korea"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "67,000 white South Africans have expressed interest in Trump's plan to give them refugee status",
            "external_url": "https://apnews.com/article/trump-white-refugee-afrikaner-south-africa-0fbca411470d3b439886cabc12c7600d",
            "upvotes": 1,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man deported to El Salvador under Alien Enemies Act because of soccer logo tattoo: Attorney",
            "external_url": "https://abcnews.go.com/Politics/man-deported-el-salvador-alien-enemies-act-soccer-logo-tattoo-attorney/story?id=119983892",
            "upvotes": 8035,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c53e7039-52fc-4319-8f04-c7c14e03e5e3/salvador-deported-10-rt-gmh-250316_1742166305552_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "People still don’t realize how serious this is and that’s a problem.",
                "I recommend watching this short [youtube documentary about CECOT,](https://www.youtube.com/watch?v=BV7Q0zYDO9I) a Mega Prison in El Salvador that the US is now sending people to without Due Process. Any of us could end up there without trial if an ICE agent takes action against you, migrant or citizen.",
                "I saw a news yesterday where a mother from Venezuela recognized his son from El Salvador video being given a haircut, he was moved without any trial or process, just packed in the plane to CECOT, this is horrible.",
                "Its exactly as bad as you might suspect it is.",
                "I am not visiting the US anytime soon, if you don't even have a right for a trial, before you get shipped of to a Camp",
                "This is crazy. He’s not from El Salvador nor has any ties to El Salvador and they just arrested and shipped an innocent soccer player/coach there.",
                "Seems like a violation of the First Amendment. Also, how does everyone feel about [Latin or Greek tattoos](https://nypost.com/2024/11/13/us-news/all-of-secretary-of-defense-nominee-pete-hegseths-tattoos/)?",
                "When will people realize they’re not coming after criminals, they’re coming after everyone without white skin. This was predictable. \n\nEdit: I was mistaken, they’re coming after everyone. ",
                "In addition to the tattoo they said that 🤟 was a gang sign jfc",
                "Most nations are going to start to have to put travel warnings to the US like any other failing state going full dictatorship as Britain just did. Tourism and GDP in many reputable media reports including the St Louis Fed as to GDP both went from solid or even very good growth to BAD negative territory in less time than possibly ever before other than Trump’s Covid screwups. \n\nEither Trump/Musk never considered what losing rule of law would do to trade and alliances, or they just didn’t care at all. Musk clearly did not foresee people actually paying attention to his misdeeds and spanking him with boycotts and more for funding extremists to unseat NATO leaders and generally being an arrogant fascist unable to read a room with acts like telling our biggest spender ally’s official to “be quiet little man” about Starlink Poland is paying plenty for."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Kirsty Coventry elected first female president of International Olympic Committee",
            "external_url": "https://www.nbcsports.com/olympics/news/kirsty-coventry-ioc-president-election",
            "upvotes": 106,
            "date": "03/20/2025",
            "thumbnail": "https://nbcsports.brightspotcdn.com/dims4/default/32a811c/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F6e%2F2a%2F041ecf0f40caa3f0fd4d4775a76d%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2196090810",
            "top_comments": [
                "When will she be receiving her first bribe? ",
                "Time to break the glass ceiling for corruption",
                "Groundbreaking day for sports corruption.",
                "First African president of the IOC too.",
                "Good for her, I hope she fights bribery and corruption.",
                "Expect  Republicans to boycott any organization led by a woman",
                "Will she allow raygun to compete again"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Millions of dollars stolen in Illinois SNAP benefits fraud, leaving vulnerable families at risk",
            "external_url": "https://www.cbsnews.com/chicago/news/illinois-snap-benefits-fraud-ebt-card-money-stolen/",
            "upvotes": 722,
            "date": "03/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/04/b7ccee84-596b-42ad-b1bf-295a37dc02d2/thumbnail/1200x630/4ae7b149f8d8ed01b575e4c3cb208fcb/gettyimages-1375172724.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "This has been a problem for a while, scammer steal the card data through skimming and create fake cards. They then cash everything out at the beginning of the month before the true beneficiaries get a chance.",
                "This has been such a big problem in California they just sent everyone cards with tap.",
                "Notice how quick this thread went from “families had their food money stolen” to “lol corrupt state” jabs.\n\nMeanwhile, people are literally without meals because leadership refuses to secure the system **or reimburse victims.**\n\nYes, Illinois has corruption problems — but throwing labels around doesn’t feed anyone.",
                "Check the DOGE account.",
                "Similar thing happened in Rhode Island and the victims are SoL because there’s not enough funds to replace the stolen benefits.",
                "This is so despicably low.  Stealing people basic food assistance, the small amount they try to live off, it's so fucked up.",
                "I’m not gonna lie, I have been told repeatedly throughout my life that it would cost more money to catch people scamming these programs than it’s worth.\n\nMay it’s time to rethink that\n\nEdit: I don’t give a fuck where the fraud comes from. Also failing to go after past scammers probably helped make a cottage industry out of scamming these programs. People graduate and move on to bigger scams. It was probably never a good idea to just not attempt to catch them.",
                "[deleted]",
                "I’m sure Leon has something to do with it"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 3519,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "Call it what it is. CWD chronic wasting disease",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "Scientists: \"Guys, can we please not dramatize this by calling it something alarmist?\"\n\nMedia: \"Scientists say don't call it zombie deer disease!\"",
                "Great timing to withdraw from the WHO and gut science and environment surveillance",
                "#\"Zombie Deer Disease\" is No Joke\n## – and Scientists are Worried\n\nA strange and deadly disease is creeping through America’s deer, elk and moose, spreading its grip from state to state and even crossing international borders. It is officially known as chronic wasting disease, or CWD, but in the media, it has earned a more lurid nickname: zombie deer disease. The label comes from its eerie symptoms, drooling, vacant stares, dramatic weight loss and animals staggering around in a disoriented daze. But scientists say the nickname is misleading and dangerously trivialises what could turn into a global crisis.\n\nCWD is always fatal and has no cure. First detected in wild deer in Colorado and Wyoming in 1981, it has since spread across 36 American states and beyond, reaching Canada, Scandinavia and South Korea. The disease is caused not by bacteria or a virus but by prions, rogue proteins that infect the brain, causing a slow but unstoppable decline. Once these prions are in the environment, they linger for years, infecting new animals through soil, water and even plants.\n\nFor now, there has been no confirmed case of CWD jumping to humans, but that does not mean the danger is not there. Scientists remember all too well what happened with BSE, or mad cow disease, which took years to leap to people, with tragic consequences. **Experts are warning that CWD could be following a similar path, particularly as thousands of people regularly eat venison from infected deer without realising it.**\n\nMichael Osterholm, an epidemiologist who has been sounding the alarm for years, says the risk is growing, yet governments are not taking it seriously enough. A recent report from 67 experts painted a bleak picture of what would happen if the disease spilt over to humans, predicting chaos in global food supplies, agriculture and trade, not to mention a major public health disaster. Despite this, surveillance and research funding are being cut just when they are needed most.\n\nSome states are making the situation worse. In Wyoming, for example, large numbers of elk and deer are fed artificial food in winter to keep their populations high. Scientists say this is a recipe for disaster, bringing animals into close contact and making it easy for the disease to spread. Meanwhile, predators like wolves and mountain lions, which naturally target sick animals and help control the spread of CWD, are being aggressively culled.\n\nIt is not just scientists who are concerned. Hunters, many of whom rely on venison as a key part of their diet, are beginning to worry about the safety of their food. Yet many deer shot by hunters are never tested for CWD, and contaminated meat is being transported across state lines, increasing the risk of further spread. In some places, infected carcasses are even being dumped in landfill sites, raising fears that the disease could find new ways to take hold in the environment.\n\nThere are no easy solutions, but ignoring the problem is not one of them. Without action, experts warn that entire populations of deer and elk could be wiped out over time. The best way to slow the disease is to let nature take its course, allow predators to do their job and stop artificially feeding wild animals in ways that help CWD thrive.\n\nScientists are watching anxiously, knowing that if CWD ever does jump to humans, the world could be facing another crisis that no one saw coming. For now, all they can do is keep warning people, even if too many are still not listening."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Jury awards $6 million to widow of Laguna Woods blind man killed by OC sheriff deputies",
            "external_url": "https://www.cbsnews.com/losangeles/news/jury-awards-6-million-to-widow-of-laguna-woods-man-killed-by-oc-sheriff-deputies/",
            "upvotes": 592,
            "date": "03/20/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/19/f63be757-ef30-4219-b270-c20ce119256a/thumbnail/1200x630/6b5ec1034866d29146378ee45df6e7ea/screenshot-2025-03-19-133705.png?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Sherrif deputies in Orange County believed a visually impaired man with a white and red cane and dark glasses was pretending to be blind.",
                "Am I reading that right, that it took 7 years for this widow to fight this in civil court while the cops were all exonerated for their actions?\n\nI'm having A Day, but like... I am getting real sick and tired of reasonable people getting all the facts laid out to them pertaining to actions cops took, finding them beyond abhorrent enough to warrant a $6 *million* payout, but then the cops and justice system are like \"nope, no wrong doing here.\"\n\nI can joke and say the line, \"We've investigated ourselves and have found no wrongdoing\" but I just can't find the mirth in a reality where I believe beyond a reasonable doubt the judge will either find some excuse to lower the payout or it'll be overturned on appeal down the line.\n\nSeven fucking years though, man. Lowkey kinda hate it here.",
                "Don't worry I am sure the officers will be fine and can shoot more unarmed people shortly. /s",
                "Can we get a national *Do Not Hire* list for shitty and dumb cops already? I don’t like the fact some shitty cop from San Antonio who fed a homeless man an actual shit sandwich can move to a small town closer to me and still wear a badge.",
                "In Arvada Colorado the cops are so corrupt they run their own mafia. \n\nKckpd got caught trafficking underage girls, but they were headed for Colorado and Colorado didn’t get caught",
                "Police laugh at these lawsuits, not only because taxpayers sue themselves but keep paying the police’s salaries to",
                "“And here’s your receipt for your husband.”",
                "Blind and bipolar sounds so difficult. Just lashing out in darkness.",
                "And Starbucks gave the guy whose nuts allegedly got disfigured from hot tea a whopping $30 million.. must’ve been forever traumatizing to have your partner shot dead in front of you like that",
                "Who called the cops for what now anyhow?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Greenpeace ordered to pay more than $660 million over Dakota Access Pipeline protests",
            "external_url": "https://www.cnbc.com/2025/03/20/greenpeace-ordered-to-pay-660-million-over-dakota-access-protests.html",
            "upvotes": 76,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118758-1742441547972-gettyimages-2179624409-HL_EBIYICK_2553172.jpeg?v=1742443355&w=1920&h=1080",
            "top_comments": [
                "Just dissolve the company and open a new one called Greenpiece, if scummy corporations can do it so can the ones fighting scummy corporations."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: US suspends some efforts to counter Russian sabotage as Trump moves closer to Putin",
            "external_url": "https://www.reuters.com/world/us-suspends-some-efforts-counter-russian-sabotage-trump-moves-closer-putin-2025-03-19/",
            "upvotes": 336,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This dumb motherfucker is going to get thousands of people killed. Maybe millions. Russia has been trying to break into vital systems in the USA for decades... power, water, chemical plant safety, telecommunications, banking. The sudden loss of even one of these would be catastrophic and cause death and strife on a massive scale.\n\n\nMake no mistake, that is Russia's goal. And, by proxy, Trump's goal.",
                "Anyone else have this ending to the Russia/USA conflict on their bingo card?",
                "USA/Russia/ North Korea. I have been calling this bingo for a long time.  But a lot are still in denial.",
                "Krasnov at work. Is it wrong to Call him a Traitor?",
                "F Trump. He’s a witting Russian agent. Putin absolutely loves all of the damage Trump is causing. F Krasnov.",
                "Solarwinds you dip shits",
                "Yes, we enjoy being spied upon, compromised, sabotaged here in the United States.\n\nWhy?  'Cause we like Putin.  'Think he is a stand up guy.\n\nRight Repubs?\n\nRight Trumpies?"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "SEC drops case against crypto firm with ties to Trump, CEO says",
            "external_url": "https://abcnews.go.com/US/sec-drops-case-crypto-firm-ties-trump-ceo/story?id=119963257",
            "upvotes": 1597,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/88d6eb42-3a82-4195-9843-94d0552a8534/Garlinghouse-gty-er-250319_1742416559959_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It’s all for sale now. It doesn’t matter what you do, just whether you can buy your way out of it from the Trump administration.",
                "Wow, must be a coincidence? Right?",
                "Blatant corruption. What a sad state they’re turning this country into.",
                "“Nothing to see here, move along.”  SEC",
                "Open corruption in every nook and cranny.",
                "The coming market crash will be catastrophic.",
                "Biff is king and corruption runs rampant in this timeline.",
                "It’s by far the most corrupt admin in US history, how does it stack up to the world?",
                "Rules for thee not for me.",
                "Enron 2.0 incoming in the next 4 years"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Carney will ask Governor General to dissolve Parliament Sunday and call election, sources say",
            "external_url": "https://www.cbc.ca/news/politics/carney-to-call-election-this-sunday-1.7488444",
            "upvotes": 56,
            "date": "03/20/2025",
            "thumbnail": "https://i.cbc.ca/1.7484454.1741989068!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/carney-cabinet-20250314.jpg?im=Resize%3D620",
            "top_comments": [
                "So we have a choice between a guy with a resume, experience, poise and compassion, and\n\nA guy who took 7 years to get an arts degree and used to want to be like the US.\n\nNot too hard a choice to chose between Education and Skills or a guy who makes Truck Stickers."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Man deported to El Salvador under Alien Enemies Act because of soccer logo tattoo: Attorney",
            "external_url": "https://abcnews.go.com/Politics/man-deported-el-salvador-alien-enemies-act-soccer-logo-tattoo-attorney/story?id=119983892",
            "upvotes": 8034,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c53e7039-52fc-4319-8f04-c7c14e03e5e3/salvador-deported-10-rt-gmh-250316_1742166305552_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "People still don’t realize how serious this is and that’s a problem.",
                "I recommend watching this short [youtube documentary about CECOT,](https://www.youtube.com/watch?v=BV7Q0zYDO9I) a Mega Prison in El Salvador that the US is now sending people to without Due Process. Any of us could end up there without trial if an ICE agent takes action against you, migrant or citizen.",
                "I saw a news yesterday where a mother from Venezuela recognized his son from El Salvador video being given a haircut, he was moved without any trial or process, just packed in the plane to CECOT, this is horrible.",
                "Its exactly as bad as you might suspect it is.",
                "I am not visiting the US anytime soon, if you don't even have a right for a trial, before you get shipped of to a Camp",
                "This is crazy. He’s not from El Salvador nor has any ties to El Salvador and they just arrested and shipped an innocent soccer player/coach there.",
                "Seems like a violation of the First Amendment. Also, how does everyone feel about [Latin or Greek tattoos](https://nypost.com/2024/11/13/us-news/all-of-secretary-of-defense-nominee-pete-hegseths-tattoos/)?",
                "When will people realize they’re not coming after criminals, they’re coming after everyone without white skin. This was predictable. \n\nEdit: I was mistaken, they’re coming after everyone. ",
                "In addition to the tattoo they said that 🤟 was a gang sign jfc",
                "Most nations are going to start to have to put travel warnings to the US like any other failing state going full dictatorship as Britain just did. Tourism and GDP in many reputable media reports including the St Louis Fed as to GDP both went from solid or even very good growth to BAD negative territory in less time than possibly ever before other than Trump’s Covid screwups. \n\nEither Trump/Musk never considered what losing rule of law would do to trade and alliances, or they just didn’t care at all. Musk clearly did not foresee people actually paying attention to his misdeeds and spanking him with boycotts and more for funding extremists to unseat NATO leaders and generally being an arrogant fascist unable to read a room with acts like telling our biggest spender ally’s official to “be quiet little man” about Starlink Poland is paying plenty for."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Millions of dollars stolen in Illinois SNAP benefits fraud, leaving vulnerable families at risk",
            "external_url": "https://www.cbsnews.com/chicago/news/illinois-snap-benefits-fraud-ebt-card-money-stolen/",
            "upvotes": 720,
            "date": "03/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/04/b7ccee84-596b-42ad-b1bf-295a37dc02d2/thumbnail/1200x630/4ae7b149f8d8ed01b575e4c3cb208fcb/gettyimages-1375172724.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "This has been a problem for a while, scammer steal the card data through skimming and create fake cards. They then cash everything out at the beginning of the month before the true beneficiaries get a chance.",
                "This has been such a big problem in California they just sent everyone cards with tap.",
                "Notice how quick this thread went from “families had their food money stolen” to “lol corrupt state” jabs.\n\nMeanwhile, people are literally without meals because leadership refuses to secure the system **or reimburse victims.**\n\nYes, Illinois has corruption problems — but throwing labels around doesn’t feed anyone.",
                "Check the DOGE account.",
                "Similar thing happened in Rhode Island and the victims are SoL because there’s not enough funds to replace the stolen benefits.",
                "This is so despicably low.  Stealing people basic food assistance, the small amount they try to live off, it's so fucked up.",
                "I’m not gonna lie, I have been told repeatedly throughout my life that it would cost more money to catch people scamming these programs than it’s worth.\n\nMay it’s time to rethink that\n\nEdit: I don’t give a fuck where the fraud comes from. Also failing to go after past scammers probably helped make a cottage industry out of scamming these programs. People graduate and move on to bigger scams. It was probably never a good idea to just not attempt to catch them.",
                "[deleted]",
                "I’m sure Leon has something to do with it"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges",
            "external_url": "https://www.kvrr.com/2025/03/20/lawmaker-convicted-of-child-sex-crime-had-history-of-exploiting-vulnerable-boys-prosecutor-alleges/",
            "upvotes": 3423,
            "date": "03/20/2025",
            "thumbnail": "https://www.kvrr.com/content/uploads/2024/08/g/s/holmberg-ray-080824.png",
            "top_comments": [
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "> Holmberg, 81, a Republican from Grand Forks, served in the North Dakota Legislature for 45 years, resigning in 2022.\nHe was linked to the investigation of Nicholas Morgan-Derosier of Grand Forks, who, in May, was sentenced to 40 years in prison on child pornography charges.\nDuring a plea hearing, Holmberg maintained he broke no laws in the Czech Republic, referring to the age of sexual consent in that country. He said he liked getting massages and they sometimes included sexual contact.\n\nThis man seriously tried to argue that he had sex with children, but he shouldn't be charged because he did it in a country with a lower age of consent? That's when you know someone is an absolutely sick pos. Zero shame for his actions, just hating that he's been caught.",
                "On brand and not surprising",
                "r/StillNotADragQueen\n\nshould just be renamed\n\nr/YepAnotherRepublicanChildMolester",
                "Republicans are trying to normalize pedophilia",
                "I read it all, yep it was a republican. Why can’t they just go pick lady bugs off Lyndsey graham and leave the teenage boys alone. ",
                "as per usual, not a drag queen or a trans person, just your garden variety predator, an old white republican man. i'll just assume he's also the american variety of \"christian\".",
                "Child Safety Reminder:\n\nMost boys who are sexually assaulted are victimized by people outside the family.\n\nMost girls who are sexually assaulted are victimized by people inside the family. \n\nKeep your babies safe.",
                "I will make a wild guess here and not be wrong.  Republican? Against women rights? etc...",
                "It’s always *exactly* who you’d suspect, and STILL not a drag queen."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 3518,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "Call it what it is. CWD chronic wasting disease",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "Scientists: \"Guys, can we please not dramatize this by calling it something alarmist?\"\n\nMedia: \"Scientists say don't call it zombie deer disease!\"",
                "Great timing to withdraw from the WHO and gut science and environment surveillance",
                "#\"Zombie Deer Disease\" is No Joke\n## – and Scientists are Worried\n\nA strange and deadly disease is creeping through America’s deer, elk and moose, spreading its grip from state to state and even crossing international borders. It is officially known as chronic wasting disease, or CWD, but in the media, it has earned a more lurid nickname: zombie deer disease. The label comes from its eerie symptoms, drooling, vacant stares, dramatic weight loss and animals staggering around in a disoriented daze. But scientists say the nickname is misleading and dangerously trivialises what could turn into a global crisis.\n\nCWD is always fatal and has no cure. First detected in wild deer in Colorado and Wyoming in 1981, it has since spread across 36 American states and beyond, reaching Canada, Scandinavia and South Korea. The disease is caused not by bacteria or a virus but by prions, rogue proteins that infect the brain, causing a slow but unstoppable decline. Once these prions are in the environment, they linger for years, infecting new animals through soil, water and even plants.\n\nFor now, there has been no confirmed case of CWD jumping to humans, but that does not mean the danger is not there. Scientists remember all too well what happened with BSE, or mad cow disease, which took years to leap to people, with tragic consequences. **Experts are warning that CWD could be following a similar path, particularly as thousands of people regularly eat venison from infected deer without realising it.**\n\nMichael Osterholm, an epidemiologist who has been sounding the alarm for years, says the risk is growing, yet governments are not taking it seriously enough. A recent report from 67 experts painted a bleak picture of what would happen if the disease spilt over to humans, predicting chaos in global food supplies, agriculture and trade, not to mention a major public health disaster. Despite this, surveillance and research funding are being cut just when they are needed most.\n\nSome states are making the situation worse. In Wyoming, for example, large numbers of elk and deer are fed artificial food in winter to keep their populations high. Scientists say this is a recipe for disaster, bringing animals into close contact and making it easy for the disease to spread. Meanwhile, predators like wolves and mountain lions, which naturally target sick animals and help control the spread of CWD, are being aggressively culled.\n\nIt is not just scientists who are concerned. Hunters, many of whom rely on venison as a key part of their diet, are beginning to worry about the safety of their food. Yet many deer shot by hunters are never tested for CWD, and contaminated meat is being transported across state lines, increasing the risk of further spread. In some places, infected carcasses are even being dumped in landfill sites, raising fears that the disease could find new ways to take hold in the environment.\n\nThere are no easy solutions, but ignoring the problem is not one of them. Without action, experts warn that entire populations of deer and elk could be wiped out over time. The best way to slow the disease is to let nature take its course, allow predators to do their job and stop artificially feeding wild animals in ways that help CWD thrive.\n\nScientists are watching anxiously, knowing that if CWD ever does jump to humans, the world could be facing another crisis that no one saw coming. For now, all they can do is keep warning people, even if too many are still not listening."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "SEC drops case against crypto firm with ties to Trump, CEO says",
            "external_url": "https://abcnews.go.com/US/sec-drops-case-crypto-firm-ties-trump-ceo/story?id=119963257",
            "upvotes": 1593,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/88d6eb42-3a82-4195-9843-94d0552a8534/Garlinghouse-gty-er-250319_1742416559959_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It’s all for sale now. It doesn’t matter what you do, just whether you can buy your way out of it from the Trump administration.",
                "Wow, must be a coincidence? Right?",
                "Blatant corruption. What a sad state they’re turning this country into.",
                "“Nothing to see here, move along.”  SEC",
                "Open corruption in every nook and cranny.",
                "The coming market crash will be catastrophic.",
                "Biff is king and corruption runs rampant in this timeline.",
                "It’s by far the most corrupt admin in US history, how does it stack up to the world?",
                "Rules for thee not for me.",
                "Enron 2.0 incoming in the next 4 years"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Jury awards $6 million to widow of Laguna Woods blind man killed by OC sheriff deputies",
            "external_url": "https://www.cbsnews.com/losangeles/news/jury-awards-6-million-to-widow-of-laguna-woods-man-killed-by-oc-sheriff-deputies/",
            "upvotes": 592,
            "date": "03/20/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/19/f63be757-ef30-4219-b270-c20ce119256a/thumbnail/1200x630/6b5ec1034866d29146378ee45df6e7ea/screenshot-2025-03-19-133705.png?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Sherrif deputies in Orange County believed a visually impaired man with a white and red cane and dark glasses was pretending to be blind.",
                "Am I reading that right, that it took 7 years for this widow to fight this in civil court while the cops were all exonerated for their actions?\n\nI'm having A Day, but like... I am getting real sick and tired of reasonable people getting all the facts laid out to them pertaining to actions cops took, finding them beyond abhorrent enough to warrant a $6 *million* payout, but then the cops and justice system are like \"nope, no wrong doing here.\"\n\nI can joke and say the line, \"We've investigated ourselves and have found no wrongdoing\" but I just can't find the mirth in a reality where I believe beyond a reasonable doubt the judge will either find some excuse to lower the payout or it'll be overturned on appeal down the line.\n\nSeven fucking years though, man. Lowkey kinda hate it here.",
                "Don't worry I am sure the officers will be fine and can shoot more unarmed people shortly. /s",
                "Can we get a national *Do Not Hire* list for shitty and dumb cops already? I don’t like the fact some shitty cop from San Antonio who fed a homeless man an actual shit sandwich can move to a small town closer to me and still wear a badge.",
                "In Arvada Colorado the cops are so corrupt they run their own mafia. \n\nKckpd got caught trafficking underage girls, but they were headed for Colorado and Colorado didn’t get caught",
                "Police laugh at these lawsuits, not only because taxpayers sue themselves but keep paying the police’s salaries to",
                "“And here’s your receipt for your husband.”",
                "Blind and bipolar sounds so difficult. Just lashing out in darkness.",
                "And Starbucks gave the guy whose nuts allegedly got disfigured from hot tea a whopping $30 million.. must’ve been forever traumatizing to have your partner shot dead in front of you like that",
                "Who called the cops for what now anyhow?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 22378,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Position  24.  Saved you a click",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "As a born Finnish (around middle-age) this seems weird because I don't think we're \"happy\" as the word suggests. I think we are \"content\". We got everything quite stable, it's safe, quiet and not a ton of people everywhere. We got nature everywhere, we got our little houses and apartment buildings and we got hobbies.\n\nLavishing life-style, kitted out mansions and supercars have never been hip here. \n\nSure sometimes it's boring as hell, but it's stable and you don't have to fear dropping onto nothing if shit gets difficult/you get sick (unless you purposefully fuck up time after time).",
                "I was told we were going to be great.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 32134,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "It is interesting to note, when the panels came off you got to see the vehicle is essentially plastic. So you get a weak aluminum unibody frame, plastic and steel alloy panels that fall off. Doesn't really sound like a vehicle for long term use. Even if it wasn't a Tesla I wouldn't touch it.",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Remember when they sneakily tried to offload $400 million worth of these to the State Department without a competitive bidding process? Lol.",
                "While they're at the dealership just keep 'em and cash out the owners. Do them all a favour."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Georgetown professor detained by federal immigration officials &#x2d; WTOP News",
            "external_url": "https://wtop.com/dc/2025/03/georgetown-u-professor-detained-by-federal-immigration-officials-lawsuit-says/",
            "upvotes": 1305,
            "date": "03/20/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2022/01/GettyImages-1236982823-scaled-e1643594830754.jpg",
            "top_comments": [
                "People are going to say this is justified because of an alleged tie of him promoting Hamas propaganda but if true, how can you support the gov response? It’s like if I jaywalked, the gov can then send masked goons, whisk me at night, and disappear me to another location because I technically did something wrong or perceived as wrong. Also, the next move for the gov here is to then focus on Americans that are born here and stifle their free speech which we see happening on college campuses.",
                "They know they will have a harder time silencing citizens so they go after the ones they can deport which i think is more of a message to us to “watch it”. They are going to abuse the terrorism thing so hard too. And eventually they will use that to disappear citizens.",
                "> Tricia McLaughlin, a spokesperson for the Department of Homeland Security, said in a post on X that Suri was “actively spreading Hamas propaganda and promoting antisemitism on social media.”\n\nIANAL so someone please correct me if this is wrong, but isn’t this protected speech under the first amendment?",
                "Freedom of speech only exist if you say things they agree with. Pretty soon you could be in trouble for supporting Canada, transgender etc.",
                "It's getting scarier by the day, don't let yourself think anybody is immune or off limits..",
                "Article says the professor was actively spreading Hamas propaganda on social - I'd like to see it. \n\nDoes anyone know how to find this/ his social?",
                "The US has gone full Nazi.",
                "I didn’t have ‘disappearing people’ on my America has Lost Its Mind bingo card for 2025",
                "[removed]",
                "From article:\n\n“But there’s another wrinkle here, which is that his wife, who is a U.S. citizen, appears to be the daughter of someone who served as a senior political adviser to the Hamas leadership. It’s not clear at the moment if he’s still in that capacity or served in that capacity in the past.\n\nSo there’s at least a semi-indirect family connection. We’ve seen a statement from DHS that alleges that Suri has “close connections to a known or suspected terrorist who is a senior adviser to Hamas.” And I think that is referring to his father-in-law. ”\n\nLooks like it could be more than freedom of speech. Also if his wife is US citizen he should be able to get a green card."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 13954,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Tessler. It's all computer.",
                "Oh oh they’re fighting back",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "So is this Counter Terrorism? Donald?",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Was this in auto pilot or just a disgruntled person trying to do terror attack?"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/20/2025 20:09:19 UTC"
}