{
    "posts": [
        {
            "category": "HOT",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 17851,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e1bac0a1-ea2e-464f-834c-50605d582485/kirsten-gillibrand-ap-jt-250430_1746052835024_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!",
                "9/11 firefighters are treated far worse than J6ers",
                "Republicans being patriotic and christian again. It's just too much."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 2836,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "Laura Loomer runs National security",
                "So the guy who added the journalist to the chat and shared classified info not once but twice still has a job, but this guy takes the fall?",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Measurment: Waltzamucci",
                "... and ... the revolving door has begun to spin ..."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Quebec to impose full ban on cellphones in schools",
            "external_url": "https://www.cbc.ca/news/canada/montreal/quebec-cell-phone-ban-1.7523543",
            "upvotes": 721,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7299218.1724883221!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/schools-cellphones.jpg?im=Resize%3D620",
            "top_comments": [
                "This seems like a necessary step.",
                "How did phones end up in schools in the first place? We couldn’t even wear hats in school.",
                "Surprised it wasn't implemented much earlier",
                "My child's school had a \"Cell Phone Ban,\" yet almost all kids had cell phones and used them constantly with rarely if any interference by teachers/staff.\n\nI came to realize they fully allowed it since the phones, to an extent, controlled the student's behavior.  The more the students were glued to their phones, the less **overt** trouble they caused and the less overt trouble teachers/staff had to deal with.\n\nBut, it also seemed clear to me that the presence of the phones created much more **covert** trouble and cyberbullying, etc.\n\nBottomline, cell phones are a ubiquitous fact of life, I'd much rather schools embrace that and encourage/enforce thoughtful/mature use of them.  Heck, they can have a role in learning if their use was considered carefully.",
                "As a 90s/2000s kid it boggles my mind even the idea of being able to have a smart phone in class.\n\nHell I had my calculator taken away several times just because it had the Snake game on it.",
                "What's missing is the details, for now.\n\nQuebec is great for bungling laws application. Bill 101 is a good example.\n\nWill the phones be banned in public transportation too? No. OK. Where TF will the students put their phones when they get to school? They can't even prevent bike theft. Cellphones? That's gonna be fun.\n\nLeave cells at home? Well, what if they have a parascolar activity that requires it? Or they need it to call parents after it for pick-up?\n\nAre they going to prevent the kid with a house in front of the school from having a cellphone at home? No? OK. Lunchtime will be fun unless they lock kids in.\n\nSome schools have good systems already: phones off and away from sight at all times.  Suspension otherwise. But hey, that's private schools. I guess public schools were not able to enforce it.\n\n(Hey downvoters, please reply to contribute something to the discussion)",
                "Man, they're really not coping well with all the Tom Wilson memes going around recently",
                "It's okay, they don't have to worry about emergencies ever because they are Canada.",
                "As a teacher. Fuck yes. This needs to happen or children are doomed",
                "Seems like a good idea. But good luck with it"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 5958,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "Picking up one per second is $360/hr",
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "This feels like the start of a probability question.",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "Is this the real life? Is this just fantasy?\n\nWhy is a literal truckload of dimes being transported? Where were they going? To what end? Who needs so many dimes? I have a fairly vivid imagination. I cannot imagine a scenario, based in reality, in which a lorry full of dimes would be required.\n\nAnyone have any good, plausible ideas?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Veteran slaying trial: Wife found guilty of murder, immediately sentenced to life in prison",
            "external_url": "https://clarksvillenow.com/local/veteran-slaying-trial-wife-found-guilty-of-murder-immediately-sentenced-to-life-in-prison/",
            "upvotes": 477,
            "date": "05/01/2025",
            "thumbnail": "https://clarksvillenow.com/wp-content/blogs.dir/43/files/2025/04/Theary-Lim-verdict-4.jpg",
            "top_comments": [
                "CLARKSVILLE, TN (CLARKSVILLE NOW) – After three days of testimony and only 1 hour and 20 minutes of jury deliberation, Theary Lim, charged with killing her Army veteran husband, was found guilty of first-degree murder on Wednesday and immediately sentenced to life in prison.\n\nOn Jan. 3, 2022, Clarksville Police conducted a welfare check in the 2200 block of Ladd Drive. Upon arrival, they found 38-year-old Sothon In dead from a gunshot wound to the head. Nearby, his wife, 32-year-old Theary Lim, and her two children were on the floor under a blanket. The next day, Theary Lim was arrested and charged.\n\nProsecution: ‘This wasn’t an accident, this was calculated’\nDuring closing arguments, Assistant District Attorney Crystal Morgan displayed a professional photograph to the jury of Theary Lim holding a firearm, a leg holster secured to her thigh, and a T-shirt with the words “Girls just want to have guns” printed on the back.\n\n“It’s the defendant’s own statement to Detective (Keenan) Carlton: She admits she had the gun in her hands. She was playing with the gun, she shook it, and it went off,” Morgan told the jury.\n\nMorgan referred to the medical examiner’s testimony that the bullet entered through Sothon’s forehead and exited out the back. She stated the defendant would had to have been standing beside the bed at close range, within 3 feet, when she fired the shot.\n\n“She left her husband in that bedroom for hours to die,” Morgan said. “A nine-hour and four-minute window that Sothon lay in that bedroom – with the defendant and his children in the house – dead.\n\n“It was an accident?” Morgan said. “What we have to believe to accept that statement is that she retrieved a gun, decided to play with it at the head of her sleeping husband.” Morgan cited testimony from an expert witness who stated it would take 7 pounds of pressure on the trigger in order for that gun to go off. “Does that pass your common sense?\n\n“This wasn’t an accident, ladies and gentlemen,” Morgan said. “It was premeditated. It was calculated. She locks the door at 12:15 (p.m.), she closes the blinds after he’s shot, and at 12:59 (p.m.) she unlocks the door. … Hold her responsible. Find her guilty.”\n\nDefense: How many unanswered questions can you live with?\nWhile Theary’s attorney, Chase Smith, waived opening remarks, he did not pass up on closing arguments. “How many unanswered questions can you have and still find someone guilty of premeditated first-degree murder?” Chase Smith asked. “Moral certainty is required, absolute certainty is not.”\n\nSmith explained this means that when the trial is over and the jury is allowed to speak about the case, they need to be able to “without hesitation” explain why they found her guilty, why she shot him, why she did it intentionally, and why it was premeditated.\n\nHe pointed out what he called flaws in the state’s case and with their witnesses. Smith mentioned a “drive-thru forensic test” explaining that it took three years to get a test back on the gunshot residue kit from the Tennessee Bureau of Investigation, a test that once it was started, only took one day to complete and get results. And he called the results confusing.\n\n“All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n\nSmith furthered his point by referencing the medical examiner report. Though the gun was close to the victims head, it wasn’t close enough to leave a muzzle stamp, meaning there wasn’t hard contact. “No pressure, no press down like you want to really kill somebody because you’re mad.\n\n“It doesn’t prove that she shot him,” Smith said. “What if he shot himself? What if one of the kids shot him? If you have a significant amount of unanswered questions, you’ve got to ask yourselves, how many can you have and still be certain that she’s guilty?” Smith asked the jury.\n\nSentenced to life in prison\nTheary Lim was found guilty as charged of first-degree murder. After the jury was dismissed, a sentencing was immediately held.\n\nIn the state of Tennessee, if any individual is found guilty of first-degree murder, it is a mandatory life sentence (60 years). The only charge Theary was facing was the murder charge. Judge Robert Bateman imposed an immediate life sentence, minus credited time served up to 15%, for a minimum of 51 years in prison.",
                "What was the motive?  I have no problem holding her responsible for the death, but first degree murder and no established motive?",
                "reading the case. \n\nyeah it was on purpose.\n\ndo gun trigger some time fail .(many recalls on that) but if gun was used before said event.\n\nit would have been easy to spot or notice in the gun.",
                "It's been proven that most gun-related accidents are usually their own family members.\n\n\nHell, my older brother almost shot me once, I was staying with him and came home one night super late. He had his gun drawn on me, and I told him I came in through the front door and had keys and everything lol.\n\n\nAn intruder wouldn't enter that way, nor have keys.\n\n\nI feel like owning a gun makes people jumpy with it, like they *want* to use it on something to justify owning it.",
                "Can't access the article so not sure what \"immediately\" means here, but I'm pretty sure nothing happens immediately in the legal world.",
                "She should have used the good ole “I didn’t know the gun was loaded” defense! /s",
                "> “All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n“What if he shot himself? What if one of the kids shot him? \n\nSounds like the prosecution failed to meet the burden of proof required for prove premeditation, but it’s Tennessee…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 24015,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Must have been an ICE office field trip or something since this was just law enforcement doing their three favorite things: abusing power, stealing, and looking at undressed minors.",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "The full [quote](https://kfor.com/news/local/were-citizens-oklahoma-city-family-traumatized-after-ice-raids-home-but-they-werent-suspects/) from the KFOR story is haunting.\n\n>“What if I would have been armed,” she said. “You’re breaking in. What am I supposed to think? My initial thought was we were being robbed—that my daughters, being females, were being kidnapped. You have guns pointed in our faces. Can you just reprogram yourself and see us as humans, as women? A little bit of mercy. Care a little bit about your fellow human, about your fellow citizen, fellow resident. We bleed too. We work. We bleed just like anybody else bleeds. We’re scared. You could see our faces that we were terrified. What makes you so much more worthier of your peace? What makes you so much more worthier of protecting your children? What makes you so much more worthy of your citizenship? What makes you more worthy of safety? Of being given the right that they took from me to protect my daughters?”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 17829,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "What’s up with middle schoolers and being the worst people possible?",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "Genius kid-must have learned it from the parents"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 3028,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ac061853d45f740b3b609756c2c36ce1604d153c/0_203_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21fa8cde98ce0947d6a960f809fae006",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Trump: “So… where are the minerals?”\n\nZelensky: “Over there, there, and there”\n\nTrump: “Wait.. the area is filled with angry Russian army!”\n\nZelensky: “Feel free to kick them out. It’s all yours!”",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "He is going to betray you like the Kurds.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "Congrats to Ukraine for being able to close the deal they've been working on for 6 months. Sounds like they got most of what they were looking for.",
                "*Income and contributions to the fund would not be taxed in the US or Ukraine, she said, “to make investments yield the greatest results” and technology transfer and development were a “key” part of the agreement.*\n\nSo no public return, just total extraction of wealth by investors?",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "Zelenskyy is smart, he knows the next president will waive it.",
                "But… did he say Thank You?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Accused serial cat killer in Santa Ana out of jail",
            "external_url": "https://www.nbclosangeles.com/news/local/accused-serial-cat-killer-santa-ana-out-of-jail/3688302/",
            "upvotes": 841,
            "date": "05/01/2025",
            "thumbnail": "https://media.nbclosangeles.com/2025/04/cat-killer.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "I hate that this coward’s hiding his face and they don’t show his mugshot\n\nHappy they show it here though: https://ktla.com/news/california/santa-ana-pd-condemns-unruly-vigil-after-alleged-cat-killer-released-on-bail/",
                "You gotta seriously be lacking so many things to torture critters like that.\n\nNo empathy, sympathy, remorse, or guilt.",
                "Man, an angry mob sounds great right now",
                "Psychopath piece of shit",
                "Future serial killer.  Also,  did he not watch Don't Fuck With Cats on Netflix?",
                "I feel like this is one of those crimes where they should hold you. Not that it isn't hugely wrong to neglect your own pets or farm animals, but this is just actively killing or torturing things. He could actually truly be a danger to other people and not just innocent little animals.\n\nI'm not even joking, luring animals with food so you can kill them is insane. Most animal cruelty is \"you're a terrible dog owner who left her locked up, hungry, and dirty\", not actively hurting animals for pleasure.",
                "Why was bail allowed if there a multiple witnesses",
                "He'll bump into a crazy cat lover sooner or later. Wish it happens sooner.",
                "Seriously though Is there a way that animal shelters can do background checks or something so that way he can't adopt a cat. I really need this person to not be able to come into contact with cats. It's soo sad to think about",
                "I never understand when this kind of things happen. Really disgusting."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "SOS: Migrants held in Texas fear notorious El Salvador prison",
            "external_url": "https://www.reuters.com/world/americas/sos-migrants-held-texas-fear-notorious-el-salvador-prison-2025-04-30/",
            "upvotes": 276,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Venezuelan detainees in Texas fear the Trump administration will send them to El Salvador's notorious CECOT maximum security prison.\n\nShhh! Fear is exactly what he wants to hear to validate the deportations."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FTC orders Publishers Clearing House to pay $18.5 million to 'misled' customers",
            "external_url": "https://www.denver7.com/us-news/ftc-orders-publishers-clearing-house-to-pay-18-5-million-to-misled-customers",
            "upvotes": 66,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/a47c520/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fbd%2F06%2Fdc94342e4e86939bce9af5d003c3%2Fshutterstock-1111363946.jpg",
            "top_comments": [
                "We WERE mislead.\n\nIt was never Ed McMahon after all.",
                ">The company, known for its sweepstakes, filed for bankruptcy earlier this year. PCH aired commercials featuring sweepstakes winners receiving giant checks delivered to their homes along with flowers and champagne.\n\nEd McMahon was a spokesperson for American Family Publishers. Publishers Clearing House had the Prize Patrol. It's a common example of the Mandela Effect.",
                "If you wondered why companies running contests prominently say NO PURCHASE NECESSARY, VOID WHERE PROHIBITED... well this is why."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Runaway kangaroo temporarily shuts down highway in Alabama",
            "external_url": "https://www.cnn.com/2025/04/30/us/runaway-kangaroo-shuts-highway-alabama-hnk",
            "upvotes": 26,
            "date": "05/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25119824201576.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Commuters are hopping mad."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 2838,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "Laura Loomer runs National security",
                "So the guy who added the journalist to the chat and shared classified info not once but twice still has a job, but this guy takes the fall?",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Measurment: Waltzamucci",
                "... and ... the revolving door has begun to spin ..."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Quebec to impose full ban on cellphones in schools",
            "external_url": "https://www.cbc.ca/news/canada/montreal/quebec-cell-phone-ban-1.7523543",
            "upvotes": 723,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7299218.1724883221!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/schools-cellphones.jpg?im=Resize%3D620",
            "top_comments": [
                "This seems like a necessary step.",
                "How did phones end up in schools in the first place? We couldn’t even wear hats in school.",
                "Surprised it wasn't implemented much earlier",
                "My child's school had a \"Cell Phone Ban,\" yet almost all kids had cell phones and used them constantly with rarely if any interference by teachers/staff.\n\nI came to realize they fully allowed it since the phones, to an extent, controlled the student's behavior.  The more the students were glued to their phones, the less **overt** trouble they caused and the less overt trouble teachers/staff had to deal with.\n\nBut, it also seemed clear to me that the presence of the phones created much more **covert** trouble and cyberbullying, etc.\n\nBottomline, cell phones are a ubiquitous fact of life, I'd much rather schools embrace that and encourage/enforce thoughtful/mature use of them.  Heck, they can have a role in learning if their use was considered carefully.",
                "As a 90s/2000s kid it boggles my mind even the idea of being able to have a smart phone in class.\n\nHell I had my calculator taken away several times just because it had the Snake game on it.",
                "What's missing is the details, for now.\n\nQuebec is great for bungling laws application. Bill 101 is a good example.\n\nWill the phones be banned in public transportation too? No. OK. Where TF will the students put their phones when they get to school? They can't even prevent bike theft. Cellphones? That's gonna be fun.\n\nLeave cells at home? Well, what if they have a parascolar activity that requires it? Or they need it to call parents after it for pick-up?\n\nAre they going to prevent the kid with a house in front of the school from having a cellphone at home? No? OK. Lunchtime will be fun unless they lock kids in.\n\nSome schools have good systems already: phones off and away from sight at all times.  Suspension otherwise. But hey, that's private schools. I guess public schools were not able to enforce it.\n\n(Hey downvoters, please reply to contribute something to the discussion)",
                "Man, they're really not coping well with all the Tom Wilson memes going around recently",
                "It's okay, they don't have to worry about emergencies ever because they are Canada.",
                "As a teacher. Fuck yes. This needs to happen or children are doomed",
                "Seems like a good idea. But good luck with it"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 17861,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e1bac0a1-ea2e-464f-834c-50605d582485/kirsten-gillibrand-ap-jt-250430_1746052835024_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!",
                "9/11 firefighters are treated far worse than J6ers",
                "Republicans being patriotic and christian again. It's just too much."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "SOS: Migrants held in Texas fear notorious El Salvador prison",
            "external_url": "https://www.reuters.com/world/americas/sos-migrants-held-texas-fear-notorious-el-salvador-prison-2025-04-30/",
            "upvotes": 275,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Venezuelan detainees in Texas fear the Trump administration will send them to El Salvador's notorious CECOT maximum security prison.\n\nShhh! Fear is exactly what he wants to hear to validate the deportations."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Veteran slaying trial: Wife found guilty of murder, immediately sentenced to life in prison",
            "external_url": "https://clarksvillenow.com/local/veteran-slaying-trial-wife-found-guilty-of-murder-immediately-sentenced-to-life-in-prison/",
            "upvotes": 477,
            "date": "05/01/2025",
            "thumbnail": "https://clarksvillenow.com/wp-content/blogs.dir/43/files/2025/04/Theary-Lim-verdict-4.jpg",
            "top_comments": [
                "CLARKSVILLE, TN (CLARKSVILLE NOW) – After three days of testimony and only 1 hour and 20 minutes of jury deliberation, Theary Lim, charged with killing her Army veteran husband, was found guilty of first-degree murder on Wednesday and immediately sentenced to life in prison.\n\nOn Jan. 3, 2022, Clarksville Police conducted a welfare check in the 2200 block of Ladd Drive. Upon arrival, they found 38-year-old Sothon In dead from a gunshot wound to the head. Nearby, his wife, 32-year-old Theary Lim, and her two children were on the floor under a blanket. The next day, Theary Lim was arrested and charged.\n\nProsecution: ‘This wasn’t an accident, this was calculated’\nDuring closing arguments, Assistant District Attorney Crystal Morgan displayed a professional photograph to the jury of Theary Lim holding a firearm, a leg holster secured to her thigh, and a T-shirt with the words “Girls just want to have guns” printed on the back.\n\n“It’s the defendant’s own statement to Detective (Keenan) Carlton: She admits she had the gun in her hands. She was playing with the gun, she shook it, and it went off,” Morgan told the jury.\n\nMorgan referred to the medical examiner’s testimony that the bullet entered through Sothon’s forehead and exited out the back. She stated the defendant would had to have been standing beside the bed at close range, within 3 feet, when she fired the shot.\n\n“She left her husband in that bedroom for hours to die,” Morgan said. “A nine-hour and four-minute window that Sothon lay in that bedroom – with the defendant and his children in the house – dead.\n\n“It was an accident?” Morgan said. “What we have to believe to accept that statement is that she retrieved a gun, decided to play with it at the head of her sleeping husband.” Morgan cited testimony from an expert witness who stated it would take 7 pounds of pressure on the trigger in order for that gun to go off. “Does that pass your common sense?\n\n“This wasn’t an accident, ladies and gentlemen,” Morgan said. “It was premeditated. It was calculated. She locks the door at 12:15 (p.m.), she closes the blinds after he’s shot, and at 12:59 (p.m.) she unlocks the door. … Hold her responsible. Find her guilty.”\n\nDefense: How many unanswered questions can you live with?\nWhile Theary’s attorney, Chase Smith, waived opening remarks, he did not pass up on closing arguments. “How many unanswered questions can you have and still find someone guilty of premeditated first-degree murder?” Chase Smith asked. “Moral certainty is required, absolute certainty is not.”\n\nSmith explained this means that when the trial is over and the jury is allowed to speak about the case, they need to be able to “without hesitation” explain why they found her guilty, why she shot him, why she did it intentionally, and why it was premeditated.\n\nHe pointed out what he called flaws in the state’s case and with their witnesses. Smith mentioned a “drive-thru forensic test” explaining that it took three years to get a test back on the gunshot residue kit from the Tennessee Bureau of Investigation, a test that once it was started, only took one day to complete and get results. And he called the results confusing.\n\n“All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n\nSmith furthered his point by referencing the medical examiner report. Though the gun was close to the victims head, it wasn’t close enough to leave a muzzle stamp, meaning there wasn’t hard contact. “No pressure, no press down like you want to really kill somebody because you’re mad.\n\n“It doesn’t prove that she shot him,” Smith said. “What if he shot himself? What if one of the kids shot him? If you have a significant amount of unanswered questions, you’ve got to ask yourselves, how many can you have and still be certain that she’s guilty?” Smith asked the jury.\n\nSentenced to life in prison\nTheary Lim was found guilty as charged of first-degree murder. After the jury was dismissed, a sentencing was immediately held.\n\nIn the state of Tennessee, if any individual is found guilty of first-degree murder, it is a mandatory life sentence (60 years). The only charge Theary was facing was the murder charge. Judge Robert Bateman imposed an immediate life sentence, minus credited time served up to 15%, for a minimum of 51 years in prison.",
                "What was the motive?  I have no problem holding her responsible for the death, but first degree murder and no established motive?",
                "reading the case. \n\nyeah it was on purpose.\n\ndo gun trigger some time fail .(many recalls on that) but if gun was used before said event.\n\nit would have been easy to spot or notice in the gun.",
                "It's been proven that most gun-related accidents are usually their own family members.\n\n\nHell, my older brother almost shot me once, I was staying with him and came home one night super late. He had his gun drawn on me, and I told him I came in through the front door and had keys and everything lol.\n\n\nAn intruder wouldn't enter that way, nor have keys.\n\n\nI feel like owning a gun makes people jumpy with it, like they *want* to use it on something to justify owning it.",
                "Can't access the article so not sure what \"immediately\" means here, but I'm pretty sure nothing happens immediately in the legal world.",
                "She should have used the good ole “I didn’t know the gun was loaded” defense! /s",
                "> “All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n“What if he shot himself? What if one of the kids shot him? \n\nSounds like the prosecution failed to meet the burden of proof required for prove premeditation, but it’s Tennessee…."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Accused serial cat killer in Santa Ana out of jail",
            "external_url": "https://www.nbclosangeles.com/news/local/accused-serial-cat-killer-santa-ana-out-of-jail/3688302/",
            "upvotes": 841,
            "date": "05/01/2025",
            "thumbnail": "https://media.nbclosangeles.com/2025/04/cat-killer.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "I hate that this coward’s hiding his face and they don’t show his mugshot\n\nHappy they show it here though: https://ktla.com/news/california/santa-ana-pd-condemns-unruly-vigil-after-alleged-cat-killer-released-on-bail/",
                "You gotta seriously be lacking so many things to torture critters like that.\n\nNo empathy, sympathy, remorse, or guilt.",
                "Man, an angry mob sounds great right now",
                "Psychopath piece of shit",
                "Future serial killer.  Also,  did he not watch Don't Fuck With Cats on Netflix?",
                "I feel like this is one of those crimes where they should hold you. Not that it isn't hugely wrong to neglect your own pets or farm animals, but this is just actively killing or torturing things. He could actually truly be a danger to other people and not just innocent little animals.\n\nI'm not even joking, luring animals with food so you can kill them is insane. Most animal cruelty is \"you're a terrible dog owner who left her locked up, hungry, and dirty\", not actively hurting animals for pleasure.",
                "Why was bail allowed if there a multiple witnesses",
                "He'll bump into a crazy cat lover sooner or later. Wish it happens sooner.",
                "Seriously though Is there a way that animal shelters can do background checks or something so that way he can't adopt a cat. I really need this person to not be able to come into contact with cats. It's soo sad to think about",
                "I never understand when this kind of things happen. Really disgusting."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 3029,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ac061853d45f740b3b609756c2c36ce1604d153c/0_203_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21fa8cde98ce0947d6a960f809fae006",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Trump: “So… where are the minerals?”\n\nZelensky: “Over there, there, and there”\n\nTrump: “Wait.. the area is filled with angry Russian army!”\n\nZelensky: “Feel free to kick them out. It’s all yours!”",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "He is going to betray you like the Kurds.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "Congrats to Ukraine for being able to close the deal they've been working on for 6 months. Sounds like they got most of what they were looking for.",
                "*Income and contributions to the fund would not be taxed in the US or Ukraine, she said, “to make investments yield the greatest results” and technology transfer and development were a “key” part of the agreement.*\n\nSo no public return, just total extraction of wealth by investors?",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "Zelenskyy is smart, he knows the next president will waive it.",
                "But… did he say Thank You?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 5964,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "Picking up one per second is $360/hr",
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "This feels like the start of a probability question.",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "Is this the real life? Is this just fantasy?\n\nWhy is a literal truckload of dimes being transported? Where were they going? To what end? Who needs so many dimes? I have a fairly vivid imagination. I cannot imagine a scenario, based in reality, in which a lorry full of dimes would be required.\n\nAnyone have any good, plausible ideas?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 2835,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "Laura Loomer runs National security",
                "So the guy who added the journalist to the chat and shared classified info not once but twice still has a job, but this guy takes the fall?",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Measurment: Waltzamucci",
                "... and ... the revolving door has begun to spin ..."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Quebec to impose full ban on cellphones in schools",
            "external_url": "https://www.cbc.ca/news/canada/montreal/quebec-cell-phone-ban-1.7523543",
            "upvotes": 719,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7299218.1724883221!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/schools-cellphones.jpg?im=Resize%3D620",
            "top_comments": [
                "This seems like a necessary step.",
                "How did phones end up in schools in the first place? We couldn’t even wear hats in school.",
                "Surprised it wasn't implemented much earlier",
                "My child's school had a \"Cell Phone Ban,\" yet almost all kids had cell phones and used them constantly with rarely if any interference by teachers/staff.\n\nI came to realize they fully allowed it since the phones, to an extent, controlled the student's behavior.  The more the students were glued to their phones, the less **overt** trouble they caused and the less overt trouble teachers/staff had to deal with.\n\nBut, it also seemed clear to me that the presence of the phones created much more **covert** trouble and cyberbullying, etc.\n\nBottomline, cell phones are a ubiquitous fact of life, I'd much rather schools embrace that and encourage/enforce thoughtful/mature use of them.  Heck, they can have a role in learning if their use was considered carefully.",
                "As a 90s/2000s kid it boggles my mind even the idea of being able to have a smart phone in class.\n\nHell I had my calculator taken away several times just because it had the Snake game on it.",
                "What's missing is the details, for now.\n\nQuebec is great for bungling laws application. Bill 101 is a good example.\n\nWill the phones be banned in public transportation too? No. OK. Where TF will the students put their phones when they get to school? They can't even prevent bike theft. Cellphones? That's gonna be fun.\n\nLeave cells at home? Well, what if they have a parascolar activity that requires it? Or they need it to call parents after it for pick-up?\n\nAre they going to prevent the kid with a house in front of the school from having a cellphone at home? No? OK. Lunchtime will be fun unless they lock kids in.\n\nSome schools have good systems already: phones off and away from sight at all times.  Suspension otherwise. But hey, that's private schools. I guess public schools were not able to enforce it.\n\n(Hey downvoters, please reply to contribute something to the discussion)",
                "Man, they're really not coping well with all the Tom Wilson memes going around recently",
                "It's okay, they don't have to worry about emergencies ever because they are Canada.",
                "As a teacher. Fuck yes. This needs to happen or children are doomed",
                "Seems like a good idea. But good luck with it"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 17865,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e1bac0a1-ea2e-464f-834c-50605d582485/kirsten-gillibrand-ap-jt-250430_1746052835024_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!",
                "9/11 firefighters are treated far worse than J6ers",
                "Republicans being patriotic and christian again. It's just too much."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "SOS: Migrants held in Texas fear notorious El Salvador prison",
            "external_url": "https://www.reuters.com/world/americas/sos-migrants-held-texas-fear-notorious-el-salvador-prison-2025-04-30/",
            "upvotes": 271,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Venezuelan detainees in Texas fear the Trump administration will send them to El Salvador's notorious CECOT maximum security prison.\n\nShhh! Fear is exactly what he wants to hear to validate the deportations."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Veteran slaying trial: Wife found guilty of murder, immediately sentenced to life in prison",
            "external_url": "https://clarksvillenow.com/local/veteran-slaying-trial-wife-found-guilty-of-murder-immediately-sentenced-to-life-in-prison/",
            "upvotes": 482,
            "date": "05/01/2025",
            "thumbnail": "https://clarksvillenow.com/wp-content/blogs.dir/43/files/2025/04/Theary-Lim-verdict-4.jpg",
            "top_comments": [
                "CLARKSVILLE, TN (CLARKSVILLE NOW) – After three days of testimony and only 1 hour and 20 minutes of jury deliberation, Theary Lim, charged with killing her Army veteran husband, was found guilty of first-degree murder on Wednesday and immediately sentenced to life in prison.\n\nOn Jan. 3, 2022, Clarksville Police conducted a welfare check in the 2200 block of Ladd Drive. Upon arrival, they found 38-year-old Sothon In dead from a gunshot wound to the head. Nearby, his wife, 32-year-old Theary Lim, and her two children were on the floor under a blanket. The next day, Theary Lim was arrested and charged.\n\nProsecution: ‘This wasn’t an accident, this was calculated’\nDuring closing arguments, Assistant District Attorney Crystal Morgan displayed a professional photograph to the jury of Theary Lim holding a firearm, a leg holster secured to her thigh, and a T-shirt with the words “Girls just want to have guns” printed on the back.\n\n“It’s the defendant’s own statement to Detective (Keenan) Carlton: She admits she had the gun in her hands. She was playing with the gun, she shook it, and it went off,” Morgan told the jury.\n\nMorgan referred to the medical examiner’s testimony that the bullet entered through Sothon’s forehead and exited out the back. She stated the defendant would had to have been standing beside the bed at close range, within 3 feet, when she fired the shot.\n\n“She left her husband in that bedroom for hours to die,” Morgan said. “A nine-hour and four-minute window that Sothon lay in that bedroom – with the defendant and his children in the house – dead.\n\n“It was an accident?” Morgan said. “What we have to believe to accept that statement is that she retrieved a gun, decided to play with it at the head of her sleeping husband.” Morgan cited testimony from an expert witness who stated it would take 7 pounds of pressure on the trigger in order for that gun to go off. “Does that pass your common sense?\n\n“This wasn’t an accident, ladies and gentlemen,” Morgan said. “It was premeditated. It was calculated. She locks the door at 12:15 (p.m.), she closes the blinds after he’s shot, and at 12:59 (p.m.) she unlocks the door. … Hold her responsible. Find her guilty.”\n\nDefense: How many unanswered questions can you live with?\nWhile Theary’s attorney, Chase Smith, waived opening remarks, he did not pass up on closing arguments. “How many unanswered questions can you have and still find someone guilty of premeditated first-degree murder?” Chase Smith asked. “Moral certainty is required, absolute certainty is not.”\n\nSmith explained this means that when the trial is over and the jury is allowed to speak about the case, they need to be able to “without hesitation” explain why they found her guilty, why she shot him, why she did it intentionally, and why it was premeditated.\n\nHe pointed out what he called flaws in the state’s case and with their witnesses. Smith mentioned a “drive-thru forensic test” explaining that it took three years to get a test back on the gunshot residue kit from the Tennessee Bureau of Investigation, a test that once it was started, only took one day to complete and get results. And he called the results confusing.\n\n“All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n\nSmith furthered his point by referencing the medical examiner report. Though the gun was close to the victims head, it wasn’t close enough to leave a muzzle stamp, meaning there wasn’t hard contact. “No pressure, no press down like you want to really kill somebody because you’re mad.\n\n“It doesn’t prove that she shot him,” Smith said. “What if he shot himself? What if one of the kids shot him? If you have a significant amount of unanswered questions, you’ve got to ask yourselves, how many can you have and still be certain that she’s guilty?” Smith asked the jury.\n\nSentenced to life in prison\nTheary Lim was found guilty as charged of first-degree murder. After the jury was dismissed, a sentencing was immediately held.\n\nIn the state of Tennessee, if any individual is found guilty of first-degree murder, it is a mandatory life sentence (60 years). The only charge Theary was facing was the murder charge. Judge Robert Bateman imposed an immediate life sentence, minus credited time served up to 15%, for a minimum of 51 years in prison.",
                "What was the motive?  I have no problem holding her responsible for the death, but first degree murder and no established motive?",
                "reading the case. \n\nyeah it was on purpose.\n\ndo gun trigger some time fail .(many recalls on that) but if gun was used before said event.\n\nit would have been easy to spot or notice in the gun.",
                "It's been proven that most gun-related accidents are usually their own family members.\n\n\nHell, my older brother almost shot me once, I was staying with him and came home one night super late. He had his gun drawn on me, and I told him I came in through the front door and had keys and everything lol.\n\n\nAn intruder wouldn't enter that way, nor have keys.\n\n\nI feel like owning a gun makes people jumpy with it, like they *want* to use it on something to justify owning it.",
                "Can't access the article so not sure what \"immediately\" means here, but I'm pretty sure nothing happens immediately in the legal world.",
                "She should have used the good ole “I didn’t know the gun was loaded” defense! /s",
                "> “All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n“What if he shot himself? What if one of the kids shot him? \n\nSounds like the prosecution failed to meet the burden of proof required for prove premeditation, but it’s Tennessee…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Accused serial cat killer in Santa Ana out of jail",
            "external_url": "https://www.nbclosangeles.com/news/local/accused-serial-cat-killer-santa-ana-out-of-jail/3688302/",
            "upvotes": 840,
            "date": "05/01/2025",
            "thumbnail": "https://media.nbclosangeles.com/2025/04/cat-killer.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "I hate that this coward’s hiding his face and they don’t show his mugshot\n\nHappy they show it here though: https://ktla.com/news/california/santa-ana-pd-condemns-unruly-vigil-after-alleged-cat-killer-released-on-bail/",
                "You gotta seriously be lacking so many things to torture critters like that.\n\nNo empathy, sympathy, remorse, or guilt.",
                "Man, an angry mob sounds great right now",
                "Psychopath piece of shit",
                "Future serial killer.  Also,  did he not watch Don't Fuck With Cats on Netflix?",
                "I feel like this is one of those crimes where they should hold you. Not that it isn't hugely wrong to neglect your own pets or farm animals, but this is just actively killing or torturing things. He could actually truly be a danger to other people and not just innocent little animals.\n\nI'm not even joking, luring animals with food so you can kill them is insane. Most animal cruelty is \"you're a terrible dog owner who left her locked up, hungry, and dirty\", not actively hurting animals for pleasure.",
                "Why was bail allowed if there a multiple witnesses",
                "He'll bump into a crazy cat lover sooner or later. Wish it happens sooner.",
                "Seriously though Is there a way that animal shelters can do background checks or something so that way he can't adopt a cat. I really need this person to not be able to come into contact with cats. It's soo sad to think about",
                "I never understand when this kind of things happen. Really disgusting."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 5960,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "Picking up one per second is $360/hr",
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "This feels like the start of a probability question.",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "Is this the real life? Is this just fantasy?\n\nWhy is a literal truckload of dimes being transported? Where were they going? To what end? Who needs so many dimes? I have a fairly vivid imagination. I cannot imagine a scenario, based in reality, in which a lorry full of dimes would be required.\n\nAnyone have any good, plausible ideas?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 24016,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Must have been an ICE office field trip or something since this was just law enforcement doing their three favorite things: abusing power, stealing, and looking at undressed minors.",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "The full [quote](https://kfor.com/news/local/were-citizens-oklahoma-city-family-traumatized-after-ice-raids-home-but-they-werent-suspects/) from the KFOR story is haunting.\n\n>“What if I would have been armed,” she said. “You’re breaking in. What am I supposed to think? My initial thought was we were being robbed—that my daughters, being females, were being kidnapped. You have guns pointed in our faces. Can you just reprogram yourself and see us as humans, as women? A little bit of mercy. Care a little bit about your fellow human, about your fellow citizen, fellow resident. We bleed too. We work. We bleed just like anybody else bleeds. We’re scared. You could see our faces that we were terrified. What makes you so much more worthier of your peace? What makes you so much more worthier of protecting your children? What makes you so much more worthy of your citizenship? What makes you more worthy of safety? Of being given the right that they took from me to protect my daughters?”"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 17834,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "What’s up with middle schoolers and being the worst people possible?",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "Genius kid-must have learned it from the parents"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 3031,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ac061853d45f740b3b609756c2c36ce1604d153c/0_203_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21fa8cde98ce0947d6a960f809fae006",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Trump: “So… where are the minerals?”\n\nZelensky: “Over there, there, and there”\n\nTrump: “Wait.. the area is filled with angry Russian army!”\n\nZelensky: “Feel free to kick them out. It’s all yours!”",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "He is going to betray you like the Kurds.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "Congrats to Ukraine for being able to close the deal they've been working on for 6 months. Sounds like they got most of what they were looking for.",
                "*Income and contributions to the fund would not be taxed in the US or Ukraine, she said, “to make investments yield the greatest results” and technology transfer and development were a “key” part of the agreement.*\n\nSo no public return, just total extraction of wealth by investors?",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "Zelenskyy is smart, he knows the next president will waive it.",
                "But… did he say Thank You?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/01/2025 16:11:38 UTC"
}