{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. stock market loses $5 trillion in value in three weeks",
            "external_url": "https://www.cnbc.com/2025/03/14/us-stock-market-loses-5-trillion-in-value-in-three-weeks.html",
            "upvotes": 39475,
            "date": "03/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108107173-1741956255184-108107173-17405057832025-02-25t164922z_514643967_rc2q1davpagh_rtrmadp_0_usa-stocks.jpg?v=1741956265&w=1920&h=1080",
            "top_comments": [
                "All of a sudden conservatives do not care about the stock market",
                "What's amazing is that millions of adults don't seem to notice his industrial strength incompetency.",
                "*Opinion pending, awaiting MAGA marching orders*",
                "Somebody said it right, *Actions speak louder than words*",
                "A quick google search indicates the US stock markets total valuation as of Jan 2025 is about 62 trillion. That is an 8% loss in less than a month largely due to the actions of 1 man. If your company discovered 1 employee was directly responsible for an 8% drop in revenue the speed with which they would be removed by any means might break the laws of physics.",
                "All Trump had to do was be an absentee retired president who golfs everyday and the momentum form Biden’s economy…9 straight quarters of growth would have kept going. Do nothing and claim credit. \n\nInstead he trashed it in 6 weeks. Every single business Trump puts his name in gets ruined. He doesn’t I understand business. He’s understands stealing, fraud and cons, but not legitimate business or the economy .",
                "The rich guys have figured out how to get at everybody's tax dollars now.\n\n\nAnd you can bet they're all buying/selling in tandem with Trump's \"tariffs on/tariffs off\" cycles.",
                "Dont worry. It’s only people retirement funds.",
                "100% the fault of chairman orange shitbag.",
                "Trump is running America exactly the same as he runs his businesses… Into the ground."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Newborn babies exposed to measles in Texas hospital",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-hospital-newborn-babies-exposed-rcna196519",
            "upvotes": 4577,
            "date": "03/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250225-measles-testing-texas-mn-1155-d488ba.jpg",
            "top_comments": [
                "This is probably the worst case scenario.  Newborns are too young to be vaccinated ",
                "“On Wednesday, a woman gave birth in a Lubbock, Texas hospital in the middle of a deadly and fast-growing measles outbreak. Doctors didn’t realize until the young mother had been admitted and in labor that she herself was infected with the measles.\nBy that time, other new moms, newborn babies and their families at University Medical Center Children’s Hospital in Lubbock had unknowingly been exposed to the virus, considered one of the most contagious in the world.\nIt’s unclear when the woman tested positive for measles. Public health officials are casting a wide net in an effort to contact everyone who may have been exposed to this particular patient. Viral particles can live in the air or on surfaces for up to two hours.”\n\nIf you haven’t been, get vaccinated. If you aren’t sure have a doctor check your titers. It’s science not the tooth fairy; believe in the science.",
                "Oh I would be screaming mad. And terrified.",
                "I remember hearing about medieval hospitals, if you went in you were likely to be sicker during your stay (and die) due to rampant diseases that spread in hospital due to poor sanitation and of course, plagues.\n\nEdit: I don't expect my newborn to die from measles caught at the hospital maternity ward.",
                "Look up SSPE. Arises from previous measles infection, going dormant for approximately 7+ years, only to come back as a progressive brain disease that is almost always fatal. The younger you are when you encounter measles virus, the much more likely you are to die of SSPE to the tune of about 1 in 600. \n\nSo these babies may get infected, become well again, and 7 years later, when you are lulled into a false sense of security, your child will wither away in front of you until they die. \n\nThis is just another reason we vaccinate widely. Because herd immunity protects infants especially.",
                "It's Texas, no one there will care. The kids have been born already.",
                "And this, folks, is why we developed mass vaccinations IN THE FIRST PLACE.",
                "Hospital staff are scrambling with damage control efforts — implementing emergency masking policies and giving babies as young as three days old injections of immunoglobulin, an antibody that helps their fragile immune system fight off infections.\n\nA 2021 study found that the therapy is highly effective in protecting exposed newborns from getting sick.\n\n“These babies didn’t ask for this exposure,” said Chad Curry, training chief for the University Medical Center EMS. “But at the end of the day, this is the only way we can protect them.”",
                " If you killed my baby with measles, you’re not going to have a nice day.",
                "When I was pregnant, they did a titer to make sure I had immunity. If someone doesn’t have immunity right now, they need to be quarantined. \n\nYou don’t wanna get the shot? Fine. Don’t. Consequences say you can’t participate in society. Unfortunately this punishes people who aren’t able to get the shot, and I suspect that is a much smaller group than anti-vaxxers."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "USDA cancels $11 million in federal funding for North Carolina food banks",
            "external_url": "https://www.wunc.org/news/2025-03-14/usda-cancels-federal-funding-north-carolina-food-banks",
            "upvotes": 1153,
            "date": "03/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/f49be1d/2147483647/strip/true/crop/1920x1008+0+136/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F88%2F9813b4f34728a68ed1ad97eb76e1%2Ffood-banks.jpg",
            "top_comments": [
                "It’s always going to be the people that deserve it the least that get the worst of it",
                "Food shelves across the country are anxious because they're expecting, on average, a doubling of people who need help this coming year, and yet are dreading this kind of news that funding will be cut.  Where will my fellow Americans go when we've cut the safety nets out from underneath them? The vast majority of people who use our foodshelf aren't foreigners, terrorists, welfare riders, or villians. They're locals who live here, seniors who don't have enough to retire on and feed themselves, disabled people that can't work enough to make ends meet and pay piling up medical bills, all sorts of sad stories of good regular local people falling through the cracks. And this administration is making those cracks bigger and bigger. SHAME. SHAME ON EVERY SINGLE ONE OF THEM THAT SUPPORTS HURTING AMERICANS.",
                "The cruelty is the point.  Thanks MAGA for even more hungry North Carolinians.",
                "No food for the needy, but a 4.5 TRILLION tax cut for the wealthy. \nThat’s not right.  I don’t care who you are or what side you’re on, that is just not right.",
                "And the hits just keep on coming",
                "Don't worry. Trump says you'll have so much money you won't even know what to spend it on! \n\nOr maybe he was just referring to himself there...",
                "And they’d all vote for trump again tomorrow if they could",
                "It’s what North Carolina wanted",
                "America is back, baby\n\nWhatever that means",
                "Definitely something Jesus would do."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Dollar General warns low-income Americans’ finances are getting worse",
            "external_url": "https://www.cnn.com/2025/03/13/business/dollar-general-shoppers-inflation/index.html",
            "upvotes": 24870,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1827147996-20250313141452450.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I grew up poor in the 80s, it must be frickin ruthless now.\n\nEdit: if my wife didn’t take care of me I’d be on the street. I’m a very lucky disabled person. Imagine making it in America on 800 bucks a month. It’s bonkers.\n\nEdit 2: imagine was a bad way to say it… I know people do it every day, my bad, I’m sorry.",
                "Dollar General is part of the problem.\n\n> True, the chain pays its workers industry-low wages in under-staffed stores that can be magnets for armed burglary. And yes, Dollar Store management targets economically struggling communities, focusing on customers who make less than $40,000 a year and visit the store multiple times a week. “The economy is continuing to create more of our core customer,” CEO Todd Vasos said in 2018.\n\n> But to those working class consumers, Dollar General promises to deliver “everyday low prices.” \n\n> In reality, without knowing it, customers are often paying Whole Foods prices for dollar store groceries. \n\n\nhttps://perfectunion.us/dollar-general-prices/",
                "In the 1960s, the gov't launched a War on Poverty. Today, it's fighting against the poor.",
                "All while paying poverty wages and cutting hours so bad it's really not worth working for them",
                "Consumers making less than $50,000 a year are “pretty constrained,” she said, and “it’s also pretty, pretty challenging” for customers making less than $100,000 annually.\n\n\nCan confirm, it is pretty challenging.",
                "To be fair, Dollar General giving people a bad price/unit because they can’t afford to buy the standard bulk sizes doesn’t help, but I digress.",
                "So they’re thrilled to swoop in to open thousands more stores?\n\nYa that’s the ticket",
                "I'm very curious just how far we can take this income disparity.\n\nThe top 26 people on the planet own as much as the bottom 50%. That's nuts.\n\nIn the US specifically, the top 0.1% owns 22 trillion dollars. The next 0.9% owns 27 trillion dollars. The next 9% owns 58 trillion dollars. The next 40% owns 48 trillion. The bottom 50% owns 4 trillion. That's about 160 trillion in total worth in the US.\n\nBreaking down that distribution (assuming 300M people in the US):\n300,000 people own 14% of the wealth.\n2,700,000 people own 17% of the wealth.\n27,000,000 people own 36% of the wealth.\n120,000,000 own 30% of the wealth.\n150,000,000 own 3% of the wealth.\n\nThe top half of the pyramid owns 97% of the wealth. Wild.\nThe top 20% of the top half of the pyramid (ie. top 10% overall) owns almost 70% of that.\nThe top 10% of the top 20% of the top half (ie. top 1% overall) owns 46% of that.\n\nThe exponential difference are so remarkable. So many have so little. So few have so much. And the insanity is that productivity has grown so significantly, it's not like there's a scarcity issue. It's not that we're getting poorer and some people are getting poorer faster. We're actively getting more prosperous as a society, but all the prosperity is going to people who's greed and appetites cannot be sated.",
                "Because they are paying more for less at dollar general.",
                "The phrasing of that headline reads like Dollar General has a sign on the door saying \"Just a heads up y'all bitches getting poorer everyday out here!\""
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Trump administration asks Australian universities to justify US funding",
            "external_url": "https://www.abc.net.au/news/2025-03-14/trump-administration-asks-australian-universities-funding/105053784",
            "upvotes": 5724,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/c549b683374ddd719ec861682aab5289?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=6&width=862&height=485&imformat=generic",
            "top_comments": [
                "Folks it’s research grants. The title was shorten for clicks\n\n“Trump administration asked to explain after Australian universities told to justify US-funded research grants” \n\nIt’s quite common for countries to collaborate on joint research in science and technology fields",
                "It’s grant money… isn’t the justification in the grant application?",
                "Reminder for anyone who may be unaware - federal grant applications already contained very lengthy and detailed justifications for pretty much every individual part of the research. \n\nIf it's been approved, it's because it was well vetted by handful of individual reviewers who can demand edits or clarification, then present the application to an entire board of specialists who review further, and then all issues have been adequately justified is the grant awarded. \n\nThis additional work created by the Trumo organization is wildly unecessary and inefficient.",
                "I work adjacent to the research community.  This is not just an Australia thing.   MANY projects are jointly funded and its because the research facilities and experts are scattered all over the world.  There are only so many people who specialize in a particular thing and you can bet if the US has kicked in funding its because they lack either the facilities or experts to run it themselves and wanted to have their finger in the soup.    \n\nIt will be impossible to reverse course with this existing administration.  Institutions and governments are already pivoting and looking at how to pivot away from the US.  They are already trying to poach researchers and skilled labour from the US. They can stay and work on government dictated research like vaccine denials and anti-climate change propaganda or they can leave and work on real science and have maternity leave and 4-6 weeks of vacation and health care.  No government or private company will invest in US based research or infrastructure developments while this gong show is underway.",
                "\"The document also asks... what steps they've taken against \"Christian persecution\" or to \"protect women and to defend against gender ideology.\"\"\n\nWhat the hell is this backwards hick garbage? The US is absolute clown town right now.",
                "Although the U.S. sending money to foreign universities can be questioned, it's becoming apparent with chaos taking over the dysfunctional U.S. government, there are more people beside Ol' Elon inside the Trump Administration with their personal agendas just doing whatever they want.",
                "Trump thinking everyone's mooching off the US.",
                "I mean we do have a nasa base in the outback but whatever dude.",
                "Every great leader in history embraced institutions of public learning as a cornerstone of society.",
                "Yeah what a waste of money to help foster collaboration between American scientists/researchers/professors and the top minds and institutions Australia has to offer.\n\nGod fucking forbid we go a single day without shitting on one of our allies."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Newsmax agrees to pay $40m to settle defamation suit over false election claims",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/14/newsmax-smartmatic-settlement",
            "upvotes": 7761,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d293af4fb1c73e4056d80f11cbdb2cbc79938dc6/0_256_7689_4613/master/7689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b5e81cd116b62569b1e434137003bb",
            "top_comments": [
                "In case no one read past the headline, Newsmax is paying $40m to the voting machine maker Smartmatics.\n\nNewsmax claimed the election machines were compromised. Smartmatics sued for defamation. Newsmax lost the suit.\n\nThis is not the same as ABC/NBC paying Trump to settle their suit.",
                "So now both Fox News and also NewsMax have each had to pay millions of dollars for lying about the election. \n\nAnd conservatives still call every other station fake news",
                "After whatever Elon paid for the white house, this is the 2nd best deal of decade.",
                "Sounds like they got off awfully cheap to me.",
                "Is $40 mill significant or just a drop in the bucket?\n\nWhat's the precedent?",
                "Newsmax Breaking: Left-Wing Extremist Guardian Falsely Claims Newsmax Settled Lawsuit",
                "Newsmax is as bad as Fox, both are providing misinformation to the USA Citizens",
                "$40m seems about right as damages to Smartmatics. That's not nearly enough as damages to the USA.",
                "Wild how not one single \"election fraud\" claim has been prove true time and time again, with millions of dollars and man hours wasted on this bullshit, and yet your average Republican still can't admit it. \n\nSorry, not \"wild\", completely predictable and expected from my \"fiscally responsibility\" and \"personal responsibility\" friends.  Whatever it takes to appease god king Trump, eh?",
                "40 million is way too little!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Mark Carney sworn in as Canada’s PM after Trudeau steps down",
            "external_url": "https://www.cnn.com/2025/03/14/americas/canada-carney-prime-minister-trudeau-resigns-intl-latam?Date=20250314&Profile=cnnbrk&utm_content=1741967012&utm_medium=social&utm_source=twitter",
            "upvotes": 5198,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-09t233949z-1493832281-rc2s9daeyq4b-rtrmadp-3-canada-politics.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "As a Canadian, it's funny thinking how Trump thought Trudeau was using tariffs to hold on to power like a dictator, not understanding he already resigned and this is how the Canadian political process sometimes works. He simply talks out of his ass about everything he doesn't understand (which is a lot).",
                "Prime Minister Mark Carney is an extremely well educated and experienced man. I am wishing him the most success in steering our Country down the right path in these uncertain times.\n\nLong Live Canada 🇨🇦",
                "Trudeau may have not been great for Canada for a while domestically \n\nBut I really think he stepped up against Trump in the last few months in a way few others did \n\nHope the new guy is as resolute",
                "Finally.  A Carney to manage the Trump circus.",
                "I really hope Mark is the answer we have been looking for. Too many people in politics don’t understand the real world. This guy seems to get it.",
                "Trudeau seemingly got a lot of shit from Canadians for his domestic policies, but dude was a masterclass in Canadian international relations. Gonna miss seeing him on the news representing Canada.",
                "Damn, in my 22 years of living in Canada this is only the 3rd prime minister",
                "There was a moment where North America had both Trudeau and Obama…\n\nThen competence took a back seat in the states.",
                "Now, let's see if Canadians can learn from the mistakes of our neighbors. Another Liberal gov( even a minority) will bury The CPC for years. They've placed all their eggs in the MAGA basket. After blowing a ~30 point lead PP would have to resign, and their is no heir apparent.\nI personally can't wait to see it.",
                "[removed]"
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "HOT",
            "title": "Measles cases linked to Texas outbreak grows to 259, with just 2 among fully vaccinated people",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-grows-259-2/story?id=119799576",
            "upvotes": 2537,
            "date": "03/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Truly the golden age here in the US.",
                "Since we are going backwards, What's next on menu? Civil war?",
                "The most lethal and most contagious disease ever is ignorance and the US has been having a pandemic for decades.",
                "As a kid, I wondered how an advanced civilization like Atlantis could possibly not exist anywhere. \n\nAs an adult, while I know Atlantis isn't real, I can totally understand how any advanced civilization could go bottoms up.\n\n  \nJust didn't think it would happen in my lifetime. And historians better call this the dumbest timeline.",
                "So. \n\n\nIs Texas planning on bringing back Polio, too?\n\n\nMaybe also Smallpox? Diphtheria? Hepatitis B?\n\n\nI'm so, so tired of science-denying ijuts.",
                "Said it before and will say it again. \n\nThe parents of unvaccinated children who get sick from measles should be charged with child abuse and/or endangerment. If the child dies they should be charged with first degree murder. If they want to claim it was \"God's will\" then they better be prepared to subpoena God to show up as a witness for their trial and testify that it was indeed preordained that this child would die of measles. Otherwise, fuck you, you allowed your child to contract (and die of) an easily preventable disease. That is, to me, textbook child abuse, and if the kid dies, considering you knew you could prevent it and still did nothing, that makes it premeditated murder. \n\nBut, it's Texas, so probably most of the parents of affected kids will profit off the death of their child by joining the anti-vax grift train and they'll be hailed as heroes for \"owning the libs\" by letting their child die a horrible death at a very young age.",
                "Today’s 36 new Texas cases is higher than the 25 new cases reported Tuesday, but lower than the 39 new cases reported last Friday.",
                "The proof that measles vaccine really work.  Anti people fear potential side effect more rather than the actual germ itself.",
                "Is anyone surprised how few cases (relatively speaking) compared to how virulent this disease is?  Wouldn’t there be more than this by now, or is the reporting skewed by families not reporting cases unless they require significant medical intervention.  I guess most of the older population has immunity and it’s just the unvaccinated kids that are getting it?",
                "I thought there were dozens where status was unknown.   Have they figured it out?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US consumer sentiment deteriorates sharply in March",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-deteriorates-sharply-march-2025-03-14/",
            "upvotes": 5900,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s almost like when the world is completely unpredictable and positions change by the second people are not able to plan for the future and are less likely to spend money outside of absolute needs. And it’s almost like when an economy is built entirely on the spending of its consumers and the confidence in systems that uncertainties hurt the whole economy.",
                "Strangely enough, my job being threatened by illegal NIH grant cuts has triggered me to stop spending money and hoard cash.\n\nThat $30k I had pegged to remodel my bathroom would be churning into the economy if not for that.",
                "If the government won’t govern why should consumers consume?",
                "Don’t underestimate how bad this is. \n\nYou can look at the historic data series, but once consumer sentiment falls, it takes a long time to get back to normal.\n\nAnd in an era where price signals, recession signals, and uncertainty signals are flashing, this could worsen an economic downturn.\n\nSource: economist.",
                "Trump and his administration has done nothing but harm to our country and certainly has not done anything good or beneficial. Unnecessary spending is completely off the table for the foreseeable future in our house.",
                "Yeah, levying sudden heavy federal sales taxes will do that. ",
                "I am getting dizzy from all that winning....",
                "Can't risk egregious spending right now. For all I know we're gonna be back to fighting in the Thunderdome for toilet paper any moment.",
                "Almost every parent I talked to had some sort of plan to take their kids somewhere for spring break this year. Every single one of them canceled and said let's just save the money",
                "I'm just buying necessities."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Immigration officials arrest second person who participated in pro-Palestinian protests at Columbia",
            "external_url": "https://www.wftv.com/news/politics/columbias-mahmoud/W6PPLQLVY5DSLL7FMKN2XI2LYI/?outputType=amp",
            "upvotes": 2439,
            "date": "03/14/2025",
            "thumbnail": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FE26T7XL4WACHU4HYKB5ERCKBYU.jpg?auth=5a0af1350facf60d9f6b189766c2aa27d84e7f45136c91a974eb02a9f9dc08fc&width=1200&height=630&smart=true",
            "top_comments": [
                "> A Columbia doctoral student from India whose visa was revoked by the Trump administration fled the U.S. on an airliner.\n\n“Fled?” I would have thought a person was supposed to leave the country after having their visa revoked. Like, isn’t that the correct and expected thing to do?",
                "Immigration is super serious and overstaying a visa is super bad and you should be deported! \n\n\n\n...unless you're Musk",
                "Her student visa was revoked three years ago for not attending classes... ",
                "Her student visa was revoked TWICE under Biden because she did't attend class. She made this decision super easy for the Trump admin. At least show up to class. geez",
                "I do think they're targeting these folks for being protesters, but to be clear:\n\n> Leqaa Kordia, a Palestinian from the West Bank, was arrested by immigration officers for overstaying her student visa, the Department of Homeland Security said.",
                "Am I missing something or is there a reason why every single comment was deleted?",
                "Although I am not an Orange Tyrant voter or anything like it, I do agree that people that over stay their visas are to be removed and furthermore if you are a guest on a student visa, you better behave or take it back to your home country",
                ">Leqaa Kordia, a Palestinian from the West Bank, was arrested by immigration officers for overstaying her student visa, the Department of Homeland Security said. Kordia’s visa was terminated in January 2022 for “lack of attendance,” the department said. She was previously arrested for her involvement in protests at Columbia in April 2024, the agency added.\n\nWell done.\n\nKeep up the good work.",
                "This one is by the rules, she overstayed. Khalil's arrest is not. It is important to not associate both cases.",
                "believe nothing from this administration."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "USDA cancels $11 million in federal funding for North Carolina food banks",
            "external_url": "https://www.wunc.org/news/2025-03-14/usda-cancels-federal-funding-north-carolina-food-banks",
            "upvotes": 1147,
            "date": "03/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/f49be1d/2147483647/strip/true/crop/1920x1008+0+136/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F88%2F9813b4f34728a68ed1ad97eb76e1%2Ffood-banks.jpg",
            "top_comments": [
                "It’s always going to be the people that deserve it the least that get the worst of it",
                "Food shelves across the country are anxious because they're expecting, on average, a doubling of people who need help this coming year, and yet are dreading this kind of news that funding will be cut.  Where will my fellow Americans go when we've cut the safety nets out from underneath them? The vast majority of people who use our foodshelf aren't foreigners, terrorists, welfare riders, or villians. They're locals who live here, seniors who don't have enough to retire on and feed themselves, disabled people that can't work enough to make ends meet and pay piling up medical bills, all sorts of sad stories of good regular local people falling through the cracks. And this administration is making those cracks bigger and bigger. SHAME. SHAME ON EVERY SINGLE ONE OF THEM THAT SUPPORTS HURTING AMERICANS.",
                "The cruelty is the point.  Thanks MAGA for even more hungry North Carolinians.",
                "No food for the needy, but a 4.5 TRILLION tax cut for the wealthy. \nThat’s not right.  I don’t care who you are or what side you’re on, that is just not right.",
                "And the hits just keep on coming",
                "Don't worry. Trump says you'll have so much money you won't even know what to spend it on! \n\nOr maybe he was just referring to himself there...",
                "And they’d all vote for trump again tomorrow if they could",
                "It’s what North Carolina wanted",
                "America is back, baby\n\nWhatever that means",
                "Definitely something Jesus would do."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Almonds, whiskey, auto parts: EU's retaliatory tariffs set up these U.S. states and local products as the biggest losers",
            "external_url": "https://www.cnbc.com/2025/03/13/almonds-whiskey-auto-parts-where-eu-tariffs-will-hit-hardest.html",
            "upvotes": 312,
            "date": "03/15/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114947-17417993792025-03-12t170750z_666726697_rc2ancapc616_rtrmadp_0_usa-trump-tariffs-spirits.jpeg?v=1741889218&w=1920&h=1080",
            "top_comments": [
                "They’ll be fine. Haven’t you heard? The tariff money is pouring in!’",
                "Between EU and Canada, Tennessee and Kentucky will not be happy.",
                "> rearview mirrors from Michigan.\n\nWe may come to regret this in hindsight",
                "I mean... if you want to encourage countries to buy more American goods, slapping tariffs on incoming goods is probably the single dumbest option there is. If you're secretly working on behalf of some other country and looking to sow chaos and distrust between long-time allies... it's a brilliant strategy.",
                "So I was looking around my hobby workshop today. 3M professional automotive products like sandpaper, polishes, sealers, adhesives, bonders, backing pads, abrasive cleaners, paint prep chemicals ( like used in every automotive body shop ) are all made in Canada. Talked to a friend who owns a forestry company and all their equipment like Tigercat cutters, high quality saw blades for big cutters and the best cutter head teeth come from Canada, so even to harvest our own timber the parts to do so don’t come from here.",
                "from the article\n\n>In 2024, California exported $1.2 billion in shelled almonds to the EU. The European Union represents 37% of California’s exports to the world.\n\nYou might think \"hey, they are hitting a solidly blue state\" but the almond tariff hits **red counties** with cruise missile precision as agricultural counties (e.g. where almonds are grown) are solidly MAGA, it is just that their population is outweighed by the urban coastal areas.",
                "Hopefully once everyone in the U.S. feels the pain something useful will be done about it. Fuck the people that let it get to this point though.",
                "Welcome Tennessee and Kentucky maga to the find out part, a leopard will be with you shortly. \n\nYour face is very important to us.",
                "Would you take a bit more of tariffs with this tariff!",
                "aren't almonds from California?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Canada resumes imports from Smithfield Foods plant",
            "external_url": "https://www.reuters.com/markets/commodities/canada-lifts-suspension-imports-biggest-us-pork-plant-usda-records-show-2025-03-14/",
            "upvotes": 4,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR: Smithfield CEO claims the reason for the temporary suspension in the first place was an \"issue\" with offal or organ meats, not related to tariffs.",
                "Isn't Smithfield owned by China? Not that it's related, but just curious."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Oldest known partial face fossil of a human ancestor in western Europe is uncovered",
            "external_url": "https://abcnews.go.com/Technology/wireStory/archaeologists-uncover-oldest-partial-face-fossil-human-ancestor-119718624",
            "upvotes": 157,
            "date": "03/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/64e6afad-55ee-4807-9aee-5c1f86a4c26f/wirestory_8cf87fb1730d45e35ca984af8b80a0a2_16x9.jpg?w=1600",
            "top_comments": [
                "She doesn't look that old",
                "Does somebody have a picture? the video that loads is of trump talking about tariffs",
                "Imagine being the model in this stock photo and seeing it in this headline",
                ">said Eric Delson, a paleontologist at the American Museum of Natural History, *who was not involved in the study.*\n\ncue to\n\n>said Potts, *who had no role in the study.*\n\nto\n\n>said University of Zurich paleoanthropologist Christoph Zollikofer, *who was not involved in the study.*\n\nOk guys, who were *not in involved in the study* but who is ge now???",
                "That face is well preserved...",
                "This is pretty misleading. They didn't find a face imprint or anything, they found pieces of a skull.",
                "*It can be challenging to identify which group of early humans a fossil find belongs to if there's only a single fragment versus many bones that show a range of features, said University of Zurich paleoanthropologist Christoph Zollikofer, who was not involved in the study.*\n\nA small fragment does not a whole human make.",
                "Now they’re DEI’n Lucy too!!! Stop the madness\n\n/s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Newborn babies exposed to measles in Texas hospital",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-hospital-newborn-babies-exposed-rcna196519",
            "upvotes": 4579,
            "date": "03/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250225-measles-testing-texas-mn-1155-d488ba.jpg",
            "top_comments": [
                "This is probably the worst case scenario.  Newborns are too young to be vaccinated ",
                "“On Wednesday, a woman gave birth in a Lubbock, Texas hospital in the middle of a deadly and fast-growing measles outbreak. Doctors didn’t realize until the young mother had been admitted and in labor that she herself was infected with the measles.\nBy that time, other new moms, newborn babies and their families at University Medical Center Children’s Hospital in Lubbock had unknowingly been exposed to the virus, considered one of the most contagious in the world.\nIt’s unclear when the woman tested positive for measles. Public health officials are casting a wide net in an effort to contact everyone who may have been exposed to this particular patient. Viral particles can live in the air or on surfaces for up to two hours.”\n\nIf you haven’t been, get vaccinated. If you aren’t sure have a doctor check your titers. It’s science not the tooth fairy; believe in the science.",
                "Oh I would be screaming mad. And terrified.",
                "I remember hearing about medieval hospitals, if you went in you were likely to be sicker during your stay (and die) due to rampant diseases that spread in hospital due to poor sanitation and of course, plagues.\n\nEdit: I don't expect my newborn to die from measles caught at the hospital maternity ward.",
                "Look up SSPE. Arises from previous measles infection, going dormant for approximately 7+ years, only to come back as a progressive brain disease that is almost always fatal. The younger you are when you encounter measles virus, the much more likely you are to die of SSPE to the tune of about 1 in 600. \n\nSo these babies may get infected, become well again, and 7 years later, when you are lulled into a false sense of security, your child will wither away in front of you until they die. \n\nThis is just another reason we vaccinate widely. Because herd immunity protects infants especially.",
                "It's Texas, no one there will care. The kids have been born already.",
                "And this, folks, is why we developed mass vaccinations IN THE FIRST PLACE.",
                "Hospital staff are scrambling with damage control efforts — implementing emergency masking policies and giving babies as young as three days old injections of immunoglobulin, an antibody that helps their fragile immune system fight off infections.\n\nA 2021 study found that the therapy is highly effective in protecting exposed newborns from getting sick.\n\n“These babies didn’t ask for this exposure,” said Chad Curry, training chief for the University Medical Center EMS. “But at the end of the day, this is the only way we can protect them.”",
                " If you killed my baby with measles, you’re not going to have a nice day.",
                "When I was pregnant, they did a titer to make sure I had immunity. If someone doesn’t have immunity right now, they need to be quarantined. \n\nYou don’t wanna get the shot? Fine. Don’t. Consequences say you can’t participate in society. Unfortunately this punishes people who aren’t able to get the shot, and I suspect that is a much smaller group than anti-vaxxers."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Voice of America ending contracts with Associated Press, Reuters and Agence France Presse",
            "external_url": "https://apnews.com/article/voa-government-media-contracts-2bd47cf0c1bbcdc5cbe08eea030c1454",
            "upvotes": 1201,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Kari Lake, the former broadcaster turned Republican politician who was selected by President Donald Trump to run VOA, estimated the move would save $53 million.\n\n\nAs an Arizona resident, I'm sincerely sorry about Kari Lake. When we send them, we're not sending our best people ",
                "In other words: _These legitimate news services undermine the narratives we make up... so fuck 'em_.",
                "This is being done as per [Project 2025 (Chapter 8).](https://static.project2025.org/2025_MandateForLeadership_CHAPTER-08.pdf)’s plans.",
                "Amongst all the horseshit, I missed Kari lying-fraud-fuckwit Lake being put in charge of VoA... Stupidest fucking timeline",
                "Easier to push out propaganda that way.",
                "“We should not be paying outside news organizations to tell us what the news is,” said Lake, who ran unsuccessfully for Arizona governor. “With a nearly billion-dollar budget, we should be producing news ourselves. And if that’s not possible, the American taxpayer should demand to know why.”",
                "That's because it's not the Voice of America anymore.\n\nIt's the Voice of Trump and Co.",
                "I dunno about this. If or when world or national news services have to use only internal staffs to assemble relevant or pertinent information then they become local news outlets and we have been there and found it wanting.       \nThat is why the 'wire' services are helpful.",
                "This is what Putin wanted.",
                "Fitting. Many Americans silenced their own voices this past election. Like they do every election."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Measles cases linked to Texas outbreak grows to 259, with just 2 among fully vaccinated people",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-grows-259-2/story?id=119799576",
            "upvotes": 2538,
            "date": "03/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Truly the golden age here in the US.",
                "Since we are going backwards, What's next on menu? Civil war?",
                "The most lethal and most contagious disease ever is ignorance and the US has been having a pandemic for decades.",
                "As a kid, I wondered how an advanced civilization like Atlantis could possibly not exist anywhere. \n\nAs an adult, while I know Atlantis isn't real, I can totally understand how any advanced civilization could go bottoms up.\n\n  \nJust didn't think it would happen in my lifetime. And historians better call this the dumbest timeline.",
                "So. \n\n\nIs Texas planning on bringing back Polio, too?\n\n\nMaybe also Smallpox? Diphtheria? Hepatitis B?\n\n\nI'm so, so tired of science-denying ijuts.",
                "Said it before and will say it again. \n\nThe parents of unvaccinated children who get sick from measles should be charged with child abuse and/or endangerment. If the child dies they should be charged with first degree murder. If they want to claim it was \"God's will\" then they better be prepared to subpoena God to show up as a witness for their trial and testify that it was indeed preordained that this child would die of measles. Otherwise, fuck you, you allowed your child to contract (and die of) an easily preventable disease. That is, to me, textbook child abuse, and if the kid dies, considering you knew you could prevent it and still did nothing, that makes it premeditated murder. \n\nBut, it's Texas, so probably most of the parents of affected kids will profit off the death of their child by joining the anti-vax grift train and they'll be hailed as heroes for \"owning the libs\" by letting their child die a horrible death at a very young age.",
                "Today’s 36 new Texas cases is higher than the 25 new cases reported Tuesday, but lower than the 39 new cases reported last Friday.",
                "The proof that measles vaccine really work.  Anti people fear potential side effect more rather than the actual germ itself.",
                "Is anyone surprised how few cases (relatively speaking) compared to how virulent this disease is?  Wouldn’t there be more than this by now, or is the reporting skewed by families not reporting cases unless they require significant medical intervention.  I guess most of the older population has immunity and it’s just the unvaccinated kids that are getting it?",
                "I thought there were dozens where status was unknown.   Have they figured it out?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Police question Russian master of ship that hit tanker in North Sea | UK news",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/captain-arrested-over-uk-ship-collision-is-russian-owner-says",
            "upvotes": 295,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f785bcdf2460ac2b7086234cb10a03a269bf9eb1/0_300_5523_3314/master/5523.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7fe543d6f080043ce83ede9e9cf3fd90",
            "top_comments": [
                "There is a semi-credible conspiracy theory (unproven but plausible) that this was a deliberate action. There was jet fuel on board the Immaculate that was destined for Ukraine. It is possible that this was sabotage aimed at preventing that from happening. I'm not saying that this is what happened, but there is a possibility. It seems somewhat unnecessary to me, as Ukraine doesn't really have enough jets where lack of jet fuel would make a noticeable difference in the war, but what do I know, I'm no military analysist. Also if it was really Putin, why not hire a non-russian to do it? Unless he was sending some sort of message? Who knows. But, it's kind of weird for a Russian ship master to randomly hit a stationary tanker that just happened to be carrying fuel heading for Ukraine... a pretty remarkable coincidence.\n\nJust watched a youtube video covering topic (at the 6:00 mark) [https://www.youtube.com/watch?v=VcRLQwpBc1s](https://www.youtube.com/watch?v=VcRLQwpBc1s)\n\nWas curious what kinda responses I'd get here.",
                "It's been a long gap between arrest and interview.  I'm assuming they were waiting for him to sober up.",
                "I think it’s easy to jump to a knee-jerk reaction without having all the facts and blame it on sabotage. So that’s what I’ll do. Sabotage! \n\nNo but seriously, the basic facts of the situation are clearly suspicious given the cargo and timing.",
                "Last I saw they charged and jailed him.",
                "The captain was Russian, that means that there is a higher probability that he was drunk rather than malicious"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "U.S. stock market loses $5 trillion in value in three weeks",
            "external_url": "https://www.cnbc.com/2025/03/14/us-stock-market-loses-5-trillion-in-value-in-three-weeks.html",
            "upvotes": 39488,
            "date": "03/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108107173-1741956255184-108107173-17405057832025-02-25t164922z_514643967_rc2q1davpagh_rtrmadp_0_usa-stocks.jpg?v=1741956265&w=1920&h=1080",
            "top_comments": [
                "All of a sudden conservatives do not care about the stock market",
                "What's amazing is that millions of adults don't seem to notice his industrial strength incompetency.",
                "*Opinion pending, awaiting MAGA marching orders*",
                "Somebody said it right, *Actions speak louder than words*",
                "A quick google search indicates the US stock markets total valuation as of Jan 2025 is about 62 trillion. That is an 8% loss in less than a month largely due to the actions of 1 man. If your company discovered 1 employee was directly responsible for an 8% drop in revenue the speed with which they would be removed by any means might break the laws of physics.",
                "All Trump had to do was be an absentee retired president who golfs everyday and the momentum form Biden’s economy…9 straight quarters of growth would have kept going. Do nothing and claim credit. \n\nInstead he trashed it in 6 weeks. Every single business Trump puts his name in gets ruined. He doesn’t I understand business. He’s understands stealing, fraud and cons, but not legitimate business or the economy .",
                "The rich guys have figured out how to get at everybody's tax dollars now.\n\n\nAnd you can bet they're all buying/selling in tandem with Trump's \"tariffs on/tariffs off\" cycles.",
                "Dont worry. It’s only people retirement funds.",
                "100% the fault of chairman orange shitbag.",
                "Trump is running America exactly the same as he runs his businesses… Into the ground."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "More than 50 universities face federal investigations as part of Trump's anti-DEI campaign",
            "external_url": "https://apnews.com/article/trump-dei-universities-investigated-f89dc9ec2a98897577ed0a6c446fae7b?utm_source=flipboard&utm_content=user%2FAssociatedPress",
            "upvotes": 558,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's a lot of investigations.  They will want to be efficient about it by relying on as few facts as possible.",
                "They don't even link to the list of schools.\n\nhttps://www.ed.gov/about/news/press-release/us-department-of-educations-office-civil-rights-sends-letters-60-universities-under-investigation-antisemitic-discrimination-and-harassment",
                "Investigating Ohio State University? This is going to be problematic for MAGA Buckeye fans.",
                "What a waste of time, money and other miscellaneous resources. I can't wait until this administration moves on to the next dog whistle buzzword.",
                "How coincidental that trump’s alma mater isn’t being investigated",
                "Investigations cost lots of money.  Where you at DOGE?",
                "Don't worry guys this investigation is surely being led by someone extremely competent and qualified.    \n\n\\*Checks\\*.    \n\nLinda Mcmahon of the WWE.   \n\nOh boy",
                "If you support Trump, you are a white supremacist.",
                "UC Davis? I'm pretty surprised, I'm attending UC Davis at the moment",
                "Vance: \"the universities are the enemy\"\n\nYarvin said Harvard should not exist by April. They're trying, anyway."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "USDA cancels $11 million in federal funding for North Carolina food banks",
            "external_url": "https://www.wunc.org/news/2025-03-14/usda-cancels-federal-funding-north-carolina-food-banks",
            "upvotes": 1146,
            "date": "03/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/f49be1d/2147483647/strip/true/crop/1920x1008+0+136/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F88%2F9813b4f34728a68ed1ad97eb76e1%2Ffood-banks.jpg",
            "top_comments": [
                "It’s always going to be the people that deserve it the least that get the worst of it",
                "Food shelves across the country are anxious because they're expecting, on average, a doubling of people who need help this coming year, and yet are dreading this kind of news that funding will be cut.  Where will my fellow Americans go when we've cut the safety nets out from underneath them? The vast majority of people who use our foodshelf aren't foreigners, terrorists, welfare riders, or villians. They're locals who live here, seniors who don't have enough to retire on and feed themselves, disabled people that can't work enough to make ends meet and pay piling up medical bills, all sorts of sad stories of good regular local people falling through the cracks. And this administration is making those cracks bigger and bigger. SHAME. SHAME ON EVERY SINGLE ONE OF THEM THAT SUPPORTS HURTING AMERICANS.",
                "The cruelty is the point.  Thanks MAGA for even more hungry North Carolinians.",
                "No food for the needy, but a 4.5 TRILLION tax cut for the wealthy. \nThat’s not right.  I don’t care who you are or what side you’re on, that is just not right.",
                "And the hits just keep on coming",
                "Don't worry. Trump says you'll have so much money you won't even know what to spend it on! \n\nOr maybe he was just referring to himself there...",
                "And they’d all vote for trump again tomorrow if they could",
                "It’s what North Carolina wanted",
                "America is back, baby\n\nWhatever that means",
                "Definitely something Jesus would do."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Almonds, whiskey, auto parts: EU's retaliatory tariffs set up these U.S. states and local products as the biggest losers",
            "external_url": "https://www.cnbc.com/2025/03/13/almonds-whiskey-auto-parts-where-eu-tariffs-will-hit-hardest.html",
            "upvotes": 315,
            "date": "03/15/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114947-17417993792025-03-12t170750z_666726697_rc2ancapc616_rtrmadp_0_usa-trump-tariffs-spirits.jpeg?v=1741889218&w=1920&h=1080",
            "top_comments": [
                "They’ll be fine. Haven’t you heard? The tariff money is pouring in!’",
                "Between EU and Canada, Tennessee and Kentucky will not be happy.",
                "> rearview mirrors from Michigan.\n\nWe may come to regret this in hindsight",
                "I mean... if you want to encourage countries to buy more American goods, slapping tariffs on incoming goods is probably the single dumbest option there is. If you're secretly working on behalf of some other country and looking to sow chaos and distrust between long-time allies... it's a brilliant strategy.",
                "So I was looking around my hobby workshop today. 3M professional automotive products like sandpaper, polishes, sealers, adhesives, bonders, backing pads, abrasive cleaners, paint prep chemicals ( like used in every automotive body shop ) are all made in Canada. Talked to a friend who owns a forestry company and all their equipment like Tigercat cutters, high quality saw blades for big cutters and the best cutter head teeth come from Canada, so even to harvest our own timber the parts to do so don’t come from here.",
                "from the article\n\n>In 2024, California exported $1.2 billion in shelled almonds to the EU. The European Union represents 37% of California’s exports to the world.\n\nYou might think \"hey, they are hitting a solidly blue state\" but the almond tariff hits **red counties** with cruise missile precision as agricultural counties (e.g. where almonds are grown) are solidly MAGA, it is just that their population is outweighed by the urban coastal areas.",
                "Hopefully once everyone in the U.S. feels the pain something useful will be done about it. Fuck the people that let it get to this point though.",
                "Welcome Tennessee and Kentucky maga to the find out part, a leopard will be with you shortly. \n\nYour face is very important to us.",
                "Would you take a bit more of tariffs with this tariff!",
                "aren't almonds from California?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Newborn babies exposed to measles in Texas hospital",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-hospital-newborn-babies-exposed-rcna196519",
            "upvotes": 4581,
            "date": "03/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250225-measles-testing-texas-mn-1155-d488ba.jpg",
            "top_comments": [
                "This is probably the worst case scenario.  Newborns are too young to be vaccinated ",
                "“On Wednesday, a woman gave birth in a Lubbock, Texas hospital in the middle of a deadly and fast-growing measles outbreak. Doctors didn’t realize until the young mother had been admitted and in labor that she herself was infected with the measles.\nBy that time, other new moms, newborn babies and their families at University Medical Center Children’s Hospital in Lubbock had unknowingly been exposed to the virus, considered one of the most contagious in the world.\nIt’s unclear when the woman tested positive for measles. Public health officials are casting a wide net in an effort to contact everyone who may have been exposed to this particular patient. Viral particles can live in the air or on surfaces for up to two hours.”\n\nIf you haven’t been, get vaccinated. If you aren’t sure have a doctor check your titers. It’s science not the tooth fairy; believe in the science.",
                "Oh I would be screaming mad. And terrified.",
                "I remember hearing about medieval hospitals, if you went in you were likely to be sicker during your stay (and die) due to rampant diseases that spread in hospital due to poor sanitation and of course, plagues.\n\nEdit: I don't expect my newborn to die from measles caught at the hospital maternity ward.",
                "Look up SSPE. Arises from previous measles infection, going dormant for approximately 7+ years, only to come back as a progressive brain disease that is almost always fatal. The younger you are when you encounter measles virus, the much more likely you are to die of SSPE to the tune of about 1 in 600. \n\nSo these babies may get infected, become well again, and 7 years later, when you are lulled into a false sense of security, your child will wither away in front of you until they die. \n\nThis is just another reason we vaccinate widely. Because herd immunity protects infants especially.",
                "It's Texas, no one there will care. The kids have been born already.",
                "And this, folks, is why we developed mass vaccinations IN THE FIRST PLACE.",
                "Hospital staff are scrambling with damage control efforts — implementing emergency masking policies and giving babies as young as three days old injections of immunoglobulin, an antibody that helps their fragile immune system fight off infections.\n\nA 2021 study found that the therapy is highly effective in protecting exposed newborns from getting sick.\n\n“These babies didn’t ask for this exposure,” said Chad Curry, training chief for the University Medical Center EMS. “But at the end of the day, this is the only way we can protect them.”",
                " If you killed my baby with measles, you’re not going to have a nice day.",
                "When I was pregnant, they did a titer to make sure I had immunity. If someone doesn’t have immunity right now, they need to be quarantined. \n\nYou don’t wanna get the shot? Fine. Don’t. Consequences say you can’t participate in society. Unfortunately this punishes people who aren’t able to get the shot, and I suspect that is a much smaller group than anti-vaxxers."
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "RISING",
            "title": "Measles cases linked to Texas outbreak grows to 259, with just 2 among fully vaccinated people",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-grows-259-2/story?id=119799576",
            "upvotes": 2532,
            "date": "03/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Truly the golden age here in the US.",
                "Since we are going backwards, What's next on menu? Civil war?",
                "The most lethal and most contagious disease ever is ignorance and the US has been having a pandemic for decades.",
                "As a kid, I wondered how an advanced civilization like Atlantis could possibly not exist anywhere. \n\nAs an adult, while I know Atlantis isn't real, I can totally understand how any advanced civilization could go bottoms up.\n\n  \nJust didn't think it would happen in my lifetime. And historians better call this the dumbest timeline.",
                "So. \n\n\nIs Texas planning on bringing back Polio, too?\n\n\nMaybe also Smallpox? Diphtheria? Hepatitis B?\n\n\nI'm so, so tired of science-denying ijuts.",
                "Said it before and will say it again. \n\nThe parents of unvaccinated children who get sick from measles should be charged with child abuse and/or endangerment. If the child dies they should be charged with first degree murder. If they want to claim it was \"God's will\" then they better be prepared to subpoena God to show up as a witness for their trial and testify that it was indeed preordained that this child would die of measles. Otherwise, fuck you, you allowed your child to contract (and die of) an easily preventable disease. That is, to me, textbook child abuse, and if the kid dies, considering you knew you could prevent it and still did nothing, that makes it premeditated murder. \n\nBut, it's Texas, so probably most of the parents of affected kids will profit off the death of their child by joining the anti-vax grift train and they'll be hailed as heroes for \"owning the libs\" by letting their child die a horrible death at a very young age.",
                "Today’s 36 new Texas cases is higher than the 25 new cases reported Tuesday, but lower than the 39 new cases reported last Friday.",
                "The proof that measles vaccine really work.  Anti people fear potential side effect more rather than the actual germ itself.",
                "Is anyone surprised how few cases (relatively speaking) compared to how virulent this disease is?  Wouldn’t there be more than this by now, or is the reporting skewed by families not reporting cases unless they require significant medical intervention.  I guess most of the older population has immunity and it’s just the unvaccinated kids that are getting it?",
                "I thought there were dozens where status was unknown.   Have they figured it out?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Immigration officials arrest second person who participated in pro-Palestinian protests at Columbia",
            "external_url": "https://www.wftv.com/news/politics/columbias-mahmoud/W6PPLQLVY5DSLL7FMKN2XI2LYI/?outputType=amp",
            "upvotes": 2431,
            "date": "03/14/2025",
            "thumbnail": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FE26T7XL4WACHU4HYKB5ERCKBYU.jpg?auth=5a0af1350facf60d9f6b189766c2aa27d84e7f45136c91a974eb02a9f9dc08fc&width=1200&height=630&smart=true",
            "top_comments": [
                "> A Columbia doctoral student from India whose visa was revoked by the Trump administration fled the U.S. on an airliner.\n\n“Fled?” I would have thought a person was supposed to leave the country after having their visa revoked. Like, isn’t that the correct and expected thing to do?",
                "Immigration is super serious and overstaying a visa is super bad and you should be deported! \n\n\n\n...unless you're Musk",
                "Her student visa was revoked three years ago for not attending classes... ",
                "Her student visa was revoked TWICE under Biden because she did't attend class. She made this decision super easy for the Trump admin. At least show up to class. geez",
                "I do think they're targeting these folks for being protesters, but to be clear:\n\n> Leqaa Kordia, a Palestinian from the West Bank, was arrested by immigration officers for overstaying her student visa, the Department of Homeland Security said.",
                "Am I missing something or is there a reason why every single comment was deleted?",
                "Although I am not an Orange Tyrant voter or anything like it, I do agree that people that over stay their visas are to be removed and furthermore if you are a guest on a student visa, you better behave or take it back to your home country",
                ">Leqaa Kordia, a Palestinian from the West Bank, was arrested by immigration officers for overstaying her student visa, the Department of Homeland Security said. Kordia’s visa was terminated in January 2022 for “lack of attendance,” the department said. She was previously arrested for her involvement in protests at Columbia in April 2024, the agency added.\n\nWell done.\n\nKeep up the good work.",
                "This one is by the rules, she overstayed. Khalil's arrest is not. It is important to not associate both cases.",
                "believe nothing from this administration."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "U.S. stock market loses $5 trillion in value in three weeks",
            "external_url": "https://www.cnbc.com/2025/03/14/us-stock-market-loses-5-trillion-in-value-in-three-weeks.html",
            "upvotes": 39481,
            "date": "03/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108107173-1741956255184-108107173-17405057832025-02-25t164922z_514643967_rc2q1davpagh_rtrmadp_0_usa-stocks.jpg?v=1741956265&w=1920&h=1080",
            "top_comments": [
                "All of a sudden conservatives do not care about the stock market",
                "What's amazing is that millions of adults don't seem to notice his industrial strength incompetency.",
                "*Opinion pending, awaiting MAGA marching orders*",
                "Somebody said it right, *Actions speak louder than words*",
                "A quick google search indicates the US stock markets total valuation as of Jan 2025 is about 62 trillion. That is an 8% loss in less than a month largely due to the actions of 1 man. If your company discovered 1 employee was directly responsible for an 8% drop in revenue the speed with which they would be removed by any means might break the laws of physics.",
                "All Trump had to do was be an absentee retired president who golfs everyday and the momentum form Biden’s economy…9 straight quarters of growth would have kept going. Do nothing and claim credit. \n\nInstead he trashed it in 6 weeks. Every single business Trump puts his name in gets ruined. He doesn’t I understand business. He’s understands stealing, fraud and cons, but not legitimate business or the economy .",
                "The rich guys have figured out how to get at everybody's tax dollars now.\n\n\nAnd you can bet they're all buying/selling in tandem with Trump's \"tariffs on/tariffs off\" cycles.",
                "Dont worry. It’s only people retirement funds.",
                "100% the fault of chairman orange shitbag.",
                "Trump is running America exactly the same as he runs his businesses… Into the ground."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Voice of America ending contracts with Associated Press, Reuters and Agence France Presse",
            "external_url": "https://apnews.com/article/voa-government-media-contracts-2bd47cf0c1bbcdc5cbe08eea030c1454",
            "upvotes": 1193,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Kari Lake, the former broadcaster turned Republican politician who was selected by President Donald Trump to run VOA, estimated the move would save $53 million.\n\n\nAs an Arizona resident, I'm sincerely sorry about Kari Lake. When we send them, we're not sending our best people ",
                "In other words: _These legitimate news services undermine the narratives we make up... so fuck 'em_.",
                "This is being done as per [Project 2025 (Chapter 8).](https://static.project2025.org/2025_MandateForLeadership_CHAPTER-08.pdf)’s plans.",
                "Amongst all the horseshit, I missed Kari lying-fraud-fuckwit Lake being put in charge of VoA... Stupidest fucking timeline",
                "Easier to push out propaganda that way.",
                "“We should not be paying outside news organizations to tell us what the news is,” said Lake, who ran unsuccessfully for Arizona governor. “With a nearly billion-dollar budget, we should be producing news ourselves. And if that’s not possible, the American taxpayer should demand to know why.”",
                "That's because it's not the Voice of America anymore.\n\nIt's the Voice of Trump and Co.",
                "I dunno about this. If or when world or national news services have to use only internal staffs to assemble relevant or pertinent information then they become local news outlets and we have been there and found it wanting.       \nThat is why the 'wire' services are helpful.",
                "This is what Putin wanted.",
                "Fitting. Many Americans silenced their own voices this past election. Like they do every election."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "More than 50 universities face federal investigations as part of Trump's anti-DEI campaign",
            "external_url": "https://apnews.com/article/trump-dei-universities-investigated-f89dc9ec2a98897577ed0a6c446fae7b?utm_source=flipboard&utm_content=user%2FAssociatedPress",
            "upvotes": 566,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's a lot of investigations.  They will want to be efficient about it by relying on as few facts as possible.",
                "They don't even link to the list of schools.\n\nhttps://www.ed.gov/about/news/press-release/us-department-of-educations-office-civil-rights-sends-letters-60-universities-under-investigation-antisemitic-discrimination-and-harassment",
                "Investigating Ohio State University? This is going to be problematic for MAGA Buckeye fans.",
                "What a waste of time, money and other miscellaneous resources. I can't wait until this administration moves on to the next dog whistle buzzword.",
                "How coincidental that trump’s alma mater isn’t being investigated",
                "Investigations cost lots of money.  Where you at DOGE?",
                "Don't worry guys this investigation is surely being led by someone extremely competent and qualified.    \n\n\\*Checks\\*.    \n\nLinda Mcmahon of the WWE.   \n\nOh boy",
                "If you support Trump, you are a white supremacist.",
                "UC Davis? I'm pretty surprised, I'm attending UC Davis at the moment",
                "Vance: \"the universities are the enemy\"\n\nYarvin said Harvard should not exist by April. They're trying, anyway."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Police question Russian master of ship that hit tanker in North Sea | UK news",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/captain-arrested-over-uk-ship-collision-is-russian-owner-says",
            "upvotes": 296,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f785bcdf2460ac2b7086234cb10a03a269bf9eb1/0_300_5523_3314/master/5523.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7fe543d6f080043ce83ede9e9cf3fd90",
            "top_comments": [
                "There is a semi-credible conspiracy theory (unproven but plausible) that this was a deliberate action. There was jet fuel on board the Immaculate that was destined for Ukraine. It is possible that this was sabotage aimed at preventing that from happening. I'm not saying that this is what happened, but there is a possibility. It seems somewhat unnecessary to me, as Ukraine doesn't really have enough jets where lack of jet fuel would make a noticeable difference in the war, but what do I know, I'm no military analysist. Also if it was really Putin, why not hire a non-russian to do it? Unless he was sending some sort of message? Who knows. But, it's kind of weird for a Russian ship master to randomly hit a stationary tanker that just happened to be carrying fuel heading for Ukraine... a pretty remarkable coincidence.\n\nJust watched a youtube video covering topic (at the 6:00 mark) [https://www.youtube.com/watch?v=VcRLQwpBc1s](https://www.youtube.com/watch?v=VcRLQwpBc1s)\n\nWas curious what kinda responses I'd get here.",
                "It's been a long gap between arrest and interview.  I'm assuming they were waiting for him to sober up.",
                "I think it’s easy to jump to a knee-jerk reaction without having all the facts and blame it on sabotage. So that’s what I’ll do. Sabotage! \n\nNo but seriously, the basic facts of the situation are clearly suspicious given the cargo and timing.",
                "Last I saw they charged and jailed him.",
                "The captain was Russian, that means that there is a higher probability that he was drunk rather than malicious"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Trump administration asks Australian universities to justify US funding",
            "external_url": "https://www.abc.net.au/news/2025-03-14/trump-administration-asks-australian-universities-funding/105053784",
            "upvotes": 5721,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/c549b683374ddd719ec861682aab5289?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=6&width=862&height=485&imformat=generic",
            "top_comments": [
                "Folks it’s research grants. The title was shorten for clicks\n\n“Trump administration asked to explain after Australian universities told to justify US-funded research grants” \n\nIt’s quite common for countries to collaborate on joint research in science and technology fields",
                "It’s grant money… isn’t the justification in the grant application?",
                "Reminder for anyone who may be unaware - federal grant applications already contained very lengthy and detailed justifications for pretty much every individual part of the research. \n\nIf it's been approved, it's because it was well vetted by handful of individual reviewers who can demand edits or clarification, then present the application to an entire board of specialists who review further, and then all issues have been adequately justified is the grant awarded. \n\nThis additional work created by the Trumo organization is wildly unecessary and inefficient.",
                "I work adjacent to the research community.  This is not just an Australia thing.   MANY projects are jointly funded and its because the research facilities and experts are scattered all over the world.  There are only so many people who specialize in a particular thing and you can bet if the US has kicked in funding its because they lack either the facilities or experts to run it themselves and wanted to have their finger in the soup.    \n\nIt will be impossible to reverse course with this existing administration.  Institutions and governments are already pivoting and looking at how to pivot away from the US.  They are already trying to poach researchers and skilled labour from the US. They can stay and work on government dictated research like vaccine denials and anti-climate change propaganda or they can leave and work on real science and have maternity leave and 4-6 weeks of vacation and health care.  No government or private company will invest in US based research or infrastructure developments while this gong show is underway.",
                "\"The document also asks... what steps they've taken against \"Christian persecution\" or to \"protect women and to defend against gender ideology.\"\"\n\nWhat the hell is this backwards hick garbage? The US is absolute clown town right now.",
                "Although the U.S. sending money to foreign universities can be questioned, it's becoming apparent with chaos taking over the dysfunctional U.S. government, there are more people beside Ol' Elon inside the Trump Administration with their personal agendas just doing whatever they want.",
                "Trump thinking everyone's mooching off the US.",
                "I mean we do have a nasa base in the outback but whatever dude.",
                "Every great leader in history embraced institutions of public learning as a cornerstone of society.",
                "Yeah what a waste of money to help foster collaboration between American scientists/researchers/professors and the top minds and institutions Australia has to offer.\n\nGod fucking forbid we go a single day without shitting on one of our allies."
            ],
            "aggregate_sentiment": 90.0
        }
    ],
    "last_updated": "03/15/2025 04:09:48 UTC"
}