{
    "posts": [
        {
            "category": "HOT",
            "title": "Judge bars Musk's DOGE team from Social Security records in scathing ruling",
            "external_url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html?utm_source=flipboard&utm_content=user%2FCNBC",
            "upvotes": 46408,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118453-1742406884122-gettyimages-2205899441-4m7a5252_j0ib0j01.jpeg?v=1742406923&w=1920&h=1080",
            "top_comments": [
                "\"Hollander, noting the affiliates of DOGE have kept their identities hidden, wrote, “ironically, the identity of these DOGE affiliates has been concealed because defendants are concerned that the disclosure of even  their names would expose them to harassment and thus invade their privacy.”\n\nA-fucking-men",
                "*Judge Ellen Lipton Hollander in a* [*scathing ruling*](https://storage.courtlistener.com/recap/gov.uscourts.mdd.577321/gov.uscourts.mdd.577321.49.0.pdf) *accused* [*DOGE*](https://www.cnbc.com/2025/02/07/elon-musk-doge-racist-treasury-x-staff.html) *of launching a “fishing expedition” at the Social Security agency and failing to provide any reason why it needed to access vast swaths of Americans’ personal and private data.*\n\nHurrah!!  She attacked DOGE for insisting on the total secrecy and privacy of their operatives while granting zilch such recognition of the tens of millions personal records they demand access to.",
                "Throw the book at these little mid 20s shits. They shouldn’t be anywhere near the government.",
                "\"Are you tired of winning?\" has turned into \"Can we win once?\"",
                "They don't even have the names of the people who had access to said data. And it's a TRO.",
                "That only works with administrations that follow the law",
                "Social Security is sacred grounds. They’ve already stopped phone support which will create havoc for the elderly. Touching benefits will be the poison pill that may finally cure the cancer running throughout the current administration. I hope but not holding my breath.",
                "So what happens when he ignores the law?  So far, no one has been held accountable for their illegal activities. \n\nWho actually stops this madness?",
                "They're getting ready to start pillaging social security. Lots of grandparents and disabled people are going to get branded frauds so billionaires can upgrade the helipads and moonpools on their yachts",
                "Before someone says “ThEy’lL jUsT iGnOrE the oRdErS” - note that the administration has been forced to follow orders then whined about it.  They aren’t as all powerful as they like to portray they are \n\nThey know while republicans are feckless and have placed their balls squarely in President Elon’s hands for safe keeping - they can only be pushed so far. \n\nThere’s a lot do resist. A lot of nonsense this administration is doing to enrich themselves and a lot of cleanup we have to do. \n\nCelebrate the win. Highlight if and when the administration ignores the law and keep fighting.\n\nEdit: added some clarifying text."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump signs executive order to dismantle the Education Department",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251",
            "upvotes": 30969,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-donald-trump-linda-mcmahon-vl-1056a-273d79.jpg",
            "top_comments": [
                "I remember when the right were outraged by Obama’s executive orders so much so that they began referring to him as Chairman Obama. \n\nAnd what do you hear now? Crickets.",
                "(He technically cannot do this but that hasn’t stopped him yet)",
                "Speed running societal collapse to *own the libs*",
                "I didn't realize the president could just run the nation with executive orders",
                "They want your children working.",
                "Educated populace is difficult to manipulate.",
                "Very sad day for America.  Trump can't do much without Congress here, but Republicans seem to be pretty much on board with closing the whole thing down.\n\nI wonder if they realize that school curriculum is already controlled at a state level?",
                "Apr 3, 2016 — We won with poorly educated. “I love the poorly educated,” the Republican presidential front-runner boasted after coasting to a decisive victory.",
                "[removed]",
                "The senators and the states THINK they will still get funding for education things but with no federal department telling em how to spend it. I somehow doubt it"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 6175,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Interesting that the JFK documents were insufficiently redacted, while the Epstein documents were redacted to the point of uselessness.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "It's crazy that these people will get new SSNs, meanwhile pretty much every American's SSN has been leaked as part of a data breach at some point recently. It's beyond time for a more modern system. ",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "can you imagine having to get a new social security number in yours 70s lol and with the current state of that department under this admin right now",
                "Leavitt doesn’t understand the difference between proactively and reactively.",
                "No fucking excuse, release the full unredacted Epstein file at this point."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China",
            "external_url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.SRAZ.aIZGK_LvUkAE&smid=nytcore-android-share",
            "upvotes": 4233,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just a friendly reminder that Musk has total access to and control of the federal government only because he gave Trump 250 million dollars. This is what extra-national oligarchy looks like. ",
                "What the actual fuck?",
                "This is just getting more insane with each new day ….",
                "Just to hammer home, there is absolutely *no* chance that Elon could pass a background check for clearance because of his drug use.",
                "Why does this un-elected dude get nearly limitless access to the government? It’s crazy.",
                "God damn, are our military leaders a bunch of spineless fucks too? This is going to get American soldiers fucking **killed**.",
                "Remember when Hillary sent an email from a non-secure server? Yeah I think this is far worse.",
                "the thing i'm shocked about the most, is that each successive outrage is exponentially more shocking and outrageous than the previous high, usually days between.",
                "Such a massive conflict of interest. In addition to Elon Musk’s own business interests in China, his mother, Maye Musk, regularly visits China for business opportunities and advertising, and is an [ambassador to some Chinese mattress company](https://www.nbcnews.com/news/world/china-elon-musk-maye-musk-rcna182118): \n\n“For [Maye] Musk, that means appearing on magazine covers and lots of opportunities to endorse products. She has walked the runway for Chinese apparel brand JNBY and appeared at an event in Shanghai this year for the sportswear brand Fila.\n\nShe is also a global brand ambassador for Chinese mattress brand AISE Baobao, attending a store opening in Shanghai this month, and has appeared in smartphone advertisements for Chinese consumer electronics manufacturer Oppo.”",
                "The drug addict that is in CCP’s pocket and putin’s pocket gets to do what?! How’s pentagon leadership not all quit in protest?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "1-year-old child in Taiwan found with blackened genitals after alleged fatal torture, hundreds call for death sentence.",
            "external_url": "https://mustsharenews.com/taiwan-child-fatal-torture/",
            "upvotes": 1204,
            "date": "03/21/2025",
            "thumbnail": "https://mustsharenews.com/wp-content/uploads/2025/03/child-fatal-torture.jpg",
            "top_comments": [
                ">\"The hospital found that Kai Kai was malnourished and covered in injuries.\n\n>Not only were his skull, pelvis, and calf bones damaged, but he also had broken teeth, pulled-out fingernails, and blackened genitals, reported Hong Kong news outlet\"\n\nMonsters. People who abuse children are the sickest of 'humans'. This poor baby was only 1, and likely the abuse started sooner, as he was in their care for 100+ days to have these significant injuries. They likely sexually abused this child based on injuries.",
                "What a sick fuck. Poor baby. Hate when kids are born only to face nothing but pain and hate.",
                "Yeah kill the person who did it. I rarely say that, but I think it's ok this time. I think for torturing a child it's ok.",
                "My sole purpose of sharing this post is hoping to spread the message of ***“Zero Tolerance for Child Abuse”.***   \nAt the same time calling for stricter penalties for child abuse cases in Taiwan or the world for the matter.",
                "This seems to be popping up EVERYWHERE, globally, on reddit. Absolutendregs of humanity this",
                "I wish I did not read this",
                "Welp that's enough Internet for today. G'night folks!",
                "I support capital punishment for people like this",
                "I worked for two years in Taiwan and saw a LOT of child abuse. Woof it always sits with me.",
                "this is there stuff that makes me wish humanity just went extinct already. the earth would thrive without us"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Man deported to El Salvador under Alien Enemies Act because of soccer logo tattoo: Attorney",
            "external_url": "https://abcnews.go.com/Politics/man-deported-el-salvador-alien-enemies-act-soccer-logo-tattoo-attorney/story?id=119983892",
            "upvotes": 19710,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c53e7039-52fc-4319-8f04-c7c14e03e5e3/salvador-deported-10-rt-gmh-250316_1742166305552_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "People still don’t realize how serious this is and that’s a problem.",
                "Its exactly as bad as you might suspect it is.",
                "I saw a news yesterday where a mother from Venezuela recognized his son from El Salvador video being given a haircut, he was moved without any trial or process, just packed in the plane to CECOT, this is horrible.",
                "I recommend watching this short [youtube documentary about CECOT,](https://www.youtube.com/watch?v=BV7Q0zYDO9I) a Mega Prison in El Salvador that the US is now sending people to without Due Process. Any of us could end up there without trial if an ICE agent takes action against you, migrant or citizen.",
                "In addition to the tattoo they said that 🤟 was a gang sign jfc",
                "I am not visiting the US anytime soon, if you don't even have a right for a trial, before you get shipped of to a Camp",
                "Labeling every one as a Gang member terrorist doesn't make it legal, because that is the same name they use for all their opposition.",
                "This is crazy. He’s not from El Salvador nor has any ties to El Salvador and they just arrested and shipped an innocent soccer player/coach there.",
                "The private prison he's being held in is CECOT, a private prison that was massively overcrowded BEFORE Trump shipped hundreds of immigrants there without trial.",
                "Seems like a violation of the First Amendment. Also, how does everyone feel about [Latin or Greek tattoos](https://nypost.com/2024/11/13/us-news/all-of-secretary-of-defense-nominee-pete-hegseths-tattoos/)?"
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "HOT",
            "title": "Houston janitor who urinated in water bottles at doctor’s office, spreading STDs to workers sentenced to prison",
            "external_url": "https://www.click2houston.com/news/local/2025/03/19/houston-janitor-who-urinated-in-water-bottles-at-doctors-office-spreading-stds-to-workers-sentenced/",
            "upvotes": 4352,
            "date": "03/20/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/U2DTQ6TYBZEBLO5G6XDWZQCNLI.png?_a=DATAdtfiZAA0",
            "top_comments": [
                ">The convicted will not have to register as a sex offender\n\n>A man with multiple sexually transmitted and communicable diseases was sentenced to six years in prison for urinating into office workers’ water bottles, resulting in the victims contracting herpes simplex 1 and hepatitis A.\n\n\nI'm a bit lost on why this instance would not be worthy of registering as a sex offender.",
                ">According to prosecutors, Diaz already served more than two years behind bars. He will be eligible for parole after serving three years of his six year sentence\n\nSeems kind of light, considering...",
                "Its some sick motherfuckers out there.",
                "6 years for spreading permanent diseases? Seems too light",
                "Anyway, some kid is gonna get 20 years for vandalizing a Telsa dealership lol",
                "> Blood and urine samples were obtained from Diaz and results indicated he tested positive for herpes simplex 1 virus and hepatitis A. One of them was incurable, documents state. The victim also had lab work done and learned she had contracted the incurable diseases.\n\nHe's a sicko who deserves a harsher sentence than 6 years. He ruined lives.",
                "6 years, down to 3 for good behavior, after spreading incurable diseases, is a very, very light sentence.",
                "According to the article, it was considered assault with a deadly weapon.",
                "Should be RFK Jr's deputy at HHS by next week. Sick, twisted fuck.",
                "How selective of him to only go for people that were about to go to prison.\n\nIn other news: Commas."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "3 people face federal charges in Tesla arson attacks in U.S. as 80 more vehicles at Canada dealership are damaged",
            "external_url": "https://www.nbcnews.com/news/us-news/3-face-federal-charges-tesla-arson-attacks-rcna197340",
            "upvotes": 3307,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-Cybertruck-aa-1045-dd55f3.jpg",
            "top_comments": [
                "Kind of a poor journalistic choice to address crimes in Canada with statements by the attorney General of a different fucking country",
                "There is an author of many satire books from Germany called Marc-Uwe Kling and one of his quotes always comes to mind when seeing stories like this: \n\n(Keep in mind, it’s satire) “I like far right extremists way more than far left extremists. Far left extremists burn cars and far right extremists burn foreigners… and I don’t own any foreigners”",
                ">\"The days of committing crimes without consequence have ended,\" Bondi said in a statement.\n\nUntil Trump is rotting in prison where he belongs, this statement is complete bullshit.",
                "What about the January 6th invaders 🤔",
                "Why is it a \"Federal charge\" for destroying private property? This should be thrown out.",
                "Elon deserves the pain but I don't think he's worth throwing your life away for.  Why go to prison for the next 20 years while Elon is chilling on the outside and chugging along to become the world's first trillionaire?",
                "I'm sorry. \nI don't condone the vandalism, but they weren't targeting people.  This was vandalism and arson. \nTrump is labeling them domestic terrorists and is probably going to push for the death penalty.  That's overkill.",
                "I cannot believe Joe Biden did this. Deplorable.",
                "If you get hit with federal charges, chances are you’re going down. The feds almost never lose, over 92% of cases end in conviction, mostly because people take plea deals to avoid even worse sentences. Trials are super rare, and beating the charges is almost impossible, less than 1% of cases end in acquittal. Federal prosecutors have all the power, all the resources, and they play to win. Once they come for you, the odds are totally against you. This is both under Democrats and Republican control. Both sides don’t play when it comes to federal charges.",
                "I do not grok.\n\nIt's easy to dislike Musk.  It's easy to dislike cybertrucks.\n\nIt's silly to think that breaking the law by being destructive to cybertrucks is going to have any real impact on Musk.\n\nAll it does is make you a criminal."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 39666,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "It is interesting to note, when the panels came off you got to see the vehicle is essentially plastic. So you get a weak aluminum unibody frame, plastic and steel alloy panels that fall off. Doesn't really sound like a vehicle for long term use. Even if it wasn't a Tesla I wouldn't touch it.",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Why would democrats do this?!",
                "Remember when they sneakily tried to offload $400 million worth of these to the State Department without a competitive bidding process? Lol."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Judge blocks deportation of Georgetown University researcher detained by ICE",
            "external_url": "https://www.cbsnews.com/news/georgetown-university-researcher-detained-by-ice/?utm_source=flipboard&utm_content=CBSNews/magazine/Latest+Headlines",
            "upvotes": 2645,
            "date": "03/20/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/20/8b76ea88-a0d8-482e-8369-4f0b19083680/thumbnail/1200x630/aa6b97b16a9e63afdfa671a769b312a0/gettyimages-2195569116.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Ooops... We put him on a plane while this hearing was taking place. /s",
                "If ICE won't release him, somebody has to get him out of detention asap otherwise dump ignore the ruling and put him on a plane. He's a dictator and someone has to stop him.",
                "Trump and company will just ignore it, I guarantee it",
                "Like they care about the law",
                "He's going to start arresting judges. \n\nThere's only so many times he can be ruled against before he decides he can't tolerate dissent any longer.",
                "I don't think this is going to stop them.",
                "Looks like anybody who objects to Israel killing tens of thousands of people can be labelled a Hamas supporter and disappeared.  This is starting to have a chilling effect to any visitor even tourists or those with work visas since it's pretty clear that they're shooting first and asking questions later.",
                "I fear they don’t care at this point. I’d we wake up tomorrow to find this man has been deported, without due process, without any kind of evidence to justify his arrest… we’re done for. Like, if they ignore an order this direct, our system is truly kaput. Just disappearing people for the hell of it.",
                "So we're up to the intellectuals now",
                "As if the government of (out)law and (dis)order would listen to the courts."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Detentions of European tourists at US borders spark fears of traveling to America",
            "external_url": "https://apnews.com/article/border-tourists-german-canadian-detention-immigration-408cd27338e8065268fabc835f8b0c34",
            "upvotes": 146,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"spent 16 days locked up before being allowed to fly home to Germany.\"\n\nWtf",
                "Add tourism to the list of things Trump is destroying",
                "People traveling here on official business should probably receive hazardous duty pay.",
                "Fuck travelling to America\n\nNeither I nor my family is going near there again for a long time.",
                "They are hosting a world cup and an Olympics under this government lol",
                "Who's travelling to that shithole country anyway, these days? Would much rather spend my hard-earned tourist money in countries that are not effectively adversaries to my own country.",
                "In light of these kinds of things, what kind of reception should Americans traveling abroad expect? Might they get a dose of the same medicine when they travel to the EU? This is nightmare for both business and tourism.\n\nEDIT: Don't assume that I am American and asking about myself please.",
                "Trump wanting to send a message….",
                "So far:\n\nKick everyone out\n\nDon't want to hire American workers cause they're more expensive and want benefits\n\nIsn't their plan to probably import more Indian and Chinese tech workers? Who will come here to work if everyone is being detained like this? Unless all of those workers will be remote.",
                "The World Cup in 2026 is gonna have dismal attendance. Why come to the US to support your national team? Tourists aren’t going to want to spend thousands of dollars to risk being detained by Customs or perhaps ICE."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Families of deported Venezuelans are distraught their loved ones were sent to El Salvador",
            "external_url": "https://www.nbcnews.com/news/us-news/families-deported-venezuelans-are-distraught-loved-ones-sent-el-salvad-rcna196950",
            "upvotes": 72,
            "date": "03/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250317-el-salvador-deportations-mn-0910-777d7a.jpg",
            "top_comments": [
                "Imagine living in a country where government officials can be held accountable for their dumbass decisions.\n\nCan't be me.",
                "\"Venezuela proves socialism never works.\"\n\"So you'll give the ones that flee a good experience with capitalism, right? Right?\"",
                "This administration's governing is chaotic and irresponsible at times"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Tesla Recalls 46,000 Cybertrucks Due to Risk of Detaching Exterior Panel While Driving",
            "external_url": "https://dailyboulder.com/tesla-recalls-46000-cybertrucks-due-to-risk-of-detaching-exterior-panel-while-driving/?utm_source=fark&utm_medium=website&utm_content=link&ICID=ref_fark",
            "upvotes": 288,
            "date": "03/21/2025",
            "thumbnail": "https://dailyboulder.com/wp-content/uploads/2025/03/tesla-cybertruck-recalled2.jpg",
            "top_comments": [
                "They sold 46,000 of these Temu dumpsters?",
                "This would be even more hilarious if it wasn't a danger to everyone else sharing the road with these raging dumpster fires.",
                "Sooo.... You could just be driving down the road and one of your \"bulletproof\" steel panels just falls off ..... Neat.",
                "Don't worry, guys, the stocks are coming back up. All cyberstucks being recalled is a minor issue that in no way reflect how Tesla works.  \nThe stocks will regain all their value naturally and without manipulation.",
                "No incentive to fix it. I mean, he got rid of the Consumer Protection Agency. \n\nI guess people are stuck with their lemon.",
                "Tesla recalls all Tesla's due to being randomly set on fire",
                "this is so interesting.. someone just posted in the MarkMyWords sub that this was going to happen..",
                "Is this true that these are the most dangerous vehicle way beyond the exploding Ford Pinto the 70's %-wise? That it has killed more people and still not complete recalled? I also thought it was a rare # like only 10-15k made things too many shit wedge trucks. ",
                "Amazing.  They developed AI that is embarrassed enough about looking like a cybertruck that it is ejecting its own body panels.",
                "This car is practically a 21st century meme"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Boy accused of killing elderly man while girl filmed attack ‘can’t keep track’ of murder trial lies, court hears",
            "external_url": "https://news.sky.com/story/boy-accused-of-killing-elderly-man-while-girl-filmed-attack-cant-keep-track-of-murder-trial-lies-court-hears-13332698",
            "upvotes": 55,
            "date": "03/21/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-bhim-kohli-leicester_6842418.jpg?20250228162305",
            "top_comments": [
                "What the heck is a “slider”?   The article mentions the man being struck with a slider. But I am unfamiliar with this usage/definition.",
                "Give the fucker some adderall.",
                "He's gonna be wearing some sliders in lockup"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 327,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "Only animals punish civilians like this.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Why people are having kids during an active war?",
                "Unfortunately that happens in war.",
                "Hamas killed her parents.\n\nCome on, people. Do better."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "1-year-old child in Taiwan found with blackened genitals after alleged fatal torture, hundreds call for death sentence.",
            "external_url": "https://mustsharenews.com/taiwan-child-fatal-torture/",
            "upvotes": 1208,
            "date": "03/21/2025",
            "thumbnail": "https://mustsharenews.com/wp-content/uploads/2025/03/child-fatal-torture.jpg",
            "top_comments": [
                ">\"The hospital found that Kai Kai was malnourished and covered in injuries.\n\n>Not only were his skull, pelvis, and calf bones damaged, but he also had broken teeth, pulled-out fingernails, and blackened genitals, reported Hong Kong news outlet\"\n\nMonsters. People who abuse children are the sickest of 'humans'. This poor baby was only 1, and likely the abuse started sooner, as he was in their care for 100+ days to have these significant injuries. They likely sexually abused this child based on injuries.",
                "What a sick fuck. Poor baby. Hate when kids are born only to face nothing but pain and hate.",
                "Yeah kill the person who did it. I rarely say that, but I think it's ok this time. I think for torturing a child it's ok.",
                "My sole purpose of sharing this post is hoping to spread the message of ***“Zero Tolerance for Child Abuse”.***   \nAt the same time calling for stricter penalties for child abuse cases in Taiwan or the world for the matter.",
                "This seems to be popping up EVERYWHERE, globally, on reddit. Absolutendregs of humanity this",
                "I wish I did not read this",
                "Welp that's enough Internet for today. G'night folks!",
                "I support capital punishment for people like this",
                "I worked for two years in Taiwan and saw a LOT of child abuse. Woof it always sits with me.",
                "this is there stuff that makes me wish humanity just went extinct already. the earth would thrive without us"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Heathrow Airport closes due to major power outage caused by substation fire",
            "external_url": "https://www.abc.net.au/news/2025-03-21/heathrow-airport-closes-after-power-outage-substation-fire/105081908?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=link",
            "upvotes": 135,
            "date": "03/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9dcb113b3ab8ac35628d50e87fb21b92?impolicy=wcms_watermark_news&cropH=665&cropW=1182&xPos=0&yPos=105&width=862&height=485&imformat=generic",
            "top_comments": [
                "shutting an entire airport is crazy",
                "I was about to leave for the airport when my neighbor knocked on my door at 4:30am and told me about the fire.",
                "Flying is frustrating enough nowadays, now this on top.",
                "That's crazy. Though Heathrow is already one of the worst airports to have a layover in, so this may be a blessing in disguise.",
                "I blame Putin (with unsubstantiated claims).",
                "This better be over by Monday when I fly back to the uk"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Norwegian man files complaint against ChatGPT for falsely saying he killed his sons",
            "external_url": "https://www.abc.net.au/news/2025-03-21/norwegian-man-files-complaint-chatgpt-false-claims-killed-sons/105080604",
            "upvotes": 355,
            "date": "03/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/6d0a4fee09332a2919340a019cd2893a?impolicy=wcms_watermark_news&cropH=2440&cropW=4338&xPos=0&yPos=226&width=862&height=485&imformat=generic",
            "top_comments": [
                "in the future instead of fighting ai spam calls, you'll be fighting ai fake stories about you based on real info it scrapes on you. but its already now... so its only going to get worse.",
                "This is up there with [\"the sun spoke to me and told me to not release my Kickstarter board game\" ](https://youtu.be/v4qzqGXsqSE?si=eHISOYyFXk7hZ0Df)",
                "One for the growing field of…robo-law?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Major Coachella artist cancels festival appearance",
            "external_url": "https://www.sfgate.com/sf-culture/article/coachella-artist-cancels-set-20232964.php",
            "upvotes": 0,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anitta pulled out of the festival for \"unexpected personal reasons\" - saved you a click.",
                "“Major”? I’m not the hippest guy, but I’d still say I’m tied in to music enough to say with confidence that if I’ve never f’ing heard of you, you most certainly are *not* a “major” Coachella act! 😂"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China",
            "external_url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.SRAZ.aIZGK_LvUkAE&smid=nytcore-android-share",
            "upvotes": 4227,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just a friendly reminder that Musk has total access to and control of the federal government only because he gave Trump 250 million dollars. This is what extra-national oligarchy looks like. ",
                "What the actual fuck?",
                "This is just getting more insane with each new day ….",
                "Just to hammer home, there is absolutely *no* chance that Elon could pass a background check for clearance because of his drug use.",
                "Why does this un-elected dude get nearly limitless access to the government? It’s crazy.",
                "God damn, are our military leaders a bunch of spineless fucks too? This is going to get American soldiers fucking **killed**.",
                "Remember when Hillary sent an email from a non-secure server? Yeah I think this is far worse.",
                "the thing i'm shocked about the most, is that each successive outrage is exponentially more shocking and outrageous than the previous high, usually days between.",
                "Such a massive conflict of interest. In addition to Elon Musk’s own business interests in China, his mother, Maye Musk, regularly visits China for business opportunities and advertising, and is an [ambassador to some Chinese mattress company](https://www.nbcnews.com/news/world/china-elon-musk-maye-musk-rcna182118): \n\n“For [Maye] Musk, that means appearing on magazine covers and lots of opportunities to endorse products. She has walked the runway for Chinese apparel brand JNBY and appeared at an event in Shanghai this year for the sportswear brand Fila.\n\nShe is also a global brand ambassador for Chinese mattress brand AISE Baobao, attending a store opening in Shanghai this month, and has appeared in smartphone advertisements for Chinese consumer electronics manufacturer Oppo.”",
                "The drug addict that is in CCP’s pocket and putin’s pocket gets to do what?! How’s pentagon leadership not all quit in protest?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 324,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "Only animals punish civilians like this.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Why people are having kids during an active war?",
                "Unfortunately that happens in war.",
                "Hamas killed her parents.\n\nCome on, people. Do better."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Tesla Recalls 46,000 Cybertrucks Due to Risk of Detaching Exterior Panel While Driving",
            "external_url": "https://dailyboulder.com/tesla-recalls-46000-cybertrucks-due-to-risk-of-detaching-exterior-panel-while-driving/?utm_source=fark&utm_medium=website&utm_content=link&ICID=ref_fark",
            "upvotes": 290,
            "date": "03/21/2025",
            "thumbnail": "https://dailyboulder.com/wp-content/uploads/2025/03/tesla-cybertruck-recalled2.jpg",
            "top_comments": [
                "They sold 46,000 of these Temu dumpsters?",
                "This would be even more hilarious if it wasn't a danger to everyone else sharing the road with these raging dumpster fires.",
                "Sooo.... You could just be driving down the road and one of your \"bulletproof\" steel panels just falls off ..... Neat.",
                "Don't worry, guys, the stocks are coming back up. All cyberstucks being recalled is a minor issue that in no way reflect how Tesla works.  \nThe stocks will regain all their value naturally and without manipulation.",
                "No incentive to fix it. I mean, he got rid of the Consumer Protection Agency. \n\nI guess people are stuck with their lemon.",
                "Tesla recalls all Tesla's due to being randomly set on fire",
                "this is so interesting.. someone just posted in the MarkMyWords sub that this was going to happen..",
                "Is this true that these are the most dangerous vehicle way beyond the exploding Ford Pinto the 70's %-wise? That it has killed more people and still not complete recalled? I also thought it was a rare # like only 10-15k made things too many shit wedge trucks. ",
                "Amazing.  They developed AI that is embarrassed enough about looking like a cybertruck that it is ejecting its own body panels.",
                "This car is practically a 21st century meme"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "1-year-old child in Taiwan found with blackened genitals after alleged fatal torture, hundreds call for death sentence.",
            "external_url": "https://mustsharenews.com/taiwan-child-fatal-torture/",
            "upvotes": 1206,
            "date": "03/21/2025",
            "thumbnail": "https://mustsharenews.com/wp-content/uploads/2025/03/child-fatal-torture.jpg",
            "top_comments": [
                ">\"The hospital found that Kai Kai was malnourished and covered in injuries.\n\n>Not only were his skull, pelvis, and calf bones damaged, but he also had broken teeth, pulled-out fingernails, and blackened genitals, reported Hong Kong news outlet\"\n\nMonsters. People who abuse children are the sickest of 'humans'. This poor baby was only 1, and likely the abuse started sooner, as he was in their care for 100+ days to have these significant injuries. They likely sexually abused this child based on injuries.",
                "What a sick fuck. Poor baby. Hate when kids are born only to face nothing but pain and hate.",
                "Yeah kill the person who did it. I rarely say that, but I think it's ok this time. I think for torturing a child it's ok.",
                "My sole purpose of sharing this post is hoping to spread the message of ***“Zero Tolerance for Child Abuse”.***   \nAt the same time calling for stricter penalties for child abuse cases in Taiwan or the world for the matter.",
                "This seems to be popping up EVERYWHERE, globally, on reddit. Absolutendregs of humanity this",
                "I wish I did not read this",
                "Welp that's enough Internet for today. G'night folks!",
                "I support capital punishment for people like this",
                "I worked for two years in Taiwan and saw a LOT of child abuse. Woof it always sits with me.",
                "this is there stuff that makes me wish humanity just went extinct already. the earth would thrive without us"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "Norwegian man files complaint against ChatGPT for falsely saying he killed his sons",
            "external_url": "https://www.abc.net.au/news/2025-03-21/norwegian-man-files-complaint-chatgpt-false-claims-killed-sons/105080604",
            "upvotes": 354,
            "date": "03/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/6d0a4fee09332a2919340a019cd2893a?impolicy=wcms_watermark_news&cropH=2440&cropW=4338&xPos=0&yPos=226&width=862&height=485&imformat=generic",
            "top_comments": [
                "in the future instead of fighting ai spam calls, you'll be fighting ai fake stories about you based on real info it scrapes on you. but its already now... so its only going to get worse.",
                "This is up there with [\"the sun spoke to me and told me to not release my Kickstarter board game\" ](https://youtu.be/v4qzqGXsqSE?si=eHISOYyFXk7hZ0Df)",
                "One for the growing field of…robo-law?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks deportation of Georgetown University researcher detained by ICE",
            "external_url": "https://www.cbsnews.com/news/georgetown-university-researcher-detained-by-ice/?utm_source=flipboard&utm_content=CBSNews/magazine/Latest+Headlines",
            "upvotes": 2644,
            "date": "03/20/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/20/8b76ea88-a0d8-482e-8369-4f0b19083680/thumbnail/1200x630/aa6b97b16a9e63afdfa671a769b312a0/gettyimages-2195569116.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Ooops... We put him on a plane while this hearing was taking place. /s",
                "If ICE won't release him, somebody has to get him out of detention asap otherwise dump ignore the ruling and put him on a plane. He's a dictator and someone has to stop him.",
                "Trump and company will just ignore it, I guarantee it",
                "Like they care about the law",
                "He's going to start arresting judges. \n\nThere's only so many times he can be ruled against before he decides he can't tolerate dissent any longer.",
                "I don't think this is going to stop them.",
                "Looks like anybody who objects to Israel killing tens of thousands of people can be labelled a Hamas supporter and disappeared.  This is starting to have a chilling effect to any visitor even tourists or those with work visas since it's pretty clear that they're shooting first and asking questions later.",
                "I fear they don’t care at this point. I’d we wake up tomorrow to find this man has been deported, without due process, without any kind of evidence to justify his arrest… we’re done for. Like, if they ignore an order this direct, our system is truly kaput. Just disappearing people for the hell of it.",
                "So we're up to the intellectuals now",
                "As if the government of (out)law and (dis)order would listen to the courts."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China",
            "external_url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.SRAZ.aIZGK_LvUkAE&smid=nytcore-android-share",
            "upvotes": 4227,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just a friendly reminder that Musk has total access to and control of the federal government only because he gave Trump 250 million dollars. This is what extra-national oligarchy looks like. ",
                "What the actual fuck?",
                "This is just getting more insane with each new day ….",
                "Just to hammer home, there is absolutely *no* chance that Elon could pass a background check for clearance because of his drug use.",
                "Why does this un-elected dude get nearly limitless access to the government? It’s crazy.",
                "God damn, are our military leaders a bunch of spineless fucks too? This is going to get American soldiers fucking **killed**.",
                "Remember when Hillary sent an email from a non-secure server? Yeah I think this is far worse.",
                "the thing i'm shocked about the most, is that each successive outrage is exponentially more shocking and outrageous than the previous high, usually days between.",
                "Such a massive conflict of interest. In addition to Elon Musk’s own business interests in China, his mother, Maye Musk, regularly visits China for business opportunities and advertising, and is an [ambassador to some Chinese mattress company](https://www.nbcnews.com/news/world/china-elon-musk-maye-musk-rcna182118): \n\n“For [Maye] Musk, that means appearing on magazine covers and lots of opportunities to endorse products. She has walked the runway for Chinese apparel brand JNBY and appeared at an event in Shanghai this year for the sportswear brand Fila.\n\nShe is also a global brand ambassador for Chinese mattress brand AISE Baobao, attending a store opening in Shanghai this month, and has appeared in smartphone advertisements for Chinese consumer electronics manufacturer Oppo.”",
                "The drug addict that is in CCP’s pocket and putin’s pocket gets to do what?! How’s pentagon leadership not all quit in protest?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Zelensky tells Russia to drop 'unnecessary' demands ahead of peace talks",
            "external_url": "https://www.bbc.co.uk/news/articles/c234y2e9kzlo",
            "upvotes": 1154,
            "date": "03/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f068/live/afed08b0-05b2-11f0-b2ad-a94aba055f71.jpg",
            "top_comments": [
                "That’s right Zelenskyy hold your ground and make the demands Ukraine deserves. You have fought against one of the great superpowers and kept them from stealing your country like they intended. \n\nYou deserve to be recognized by the entire world as the hero you are!!!",
                "Any demand Russia makes is unnecessary. They invaded another country.",
                "I feel so bad for them. The one country that could help, is taking advantage of their dire situation to squeeze out what they can. False promises that are made before letting Putin take full control. What a terrible period this will be remembered as",
                "also maybe stop bombing places while demanding peace.",
                "Russia: \"We demand negotiations! Also, here are our demands, and they're not up for negotiation.\"\n\n\nSay about Zelensky what you will, but he sure rose to the occasion when needed. Trump and Jay Divans could learn a thing or two about that alpha masculinity thing they seem into.",
                "Russia, GTFO and take all your dead with you. That's the deal.",
                "Zelensky is a great leader of his country, and Ukrainians are true patriots and warriors, but when you are left alone with such a huge monster as Russia and such a cunning chameleon as Trump, you become helpless. And this is very sad.",
                "The problem is that the strong subjects the weak. If Zelensky and the Ukrainians don't have the strength to back their sovereignity then they don't get to make any demands. Our world only acknowledges might and Putin knows this. It's up to Europe whether they decide to back Ukraine with might or not if they want them to survive. That's all what really matters.",
                "The Russian mentality is difficult to understand but easy to predict.",
                "Just amend the demand that Trump gets spit roasted, and it’ll get done."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 6180,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Interesting that the JFK documents were insufficiently redacted, while the Epstein documents were redacted to the point of uselessness.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "It's crazy that these people will get new SSNs, meanwhile pretty much every American's SSN has been leaked as part of a data breach at some point recently. It's beyond time for a more modern system. ",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "can you imagine having to get a new social security number in yours 70s lol and with the current state of that department under this admin right now",
                "Leavitt doesn’t understand the difference between proactively and reactively.",
                "No fucking excuse, release the full unredacted Epstein file at this point."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Houston janitor who urinated in water bottles at doctor’s office, spreading STDs to workers sentenced to prison",
            "external_url": "https://www.click2houston.com/news/local/2025/03/19/houston-janitor-who-urinated-in-water-bottles-at-doctors-office-spreading-stds-to-workers-sentenced/",
            "upvotes": 4354,
            "date": "03/20/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/U2DTQ6TYBZEBLO5G6XDWZQCNLI.png?_a=DATAdtfiZAA0",
            "top_comments": [
                ">The convicted will not have to register as a sex offender\n\n>A man with multiple sexually transmitted and communicable diseases was sentenced to six years in prison for urinating into office workers’ water bottles, resulting in the victims contracting herpes simplex 1 and hepatitis A.\n\n\nI'm a bit lost on why this instance would not be worthy of registering as a sex offender.",
                ">According to prosecutors, Diaz already served more than two years behind bars. He will be eligible for parole after serving three years of his six year sentence\n\nSeems kind of light, considering...",
                "Its some sick motherfuckers out there.",
                "6 years for spreading permanent diseases? Seems too light",
                "Anyway, some kid is gonna get 20 years for vandalizing a Telsa dealership lol",
                "> Blood and urine samples were obtained from Diaz and results indicated he tested positive for herpes simplex 1 virus and hepatitis A. One of them was incurable, documents state. The victim also had lab work done and learned she had contracted the incurable diseases.\n\nHe's a sicko who deserves a harsher sentence than 6 years. He ruined lives.",
                "6 years, down to 3 for good behavior, after spreading incurable diseases, is a very, very light sentence.",
                "According to the article, it was considered assault with a deadly weapon.",
                "Should be RFK Jr's deputy at HHS by next week. Sick, twisted fuck.",
                "How selective of him to only go for people that were about to go to prison.\n\nIn other news: Commas."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "1999 Columbine school massacre claims another life as paralyzed survivor's death ruled homicide: Complications from Anne Marie Hochhalter's paralysis were a \"significant contributing factor\" in her death, according to a forensic pathologist",
            "external_url": "https://news.sky.com/story/1999-columbine-school-massacre-claims-another-life-as-paralysed-survivors-death-ruled-homicide-13328132",
            "upvotes": 1934,
            "date": "03/20/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-anne-marie-hochhalter_6855513.jpg?20250313212946",
            "top_comments": [
                "Columbine, the event that changed everything and nothing.",
                "Anne Marie Hochhalter died of sepsis. She was shot in the chest and back during the shooting leaving her paralyzed from the waist down. The grief caused her mom to shoot and kill herself in a pawn shop after asking to see a revolver. The death toll from Columbine is now 14.",
                "Columbine happened the year before I started high school and I remember being terrified but also feeling like it was this seemingly once-in-a-lifetime thing, like it wasn't *actually* something I or the average kid had to worry about & it was just my anxiety getting the best of me.\n\nCrazy that now it's literally just commonplace. It's always sad, but it's never a shock anymore- it's just the way our broken country works.",
                "I remember a few years ago when the victims of Columbine started to be gone longer than they had ever been alive and it was a real sober moment. Its amazing how much the story of Columbine has developed, like kids these days will never understand how after this happened the talk was about music, video games, and bullying, and only years later more focused on how the shooters were psychopaths to the nth degree, their real plans, and what all really went on in the library.",
                "I remember my mom just turning the TV off when this happened. I had a nightmare just off the little bit that I watched.",
                "Anyways just remember that we refuse to admit that the two shooters were influenced by white supremacy and were looking to beat Timothy McVeigh's \"high score\". They instead blamed it on bullying, videogames, and even satanism.",
                "I hadn't known much about Columbine (not from the US) until reading A Mother's Reckoning recently.\nWhat a horrific tragedy. My heart goes out to everyone affected.",
                "Yet, the USA continues to have an enormous problem with guns. Your politicians pose with assault rifles in their family Christmas cards. The USA is number 1 in developed countries for school shootings. They’ve learned nothing since Columbine. But hey, at least you’ve got your “rights” to carry. Clearly the USA is a very sick country, as many would rather have the “right” to possess a gun, over the right for children to feel and be safe in school.",
                "Clearly the answer is easier access to guns.",
                "God bless her. Free from pain. Shes truly an angel for her good work."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/21/2025 08:12:12 UTC"
}