{
    "posts": [
        {
            "category": "HOT",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 6262,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "MAGA – Morons Are Governing America",
                "This raises serious questions about protocol. If true, how could sensitive information be shared in an unsecured chat? Should there be stricter consequences for breaches like this, regardless of who’s involved?",
                "Imagine working your whole life and being locked in since you were a kid to hold a position like Defense Chief then some Fox News guy gets it.",
                "Sir, a second group chat has hit the pentagon",
                "“I know what I am doing”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 2984,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking.",
                "Israel is just committing war crimes these are not “accidents” they’re killing all sorts of aid works from many countries including America",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 10160,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burglar who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches",
                "What church does he attend"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Chinese executive linked to Bangkok building collapse arrested",
            "external_url": "https://www.ctvnews.ca/world/article/chinese-executive-linked-to-bangkok-building-collapse-arrested/",
            "upvotes": 1594,
            "date": "04/20/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/3QSXNATHWOIBSBLR6EB6W7ZUAE.jpg?smart=true&auth=470978b9815b6ed72e6915b2efe2b2538b2819409d5ac2c8d6e2c860bc74875a&width=1200&height=630",
            "top_comments": [
                "Good. I'm Chinese. It's good. Fuck these national corporation.",
                "We should be doing this in the US.",
                "Wait, you mean they don't just step down from their position with a 60 million dollar bonus?",
                "*Substandard metal, fake signatures, bid rigging.* All worrying in light of stories we've heard that the abandoned Oceanwide Plaza towers in Downtown Los Angeles, a Chinese funded project halted due to claimed bankruptcy, were not properly built and cannot be finished.",
                "[deleted]",
                "I was wondering about that building figured it had to do with the fact that it was still under construction didn’t think it should have been able to survive that type of earth quake while not even completely built ",
                "I'd be more impressed if it was a Thai executive, or that the arrest of the Chinese exec had happened in China. You know, when it wasn't an easy domestic political win.\n\n\nBut still better than nothing I guess..."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 1124,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Single-engine plane crashes in Illinois, killing all 4 people aboard",
            "external_url": "https://www.nbcnews.com/news/us-news/single-engine-plane-crashes-illinois-rcna202021",
            "upvotes": 587,
            "date": "04/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250420-trilla-plane-crash-vl-1051a-be3489.jpg",
            "top_comments": [
                "Is this just being reported on more? Because it seems like everyday or every week there's a plane crash. \n\nI'd love to see some statistics",
                "I can trust large, commercial airlines to a reasonable degree. I'd never get on a private plane. ",
                "Wouldn't it be nice to have a high speed train system in our country.  At least it would give us more choices of travel, not just driving or flying.",
                "Landing in a nice open, flat field? No problem. Landing a plane and clipping a wire? That'll do it. The C180G is a tail dragger which makes landing more challenging since you pitch up and visibility is poor over the nose. https://asn.flightsafety.org/wikibase/500313",
                "If Pritzker is already weighing in on this, chances are it was a private plane with some wealthy/influential people on board"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "4 witnesses shed light on Montgomery woman’s murder, husband’s arrest",
            "external_url": "https://www.wsfa.com/2025/04/18/4-witnesses-shed-light-montgomery-womans-murder-husbands-arrest/",
            "upvotes": 217,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/E7RUVXFEZRBHZNGLRJCJKETPEY.png?auth=24a3f559c495be9ec0015da8a715f94cd40e6503adffb5e9e213f57a52de03b2&width=1200&height=600&smart=true",
            "top_comments": [
                "The witnesses said they fled the area and didn’t see what happened next, but were able to identify Wright as the suspect through a photographic lineup.",
                "The witnesses said they were driving their city-owned vehicle on the Boulevard when an unknown woman ran up to them and tried to get in. They then reported a man firing shots at them, three of which hit the vehicle. While no one was injured, the witnesses said the woman then fled to the wood line and was chased by the man.",
                "“A motive for the shooting was not immediately clear” — that line always frustrates me in cases like this, that are DV related. Men kill their wives all the time, because they feel entitled to control over these women’s lives. “why does he do that?” By Lundy Bancroft is a very eye opening read about this subject",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Officers who attended Jan. 6 rally ask Supreme Court to keep identities anonymous",
            "external_url": "https://abcnews.go.com/US/wireStory/seattle-officers-attended-jan-6-rally-us-supreme-120979630",
            "upvotes": 27719,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7283fa25-35ca-41e0-a982-84b019579cf9/wirestory_01d1b6115c8b6529e74bbaf90a332239_16x9.jpg?w=1600",
            "top_comments": [
                "Meanwhile laws are being put on the books about wearing masks in public, and Im not even touching the Covid thing. Obviously this goes without saying and getting into the streets peacefully and organizing is as important now as its been since the Civil Rights movements in the 50s/60s. Fascism exists in the shadows and the darkness until enough power is amassed to unmask.",
                "Why are they concerned that the public will find out they went to a peaceful rally?",
                "‘Rally’ ?! Fuck each and every one of those traitors..",
                "Absolutely fuck that. Unless they are willing to retire/quit as law enforcement.",
                "We already know who they are…..\n\nhttps://liberationnews.org/unmasked-at-last-all-seattle-cops-at-fascist-jan-6-rally-have-been-identified/\n\nThe rot starts with the Seattle Police Officers Guild.",
                "These men support a russian asset for president. They deserved to be shamed and shunned for their terroristic actions.",
                "SEATTLE -- Current and former Seattle police officers who attended President Donald Trump's “Stop the Steal” political rally on Jan. 6, 2021 at the U.S. Capitol are asking the nation's highest court to keep their identities anonymous in public court records. \n\nUsing “John Doe” pseudonyms, they sued over whether the investigation into their activities should be made public. The Washington State Supreme Court ruled in February that they can be identified and that they haven't shown that public release of their names violates their right to privacy. The state supreme court denied reconsideration earlier this month and lawyers for the four officers submitted a petition to the U.S. Supreme Court, asking that the names remain protected during their legal challenge. \n\nFour officers who attended events in the nation’s capital on the day of an insurrection claimed they are protected under the state’s public records law. They say they did nothing wrong and that revealing their names would violate their privacy.\n\nIn the aftermath of the Jan. 6, 2021 events, the Seattle Police Department ordered an investigation into whether any of its officers who traveled to Washington, D.C. to attend the rally had violated any laws or department policies.\n\nThe investigation found that married officers Caitlin and Alexander Everett crossed barriers set up by the Capitol police and were next to the Capitol Building, in violation of the law, prompting Diaz to fire the pair. Investigators said three other officers had not violated policies and the fourth case was ruled “inconclusive.”\n\nSam Sueoka, a law student at the time, filed records requests seeking disclosure of the investigation's records for the participating officers. \n\n“We are reviewing the Does' motion for a stay,” Neil Fox, one of the Sueoka's attorneys, said in an email to The Associated Press Saturday. \n\nRequiring the officers to use their real names in the litigation would create a chilling effect on voicing unpopular opinions, the petition to the Supreme Court said. \n\n“At its core, this appeal involves whether a government agency can ignore the chilling effect resulting from an employer requiring an employee to disclose their off-duty political activities and attendant impressions or motivations associated therewith, followed by widespread dissemination to those who deliberately seek this information to subject these public servants to vilification without the commission of any misconduct whatsoever,” the petition said. \n\nA response to the petition is due next week on Friday.",
                ">They say they did nothing wrong and that revealing their names would violate their privacy.\n\nThey were in a public place. There is not a reasonable expectation of privacy in public, that's why photographers can take public pictures without consent. The SCOTUS shouldn't even entertain this.",
                "Absolutely not. You’re going to be treated like everyone else.",
                "Traitors against the US with badges and guns."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Indonesian student detained by Ice after US secretly revokes his visa",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/19/aditya-wahyu-harsono-immigration-indonesia",
            "upvotes": 21594,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3a43d1eaa2e95650e34757d82253187c664e2a41/217_850_2715_1629/master/2715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=308f66172b74fd4660247063a77b7561",
            "top_comments": [
                "> His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\nThe revocation was backdated to 23 March and allegedly based on his 2022 misdemeanor conviction for graffitiing a semi-truck trailer.\n\nThey detained him, claimed his visa was revoked, then backdated paperwork revoking his visa? Yeah, that's not alarming or anything.",
                ">Harsono’s wife, Peyton, called Gad in a panic after she received a call from human resources at the hospital. Two Immigration and Customs Enforcement (Ice) agents, dressed in plain clothes, had shown up and instructed the staff to stage a fake meeting in the basement so they could apprehend him, according to Gad.\n\n>Hospital staff were distraught but felt forced to comply.\n\n>“He unsuspectedly walks in, smiling, and then they just pull out their handcuffs and forcibly detain him, pushing against the wall, start frisking him, and stripping all of his belongings,” Gad said.\n\nThis is sickening",
                "A student at my college got their visa revoked a few weeks ago and according to an email they sent out there was no notification given, the college just happened to be doing a routine check of international visa status and caught it",
                "“His wife has been in a state of shock and exhaustion,” Sarah Gad, Harsono’s lawyer, said. “The Department of Homeland Security has weaponized the immigration system to serve just an entirely different purpose, which is to instill fear.”",
                "**>** His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\n\n\\> The revocation was backdated to 23 March\n\nWTF. His visa was secretly revoked and backdated.",
                "I'd like any Trump voter to explain to me why secretly revoking a visa is necessary.",
                "ICE is really working hard to kick out all foreign visa holders who have had any blemish, no matter how slight.  It is a definite agenda to rid this country of all foreigners they possibly can.",
                "So here we have a guy making real progress with his life, contributing to society in major ways and all.\n\nAnd yet, he ends up devastated, embarrassed, and now sits in jail while his wife and child also suffer.\n\nScrew everyone involved. Seriously, get a life, you damn racists.\n\nEdit: an award from a kind stranger! 🙏\n\nEdit 2: Another! Thank you, kind sir/ma'am! ♥️",
                "The staff that complied with ICE to set up a fake meeting are cowards. ",
                "Millions of people in America are cheering because suffering of minorities makes them happy."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Zelenskyy says Russia still firing on Ukraine despite ‘Easter truce’",
            "external_url": "https://www.theguardian.com/world/2025/apr/19/putin-announces-surprise-easter-truce-and-claims-russia-will-not-attack-ukraine-until-monday",
            "upvotes": 8673,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/de1a30b2ab01b986fd22ad96a0e808bc677ba681/0_84_2506_1503/master/2506.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f9b1488cbff715ccfc565226a4a496ca",
            "top_comments": [
                "To the surprise of absolutely no one",
                "Of course the russians are breaking their deal. They break every deal they sign. It is a known quantity.\n\nToo bad we have a russian asset in the white house now. Things are only going to get worse. Set your watch by it.",
                "Of course. Putin never intended to honor the truce. The only purpose of it was propaganda to state that Ukraine was breaking it.",
                "Tomorrow Trump will complain that Ukraine didn‘t accept Putin‘s offer and announce this is the reason the US can‘t do anything anymore to end the war.",
                "A ceasefire with Russia just means that you aren’t allowed to fire back.",
                "I still don't understand why there's so many Americans and bots claiming Zelensky is the reason the war is continuing when it could all end tomorrow if the Russians just fuck off back to their own country considering THEY are the ones invading!!!",
                "I'm starting to think this Putin guy isn't all that honorable.",
                "There will be fires and death around Ukraine and orange head will be on TV Monday saying how great Putin was to implement the truce.",
                "Well it's an Easter truce, so no bullets must travel East. Had it been a Wester truce, Russia would not fire.\n\n/s",
                "Sounds about right. If Putin was honorable or had a sense of fairness then the invasion never would have happened."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 6272,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "MAGA – Morons Are Governing America",
                "This raises serious questions about protocol. If true, how could sensitive information be shared in an unsecured chat? Should there be stricter consequences for breaches like this, regardless of who’s involved?",
                "Imagine working your whole life and being locked in since you were a kid to hold a position like Defense Chief then some Fox News guy gets it.",
                "Sir, a second group chat has hit the pentagon",
                "“I know what I am doing”"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "4 witnesses shed light on Montgomery woman’s murder, husband’s arrest",
            "external_url": "https://www.wsfa.com/2025/04/18/4-witnesses-shed-light-montgomery-womans-murder-husbands-arrest/",
            "upvotes": 220,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/E7RUVXFEZRBHZNGLRJCJKETPEY.png?auth=24a3f559c495be9ec0015da8a715f94cd40e6503adffb5e9e213f57a52de03b2&width=1200&height=600&smart=true",
            "top_comments": [
                "The witnesses said they fled the area and didn’t see what happened next, but were able to identify Wright as the suspect through a photographic lineup.",
                "The witnesses said they were driving their city-owned vehicle on the Boulevard when an unknown woman ran up to them and tried to get in. They then reported a man firing shots at them, three of which hit the vehicle. While no one was injured, the witnesses said the woman then fled to the wood line and was chased by the man.",
                "“A motive for the shooting was not immediately clear” — that line always frustrates me in cases like this, that are DV related. Men kill their wives all the time, because they feel entitled to control over these women’s lives. “why does he do that?” By Lundy Bancroft is a very eye opening read about this subject",
                "[deleted]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 2989,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking.",
                "Israel is just committing war crimes these are not “accidents” they’re killing all sorts of aid works from many countries including America",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 1120,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Single-engine plane crashes in Illinois, killing all 4 people aboard",
            "external_url": "https://www.nbcnews.com/news/us-news/single-engine-plane-crashes-illinois-rcna202021",
            "upvotes": 590,
            "date": "04/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250420-trilla-plane-crash-vl-1051a-be3489.jpg",
            "top_comments": [
                "Is this just being reported on more? Because it seems like everyday or every week there's a plane crash. \n\nI'd love to see some statistics",
                "I can trust large, commercial airlines to a reasonable degree. I'd never get on a private plane. ",
                "Wouldn't it be nice to have a high speed train system in our country.  At least it would give us more choices of travel, not just driving or flying.",
                "Landing in a nice open, flat field? No problem. Landing a plane and clipping a wire? That'll do it. The C180G is a tail dragger which makes landing more challenging since you pitch up and visibility is poor over the nose. https://asn.flightsafety.org/wikibase/500313",
                "If Pritzker is already weighing in on this, chances are it was a private plane with some wealthy/influential people on board"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Chinese executive linked to Bangkok building collapse arrested",
            "external_url": "https://www.ctvnews.ca/world/article/chinese-executive-linked-to-bangkok-building-collapse-arrested/",
            "upvotes": 1593,
            "date": "04/20/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/3QSXNATHWOIBSBLR6EB6W7ZUAE.jpg?smart=true&auth=470978b9815b6ed72e6915b2efe2b2538b2819409d5ac2c8d6e2c860bc74875a&width=1200&height=630",
            "top_comments": [
                "Good. I'm Chinese. It's good. Fuck these national corporation.",
                "We should be doing this in the US.",
                "Wait, you mean they don't just step down from their position with a 60 million dollar bonus?",
                "*Substandard metal, fake signatures, bid rigging.* All worrying in light of stories we've heard that the abandoned Oceanwide Plaza towers in Downtown Los Angeles, a Chinese funded project halted due to claimed bankruptcy, were not properly built and cannot be finished.",
                "[deleted]",
                "I was wondering about that building figured it had to do with the fact that it was still under construction didn’t think it should have been able to survive that type of earth quake while not even completely built ",
                "I'd be more impressed if it was a Thai executive, or that the arrest of the Chinese exec had happened in China. You know, when it wasn't an easy domestic political win.\n\n\nBut still better than nothing I guess..."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 10153,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burglar who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches",
                "What church does he attend"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "No sweat: Humanoid robots run a Chinese half-marathon alongside flesh-and-blood competitors",
            "external_url": "https://apnews.com/article/china-robot-half-marathon-153c6823bd628625106ed26267874d21",
            "upvotes": 621,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why does it seem increasingly likely that various forms of technology are going to live out our dreams of being entertainers, musicians, artists, and athletes while actual human beings are condemned to die on the factory floor in the middle of a 16 hour shift?",
                "Jokes on them, my Subaru Forester can already go much faster and further than even the most athletic person.",
                "I think Im going to start collecting magnets",
                "And they’re worried about trans athletes in the US",
                "[deleted]",
                "That's wild! Imagine running a marathon and having a robot pass you. I wonder if they have to recharge mid-race or if they can go the whole distance on one charge.",
                "Why?  Stop teaching them things.  That’s how we all die.",
                "Great. Now Republicans are gonna start complaining about trans robot athletes.",
                "[https://youtu.be/koB435oHYqY?si=j-DEeai-jBj3qPrM](https://youtu.be/koB435oHYqY?si=j-DEeai-jBj3qPrM)\n\nI was more impressed at first, but then I saw a video. If the robots finally try and take over, just take a brisk walk down the street, and you'll be fine.",
                "Thank god that robot wasn’t a trans woman or this might actually be a problem…."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Officers who attended Jan. 6 rally ask Supreme Court to keep identities anonymous",
            "external_url": "https://abcnews.go.com/US/wireStory/seattle-officers-attended-jan-6-rally-us-supreme-120979630",
            "upvotes": 27718,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7283fa25-35ca-41e0-a982-84b019579cf9/wirestory_01d1b6115c8b6529e74bbaf90a332239_16x9.jpg?w=1600",
            "top_comments": [
                "Meanwhile laws are being put on the books about wearing masks in public, and Im not even touching the Covid thing. Obviously this goes without saying and getting into the streets peacefully and organizing is as important now as its been since the Civil Rights movements in the 50s/60s. Fascism exists in the shadows and the darkness until enough power is amassed to unmask.",
                "Why are they concerned that the public will find out they went to a peaceful rally?",
                "‘Rally’ ?! Fuck each and every one of those traitors..",
                "Absolutely fuck that. Unless they are willing to retire/quit as law enforcement.",
                "We already know who they are…..\n\nhttps://liberationnews.org/unmasked-at-last-all-seattle-cops-at-fascist-jan-6-rally-have-been-identified/\n\nThe rot starts with the Seattle Police Officers Guild.",
                "These men support a russian asset for president. They deserved to be shamed and shunned for their terroristic actions.",
                "SEATTLE -- Current and former Seattle police officers who attended President Donald Trump's “Stop the Steal” political rally on Jan. 6, 2021 at the U.S. Capitol are asking the nation's highest court to keep their identities anonymous in public court records. \n\nUsing “John Doe” pseudonyms, they sued over whether the investigation into their activities should be made public. The Washington State Supreme Court ruled in February that they can be identified and that they haven't shown that public release of their names violates their right to privacy. The state supreme court denied reconsideration earlier this month and lawyers for the four officers submitted a petition to the U.S. Supreme Court, asking that the names remain protected during their legal challenge. \n\nFour officers who attended events in the nation’s capital on the day of an insurrection claimed they are protected under the state’s public records law. They say they did nothing wrong and that revealing their names would violate their privacy.\n\nIn the aftermath of the Jan. 6, 2021 events, the Seattle Police Department ordered an investigation into whether any of its officers who traveled to Washington, D.C. to attend the rally had violated any laws or department policies.\n\nThe investigation found that married officers Caitlin and Alexander Everett crossed barriers set up by the Capitol police and were next to the Capitol Building, in violation of the law, prompting Diaz to fire the pair. Investigators said three other officers had not violated policies and the fourth case was ruled “inconclusive.”\n\nSam Sueoka, a law student at the time, filed records requests seeking disclosure of the investigation's records for the participating officers. \n\n“We are reviewing the Does' motion for a stay,” Neil Fox, one of the Sueoka's attorneys, said in an email to The Associated Press Saturday. \n\nRequiring the officers to use their real names in the litigation would create a chilling effect on voicing unpopular opinions, the petition to the Supreme Court said. \n\n“At its core, this appeal involves whether a government agency can ignore the chilling effect resulting from an employer requiring an employee to disclose their off-duty political activities and attendant impressions or motivations associated therewith, followed by widespread dissemination to those who deliberately seek this information to subject these public servants to vilification without the commission of any misconduct whatsoever,” the petition said. \n\nA response to the petition is due next week on Friday.",
                ">They say they did nothing wrong and that revealing their names would violate their privacy.\n\nThey were in a public place. There is not a reasonable expectation of privacy in public, that's why photographers can take public pictures without consent. The SCOTUS shouldn't even entertain this.",
                "Absolutely not. You’re going to be treated like everyone else.",
                "Traitors against the US with badges and guns."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Indonesian student detained by Ice after US secretly revokes his visa",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/19/aditya-wahyu-harsono-immigration-indonesia",
            "upvotes": 21593,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3a43d1eaa2e95650e34757d82253187c664e2a41/217_850_2715_1629/master/2715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=308f66172b74fd4660247063a77b7561",
            "top_comments": [
                "> His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\nThe revocation was backdated to 23 March and allegedly based on his 2022 misdemeanor conviction for graffitiing a semi-truck trailer.\n\nThey detained him, claimed his visa was revoked, then backdated paperwork revoking his visa? Yeah, that's not alarming or anything.",
                ">Harsono’s wife, Peyton, called Gad in a panic after she received a call from human resources at the hospital. Two Immigration and Customs Enforcement (Ice) agents, dressed in plain clothes, had shown up and instructed the staff to stage a fake meeting in the basement so they could apprehend him, according to Gad.\n\n>Hospital staff were distraught but felt forced to comply.\n\n>“He unsuspectedly walks in, smiling, and then they just pull out their handcuffs and forcibly detain him, pushing against the wall, start frisking him, and stripping all of his belongings,” Gad said.\n\nThis is sickening",
                "A student at my college got their visa revoked a few weeks ago and according to an email they sent out there was no notification given, the college just happened to be doing a routine check of international visa status and caught it",
                "“His wife has been in a state of shock and exhaustion,” Sarah Gad, Harsono’s lawyer, said. “The Department of Homeland Security has weaponized the immigration system to serve just an entirely different purpose, which is to instill fear.”",
                "**>** His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\n\n\\> The revocation was backdated to 23 March\n\nWTF. His visa was secretly revoked and backdated.",
                "I'd like any Trump voter to explain to me why secretly revoking a visa is necessary.",
                "ICE is really working hard to kick out all foreign visa holders who have had any blemish, no matter how slight.  It is a definite agenda to rid this country of all foreigners they possibly can.",
                "So here we have a guy making real progress with his life, contributing to society in major ways and all.\n\nAnd yet, he ends up devastated, embarrassed, and now sits in jail while his wife and child also suffer.\n\nScrew everyone involved. Seriously, get a life, you damn racists.\n\nEdit: an award from a kind stranger! 🙏\n\nEdit 2: Another! Thank you, kind sir/ma'am! ♥️",
                "The staff that complied with ICE to set up a fake meeting are cowards. ",
                "Millions of people in America are cheering because suffering of minorities makes them happy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 6284,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "MAGA – Morons Are Governing America",
                "This raises serious questions about protocol. If true, how could sensitive information be shared in an unsecured chat? Should there be stricter consequences for breaches like this, regardless of who’s involved?",
                "Imagine working your whole life and being locked in since you were a kid to hold a position like Defense Chief then some Fox News guy gets it.",
                "Sir, a second group chat has hit the pentagon",
                "“I know what I am doing”"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 1118,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 2985,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking.",
                "Israel is just committing war crimes these are not “accidents” they’re killing all sorts of aid works from many countries including America",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "4 witnesses shed light on Montgomery woman’s murder, husband’s arrest",
            "external_url": "https://www.wsfa.com/2025/04/18/4-witnesses-shed-light-montgomery-womans-murder-husbands-arrest/",
            "upvotes": 220,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/E7RUVXFEZRBHZNGLRJCJKETPEY.png?auth=24a3f559c495be9ec0015da8a715f94cd40e6503adffb5e9e213f57a52de03b2&width=1200&height=600&smart=true",
            "top_comments": [
                "The witnesses said they fled the area and didn’t see what happened next, but were able to identify Wright as the suspect through a photographic lineup.",
                "The witnesses said they were driving their city-owned vehicle on the Boulevard when an unknown woman ran up to them and tried to get in. They then reported a man firing shots at them, three of which hit the vehicle. While no one was injured, the witnesses said the woman then fled to the wood line and was chased by the man.",
                "“A motive for the shooting was not immediately clear” — that line always frustrates me in cases like this, that are DV related. Men kill their wives all the time, because they feel entitled to control over these women’s lives. “why does he do that?” By Lundy Bancroft is a very eye opening read about this subject",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Single-engine plane crashes in Illinois, killing all 4 people aboard",
            "external_url": "https://www.nbcnews.com/news/us-news/single-engine-plane-crashes-illinois-rcna202021",
            "upvotes": 584,
            "date": "04/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250420-trilla-plane-crash-vl-1051a-be3489.jpg",
            "top_comments": [
                "Is this just being reported on more? Because it seems like everyday or every week there's a plane crash. \n\nI'd love to see some statistics",
                "I can trust large, commercial airlines to a reasonable degree. I'd never get on a private plane. ",
                "Wouldn't it be nice to have a high speed train system in our country.  At least it would give us more choices of travel, not just driving or flying.",
                "Landing in a nice open, flat field? No problem. Landing a plane and clipping a wire? That'll do it. The C180G is a tail dragger which makes landing more challenging since you pitch up and visibility is poor over the nose. https://asn.flightsafety.org/wikibase/500313",
                "If Pritzker is already weighing in on this, chances are it was a private plane with some wealthy/influential people on board"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Chinese executive linked to Bangkok building collapse arrested",
            "external_url": "https://www.ctvnews.ca/world/article/chinese-executive-linked-to-bangkok-building-collapse-arrested/",
            "upvotes": 1594,
            "date": "04/20/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/3QSXNATHWOIBSBLR6EB6W7ZUAE.jpg?smart=true&auth=470978b9815b6ed72e6915b2efe2b2538b2819409d5ac2c8d6e2c860bc74875a&width=1200&height=630",
            "top_comments": [
                "Good. I'm Chinese. It's good. Fuck these national corporation.",
                "We should be doing this in the US.",
                "Wait, you mean they don't just step down from their position with a 60 million dollar bonus?",
                "*Substandard metal, fake signatures, bid rigging.* All worrying in light of stories we've heard that the abandoned Oceanwide Plaza towers in Downtown Los Angeles, a Chinese funded project halted due to claimed bankruptcy, were not properly built and cannot be finished.",
                "[deleted]",
                "I was wondering about that building figured it had to do with the fact that it was still under construction didn’t think it should have been able to survive that type of earth quake while not even completely built ",
                "I'd be more impressed if it was a Thai executive, or that the arrest of the Chinese exec had happened in China. You know, when it wasn't an easy domestic political win.\n\n\nBut still better than nothing I guess..."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 10161,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burglar who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches",
                "What church does he attend"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Officers who attended Jan. 6 rally ask Supreme Court to keep identities anonymous",
            "external_url": "https://abcnews.go.com/US/wireStory/seattle-officers-attended-jan-6-rally-us-supreme-120979630",
            "upvotes": 27716,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7283fa25-35ca-41e0-a982-84b019579cf9/wirestory_01d1b6115c8b6529e74bbaf90a332239_16x9.jpg?w=1600",
            "top_comments": [
                "Meanwhile laws are being put on the books about wearing masks in public, and Im not even touching the Covid thing. Obviously this goes without saying and getting into the streets peacefully and organizing is as important now as its been since the Civil Rights movements in the 50s/60s. Fascism exists in the shadows and the darkness until enough power is amassed to unmask.",
                "Why are they concerned that the public will find out they went to a peaceful rally?",
                "‘Rally’ ?! Fuck each and every one of those traitors..",
                "Absolutely fuck that. Unless they are willing to retire/quit as law enforcement.",
                "We already know who they are…..\n\nhttps://liberationnews.org/unmasked-at-last-all-seattle-cops-at-fascist-jan-6-rally-have-been-identified/\n\nThe rot starts with the Seattle Police Officers Guild.",
                "These men support a russian asset for president. They deserved to be shamed and shunned for their terroristic actions.",
                "SEATTLE -- Current and former Seattle police officers who attended President Donald Trump's “Stop the Steal” political rally on Jan. 6, 2021 at the U.S. Capitol are asking the nation's highest court to keep their identities anonymous in public court records. \n\nUsing “John Doe” pseudonyms, they sued over whether the investigation into their activities should be made public. The Washington State Supreme Court ruled in February that they can be identified and that they haven't shown that public release of their names violates their right to privacy. The state supreme court denied reconsideration earlier this month and lawyers for the four officers submitted a petition to the U.S. Supreme Court, asking that the names remain protected during their legal challenge. \n\nFour officers who attended events in the nation’s capital on the day of an insurrection claimed they are protected under the state’s public records law. They say they did nothing wrong and that revealing their names would violate their privacy.\n\nIn the aftermath of the Jan. 6, 2021 events, the Seattle Police Department ordered an investigation into whether any of its officers who traveled to Washington, D.C. to attend the rally had violated any laws or department policies.\n\nThe investigation found that married officers Caitlin and Alexander Everett crossed barriers set up by the Capitol police and were next to the Capitol Building, in violation of the law, prompting Diaz to fire the pair. Investigators said three other officers had not violated policies and the fourth case was ruled “inconclusive.”\n\nSam Sueoka, a law student at the time, filed records requests seeking disclosure of the investigation's records for the participating officers. \n\n“We are reviewing the Does' motion for a stay,” Neil Fox, one of the Sueoka's attorneys, said in an email to The Associated Press Saturday. \n\nRequiring the officers to use their real names in the litigation would create a chilling effect on voicing unpopular opinions, the petition to the Supreme Court said. \n\n“At its core, this appeal involves whether a government agency can ignore the chilling effect resulting from an employer requiring an employee to disclose their off-duty political activities and attendant impressions or motivations associated therewith, followed by widespread dissemination to those who deliberately seek this information to subject these public servants to vilification without the commission of any misconduct whatsoever,” the petition said. \n\nA response to the petition is due next week on Friday.",
                ">They say they did nothing wrong and that revealing their names would violate their privacy.\n\nThey were in a public place. There is not a reasonable expectation of privacy in public, that's why photographers can take public pictures without consent. The SCOTUS shouldn't even entertain this.",
                "Absolutely not. You’re going to be treated like everyone else.",
                "Traitors against the US with badges and guns."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Indonesian student detained by Ice after US secretly revokes his visa",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/19/aditya-wahyu-harsono-immigration-indonesia",
            "upvotes": 21596,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3a43d1eaa2e95650e34757d82253187c664e2a41/217_850_2715_1629/master/2715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=308f66172b74fd4660247063a77b7561",
            "top_comments": [
                "> His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\nThe revocation was backdated to 23 March and allegedly based on his 2022 misdemeanor conviction for graffitiing a semi-truck trailer.\n\nThey detained him, claimed his visa was revoked, then backdated paperwork revoking his visa? Yeah, that's not alarming or anything.",
                ">Harsono’s wife, Peyton, called Gad in a panic after she received a call from human resources at the hospital. Two Immigration and Customs Enforcement (Ice) agents, dressed in plain clothes, had shown up and instructed the staff to stage a fake meeting in the basement so they could apprehend him, according to Gad.\n\n>Hospital staff were distraught but felt forced to comply.\n\n>“He unsuspectedly walks in, smiling, and then they just pull out their handcuffs and forcibly detain him, pushing against the wall, start frisking him, and stripping all of his belongings,” Gad said.\n\nThis is sickening",
                "A student at my college got their visa revoked a few weeks ago and according to an email they sent out there was no notification given, the college just happened to be doing a routine check of international visa status and caught it",
                "“His wife has been in a state of shock and exhaustion,” Sarah Gad, Harsono’s lawyer, said. “The Department of Homeland Security has weaponized the immigration system to serve just an entirely different purpose, which is to instill fear.”",
                "**>** His attorney said that as of 28 March, the day after his arrest, his F-1 visa was still active. Gad said the government revoked it without any notice to him, and then claimed he had overstayed.\n\n\\> The revocation was backdated to 23 March\n\nWTF. His visa was secretly revoked and backdated.",
                "I'd like any Trump voter to explain to me why secretly revoking a visa is necessary.",
                "ICE is really working hard to kick out all foreign visa holders who have had any blemish, no matter how slight.  It is a definite agenda to rid this country of all foreigners they possibly can.",
                "So here we have a guy making real progress with his life, contributing to society in major ways and all.\n\nAnd yet, he ends up devastated, embarrassed, and now sits in jail while his wife and child also suffer.\n\nScrew everyone involved. Seriously, get a life, you damn racists.\n\nEdit: an award from a kind stranger! 🙏\n\nEdit 2: Another! Thank you, kind sir/ma'am! ♥️",
                "The staff that complied with ICE to set up a fake meeting are cowards. ",
                "Millions of people in America are cheering because suffering of minorities makes them happy."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Zelenskyy says Russia still firing on Ukraine despite ‘Easter truce’",
            "external_url": "https://www.theguardian.com/world/2025/apr/19/putin-announces-surprise-easter-truce-and-claims-russia-will-not-attack-ukraine-until-monday",
            "upvotes": 8670,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/de1a30b2ab01b986fd22ad96a0e808bc677ba681/0_84_2506_1503/master/2506.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f9b1488cbff715ccfc565226a4a496ca",
            "top_comments": [
                "To the surprise of absolutely no one",
                "Of course the russians are breaking their deal. They break every deal they sign. It is a known quantity.\n\nToo bad we have a russian asset in the white house now. Things are only going to get worse. Set your watch by it.",
                "Of course. Putin never intended to honor the truce. The only purpose of it was propaganda to state that Ukraine was breaking it.",
                "Tomorrow Trump will complain that Ukraine didn‘t accept Putin‘s offer and announce this is the reason the US can‘t do anything anymore to end the war.",
                "A ceasefire with Russia just means that you aren’t allowed to fire back.",
                "I still don't understand why there's so many Americans and bots claiming Zelensky is the reason the war is continuing when it could all end tomorrow if the Russians just fuck off back to their own country considering THEY are the ones invading!!!",
                "I'm starting to think this Putin guy isn't all that honorable.",
                "There will be fires and death around Ukraine and orange head will be on TV Monday saying how great Putin was to implement the truce.",
                "Well it's an Easter truce, so no bullets must travel East. Had it been a Wester truce, Russia would not fire.\n\n/s",
                "Sounds about right. If Putin was honorable or had a sense of fairness then the invasion never would have happened."
            ],
            "aggregate_sentiment": 20.0
        }
    ],
    "last_updated": "04/21/2025 00:44:48 UTC"
}