{
    "posts": [
        {
            "category": "HOT",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 23259,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "Cue the continued attacks on Gates for being part of the deep state and weird conspiracy theories about him being a secret lizard or wanting to mind control people with vaccines or some shit like that.",
                "Where do I sign up? I'm poor."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 350,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "Check their phones- I guarantee they were recording it.\n\nMy next door neighbor got a ding dong prank early last year- except instead of ringing the bell they donkey kicked his door and caused the glass to shatter. At 2 in the morning.\n\nGuns got involved. Fortunately none of the stupid kids was shot.",
                "Happened when I was a kid, bunch of people were out playing ding dong ditch at midnight on Halloween and someone came out and shot one of the kids in the back. R.I.P Mark Drews ",
                "I don't buy it.  If the story was true the kids would have been recording at the time of the event, but they weren't.",
                "Play stupid games win stupid prizes the dude didn't have to shoot em but can't take any chances during these crazy times",
                "Messing around at someone’s home at 3am in a group.  It’s a sad story but I wouldn’t convict the homeowner.  He had no way of k owing what their intentions were.",
                "18 year old boy?  Seriously?  \n\nThat's a grown ass man doing pranks at 3AM on a neighborhood they don't know.  \n\nring the bell - look suspicious - start running when someone comes out... yeah.. I would think you were up to no good too... \n\nshooting wasn't justified... but they weren't really bright either...",
                "18 year old ringing a doorbell and running away for fun??",
                "The idiot wasn't aware of ding dong ditch? Did that game skip a generation or something? In the late 90s, early 2000s, it was definitely a thing. No one got shot at or killed for it, at least, not that I'm aware of?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "USDA chief says agency is trying to fill key jobs after paying 15,000 to leave",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389922/usda-deferred-resignation-federal-workers-brooke-rollins",
            "upvotes": 827,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2Fef%2Ff073ccd940c397698bd07095878d%2Fgettyimages-2213159332.jpg",
            "top_comments": [
                "This sounds incredibly efficient",
                "This is the plan per Project 2025. They will fill it with their people now.",
                "They mean complete ass kissing loyalists to Trump wanted. Only R's need apply.\n\n\nProject 2025 in action",
                "This is what happens when you take a sledgehammer to something that needs a scalpel.",
                "Replacing with yes men. Lots and lots of white yes men.",
                "Who wants to work for the Govt anymore",
                "The chainsaw approach will ultimately cost more.",
                "We want educated applicants who epitomize our political ideals.  Those educated AND supporting your ideals want to profit off the grift, not do the work.",
                "I wonder if there can hire some ' re-dippers ' and they can call it an ' extended paid vacation '.",
                "Nothing like hiring in a bunch of new people with no one around to properly train them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 14171,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                "This is the one where they are on camera holding his arms behind his back so the others can take turns punching and kicking him in the face, right? The one where they broke his fucking neck and still kept swinging on him, then propped him up against a car so they could keep going? The one where one of their own even kept asking what he did to deserve this and they couldn't give an answer?\n\nThose are the cops that got acquitted? Jesus fucking Christ. This murder was even more obvious than George Floyd and they acquitted them. This country is fundamentally broken in so many ways.",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "Complete miscarriage of justice. We all saw the murder with our own eyes.",
                "That's incredible... with all the footage",
                "\"Black policemen were another matter. We used to say, “If you must call a policeman”— for we hardly ever did—“for God’s sake, try to make sure it’s a White one.” A Black policeman could completely demolish you. He knew far more about you than a White policeman could and you were without defenses before this Black brother in uniform whose entire reason for breathing seemed to be his hope to offer proof that, though he was Black, he was not Black like you.\"\n\n-James Baldwin",
                "This is beyond sickening. They all deserved to go to prison. Heck, even the EMTs called to the scene were fired for lack of appropriate care, which they blamed on the officers. That video haunts my nightmares. INJUSTICE again today.\n\n[https://www.cnn.com/2023/03/03/us/tyre-nichols-robert-long-testimony/index.html](https://www.cnn.com/2023/03/03/us/tyre-nichols-robert-long-testimony/index.html)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tariffs force U.S. bicycle company to halt imports from China",
            "external_url": "https://www.cbsnews.com/news/tariffs-u-s-bicycle-company-kent-international-halts-imports-from-china/",
            "upvotes": 525,
            "date": "05/08/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/07/243de323-dcf6-4b1e-b542-3ea2f1d2fb55/thumbnail/1200x630/4677ee1734febb8a9c3378a5257eb1c9/1746579665699.png?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "Your kids don't need 1 bike. They can have 0 bikes",
                "I was told we don’t pay the tariffs, the other country does, by the convicted felon & rapist  So why does this keep happening? \n\nI mean I was told we would be so rich from the other countries money rolling in that I would not have to pay taxes anymore, but if WE are paying the tariffs, how is that going to happen. I am so confused.",
                "This was the intended impact of the tariffs, correct?  He should just buy American then, according to the orange-utan.",
                "who need bikes when you have  massive trucks??? MURICA!",
                "Don's right. We don't pay the tariffs. The importer does - straight into Don's unmonitored \"wallet.\" This is known as a slush fund, albeit on a massive scale.   \n\nTHEN the importer raises the price to the American consumer to make up for the tolls they had to pay the troll in the WH, and we either pay it out of our diminished buying power wages (due to Don's other failing economic policies), or the companies go under as sales plummet.  \n\nWho will bear the brunt of the tariffs? Don and Friends or the American people and American businesses?  If you cannot answer that question honestly, you are definitely in the cult.   \n\nDon may be able to \"negotiate\" our country back to exactly where it was when he took over and claim it as the most extraordinary feat of negotiation in history, even though he will (very very quietly—NDAs and all) back down from every demand he made to our international trading partners since they will brush aside each of his demands as the acts of a child pretending to be an adult.  Their \"strongman's\" wins will fire up MAGA.",
                "If bicyclists want favorable treatment from trump they should rebrand themselves as pedalphiles and he'll be their bestie",
                "Make walking great again",
                "Why is this newsworthy?   \nThis outcome was to be expected... unless you don't understand how tariffs work.",
                "I would buy parts or a new bike now rather than later if you need them (even if you want a used bike). You ever seen what goes into shifters/brifters? or even something as small as the tube valve? that manufacturing ain't happening domestically (let alone on a scale to supply Walmart)",
                "> Under the new tariffs, a bicycle wheel imported from China that would have previously cost between $10 and $12 increased to about $30, according to Arnold.\n\nWhy do articles keep failing at reporting right at this point? The next sentence should state how much it would cost to build and buy that same tire in the US so there is actually a real comparison on the financial impact, not just that it costs more to keep importing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration invokes state-secrets privilege in Kilmar Abrego Garcia case",
            "external_url": "https://www.cbsnews.com/news/trump-administration-invokes-state-secrets-privilege-kilmar-abrego-garcia-case/",
            "upvotes": 1394,
            "date": "05/08/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/28/48dfd391-f569-4e1c-8f7c-2bc5da5f98ac/thumbnail/1200x630/5a9a69d4782494521a82065f4cd019c4/gettyimages-2211837932.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"This guy's a supervillain but I can't prove it because the proof is classified.\"",
                "Yes, the state secret is that Trump and his administration is a bunch of cruel misguided egomaniacs who are destroying the country starting with the rule of law",
                "So we just need them to tell the info to old whiskeyleaks and he will send all the details out in a group text....again",
                "But *Trump's* the guy who's constantly claiming to be the victim...\n\nThese people are some truly sleazy assholes.",
                "Trump is a traitor to our nation and should be impeached, removed, convicted, and exiled.",
                "Jesus Christ, take the “L”. \n\nBut as others pointed out, they have big plans for deporting people to gulags with no due process. Can’t let it get stalled right from the get go with judicial oversight…",
                "Just bring him back and give him his due process.  Trump is not the only resident of America that is entitled to due process.",
                "Courts deal with top secret intelligence often. They put in a process and move on. Stop delaying. You admitted you deported him improperly. Bring him home, present evidence, and deport him through proper means if you want",
                "First they said it was administrative error\n\nThen they said he’s a gang member, and when pressed for evidence of that they could only provide hearsay from one CI\n\nNow they’re saying he was deported but they can’t tell anyone why because of “state secrets”?\n\nHOW FUCKING GULLIBLE DO YOU NEED TO BE TO CONTINUE LETTING THEM DO THIS IN BAD FAITH????",
                "The Trump administration appears to have invoked the state-secrets privilege to withhold information in the case involving the mistaken removal of Kilmar Abrego Garcia to El Salvador and any efforts by the Trump administration to return him to the United States.\n\nThe administration’s assertion of the privilege was revealed in an order from U.S. District Judge Paula Xinis, which asked lawyers for Abrego Garcia and the Justice Department to file additional legal papers about the administration’s “invocations of privilege, principally the state secrets and deliberative process privileges.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "LA County introduces health vending machines that offer lifesaving products for free",
            "external_url": "https://abc7.com/post/los-angeles-county-rolls-health-vending-machines-offer-covid-tests-condoms-narcan-free/16352214/",
            "upvotes": 1144,
            "date": "05/08/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16352234_050725-kabc-5pm-health-vending-machines-vid.jpg?w=1600",
            "top_comments": [
                "We have this at a nonprofit I volunteer at in Seattle. The weirdest part is that sometimes police officers come in and use the vending machine to restock their narcan. You'd think they'd have a better supplier than that",
                "I’m from LA and I’m all for this. But do they have a way to stop people from taking more than they need / reselling? More so to ensure these machines aren’t empty when people actually need them. Aside from money I’d think phone number or email would work, but not everyone has those either.",
                "Good! With funding being cut, counties picking up the slack is absolutely necessary.",
                "For Michigan Oakland County has a map of locations.\n\nhttps://www.arcgis.com/apps/instant/sidebar/index.html?appid=96df1b2b41d84d1b8f6a7523e7eda677\n\nHospitals often have free vending machines.",
                "Emptied and sold on Craigslist is what I see happening.",
                "Can't wait for all the shit heads to spin this into that it makes people want to do drugs",
                "These ridiculous machines will not solve the problem.  We need to institutionalize the street addicts.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Cardinals fail to elect new pope on first day of the conclave",
            "external_url": "https://www.cnn.com/world/live-news/new-pope-conclave-day-one-05-07-25",
            "upvotes": 3769,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212927494.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So I still have time to watch Conclave and pretend I know how it all works?",
                "Just the first day.   The elections of Popes Benedict XVI and Francis were swift by historical standards. Both popes were appointed on the second day of voting. Benedict required four rounds of voting; Francis took five.\n\nPope John Paul II, Benedict’s predecessor, took slightly longer. He was elected in 1978 on the third day of voting, in the eighth round. \n\nThe longest record was some 3 years and a few Cardinals died during the voting.  The shortest record was only 10 hours.",
                "Still time for Tedesco",
                "What does this mean for LeBron’s legacy?",
                "Was anyone at all expecting them to have a first round pick?",
                "Is this like pirates of the Caribbean where they all vote for themselves so a decision can’t be made?",
                "Good food, good wine, good friends, nice accommodations.  Let's take our time, just to be very sure.",
                "Does the Vatican have a version of the pizza index we can track?",
                "Is it a best-of-seven?  They can still lose three more games.",
                "The choice between Cardinals legends Larry Fitzgerald and Mark McGuire is a difficult one."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Pakistan says shot down 25 drones, India says it pushed back Pakistani retaliation",
            "external_url": "https://www.reuters.com/world/asia-pacific/blast-heard-pakistans-lahore-amid-tensions-with-india-say-geo-news-reuters-2025-05-08/",
            "upvotes": 240,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reddit is full of Indians and Pakistanis explaining how their side is great and the other is crap. Fuck both of them.",
                "Sounds like they sent drones on purpose to test there air defence.\n\nThe only question is how bad this gets before both sides decide enough people have died and it is time to strike a new deal.",
                "Both of the above statements can be true together. What India has claimed till now is military establishments were attacked first by Pakistan and then in retaliation for this escalation at least 1 ground based air defense system was neutralized. It is not impossible that some of Indian drones were actually taken down.\n\n[‘From destroying Lahore air defence to foiling Pak’s drones’ MEA’s big revelations over Ops Sindoor](https://www.youtube.com/watch?v=3cBIg64Bhb4&ab_channel=ANINews)\n\nIndian MEA also provides some proofs related to Pak terrorist involvement  (around 15min)- UN declared terrorists attending \"civilian\" funerals where they were given protection of Pakistani military and the bodies were wrapped in Pakistani flags.\n\n[This pic says it all: Pakistani Army stands with LeT leader Abdul Rauf at terror camp hit by India under Operation Sindoor](https://www.wionews.com/india-news/operation-sindoor-pakistani-army-stands-with-let-commander-abdul-rauf-at-funeral-of-terrorists-9045122)\n\nGranted that I might be biased, but I'm pro-research. If that's your way, please do and you are free to consider or disregard the above as any valuable leads.",
                "Almost all drones were intercepted. They have been sending those since last night trying to provoke a response by Pakistan but Pakistan is not buying the bait. The videos are circulating all around social media and on Reddits Combat page. \n\nThey are Israeli - made drones which were supplied to India. Wreckage can confirm that.\n\nPakistan has acknowledged one air defence installation was hit where 4 soldiers were injured\n\nThe Indian reddit army is strong and wants to change the narrative by upvoting/downvoting but it isn't working.\n\nThe jets were shot down the night before, now the drones and Pakistan has still only defended itself.",
                "Of course they did, Just like 7 jets yesterday. Tomorrow they will say they downed 30 UFOs, 18 SPACESHIPS and  12 time machines..",
                "the question rest of the world needs to ask Pakistan is, why are Pakistani military officials attending funerals of members of lashkar e tayyeba terrorist organisation ?\n\nhttps://x.com/AdityaRajKaul/status/1920461404374458755\n\nHere’s the photo of Pakistani military and police standing along with Lashkar e Tayyiba Commander Hafiz Abdul Rauf who is a US govt designated terrorist",
                "No, Pakistan, that isn't called 'Shooting down' drones, that's called drones exploding themselves and dealing damage to your systems. It's called Kamikaze drones for a reason.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Town official allegedly shoots lost DoorDash driver looking for directions: Police",
            "external_url": "https://abcnews.go.com/US/town-official-allegedly-shoots-lost-doordash-driver-directions/story?id=121521187",
            "upvotes": 26117,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d845f5c7-a11e-4f3c-8df2-db41b0f8055b/chester-ny-shooting-main-ht-jt-250506_1746551721498_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nHe tells him to leave, so he tries to leave, but he gets shot anyway, *in the fucking back*. Fuck this guy forever.",
                "Imagine being such a paranoid scaredy cat little baby you have to shoot at someone just because they went up your driveway, and I bet he thinks he's acting manly.",
                ">He \"approached several homes asking for directions before arriving at the residence of John Reilly III,\" who is the Town of Chester highway superintendent, police said.\n\n>Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nWhen someone pulls into my driveway, my first inclination is to assume they're probably turning around. My second is I'm about to win money from the Prize Patrol. Further down the line is that they're armed Nova Scotia separatist radicals. \n\n>Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nThose guns are probably going to go away. New York state doesn't allow felons to possess firearms. All because he wanted to \"stand his ground\".",
                ">Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nFederally licensed firearms dealer has illegal gun. Fantastic.",
                " Assault is really underselling what he did. He deliberately shot at someone he knew wasn't a threat to him, he should be getting tried for attempted murder.",
                "Getting lost... **try that in a small town.*",
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\n>The driver was shot once in the back and hospitalized with serious injuries, police said. He's currently in stable condition, police said on Tuesday.\n\n>>**Reilly -- who is a federally licensed firearms dealer**\n\nTypical. The victim was complying and attempting to leave, there was no reason to open fire. This is just another \"*GoOd GuY wItH a GuN*\" looking for an excuse to shoot someone. He's made it abundantly clear that he is a danger to society and belongs in prison for the rest of his life.",
                "This is what happens when you eat social media for all three meals and think you are some sort of lone star rebel hero standing against Democrats who just want children to have food and for billionaires to pay taxes.",
                "This must be that “polite society” they told us we’d have if everyone was armed",
                "It's really touching that both DoorDash and the town have issued statements of remorse for the driver without offering to help cover the guy's medical bills."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli forces close Unrwa-run schools in East Jerusalem",
            "external_url": "https://www.bbc.com/news/articles/cqxej00w3wno",
            "upvotes": 20,
            "date": "05/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7e56/live/b15e8730-2c0b-11f0-8da1-ad2bbee6cda5.jpg",
            "top_comments": [
                "When the schools are run by an organization whose staff took part in the Oct 7th atrocities, its time for that organization to be banned from running schools."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Revealed: Autopsy suggests South Carolina botched firing squad execution | South Carolina",
            "external_url": "https://www.theguardian.com/us-news/2025/may/08/south-carolina-firing-squad-execution",
            "upvotes": 26,
            "date": "05/08/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35da1eac9eaebe0e8101e96eca452c4844ccbd9f/426_411_3267_2613/master/3267.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0dd4ee1d090408522158e5b873c6f6e7",
            "top_comments": [
                "God damn, three shooters missed his heart from 15 feet away? That was either intentional or their training was done by Imperial Stormtroopers.",
                "Absolutely shocking that the US prison system would botch shooting someone, absolutely shocking.",
                "He murdered three people, including \"... 56-year-old off-duty police officer James Myers, whose body was doused in diesel fuel and burned...\"  Maybe justice was served;  Incompetently so, but served nonetheless.",
                "Maybe they ought to go for the head it’s a really big target."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 338,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "Check their phones- I guarantee they were recording it.\n\nMy next door neighbor got a ding dong prank early last year- except instead of ringing the bell they donkey kicked his door and caused the glass to shatter. At 2 in the morning.\n\nGuns got involved. Fortunately none of the stupid kids was shot.",
                "Happened when I was a kid, bunch of people were out playing ding dong ditch at midnight on Halloween and someone came out and shot one of the kids in the back. R.I.P Mark Drews ",
                "I don't buy it.  If the story was true the kids would have been recording at the time of the event, but they weren't.",
                "Play stupid games win stupid prizes the dude didn't have to shoot em but can't take any chances during these crazy times",
                "Messing around at someone’s home at 3am in a group.  It’s a sad story but I wouldn’t convict the homeowner.  He had no way of k owing what their intentions were.",
                "18 year old boy?  Seriously?  \n\nThat's a grown ass man doing pranks at 3AM on a neighborhood they don't know.  \n\nring the bell - look suspicious - start running when someone comes out... yeah.. I would think you were up to no good too... \n\nshooting wasn't justified... but they weren't really bright either...",
                "18 year old ringing a doorbell and running away for fun??",
                "The idiot wasn't aware of ding dong ditch? Did that game skip a generation or something? In the late 90s, early 2000s, it was definitely a thing. No one got shot at or killed for it, at least, not that I'm aware of?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Lawyers for man executed by firing squad in South Carolina say bullets mostly missed his heart",
            "external_url": "https://apnews.com/article/firing-squad-autopsy-missing-bullet-south-carolina-ffce046a03b2f636f79cff3a50f9474d",
            "upvotes": 43,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Mostly missed his heart” implies to me that at least one did hit his heart. Which seems like the goal, yeah? And in any case, why heart? If you wanted to shoot someone instantaneously, brain.",
                "Honest question — Cops do this every day to people without this level of scrutiny. \n\nI'm not saying by any means it's ok, but why the scrutiny here but not for everyone else killed through state or government sanctioned means?\n\nGenuinely curious",
                "What the fuck does mostly mean lol, either his heart was hit or it wasn't"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 23287,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "Cue the continued attacks on Gates for being part of the deep state and weird conspiracy theories about him being a secret lizard or wanting to mind control people with vaccines or some shit like that.",
                "Where do I sign up? I'm poor."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration invokes state-secrets privilege in Kilmar Abrego Garcia case",
            "external_url": "https://www.cbsnews.com/news/trump-administration-invokes-state-secrets-privilege-kilmar-abrego-garcia-case/",
            "upvotes": 1399,
            "date": "05/08/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/28/48dfd391-f569-4e1c-8f7c-2bc5da5f98ac/thumbnail/1200x630/5a9a69d4782494521a82065f4cd019c4/gettyimages-2211837932.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"This guy's a supervillain but I can't prove it because the proof is classified.\"",
                "Yes, the state secret is that Trump and his administration is a bunch of cruel misguided egomaniacs who are destroying the country starting with the rule of law",
                "So we just need them to tell the info to old whiskeyleaks and he will send all the details out in a group text....again",
                "But *Trump's* the guy who's constantly claiming to be the victim...\n\nThese people are some truly sleazy assholes.",
                "Trump is a traitor to our nation and should be impeached, removed, convicted, and exiled.",
                "Jesus Christ, take the “L”. \n\nBut as others pointed out, they have big plans for deporting people to gulags with no due process. Can’t let it get stalled right from the get go with judicial oversight…",
                "Just bring him back and give him his due process.  Trump is not the only resident of America that is entitled to due process.",
                "Courts deal with top secret intelligence often. They put in a process and move on. Stop delaying. You admitted you deported him improperly. Bring him home, present evidence, and deport him through proper means if you want",
                "First they said it was administrative error\n\nThen they said he’s a gang member, and when pressed for evidence of that they could only provide hearsay from one CI\n\nNow they’re saying he was deported but they can’t tell anyone why because of “state secrets”?\n\nHOW FUCKING GULLIBLE DO YOU NEED TO BE TO CONTINUE LETTING THEM DO THIS IN BAD FAITH????",
                "The Trump administration appears to have invoked the state-secrets privilege to withhold information in the case involving the mistaken removal of Kilmar Abrego Garcia to El Salvador and any efforts by the Trump administration to return him to the United States.\n\nThe administration’s assertion of the privilege was revealed in an order from U.S. District Judge Paula Xinis, which asked lawyers for Abrego Garcia and the Justice Department to file additional legal papers about the administration’s “invocations of privilege, principally the state secrets and deliberative process privileges.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "X restricts Erdoğan rival İmamoğlu's account in Turkey",
            "external_url": "https://bianet.org/haber/x-restricts-erdogan-rival-imamoglu-s-account-in-turkey-307228",
            "upvotes": 66,
            "date": "05/08/2025",
            "thumbnail": "https://static.bianet.org/haber/2025/04/04/imamoglundan-akp-ve-mhp-secmenine-bu-zulmu-durdurmaliyiz.jpg",
            "top_comments": [
                "And Elon bows low to another demented dictator.",
                "Free speech absolutist as long as it’s speech he approves of. Musk is such a thin-skinned tosser."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "USDA chief says agency is trying to fill key jobs after paying 15,000 to leave",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389922/usda-deferred-resignation-federal-workers-brooke-rollins",
            "upvotes": 826,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2Fef%2Ff073ccd940c397698bd07095878d%2Fgettyimages-2213159332.jpg",
            "top_comments": [
                "This sounds incredibly efficient",
                "This is the plan per Project 2025. They will fill it with their people now.",
                "They mean complete ass kissing loyalists to Trump wanted. Only R's need apply.\n\n\nProject 2025 in action",
                "This is what happens when you take a sledgehammer to something that needs a scalpel.",
                "Replacing with yes men. Lots and lots of white yes men.",
                "Who wants to work for the Govt anymore",
                "The chainsaw approach will ultimately cost more.",
                "We want educated applicants who epitomize our political ideals.  Those educated AND supporting your ideals want to profit off the grift, not do the work.",
                "I wonder if there can hire some ' re-dippers ' and they can call it an ' extended paid vacation '.",
                "Nothing like hiring in a bunch of new people with no one around to properly train them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Jennifer Aniston gate-crashing suspect charged with stalking and vandalism",
            "external_url": "https://abcnews.go.com/US/jennifer-aniston-gate-crashing-suspect-charged-stalking-vandalism/story?id=121578319",
            "upvotes": 109,
            "date": "05/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/215ae965-b2f4-41c1-ad6e-b3cf75b9fcd4/anniston-1-gty-er-250507_1746656263121_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Jennifer Aniston is like one of the least annoying popular actresses there is. Whyd bruh have to bother her of all people",
                ">The Los Angeles Police Department's Threat Management Unit, which has handled cases involving Aniston before, investigated, the sources said.\n\nYeesh. Sometimes I think there's no point to being famous. The Threat Management Unit is tasked with investigating harassment and stalking, especially against celebrities and officials. I guess it makes sense to have a dedicated unit that specialized in that. At the same time, it's crazy we need to have a specialized unit.",
                "It is better to be rich and not famous. Low profile is key to avoid a lot of bad stuff.",
                "Isn't this the second major stalking she's had?",
                "Yeah, I got billions but I  hide it by living in the trailer park. \nCan’t be too careful.",
                "Celebrity stalking has to be one of the most looser ass crimes of all time.",
                "The crazies exist. They are why famous people have to have security and live behind concrete walls. Fortunately I will never enjoy fame or fortune, oh lucky poor me. :(",
                "No! Not the father of her secret child! /s",
                "It's said that prior to Johnny Depp and his Viper Room, celebrity culture mostly existed behind closed doors. Twas Depp's star studded nightlife sensationalism that really put being famous up on a pedestal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pakistan says shot down 25 drones, India says it pushed back Pakistani retaliation",
            "external_url": "https://www.reuters.com/world/asia-pacific/blast-heard-pakistans-lahore-amid-tensions-with-india-say-geo-news-reuters-2025-05-08/",
            "upvotes": 241,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reddit is full of Indians and Pakistanis explaining how their side is great and the other is crap. Fuck both of them.",
                "Sounds like they sent drones on purpose to test there air defence.\n\nThe only question is how bad this gets before both sides decide enough people have died and it is time to strike a new deal.",
                "Both of the above statements can be true together. What India has claimed till now is military establishments were attacked first by Pakistan and then in retaliation for this escalation at least 1 ground based air defense system was neutralized. It is not impossible that some of Indian drones were actually taken down.\n\n[‘From destroying Lahore air defence to foiling Pak’s drones’ MEA’s big revelations over Ops Sindoor](https://www.youtube.com/watch?v=3cBIg64Bhb4&ab_channel=ANINews)\n\nIndian MEA also provides some proofs related to Pak terrorist involvement  (around 15min)- UN declared terrorists attending \"civilian\" funerals where they were given protection of Pakistani military and the bodies were wrapped in Pakistani flags.\n\n[This pic says it all: Pakistani Army stands with LeT leader Abdul Rauf at terror camp hit by India under Operation Sindoor](https://www.wionews.com/india-news/operation-sindoor-pakistani-army-stands-with-let-commander-abdul-rauf-at-funeral-of-terrorists-9045122)\n\nGranted that I might be biased, but I'm pro-research. If that's your way, please do and you are free to consider or disregard the above as any valuable leads.",
                "Almost all drones were intercepted. They have been sending those since last night trying to provoke a response by Pakistan but Pakistan is not buying the bait. The videos are circulating all around social media and on Reddits Combat page. \n\nThey are Israeli - made drones which were supplied to India. Wreckage can confirm that.\n\nPakistan has acknowledged one air defence installation was hit where 4 soldiers were injured\n\nThe Indian reddit army is strong and wants to change the narrative by upvoting/downvoting but it isn't working.\n\nThe jets were shot down the night before, now the drones and Pakistan has still only defended itself.",
                "Of course they did, Just like 7 jets yesterday. Tomorrow they will say they downed 30 UFOs, 18 SPACESHIPS and  12 time machines..",
                "the question rest of the world needs to ask Pakistan is, why are Pakistani military officials attending funerals of members of lashkar e tayyeba terrorist organisation ?\n\nhttps://x.com/AdityaRajKaul/status/1920461404374458755\n\nHere’s the photo of Pakistani military and police standing along with Lashkar e Tayyiba Commander Hafiz Abdul Rauf who is a US govt designated terrorist",
                "No, Pakistan, that isn't called 'Shooting down' drones, that's called drones exploding themselves and dealing damage to your systems. It's called Kamikaze drones for a reason.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 341,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "Check their phones- I guarantee they were recording it.\n\nMy next door neighbor got a ding dong prank early last year- except instead of ringing the bell they donkey kicked his door and caused the glass to shatter. At 2 in the morning.\n\nGuns got involved. Fortunately none of the stupid kids was shot.",
                "Happened when I was a kid, bunch of people were out playing ding dong ditch at midnight on Halloween and someone came out and shot one of the kids in the back. R.I.P Mark Drews ",
                "I don't buy it.  If the story was true the kids would have been recording at the time of the event, but they weren't.",
                "Play stupid games win stupid prizes the dude didn't have to shoot em but can't take any chances during these crazy times",
                "Messing around at someone’s home at 3am in a group.  It’s a sad story but I wouldn’t convict the homeowner.  He had no way of k owing what their intentions were.",
                "18 year old boy?  Seriously?  \n\nThat's a grown ass man doing pranks at 3AM on a neighborhood they don't know.  \n\nring the bell - look suspicious - start running when someone comes out... yeah.. I would think you were up to no good too... \n\nshooting wasn't justified... but they weren't really bright either...",
                "18 year old ringing a doorbell and running away for fun??",
                "The idiot wasn't aware of ding dong ditch? Did that game skip a generation or something? In the late 90s, early 2000s, it was definitely a thing. No one got shot at or killed for it, at least, not that I'm aware of?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 23290,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "Cue the continued attacks on Gates for being part of the deep state and weird conspiracy theories about him being a secret lizard or wanting to mind control people with vaccines or some shit like that.",
                "Where do I sign up? I'm poor."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "USDA chief says agency is trying to fill key jobs after paying 15,000 to leave",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389922/usda-deferred-resignation-federal-workers-brooke-rollins",
            "upvotes": 823,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2Fef%2Ff073ccd940c397698bd07095878d%2Fgettyimages-2213159332.jpg",
            "top_comments": [
                "This sounds incredibly efficient",
                "This is the plan per Project 2025. They will fill it with their people now.",
                "They mean complete ass kissing loyalists to Trump wanted. Only R's need apply.\n\n\nProject 2025 in action",
                "This is what happens when you take a sledgehammer to something that needs a scalpel.",
                "Replacing with yes men. Lots and lots of white yes men.",
                "Who wants to work for the Govt anymore",
                "The chainsaw approach will ultimately cost more.",
                "We want educated applicants who epitomize our political ideals.  Those educated AND supporting your ideals want to profit off the grift, not do the work.",
                "I wonder if there can hire some ' re-dippers ' and they can call it an ' extended paid vacation '.",
                "Nothing like hiring in a bunch of new people with no one around to properly train them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tariffs force U.S. bicycle company to halt imports from China",
            "external_url": "https://www.cbsnews.com/news/tariffs-u-s-bicycle-company-kent-international-halts-imports-from-china/",
            "upvotes": 532,
            "date": "05/08/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/07/243de323-dcf6-4b1e-b542-3ea2f1d2fb55/thumbnail/1200x630/4677ee1734febb8a9c3378a5257eb1c9/1746579665699.png?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "Your kids don't need 1 bike. They can have 0 bikes",
                "I was told we don’t pay the tariffs, the other country does, by the convicted felon & rapist  So why does this keep happening? \n\nI mean I was told we would be so rich from the other countries money rolling in that I would not have to pay taxes anymore, but if WE are paying the tariffs, how is that going to happen. I am so confused.",
                "This was the intended impact of the tariffs, correct?  He should just buy American then, according to the orange-utan.",
                "who need bikes when you have  massive trucks??? MURICA!",
                "Don's right. We don't pay the tariffs. The importer does - straight into Don's unmonitored \"wallet.\" This is known as a slush fund, albeit on a massive scale.   \n\nTHEN the importer raises the price to the American consumer to make up for the tolls they had to pay the troll in the WH, and we either pay it out of our diminished buying power wages (due to Don's other failing economic policies), or the companies go under as sales plummet.  \n\nWho will bear the brunt of the tariffs? Don and Friends or the American people and American businesses?  If you cannot answer that question honestly, you are definitely in the cult.   \n\nDon may be able to \"negotiate\" our country back to exactly where it was when he took over and claim it as the most extraordinary feat of negotiation in history, even though he will (very very quietly—NDAs and all) back down from every demand he made to our international trading partners since they will brush aside each of his demands as the acts of a child pretending to be an adult.  Their \"strongman's\" wins will fire up MAGA.",
                "If bicyclists want favorable treatment from trump they should rebrand themselves as pedalphiles and he'll be their bestie",
                "Make walking great again",
                "Why is this newsworthy?   \nThis outcome was to be expected... unless you don't understand how tariffs work.",
                "I would buy parts or a new bike now rather than later if you need them (even if you want a used bike). You ever seen what goes into shifters/brifters? or even something as small as the tube valve? that manufacturing ain't happening domestically (let alone on a scale to supply Walmart)",
                "> Under the new tariffs, a bicycle wheel imported from China that would have previously cost between $10 and $12 increased to about $30, according to Arnold.\n\nWhy do articles keep failing at reporting right at this point? The next sentence should state how much it would cost to build and buy that same tire in the US so there is actually a real comparison on the financial impact, not just that it costs more to keep importing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "LA County introduces health vending machines that offer lifesaving products for free",
            "external_url": "https://abc7.com/post/los-angeles-county-rolls-health-vending-machines-offer-covid-tests-condoms-narcan-free/16352214/",
            "upvotes": 1140,
            "date": "05/08/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16352234_050725-kabc-5pm-health-vending-machines-vid.jpg?w=1600",
            "top_comments": [
                "We have this at a nonprofit I volunteer at in Seattle. The weirdest part is that sometimes police officers come in and use the vending machine to restock their narcan. You'd think they'd have a better supplier than that",
                "I’m from LA and I’m all for this. But do they have a way to stop people from taking more than they need / reselling? More so to ensure these machines aren’t empty when people actually need them. Aside from money I’d think phone number or email would work, but not everyone has those either.",
                "Good! With funding being cut, counties picking up the slack is absolutely necessary.",
                "For Michigan Oakland County has a map of locations.\n\nhttps://www.arcgis.com/apps/instant/sidebar/index.html?appid=96df1b2b41d84d1b8f6a7523e7eda677\n\nHospitals often have free vending machines.",
                "Emptied and sold on Craigslist is what I see happening.",
                "Can't wait for all the shit heads to spin this into that it makes people want to do drugs",
                "These ridiculous machines will not solve the problem.  We need to institutionalize the street addicts.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration invokes state-secrets privilege in Kilmar Abrego Garcia case",
            "external_url": "https://www.cbsnews.com/news/trump-administration-invokes-state-secrets-privilege-kilmar-abrego-garcia-case/",
            "upvotes": 1391,
            "date": "05/08/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/28/48dfd391-f569-4e1c-8f7c-2bc5da5f98ac/thumbnail/1200x630/5a9a69d4782494521a82065f4cd019c4/gettyimages-2211837932.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"This guy's a supervillain but I can't prove it because the proof is classified.\"",
                "Yes, the state secret is that Trump and his administration is a bunch of cruel misguided egomaniacs who are destroying the country starting with the rule of law",
                "So we just need them to tell the info to old whiskeyleaks and he will send all the details out in a group text....again",
                "But *Trump's* the guy who's constantly claiming to be the victim...\n\nThese people are some truly sleazy assholes.",
                "Trump is a traitor to our nation and should be impeached, removed, convicted, and exiled.",
                "Jesus Christ, take the “L”. \n\nBut as others pointed out, they have big plans for deporting people to gulags with no due process. Can’t let it get stalled right from the get go with judicial oversight…",
                "Just bring him back and give him his due process.  Trump is not the only resident of America that is entitled to due process.",
                "Courts deal with top secret intelligence often. They put in a process and move on. Stop delaying. You admitted you deported him improperly. Bring him home, present evidence, and deport him through proper means if you want",
                "First they said it was administrative error\n\nThen they said he’s a gang member, and when pressed for evidence of that they could only provide hearsay from one CI\n\nNow they’re saying he was deported but they can’t tell anyone why because of “state secrets”?\n\nHOW FUCKING GULLIBLE DO YOU NEED TO BE TO CONTINUE LETTING THEM DO THIS IN BAD FAITH????",
                "The Trump administration appears to have invoked the state-secrets privilege to withhold information in the case involving the mistaken removal of Kilmar Abrego Garcia to El Salvador and any efforts by the Trump administration to return him to the United States.\n\nThe administration’s assertion of the privilege was revealed in an order from U.S. District Judge Paula Xinis, which asked lawyers for Abrego Garcia and the Justice Department to file additional legal papers about the administration’s “invocations of privilege, principally the state secrets and deliberative process privileges.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Pakistan says shot down 25 drones, India says it pushed back Pakistani retaliation",
            "external_url": "https://www.reuters.com/world/asia-pacific/blast-heard-pakistans-lahore-amid-tensions-with-india-say-geo-news-reuters-2025-05-08/",
            "upvotes": 239,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reddit is full of Indians and Pakistanis explaining how their side is great and the other is crap. Fuck both of them.",
                "Sounds like they sent drones on purpose to test there air defence.\n\nThe only question is how bad this gets before both sides decide enough people have died and it is time to strike a new deal.",
                "Both of the above statements can be true together. What India has claimed till now is military establishments were attacked first by Pakistan and then in retaliation for this escalation at least 1 ground based air defense system was neutralized. It is not impossible that some of Indian drones were actually taken down.\n\n[‘From destroying Lahore air defence to foiling Pak’s drones’ MEA’s big revelations over Ops Sindoor](https://www.youtube.com/watch?v=3cBIg64Bhb4&ab_channel=ANINews)\n\nIndian MEA also provides some proofs related to Pak terrorist involvement  (around 15min)- UN declared terrorists attending \"civilian\" funerals where they were given protection of Pakistani military and the bodies were wrapped in Pakistani flags.\n\n[This pic says it all: Pakistani Army stands with LeT leader Abdul Rauf at terror camp hit by India under Operation Sindoor](https://www.wionews.com/india-news/operation-sindoor-pakistani-army-stands-with-let-commander-abdul-rauf-at-funeral-of-terrorists-9045122)\n\nGranted that I might be biased, but I'm pro-research. If that's your way, please do and you are free to consider or disregard the above as any valuable leads.",
                "Almost all drones were intercepted. They have been sending those since last night trying to provoke a response by Pakistan but Pakistan is not buying the bait. The videos are circulating all around social media and on Reddits Combat page. \n\nThey are Israeli - made drones which were supplied to India. Wreckage can confirm that.\n\nPakistan has acknowledged one air defence installation was hit where 4 soldiers were injured\n\nThe Indian reddit army is strong and wants to change the narrative by upvoting/downvoting but it isn't working.\n\nThe jets were shot down the night before, now the drones and Pakistan has still only defended itself.",
                "Of course they did, Just like 7 jets yesterday. Tomorrow they will say they downed 30 UFOs, 18 SPACESHIPS and  12 time machines..",
                "the question rest of the world needs to ask Pakistan is, why are Pakistani military officials attending funerals of members of lashkar e tayyeba terrorist organisation ?\n\nhttps://x.com/AdityaRajKaul/status/1920461404374458755\n\nHere’s the photo of Pakistani military and police standing along with Lashkar e Tayyiba Commander Hafiz Abdul Rauf who is a US govt designated terrorist",
                "No, Pakistan, that isn't called 'Shooting down' drones, that's called drones exploding themselves and dealing damage to your systems. It's called Kamikaze drones for a reason.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US and UK expected to announce deal to reduce tariffs today - BBC News",
            "external_url": "https://www.bbc.co.uk/news/live/cn91dxzv4pnt?post=asset%3A50b726df-cffc-4f73-83c5-aea77fe8b257#post",
            "upvotes": 207,
            "date": "05/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c574/live/e71d5ba0-2c1d-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "This is not the actual trade deal.  It's expected to be just an announcement that they are agreeing to have a trade deal.  We'll see what is actually said by both sides, but this is very likely not to include any details.",
                "I just hope we don’t have to agree to anything shitty for this like their awful factory farmed meats or abandoning the NHS :/",
                "This may or may not happen because I'm making 90 deals in 90 days, 25 deals in 25 days, and I'm going to end the war in Ukraine on the first day. That's a lot of work, and I don't get any sleep, and I haven't even had time to play golf since I've been reselected as president. People are wanting me to have a major parade that I wasn't sure about but the military said \"Sir you are the greatest president in the history of the universe, you have to have this parade for our straight soldiers\". I reluctantly agreed because it's for a great cause, and we're going to have a deal making parade like you've never seen before.",
                "This will save me millions on my imported crumpets",
                "oh wow Trump did it look at how great he is at deals or something or whatever",
                "Thank goodness, maybe we can finally do something about this egregious $11.8B trade surplus with UK? Totally just ripping us off. 🙄\n\nSource: https://www.census.gov/foreign-trade/balance/c4120.html",
                "What was the trade deal before the 🍊 🤡 fucked it all up? Guarantee talks won’t amount to anything and that if they do, they’re worse than where we started.",
                "No doubt it'll be a shit deal for the UK and starmer will stand up and boast how he's making deals",
                "Oh yay the US will still get bandaid\nhttps://tradingeconomics.com/united-kingdom/exports/united-states/pharmaceutical-products",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Gang who smuggled thousands of queen ants sentenced in Kenya",
            "external_url": "https://www.bbc.com/news/articles/cy0x07pr8dno",
            "upvotes": 616,
            "date": "05/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b1af/live/c5878890-2b4f-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Ant trafficking is something I’d never think I would read about",
                "how the fuck do you even gather thousands of queen ants.",
                "But wht they smuggle queen ants? What's the main purpose of it.",
                "Imagine when you in jail and your fellow inmates ask what you in for……",
                "They are trying to start an illegal alien ant farm",
                "They had 5300 ants at $220 is $1.17 Million in illicit trade.\n\nThey get fined $7700.\n\nThey should get treble damages or nearly $3.5 Million and send a message FAFO.  At least scare the \\*\\*\\*\\* out of them and let them sweat....knock it down to $11,700 and they have to go do restoration or whatever re-establishing nets or whatever they can.  \n\nObligatory \"Do you want ants?  Because, this is how you get ants!\"",
                "what is this? a smuggling gang for ants?",
                "This is how you get ants",
                "How does one join this ant gang?",
                "This is a serious subject but also somehow hilarious. They were caught with thousands. Successful ant smugglers know you've gotta kiester those ants to make it through customs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 14162,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                "This is the one where they are on camera holding his arms behind his back so the others can take turns punching and kicking him in the face, right? The one where they broke his fucking neck and still kept swinging on him, then propped him up against a car so they could keep going? The one where one of their own even kept asking what he did to deserve this and they couldn't give an answer?\n\nThose are the cops that got acquitted? Jesus fucking Christ. This murder was even more obvious than George Floyd and they acquitted them. This country is fundamentally broken in so many ways.",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "Complete miscarriage of justice. We all saw the murder with our own eyes.",
                "That's incredible... with all the footage",
                "\"Black policemen were another matter. We used to say, “If you must call a policeman”— for we hardly ever did—“for God’s sake, try to make sure it’s a White one.” A Black policeman could completely demolish you. He knew far more about you than a White policeman could and you were without defenses before this Black brother in uniform whose entire reason for breathing seemed to be his hope to offer proof that, though he was Black, he was not Black like you.\"\n\n-James Baldwin",
                "This is beyond sickening. They all deserved to go to prison. Heck, even the EMTs called to the scene were fired for lack of appropriate care, which they blamed on the officers. That video haunts my nightmares. INJUSTICE again today.\n\n[https://www.cnn.com/2023/03/03/us/tyre-nichols-robert-long-testimony/index.html](https://www.cnn.com/2023/03/03/us/tyre-nichols-robert-long-testimony/index.html)"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/08/2025 16:11:14 UTC"
}