{
    "posts": [
        {
            "category": "HOT",
            "title": "Tesla board members, executive sell off over $100 million of stock in recent weeks",
            "external_url": "https://abcnews.go.com/Business/tesla-board-members-executive-sell-off-100-million/story?id=119889047&cid=social_twitter_abcn",
            "upvotes": 23450,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7d0ebdc0-95a7-4b1b-9b06-180791a83c1f/tesla-charging-station-gty-jt-250314_1741978782881_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "JP Morgan recently downgraded TSLA stock to $120/share. Elon is going to get a margin call.",
                "The fact investors thought Tesla was worth more than every established auto manufacturer combined was just stupid. Please tell me how Tesla was worth more than Toyota, Honda, Ford and VW combined.  Not to mention all the other major brands…",
                "Ah so that’s why Elon made Donald sell Teslas on the White House lawn",
                "Im sure daddy Trump will help bail musk out when this all crashes.",
                "If I had that stock I'd probably be selling too before it's worthless.",
                "If you look into insider sales you will see that no insider has bought a singular share, they only have sold",
                "Weeks? They havent bought a share in over a year.. The execs have sold 750k shares in that same time period.\n\n[https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity](https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity)",
                "That bubble gonna burst.",
                "What’s amazing to me, reading the article, is how divorced some of the rank and file investors are from reality. Talking in the article about how he should “focus less on government spending and more on running his car company” is such a laughable position. \n\nHe doesn’t do anything. How do people not realize this. He was a figurehead with money. ",
                "Good. Get fucked, Elon."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Drake's record label files motion to dismiss his lawsuit over Kendrick Lamar's 'Not Like Us'",
            "external_url": "https://www.nbcnews.com/pop-culture/pop-culture-news/universal-music-group-response-drake-lawsuit-kendrick-lamar-diss-track-rcna196788",
            "upvotes": 2034,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250317-drake-kendrick-lamar-se-349p-c7852c.jpg",
            "top_comments": [
                "And somewhere J Cole is just living his best life.",
                "Drake really asked lawyers to proofread his lyrics for validity. \n\nAnd to nobody's surprise, they found them to be fraudulent and petty, and now its documented for all time in legal form.\n\nLet the record show that Drake is officially a fake gangster who makes shit up about people and lost a rap battle that he provoked.",
                "> The filing comes after a yearlong prolific diss track battle between Drake and Lamar, who spent much of 2024 dropping a slew of tracks aimed at each other. But many fans declared Lamar as the winner of the feud, with “Not Like Us” becoming the bestselling rap recording of 2024. The artist swept this year’s Grammy Awards, taking home five wins, including song of the year and record of the year. Lamar’s momentum continued as he performed at the Super Bowl halftime show in February, where the crowd loudly sang along as he performed “Not Like Us.”  \n\n**TL;DR:** Drake threw the first punch, Kendrick won Grammys, dropped the biggest hit of 2024, and took over the Super Bowl.",
                "This headline seems like it's confusing some people in this thread. For clarification, Drake's record label is the one being sued here. Them asking for the lawsuit to be dismissed isn't the same as Drake dropping the lawsuit.",
                "So now we can say that Kendrick legally won the rap war?",
                "If you told me Kendrick was helping out UMG's legal team to write this I wouldn't question it because it was a thorough slapping of Drake's face flipping his own words, calling to question his Drake persona and cooking him in the footnotes.",
                "Sounds like someone ended up not wanting to go through discovery.",
                "I heard his real name is Clarence.",
                "I’m sure the calm and collected folks of r/Drizzy are taking this very rationally",
                "No one in the comments read the article or understands who is being sued by whom."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Cop dies when police car split in 2 by light pole while in pursuit of suspect during chase",
            "external_url": "https://abcnews.go.com/US/cop-dies-police-car-split-2-light-pole/story?id=119900970",
            "upvotes": 984,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f1a3e680-5b5d-4978-864c-6fe7523d2a07/Cuevas_1742282458142_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "Just fucking say he crashed into a light pole, what the fuck.",
                "Alright this has to be the silliest use of passive voice ever.\n\n“Cop dies in highspeed chase after hitting bystander’s car, light pole.”",
                "pictures of the car in this article  \n[https://www.vvng.com/authorities-identify-deputy-killed-in-victorville-crash-as-hector-cuevas-jr/](https://www.vvng.com/authorities-identify-deputy-killed-in-victorville-crash-as-hector-cuevas-jr/)",
                "I also died trying to read the headline.",
                "Passive voice is the real killer.",
                "\"cop loses control of vehicle at high speed, dies\"",
                "Is that the light pole’s fault?",
                "Police car pursuits are dumb and should be illegal example number: 11,239",
                "And the article says nothing about the girl he sent to the hospital",
                "Maintain distance, and call for backup."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 17856,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "The reason people with a brain do not do this is they realize their own children are going to need the very same protection. Jesus how did so many people vote for one of the dumbest fuckers on the planet.",
                "I've never seen a more insecure man than Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "Biden specifically EXTENDED protections for Trump's adult kids from six months to one year when he became president.  Trump is just being his typically petty bitch ass self.",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Good thing Democrats won't fight dirty because they want to be civil and prevent exactly the retaliatory things that are happening every day"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "China says Panama ports sale to BlackRock is an example of ‘economic coercion.’ Investors are spooked",
            "external_url": "https://edition.cnn.com/2025/03/18/business/hong-kong-ck-hutchison-panama-ports-sale-hnk-intl/index.html?utm_source=business_ribbon",
            "upvotes": 1464,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2201491120.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And the ironic part is that BlackRock is still one of the most Chinese friendly US investment firms.",
                "So does this mean the US will stop passive aggressively declaring war on Panama?",
                "This article made me wonder: why does Blackrock even need partners for a 22b sale? They manage assets worth over 10 trillion dollars. It’s less than 0.2% of their managed assets to just purchase it on their own. So why even partner up?",
                "> “I would like to emphasize that China has always firmly opposed the use of economic coercion, hegemonism and bullying to infringe upon the legitimate rights and interests of other countries,”\n\nBy other countries. We don’t like competition.",
                "This deal is literally fucking stupid. It doesn’t even give the US control over the canal like Trump and MEGA claim it does. All it does is give BlackRock majority ownership of the ports AROUND the canal. Ports that have no way of controlling who actually goes in and out. \n\nThis might as well encourage China to build its own canal further up.",
                "\"We oppose the use of...\" (by anyone but us!).",
                "You gotta love the galling hypocrisy.",
                "Ironic given China’s Belt and Road initiatives throughout many struggling 3rd world countries, who when they default on their loans, have to cede ownership of their infrastructure to China.",
                "Meanwhile, the Chinese are expanding the Karakoram Highway into the China-Pakistan Economic Corridor.",
                "This is Trump rewarding his donors, like they needed it."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 15686,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "Navajo Code Talkers disappear from military websites after Trump DEI order",
            "external_url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii",
            "upvotes": 10588,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it me or is this the most insecure shit you’ve ever seen?",
                "Isn't this the same party that cries about \"erasing history\" when a community tries to remove Confederate monuments?",
                "This is so fucked up. These are the worst people doing the worst things to America.",
                "What a colossal waste of time and tax payer's money Hegseth\n\nYou know we're going to put it all back when you're gone you dickhead",
                "There not removing DEI related topics. They're removing any mention of women or minority achievements, regardless of how they were actually earned. \n\nThis is straight up racism. Full stop. There is no other explanation.",
                "https://en.m.wikipedia.org/wiki/Choctaw_code_talkers\n\nI'm the great grandson of Solomon Bond Louis\n\nMy family has always served in some unit of the military until my generation where they sat us down and warned us in 2002 that things have changed. Considering most are Vietnam vets in the Marines it made sense. Also my dad constantly reminded me as a kid that if his CO hadn't give him the leave to get married to my mom who also served(higher rank as well) he would of been in Beirut when it was bombed. \n\nAll I can say is this is fucking crazy, I'm genuinely lost for words at this point",
                "My grandfather was a lifelong Republican who spent decades working in the Bureau of Indian Affairs and Bureau of Land Management, serving many Navajo communities and other tribes in the Southwest US, continuing to field calls well after his retirement. Here they are undermining his life's work, the communities he and these agencies served, and utterly besmirching one of the most important, selfless, and **undeserving** contributions to our country by a community of its people.\n\nLike many people, I felt pretty hollow after the election, and for my own sanity decided to step back from political efforts. \"Americans voted for this, let them reap what they sow.\" I cannot in good conscience, maintaining civility and patience, just watch our country steer into a landslide intent on corrupting and twisting what we built. It is controversial, problematic, but nonetheless hard-earned history that we built together.\n\nI choose to resist in any way I can, so that my children may have a future and that the legacy of people who chose to serve our country will cease its diminishment and thrive. I hope you join me in the protests and whatever else is to come.",
                "Whitewashing of America. Another stupid effing order.",
                "Never forget victory in WWII could not have happened, (at least not as \"quickly\") without a gay man, named Alan Turing, and the Navajo code talkers.\n\nBreaking enigma combined with our own code that couldn't be deciphered were instrumental.\n\nIf the government in the 1890s had succeeded in destroying native languages and culture through ethnic cleansing and residential schools enforcing Eurocentrism, it's likely we wouldn't have had the code talkers during World War II.\n\nThe attempt by the government to completely excise native culture and the role the code talkers played are the basic cliffnotes primer anyone needs to demonstrate why racism is truly a shitty concept.\n\nThis neo McCarthyism \"war on woke/anti DEIA bullshit needs to stop, but I guess people who are ignorant of our history never learned what was actually valuable from the past they are trying to destroy",
                "DEI is just a racist and bigoted dog whistle to use on anyone who isn't a cishet, white, straight male.   \n  \nAbsolutely abhorrent. How the hell is it even DEI for NAVAJO people to use NAVAJO language to help win a war for their country? \n\nTuskegee airmen and women. The Enola Gay. Army Maj. Gen. Charles Calvin Rogers. Adm. Lisa Franchetti. Chairman, Gen. CQ Brown Jr. 14000+ active military folks being ousted because they are trans.\n\n9 million+ Veterans affected by DEI and policy change EO's...\n\nWhy the hell would ANYONE want to join the Forces now? \n\nThis shit is so wrong."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 52084,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 5216,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "He flew so the world may be free rip",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "I remember growing up all the WW2 vets I knew. All gone now. I even knew a neighbor who told me he was in a glider when I was a teen. I never knew before about the gliders. It was amazing to learn firsthand from him.",
                "Thank you.\nYou will live on in my heart and head forever"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Israel launches waves of strikes on Gaza with more than 400 reportedly killed",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy3k4dpz0o",
            "upvotes": 406,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/126c/live/44092310-0411-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "I thought the January ceasefire fixed everything and it was all thanks to Trump?",
                "400 is not a small amount. That’s crazy.",
                "I don't see Israel pausing the killings especially with Trump supporting him.\n\nI can only hope that someday, Netanyahu will be held accountable.",
                "Trump will soon authorize direct US military strikes against Gaza.",
                "This is a lot of souls taken… for what?",
                "Israel really cannot control their endless bloodlust. The US is just as guilty in this evil.",
                "400 is not a small number in this context. I mean, good lord.\n\nAnd the worst part is that this is unlikely to be the only incident going forward with the ceasefire effectively in tatters.",
                "God help these people. These zionists are evil incarnate. ",
                "Genocide is back on I guess.",
                "\nThe conflict fundamentally stems from irreconcilable strategic objectives between the two sides. Hamas’s primary goal is to maintain its power in Gaza, whether through direct governmental authority or as a Hezbollah-style paramilitary organization with sufficient military capacity to influence governance decisions. Conversely, Israel is fundamentally committed to preventing this outcome. Until either party demonstrates willingness to compromise on these core positions, the conflict will persist—with tragic consequences for the civilian populations caught in between. Unfortunately, at present, neither side appears prepared to make the necessary concessions.​​​​​​​​​​​​​​​​"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Israeli strikes across Gaza kill more than 400 and shatter ceasefire with Hamas",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-18-2025-0df87331efc6a7b1dfd99275f52868a5",
            "upvotes": 69,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So ceasefire lasted about 2 months?",
                "But Trump went to Dearborn and said he would stop this.",
                "From AP News:\n\n>Israel launched airstrikes across the Gaza Strip early Tuesday, killing more than 400 Palestinians, local health officials said, and shattering a ceasefire in place since January with its deadliest bombardment in a 17-month war with Hamas.\n\n>Prime Minister Benjamin Netanyahu ordered the strikes, which killed mostly women and children, after Hamas refused Israeli demands to change the ceasefire agreement. Officials said the operation was open-ended and expected to expand. The White House said it had been consulted and voiced support for Israel’s actions.\n\n>The Israeli military ordered people to evacuate eastern Gaza and head toward the center of the territory, indicating that Israel could soon launch renewed ground operations. The new campaign comes as aid groups warn supplies are running out two weeks after Israel cut off all food, medicine, fuel and other goods to Gaza’s 2 million Palestinians.\n\n>[…]\n\n>Gaza’s Health Ministry said the strikes killed at least 404 people and wounded more than 560. Zaher al-Waheidi, head of the ministry’s records department, said at least 263 of those killed were women or children under 18. He described it as the deadliest day in Gaza since the start of the war.",
                "Are we great again yet?",
                "This is genuinely so heartbreaking. What did all those people do to deserve this suffering.",
                "Hamas violates all terms of ceasefire\n\nIsrael try’s to renegotiate\n\nAP quotes Hamas propaganda saying the strikes were mostly women and children\n\n🤡",
                "the \"local health officials\" are the hamas \"health ministry\"....\n\ndidn't know terrorists had health ministrys....",
                "The resumption of war was inevitable. Hamas offered no possibility of progress on the hostage situation. It stalled endlessly which is the reason the ceasefire collapsed. The whining about genocide and innocent civilians can now start all over but  hamas could surrender and release the hostages and the war would be over. The palestinians must rise up against Hamas. Eventually, it must be destroyed for the sake of both Israëli’s and the people in Gaza.",
                "Trump and bibi are war criminals\n\nBut anyone who supports leaving hamas in charge, SUPPORTS the eradication of Palestinians, as hamas hates Palestinians much as Israelis \n\nAs both a Palestinian state and the state of Israel, stand in the way of their Islamic theocracy"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Two people charged in connection to deadly crash in Leland",
            "external_url": "https://www.wect.com/2025/03/17/deputy-charged-issued-citation-deadly-crash-leland/",
            "upvotes": 12,
            "date": "03/18/2025",
            "thumbnail": "https://gray-wect-prod.gtv-cdn.com/resizer/v2/2AMNLDJWFJAUFMO25ZJM5DKBRE.png?auth=a2291dae6662b162904ca9a9f1ffe352697e6a6035dcca8a7090511087935610&width=1200&height=600&smart=true",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cop dies when police car split in 2 by light pole while in pursuit of suspect during chase",
            "external_url": "https://abcnews.go.com/US/cop-dies-police-car-split-2-light-pole/story?id=119900970",
            "upvotes": 983,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f1a3e680-5b5d-4978-864c-6fe7523d2a07/Cuevas_1742282458142_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "Just fucking say he crashed into a light pole, what the fuck.",
                "Alright this has to be the silliest use of passive voice ever.\n\n“Cop dies in highspeed chase after hitting bystander’s car, light pole.”",
                "pictures of the car in this article  \n[https://www.vvng.com/authorities-identify-deputy-killed-in-victorville-crash-as-hector-cuevas-jr/](https://www.vvng.com/authorities-identify-deputy-killed-in-victorville-crash-as-hector-cuevas-jr/)",
                "I also died trying to read the headline.",
                "Passive voice is the real killer.",
                "\"cop loses control of vehicle at high speed, dies\"",
                "Is that the light pole’s fault?",
                "Police car pursuits are dumb and should be illegal example number: 11,239",
                "And the article says nothing about the girl he sent to the hospital",
                "Maintain distance, and call for backup."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Judge questions Trump administration on whether it ignored order to turn around deportation flights",
            "external_url": "https://apnews.com/article/aclu-trump-deportations-el-salvador-boasberg-e447c61de031150669d01687edc4b11b",
            "upvotes": 68,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They absolutely did ignore the order but in Putin style the Trump\nadministration sent a message that they don’t care.",
                "What's the point of these judges if they're not going to enforce their ruling once it's broken? Trump is not going to magically do the right thing, get off your asses and do something about it.",
                "Time to fire these judges."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Some 80,000 pages of JFK files will be released Tuesday, Trump says",
            "external_url": "https://www.reuters.com/world/us/around-80000-pages-jfk-files-will-be-released-tuesday-trump-says-2025-03-17/",
            "upvotes": 56,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The ultimate anti-climax.\n60 years of movies and books with wild theories and the files are going to conclude that there was nothing more than the initial \"one shooter\" Oswald case concluded with. \nNext lets do Area 51. Same outcome. \n\n\nThe Epstein files however.... Trump is going to make sure those don't see the light of day:-)",
                "He’s said this before in his last term. It’s a distraction and the media and his sheep will follow.",
                "That just means something bad is going to happen on Tuesday and he doesn't want anybody to know",
                "These distractions are gonna have to get A LOT crazier to remain effective.",
                "I’m sure it’ll be just as meaningful as the Epstein drop.",
                "Ok good. I'm not the only one that immediately thought this was a distraction from something he's either doing or about to do. I'm sure the very easily distracted far right WILL find this very interesting if they actually release it.",
                "Just look at his honest immediate response when asked if he would release the Epstein files when he wasn't expecting it. Everything you need to know about his involvement with Epstein.",
                "Finally I can learn the truth about Ted Cruz’s father 🙄",
                "It doesn’t matter. The people that think it was a conspiracy won’t be convinced otherwise by any file that could be released.",
                "Who cares? How is this helpful in any way"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "DOGE gains access to US Institute of Peace after Trump administration overhauls board",
            "external_url": "https://www.cnn.com/2025/03/17/politics/doge-us-institute-of-peace-trump-administration-overhaul-board/index.html",
            "upvotes": 85,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200900407.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Trump wants to make Canada his Ukraine. This won't end well...",
                "CNN says \"overhauls board\". You meant to say \"fired\", CNN. Go home; you're ~~drunk~~ complicit."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "White House removes advisory defining gun violence as a public health issue | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/trump-removes-gun-violence-public-health-advisory",
            "upvotes": 375,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2879d79b395b469d0eb4548c3f8925412f0696e/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=620847e8f76fd103f33ae734f747d6b8",
            "top_comments": [
                "Please be reminded:\n\nIt's not that this is no longer a public health issue. It remains the *leading cause of death* in children and teens, ages 1 - 17.\n\nIt's just that they are removing it. They are *erasing facts.*\n\nJohns Hopkins:\nhttps://publichealth.jhu.edu/2024/guns-remain-leading-cause-of-death-for-children-and-teens",
                "Which is crazy considering homie was shot at a few months ago",
                "Guns don’t kill people, bad public health policies do",
                "This very smart. Proclaiming that something isn't a problem definitely makes the problem go away. Gun violence solved!!!",
                "They can change or remove definitions of whatever they want...it doesn't change the facts surrounding those things.  Gun violence IS a public health issue, not only the deaths caused by guns, but the lack of mental health support in this country as well",
                "Gun violence is good for public health now",
                "So keep pissing off your highly armed volatile citizens while also turning a blind eye to the fact we have more Guns in this country then citizens and then think somehow your going to stay in power, it's like they are literally planning on having zero resistance to anything they do.",
                "remember,\n\n# Guns don't kill people, people kill people\n\n/s\n\nor not /s, they actually said this",
                "Sign in the Oval Office- \"Own the libs, stupid!\"",
                "Momma always tole me its not an isshoo if im dead"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Cross-border trips to the U.S. reach COVID lows with nearly 500,000 fewer travellers in February",
            "external_url": "https://www.cbc.ca/news/politics/cross-border-trips-decline-235k-february-1.7485695",
            "upvotes": 63,
            "date": "03/18/2025",
            "thumbnail": "https://i.cbc.ca/1.7485726.1742253059!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/cda-border-20250313.JPG?im=Resize%3D620",
            "top_comments": [
                "If I was one of our neighbors, I wouldn’t come here either. The Trump admin is openly and unnecessarily hostile towards them.",
                "I live less than a hundred miles to the border and I will never ever enter the United States again",
                "When all of our problems are still there after no one travels to the US, that is when the atrocities will start in earnest.",
                "Fascism 101- give bad news, tell them it's good news",
                "All by design. Truly hurling toward a fascist technocracy. Close us off from the world and keep their boots on our necks.",
                "We can make that number lower",
                "If you don't like that, you don't irrationally hate the world!",
                "People will say that’s 500,000 fewer illegals and will “Yaaay!” themselves"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "'Segregated facilities' are no longer explicitly banned in federal contracts",
            "external_url": "https://www.npr.org/sections/shots-health-news/2025/03/18/nx-s1-5326118/segregation-federal-contracts-far-regulation-trump",
            "upvotes": 264,
            "date": "03/18/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5300x2981+0+263/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff5%2F79%2Fffb84f95492b81dfdd921dbf1929%2Fgettyimages-77558656.jpg",
            "top_comments": [
                "Is this “Great Again”?🤦🏻‍♂️",
                "McKinley, Gulf of America, so much winning",
                "What the hell is wrong with America? Is this a second Civil War that is being fought and the absolute worst kind of ideology is being resurrected? I have no words to describe the wanton destruction of the American constitution. Absolute anarchy. ",
                "I'd like to say this sort of thing isn't needed anymore, but just look at what happened after they said the Voting Rights Act had served its purpose. All kinds of laws aimed at diluting the black vote started going into effect.",
                "The \"Good 'ol Days\" they want to bring us back to.",
                "TBH, it seems like this language was redundant because there are plenty of other laws that cover the same thing. \n\nEven if there wasn't, no contractor in 2025 is going to be maintaining \"separate but equal\" facilities based on cost alone.",
                "This looks real,but only Congress can change the law and rules of Federal government procurement rules and procedures.",
                "Tennessee lawmakers will be the first to bring back segregated facilities"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Alphabet to buy cybersecurity startup Wiz for $32 billion",
            "external_url": "https://apnews.com/article/google-alphabet-wiz-32-billion-e50fb41b9a84a1056a116f963e6efed0",
            "upvotes": 349,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "32 billion for a start up?",
                "That's if it doesn't get rejected blocked by the DoJ/FTC and UK/EU commisions.",
                "I used their software briefly for POC. It's pretty amazing really. Unfortunately it was to expensive for us.",
                "So this is still going on, I really need to get my start up going! Haha",
                "The same Wiz that makes the smart lightbulbs?",
                "That's the most anyone has ever paid just to take a Wiz.",
                "From zero to 32 billion in five years. All in cash…",
                "Antitrust laws really don't exist in this country and never have lol",
                "Google execs right now: https://youtu.be/pRf_A07Elyw?si=tp5_MIXxjkHfm4zW",
                "The deeper Google goes into 🇮🇱, the faster it will have its downfall "
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Tesla board members, executive sell off over $100 million of stock in recent weeks",
            "external_url": "https://abcnews.go.com/Business/tesla-board-members-executive-sell-off-100-million/story?id=119889047&cid=social_twitter_abcn",
            "upvotes": 23452,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7d0ebdc0-95a7-4b1b-9b06-180791a83c1f/tesla-charging-station-gty-jt-250314_1741978782881_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "JP Morgan recently downgraded TSLA stock to $120/share. Elon is going to get a margin call.",
                "The fact investors thought Tesla was worth more than every established auto manufacturer combined was just stupid. Please tell me how Tesla was worth more than Toyota, Honda, Ford and VW combined.  Not to mention all the other major brands…",
                "Ah so that’s why Elon made Donald sell Teslas on the White House lawn",
                "Im sure daddy Trump will help bail musk out when this all crashes.",
                "If I had that stock I'd probably be selling too before it's worthless.",
                "If you look into insider sales you will see that no insider has bought a singular share, they only have sold",
                "Weeks? They havent bought a share in over a year.. The execs have sold 750k shares in that same time period.\n\n[https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity](https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity)",
                "That bubble gonna burst.",
                "What’s amazing to me, reading the article, is how divorced some of the rank and file investors are from reality. Talking in the article about how he should “focus less on government spending and more on running his car company” is such a laughable position. \n\nHe doesn’t do anything. How do people not realize this. He was a figurehead with money. ",
                "Good. Get fucked, Elon."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Drake's record label files motion to dismiss his lawsuit over Kendrick Lamar's 'Not Like Us'",
            "external_url": "https://www.nbcnews.com/pop-culture/pop-culture-news/universal-music-group-response-drake-lawsuit-kendrick-lamar-diss-track-rcna196788",
            "upvotes": 2036,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250317-drake-kendrick-lamar-se-349p-c7852c.jpg",
            "top_comments": [
                "And somewhere J Cole is just living his best life.",
                "Drake really asked lawyers to proofread his lyrics for validity. \n\nAnd to nobody's surprise, they found them to be fraudulent and petty, and now its documented for all time in legal form.\n\nLet the record show that Drake is officially a fake gangster who makes shit up about people and lost a rap battle that he provoked.",
                "> The filing comes after a yearlong prolific diss track battle between Drake and Lamar, who spent much of 2024 dropping a slew of tracks aimed at each other. But many fans declared Lamar as the winner of the feud, with “Not Like Us” becoming the bestselling rap recording of 2024. The artist swept this year’s Grammy Awards, taking home five wins, including song of the year and record of the year. Lamar’s momentum continued as he performed at the Super Bowl halftime show in February, where the crowd loudly sang along as he performed “Not Like Us.”  \n\n**TL;DR:** Drake threw the first punch, Kendrick won Grammys, dropped the biggest hit of 2024, and took over the Super Bowl.",
                "This headline seems like it's confusing some people in this thread. For clarification, Drake's record label is the one being sued here. Them asking for the lawsuit to be dismissed isn't the same as Drake dropping the lawsuit.",
                "So now we can say that Kendrick legally won the rap war?",
                "If you told me Kendrick was helping out UMG's legal team to write this I wouldn't question it because it was a thorough slapping of Drake's face flipping his own words, calling to question his Drake persona and cooking him in the footnotes.",
                "Sounds like someone ended up not wanting to go through discovery.",
                "I heard his real name is Clarence.",
                "I’m sure the calm and collected folks of r/Drizzy are taking this very rationally",
                "No one in the comments read the article or understands who is being sued by whom."
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "RISING",
            "title": "Cop dies when police car split in 2 by light pole while in pursuit of suspect during chase",
            "external_url": "https://abcnews.go.com/US/cop-dies-police-car-split-2-light-pole/story?id=119900970",
            "upvotes": 986,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f1a3e680-5b5d-4978-864c-6fe7523d2a07/Cuevas_1742282458142_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "Just fucking say he crashed into a light pole, what the fuck.",
                "Alright this has to be the silliest use of passive voice ever.\n\n“Cop dies in highspeed chase after hitting bystander’s car, light pole.”",
                "pictures of the car in this article  \n[https://www.vvng.com/authorities-identify-deputy-killed-in-victorville-crash-as-hector-cuevas-jr/](https://www.vvng.com/authorities-identify-deputy-killed-in-victorville-crash-as-hector-cuevas-jr/)",
                "I also died trying to read the headline.",
                "Passive voice is the real killer.",
                "\"cop loses control of vehicle at high speed, dies\"",
                "Is that the light pole’s fault?",
                "Police car pursuits are dumb and should be illegal example number: 11,239",
                "And the article says nothing about the girl he sent to the hospital",
                "Maintain distance, and call for backup."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 17864,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "The reason people with a brain do not do this is they realize their own children are going to need the very same protection. Jesus how did so many people vote for one of the dumbest fuckers on the planet.",
                "I've never seen a more insecure man than Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "Biden specifically EXTENDED protections for Trump's adult kids from six months to one year when he became president.  Trump is just being his typically petty bitch ass self.",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Good thing Democrats won't fight dirty because they want to be civil and prevent exactly the retaliatory things that are happening every day"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "China says Panama ports sale to BlackRock is an example of ‘economic coercion.’ Investors are spooked",
            "external_url": "https://edition.cnn.com/2025/03/18/business/hong-kong-ck-hutchison-panama-ports-sale-hnk-intl/index.html?utm_source=business_ribbon",
            "upvotes": 1461,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2201491120.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And the ironic part is that BlackRock is still one of the most Chinese friendly US investment firms.",
                "So does this mean the US will stop passive aggressively declaring war on Panama?",
                "This article made me wonder: why does Blackrock even need partners for a 22b sale? They manage assets worth over 10 trillion dollars. It’s less than 0.2% of their managed assets to just purchase it on their own. So why even partner up?",
                "> “I would like to emphasize that China has always firmly opposed the use of economic coercion, hegemonism and bullying to infringe upon the legitimate rights and interests of other countries,”\n\nBy other countries. We don’t like competition.",
                "This deal is literally fucking stupid. It doesn’t even give the US control over the canal like Trump and MEGA claim it does. All it does is give BlackRock majority ownership of the ports AROUND the canal. Ports that have no way of controlling who actually goes in and out. \n\nThis might as well encourage China to build its own canal further up.",
                "\"We oppose the use of...\" (by anyone but us!).",
                "You gotta love the galling hypocrisy.",
                "Ironic given China’s Belt and Road initiatives throughout many struggling 3rd world countries, who when they default on their loans, have to cede ownership of their infrastructure to China.",
                "Meanwhile, the Chinese are expanding the Karakoram Highway into the China-Pakistan Economic Corridor.",
                "This is Trump rewarding his donors, like they needed it."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 15673,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Navajo Code Talkers disappear from military websites after Trump DEI order",
            "external_url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii",
            "upvotes": 10592,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it me or is this the most insecure shit you’ve ever seen?",
                "Isn't this the same party that cries about \"erasing history\" when a community tries to remove Confederate monuments?",
                "This is so fucked up. These are the worst people doing the worst things to America.",
                "What a colossal waste of time and tax payer's money Hegseth\n\nYou know we're going to put it all back when you're gone you dickhead",
                "There not removing DEI related topics. They're removing any mention of women or minority achievements, regardless of how they were actually earned. \n\nThis is straight up racism. Full stop. There is no other explanation.",
                "https://en.m.wikipedia.org/wiki/Choctaw_code_talkers\n\nI'm the great grandson of Solomon Bond Louis\n\nMy family has always served in some unit of the military until my generation where they sat us down and warned us in 2002 that things have changed. Considering most are Vietnam vets in the Marines it made sense. Also my dad constantly reminded me as a kid that if his CO hadn't give him the leave to get married to my mom who also served(higher rank as well) he would of been in Beirut when it was bombed. \n\nAll I can say is this is fucking crazy, I'm genuinely lost for words at this point",
                "My grandfather was a lifelong Republican who spent decades working in the Bureau of Indian Affairs and Bureau of Land Management, serving many Navajo communities and other tribes in the Southwest US, continuing to field calls well after his retirement. Here they are undermining his life's work, the communities he and these agencies served, and utterly besmirching one of the most important, selfless, and **undeserving** contributions to our country by a community of its people.\n\nLike many people, I felt pretty hollow after the election, and for my own sanity decided to step back from political efforts. \"Americans voted for this, let them reap what they sow.\" I cannot in good conscience, maintaining civility and patience, just watch our country steer into a landslide intent on corrupting and twisting what we built. It is controversial, problematic, but nonetheless hard-earned history that we built together.\n\nI choose to resist in any way I can, so that my children may have a future and that the legacy of people who chose to serve our country will cease its diminishment and thrive. I hope you join me in the protests and whatever else is to come.",
                "Whitewashing of America. Another stupid effing order.",
                "Never forget victory in WWII could not have happened, (at least not as \"quickly\") without a gay man, named Alan Turing, and the Navajo code talkers.\n\nBreaking enigma combined with our own code that couldn't be deciphered were instrumental.\n\nIf the government in the 1890s had succeeded in destroying native languages and culture through ethnic cleansing and residential schools enforcing Eurocentrism, it's likely we wouldn't have had the code talkers during World War II.\n\nThe attempt by the government to completely excise native culture and the role the code talkers played are the basic cliffnotes primer anyone needs to demonstrate why racism is truly a shitty concept.\n\nThis neo McCarthyism \"war on woke/anti DEIA bullshit needs to stop, but I guess people who are ignorant of our history never learned what was actually valuable from the past they are trying to destroy",
                "DEI is just a racist and bigoted dog whistle to use on anyone who isn't a cishet, white, straight male.   \n  \nAbsolutely abhorrent. How the hell is it even DEI for NAVAJO people to use NAVAJO language to help win a war for their country? \n\nTuskegee airmen and women. The Enola Gay. Army Maj. Gen. Charles Calvin Rogers. Adm. Lisa Franchetti. Chairman, Gen. CQ Brown Jr. 14000+ active military folks being ousted because they are trans.\n\n9 million+ Veterans affected by DEI and policy change EO's...\n\nWhy the hell would ANYONE want to join the Forces now? \n\nThis shit is so wrong."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 52089,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 5222,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "He flew so the world may be free rip",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "I remember growing up all the WW2 vets I knew. All gone now. I even knew a neighbor who told me he was in a glider when I was a teen. I never knew before about the gliders. It was amazing to learn firsthand from him.",
                "Thank you.\nYou will live on in my heart and head forever"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Israel launches waves of strikes on Gaza with more than 400 reportedly killed",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy3k4dpz0o",
            "upvotes": 404,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/126c/live/44092310-0411-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "I thought the January ceasefire fixed everything and it was all thanks to Trump?",
                "400 is not a small amount. That’s crazy.",
                "I don't see Israel pausing the killings especially with Trump supporting him.\n\nI can only hope that someday, Netanyahu will be held accountable.",
                "Trump will soon authorize direct US military strikes against Gaza.",
                "This is a lot of souls taken… for what?",
                "Israel really cannot control their endless bloodlust. The US is just as guilty in this evil.",
                "400 is not a small number in this context. I mean, good lord.\n\nAnd the worst part is that this is unlikely to be the only incident going forward with the ceasefire effectively in tatters.",
                "God help these people. These zionists are evil incarnate. ",
                "Genocide is back on I guess.",
                "\nThe conflict fundamentally stems from irreconcilable strategic objectives between the two sides. Hamas’s primary goal is to maintain its power in Gaza, whether through direct governmental authority or as a Hezbollah-style paramilitary organization with sufficient military capacity to influence governance decisions. Conversely, Israel is fundamentally committed to preventing this outcome. Until either party demonstrates willingness to compromise on these core positions, the conflict will persist—with tragic consequences for the civilian populations caught in between. Unfortunately, at present, neither side appears prepared to make the necessary concessions.​​​​​​​​​​​​​​​​"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/18/2025 16:10:48 UTC"
}