{
    "posts": [
        {
            "category": "HOT",
            "title": "A Cybertruck Owner Says Tesla Reset His Odometer to Zero Following a Service Visit – Adds “I Bought My Cybertruck 5 Months Ago & I’ve Already Driven It 26,000 Miles”",
            "external_url": "https://www.torquenews.com/11826/cybertruck-owner-says-tesla-reset-his-odometer-zero-following-service-visit-adds-i-bought-my#comment-186461",
            "upvotes": 2173,
            "date": "05/13/2025",
            "thumbnail": "https://www.torquenews.com/sites/default/files/styles/amp_1200x675_16_9/public/images/Tesla%20Cybertruck%20road_0.jpg?itok=Iow10kCt",
            "top_comments": [
                "Just throwing this out there, but this is straight up fraud right?",
                "They roll back odometers?  Sounds like a place a shady salesman in a houndstooth coat would work.  Isn't rolling back odometers illegal?",
                "Soooo he gets an extra long warrantee?",
                "Nobody fucks over the musk cult quite like Elmo himself",
                "Among all of the horrible things Elon Musk is, I didn't have \"Danny Devito in Matilda\" on my bingo card.",
                "The fact that a reset or a rate change can even happen, accidentally or otherwise should by law be impossible or made infeasible by design.\n\nThough, after a search & seeing plenty of law that covers tampering & requirements for replacement or reset, I cannot find a law that covers design requirements.",
                "Don't you dare report it or you'll be driven to El Salvador. In a Cybertruck 💀",
                "I didn't even know dumpsters had odometers.",
                "All odometers should be mechanical.",
                "HAHAHAHAHA, just days after Musk disclaims accusations of odometer manipulation by Tesla, one of his own beloved Cybertrucks **betrays** him. That dumb fuck is so responsible for all of his own suffering. It's legit astonishing that he is so allergic to learning from his past mistakes. He deserves everything bad that could ever possibly happen to him."
            ],
            "aggregate_sentiment": 75.0
        },
        {
            "category": "HOT",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 4863,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "*. We’re going to be working on the fundamentals of wrestling, proper stance, proper head position, how to hand fight and dominate your opponent,” Snyder says in a video.   “And we’re also going to be talking about the Lord Jesus. That’s the most important thing, how he’s going to change our life, bring us closer to him. Looking forward to seeing you guys. God bless*.”\n\nSnyder also holds a summer camp at Messiah University The Sting came up with 16 men, one of which, celeb Snyder, was the more important in pushing the message than all the others.",
                "Thank goodness this dangerous criminal is off the streets. It would have been nice if the police could have spent the time and effort put into this operation catching thieves and killers, but I guess you can't have everything."
            ],
            "aggregate_sentiment": 24.0
        },
        {
            "category": "HOT",
            "title": "Episcopal Church refuses to resettle white Afrikaners, citing moral opposition",
            "external_url": "https://www.npr.org/2025/05/12/g-s1-65988/episcopal-church-white-afrikaners-ends-partnership-u-s-government",
            "upvotes": 4134,
            "date": "05/12/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F34%2F1b1627bb47cabd2e3be01911d780%2Fap25079502278892.jpg",
            "top_comments": [
                "It is refreshing to see some Christians actually following their faith.",
                "Last week I'm agreeing with a Pope and this week I'm with an Episcopal church.  Weird couple of weeks as an atheist.",
                "It's outrageous our tax dollars were spent to bring these people here.  What a waste of resources.",
                "Trump isn't hiding who and what he is.",
                "Episcopalians do what Republicans can't.",
                "> Q: There are many people who fit the criteria of fleeing persecution. Afghans for example. But they're being denied refugee status. So why such an exception for the Afrikaners?\n\n> TRUMP ADMIN OFFICIAL: One of the criteria is making sure they can be assimilated easily into our country\n\nIt’s just racism. That’s it. \n\nSource: https://bsky.app/profile/atrupar.com/post/3loym4e3uts23",
                "Bringing white south afrikaners here is just trump DEI policies benefiting people who historically benefited from racism, and largely still do.\nAnd don't the white people in South Africa still own the majority of the land in South Africa? Land they stole from the ancestors the people that the trump administration is trying to paint as viEurope.\n\n MAYBE the European South afrikaners should go back to europe.",
                "As a DEI citizen, glad to see someone in this country has some integrity",
                "The Episcopal Church is not a part of the evangelical wing of Christian denominations. They are on the progress side and emphasizes helping the needy and bringing people together to do good. I have a friend who's a priest in the church and as an atheist I respect her work very much.",
                "I think I might like the Episcopalians."
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "HOT",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 9555,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FYI, the other state is North Dakota",
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "We don't need to be giving giant companies shields like that. We also don't need a jury deciding what causes cancer when the scientific results aren't there.",
                "Bayer is the beneficiary. Bayer is not a farmer. \n\n> The new law “demonstrates that Georgia stands with its farmers, who work tirelessly to produce safe and affordable food,” said Brian Naber, president of Bayer’s crop sciences in North America, Australia and New Zealand.",
                "Georgia is also the state where prosecutors have absolute immunity. If they lie or break the law to convict you, they face no consequences whatsoever and cannot be sued for their misconduct. I feel terrible for people stuck there with MTG",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "Why is everybody freaking out over unsubstantiated dubious cancer claims rather than the widespread ecosystem damage that's well known and understood? Like if you're going to hate it please learn to hate it for the right reasons.",
                "Save corporations from responsibility.",
                "I have been reading studies on this.  Humans don't have the chemical pathway to be directly poisoned by glycophate, however these studies seem to indicate that glycophate does directly kill much of the microflora in the intestines disrupting many of the metabolic functions in the gut.  This in turn has links to forms of cancer and autoimmune diseases.\n\nMedicine has barely touched on microbiome research, but I'm betting this is the source of the issue.  There are low doses of glycophate throughout much of our food supply.\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC4047521/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9145961/\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S1382668923000911\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9321451/",
                "Georgia becomes second state to give Monsanto immunity."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "HOT",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 1100,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "just outlaw thinking and get it over with. ",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some dude lost to a woman in chess, huh",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that.",
                "What’s not banned at this point?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Trump calls for broad drug price cuts in executive order",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-says-he-will-cut-drug-prices-by-59-2025-05-12/",
            "upvotes": 4354,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "“White House officials said the government will give drugmakers price targets in the next 30 days, and will take further action to lower prices if those companies do not make \"significant progress\" towards those goals within six months of the order being signed”\n\nPer usual, there is always some future date. Always a delay. Nothing will happen",
                "And then the drug manufacturers will raise their prices again.",
                "After he just got rid of Biden’s work to lower prices?\n\nIt never ends with this twat",
                "He did the same thing in his first term then never followed up on it. He also removed a Biden-era law that restricted insulin prices to $30, so he literally raised prices and is now acting like he’s saving us by lowering them back to Biden-era prices",
                "Didn’t he claim he was going to do this his first term too?",
                "He should tariff them at 125% then lower it to 10%, then declare it a “total reset” and success, and hope nobody notices it is 10% higher than before.",
                "Executive orders require money to come from the executive branch for them to be enforced.  If dummy says a thing and then doesn't fund it, then he did nothing.  Alas, his idiot cult members don't know shit, so they'll listen when he lies that big pharma isn't heeding his EO.",
                "Trump:  They will bring the prices down or I will add tariffs!\n\nDrug Co:  you mean we can raise prices more and blame the tariffs?  Count us in!",
                "“Man who turned off the overhead lights announces plan to light a candle soon.”"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Edan Alexander, U.S.-Israeli hostage, released after more than 19 months in captivity, Hamas says",
            "external_url": "https://www.cbsnews.com/news/edan-alexander-us-israeli-hostage-released-hamas-after-more-than-19-months-captivity/",
            "upvotes": 1948,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/12/9a3ce98b-616a-4de9-9f6d-156cdb148ce5/thumbnail/1200x630/0758355536b5340ff885c8019668d11f/gettyimages-2214166996.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "All it took to get a deal was Qatar gifting a plane to Trump.",
                "Man, comments are always so goddamn weird on threads like this. Astroturfing of all sorts along with a variety of genuine lunatics.",
                "i’m glad he’s going to get to see his family :)",
                "It's incredible any hostages are still alive. I dont even know where they are putting them. \n\nThis was a bit of good news to come out of Israel, so I thought I'd share it.\n\nHave an awesome day!",
                "[removed]",
                "This kids appearance is sure going to mess with some people’s narrative",
                "This article barely mentions that he's an active duty IDF soldier. The headline and photo make it seem like he's a teenage American tourist or something. ",
                "Good to see. He’s the one Corey Booker had a pin on for.",
                "I need a therapist to even think about this guy surviving the ordeal he has been through.",
                "[deleted]"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "HOT",
            "title": "Tory Lanez, in prison for Megan Thee Stallion shooting, hospitalized after attack by fellow inmate",
            "external_url": "https://abcnews.go.com/US/tory-lanez-prison-megan-thee-stallion-shooting-hospitalized/story?id=121729265",
            "upvotes": 631,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb558451-cf1b-4a98-98dd-73533d4b8e1e/tory-lanez-ap-jef-250512_1747070335627_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Ah, too bad. I bet that hurt. Kinda like getting shot.",
                "Article by Deena Zaru and Alex Stone\n\n>Tory Lanez was hospitalized on Monday after a fellow inmate at the California Correctional Institution in Tehachapi attacked the rapper at around 7:20 a.m. local time, a spokesperson for the prison told ABC News.\n\n>\"Staff immediately responded, activated 911 and began medical aid. Peterson was subsequently transported to an outside medical facility for further treatment,\" the spokesperson said.\n\n>The rapper, whose legal name is Daystar Peterson, is serving a [10-year prison sentence](https://abcnews.go.com/US/rapper-tory-lanez-set-sentenced-shooting-injuring-megan/story?id=102070344) for shooting and injuring fellow hip-hop star Megan Thee Stallion, whose legal name is Megan Pete, in July 2020.\n\n>The prison spokesperson did not provide further comment when asked about the nature of Peterson's injuries, whether he has been released from the hospital or whether a suspect has been charged in the attack.\n\n>Crystal Morgan, an attorney representing Peterson, confirmed to ABC News that the rapper was attacked at the correctional facility and said that as of Monday afternoon he remains hospitalized.\n\n>Morgan said she has not been able to obtain any information about his injuries or his condition and is \"in the dark\" like everyone else. Morgan added she called Peterson's family to notify them of the attack.\n\n>The prison's Investigative Services Unit and the Kern County District Attorney's Office launched a probe into the incident, while the Office of the Inspector General has been notified, the spokesperson said.\n\n>ABC News has reached out to the DA's office for additional comment.\n\n>Peterson [was found guilty](https://abcnews.go.com/US/verdict-reached-trial-rapper-tory-lanez-charged-shooting/story?id=95723751) on Dec. 23, 2022, of three charges for shooting and injuring Pete in both feet as they left a party in the Hollywood Hills on July 12, 2020.\n\n>He was initially charged in October 2020 with one felony count each of assault with a semi-automatic firearm (personal use of a firearm) and carrying a loaded, unregistered firearm in a vehicle, according to charging documents obtained by ABC News.\n\n>He was also charged ahead of his trial in December 2022 with an additional felony count of discharging a firearm with gross negligence. Lanez, who chose not to take the witness stand during the trial, pleaded not guilty to all three charges.\n\n>His defense attorneys argued during the trial that Lanez was not the shooter and he has maintained his innocence in multiple social media posts since his sentencing last year.\n\n>During his sentencing hearing, prosecutors read an impact statement from Pete -- who testified during the trial -- in which she called for Peterson to \"be forced to face the full consequences of his heinous actions and face justice.\"\n\n>\"He not only shot me, he made a mockery of my trauma. He tried to position himself as a victim and set out to destroy my character and my soul,\" Pete said in her impact statement.\n\n>Peterson was denied bond by a Los Angeles County Superior Court judge on Sept. 14, 2023, as his [legal team appeals his 10-year sentence](https://abcnews.go.com/US/tory-lanez-denied-bond-appeals-10-year-sentence/story?id=103185176).",
                "Let me play a song on the world’s smallest violin",
                "Actions have consequences. Sometimes those consequences come with a bunkmate named Karma.",
                "I will never understand how one minute you can be at a mansion party in the pool with Meg Thee Stallion and Kylie Jenner, and the next you're facing 10 years in prison for shooting at said ~~females~~ women. That's not how my night would've went, IJS.",
                "Kinda crazy to think I met this guy in Austin via a friend who’s a very close friend of Tory. \n\nI didn’t think he was that big.",
                "Finally some good news today!"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 18752,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "The Mouse is going to be angry!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 285,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "It’s Argentina I’m not surprised at all",
                "Anything Kanye can use?",
                "We have top men working on it right now.",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "Argentina is still pro Nazi .",
                "What’s in the boxes. That’s what I want to know.",
                "They did nazi that coming"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "A Cybertruck Owner Says Tesla Reset His Odometer to Zero Following a Service Visit – Adds “I Bought My Cybertruck 5 Months Ago & I’ve Already Driven It 26,000 Miles”",
            "external_url": "https://www.torquenews.com/11826/cybertruck-owner-says-tesla-reset-his-odometer-zero-following-service-visit-adds-i-bought-my#comment-186461",
            "upvotes": 2184,
            "date": "05/13/2025",
            "thumbnail": "https://www.torquenews.com/sites/default/files/styles/amp_1200x675_16_9/public/images/Tesla%20Cybertruck%20road_0.jpg?itok=Iow10kCt",
            "top_comments": [
                "Just throwing this out there, but this is straight up fraud right?",
                "They roll back odometers?  Sounds like a place a shady salesman in a houndstooth coat would work.  Isn't rolling back odometers illegal?",
                "Soooo he gets an extra long warrantee?",
                "Nobody fucks over the musk cult quite like Elmo himself",
                "Among all of the horrible things Elon Musk is, I didn't have \"Danny Devito in Matilda\" on my bingo card.",
                "The fact that a reset or a rate change can even happen, accidentally or otherwise should by law be impossible or made infeasible by design.\n\nThough, after a search & seeing plenty of law that covers tampering & requirements for replacement or reset, I cannot find a law that covers design requirements.",
                "Don't you dare report it or you'll be driven to El Salvador. In a Cybertruck 💀",
                "I didn't even know dumpsters had odometers.",
                "All odometers should be mechanical.",
                "HAHAHAHAHA, just days after Musk disclaims accusations of odometer manipulation by Tesla, one of his own beloved Cybertrucks **betrays** him. That dumb fuck is so responsible for all of his own suffering. It's legit astonishing that he is so allergic to learning from his past mistakes. He deserves everything bad that could ever possibly happen to him."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 129,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "You mean someone's paying them to work?",
                "The feds at any level will not save us. We will have to do it ourselves. Will we? Maybe, maybe not. Anyone who has a definitive answer is a liar, but the establishment that delivered us to these fascists will not save us."
            ],
            "aggregate_sentiment": 24.0
        },
        {
            "category": "NEW",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 284,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "It’s Argentina I’m not surprised at all",
                "Anything Kanye can use?",
                "We have top men working on it right now.",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "Argentina is still pro Nazi .",
                "What’s in the boxes. That’s what I want to know.",
                "They did nazi that coming"
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "NEW",
            "title": "Tory Lanez, in prison for Megan Thee Stallion shooting, hospitalized after attack by fellow inmate",
            "external_url": "https://abcnews.go.com/US/tory-lanez-prison-megan-thee-stallion-shooting-hospitalized/story?id=121729265",
            "upvotes": 626,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb558451-cf1b-4a98-98dd-73533d4b8e1e/tory-lanez-ap-jef-250512_1747070335627_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Ah, too bad. I bet that hurt. Kinda like getting shot.",
                "Article by Deena Zaru and Alex Stone\n\n>Tory Lanez was hospitalized on Monday after a fellow inmate at the California Correctional Institution in Tehachapi attacked the rapper at around 7:20 a.m. local time, a spokesperson for the prison told ABC News.\n\n>\"Staff immediately responded, activated 911 and began medical aid. Peterson was subsequently transported to an outside medical facility for further treatment,\" the spokesperson said.\n\n>The rapper, whose legal name is Daystar Peterson, is serving a [10-year prison sentence](https://abcnews.go.com/US/rapper-tory-lanez-set-sentenced-shooting-injuring-megan/story?id=102070344) for shooting and injuring fellow hip-hop star Megan Thee Stallion, whose legal name is Megan Pete, in July 2020.\n\n>The prison spokesperson did not provide further comment when asked about the nature of Peterson's injuries, whether he has been released from the hospital or whether a suspect has been charged in the attack.\n\n>Crystal Morgan, an attorney representing Peterson, confirmed to ABC News that the rapper was attacked at the correctional facility and said that as of Monday afternoon he remains hospitalized.\n\n>Morgan said she has not been able to obtain any information about his injuries or his condition and is \"in the dark\" like everyone else. Morgan added she called Peterson's family to notify them of the attack.\n\n>The prison's Investigative Services Unit and the Kern County District Attorney's Office launched a probe into the incident, while the Office of the Inspector General has been notified, the spokesperson said.\n\n>ABC News has reached out to the DA's office for additional comment.\n\n>Peterson [was found guilty](https://abcnews.go.com/US/verdict-reached-trial-rapper-tory-lanez-charged-shooting/story?id=95723751) on Dec. 23, 2022, of three charges for shooting and injuring Pete in both feet as they left a party in the Hollywood Hills on July 12, 2020.\n\n>He was initially charged in October 2020 with one felony count each of assault with a semi-automatic firearm (personal use of a firearm) and carrying a loaded, unregistered firearm in a vehicle, according to charging documents obtained by ABC News.\n\n>He was also charged ahead of his trial in December 2022 with an additional felony count of discharging a firearm with gross negligence. Lanez, who chose not to take the witness stand during the trial, pleaded not guilty to all three charges.\n\n>His defense attorneys argued during the trial that Lanez was not the shooter and he has maintained his innocence in multiple social media posts since his sentencing last year.\n\n>During his sentencing hearing, prosecutors read an impact statement from Pete -- who testified during the trial -- in which she called for Peterson to \"be forced to face the full consequences of his heinous actions and face justice.\"\n\n>\"He not only shot me, he made a mockery of my trauma. He tried to position himself as a victim and set out to destroy my character and my soul,\" Pete said in her impact statement.\n\n>Peterson was denied bond by a Los Angeles County Superior Court judge on Sept. 14, 2023, as his [legal team appeals his 10-year sentence](https://abcnews.go.com/US/tory-lanez-denied-bond-appeals-10-year-sentence/story?id=103185176).",
                "Let me play a song on the world’s smallest violin",
                "Actions have consequences. Sometimes those consequences come with a bunkmate named Karma.",
                "I will never understand how one minute you can be at a mansion party in the pool with Meg Thee Stallion and Kylie Jenner, and the next you're facing 10 years in prison for shooting at said ~~females~~ women. That's not how my night would've went, IJS.",
                "Kinda crazy to think I met this guy in Austin via a friend who’s a very close friend of Tory. \n\nI didn’t think he was that big.",
                "Finally some good news today!"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 1099,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "just outlaw thinking and get it over with. ",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some dude lost to a woman in chess, huh",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that.",
                "What’s not banned at this point?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Episcopal Church refuses to resettle white Afrikaners, citing moral opposition",
            "external_url": "https://www.npr.org/2025/05/12/g-s1-65988/episcopal-church-white-afrikaners-ends-partnership-u-s-government",
            "upvotes": 4130,
            "date": "05/12/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F34%2F1b1627bb47cabd2e3be01911d780%2Fap25079502278892.jpg",
            "top_comments": [
                "It is refreshing to see some Christians actually following their faith.",
                "Last week I'm agreeing with a Pope and this week I'm with an Episcopal church.  Weird couple of weeks as an atheist.",
                "It's outrageous our tax dollars were spent to bring these people here.  What a waste of resources.",
                "Trump isn't hiding who and what he is.",
                "Episcopalians do what Republicans can't.",
                "> Q: There are many people who fit the criteria of fleeing persecution. Afghans for example. But they're being denied refugee status. So why such an exception for the Afrikaners?\n\n> TRUMP ADMIN OFFICIAL: One of the criteria is making sure they can be assimilated easily into our country\n\nIt’s just racism. That’s it. \n\nSource: https://bsky.app/profile/atrupar.com/post/3loym4e3uts23",
                "Bringing white south afrikaners here is just trump DEI policies benefiting people who historically benefited from racism, and largely still do.\nAnd don't the white people in South Africa still own the majority of the land in South Africa? Land they stole from the ancestors the people that the trump administration is trying to paint as viEurope.\n\n MAYBE the European South afrikaners should go back to europe.",
                "As a DEI citizen, glad to see someone in this country has some integrity",
                "The Episcopal Church is not a part of the evangelical wing of Christian denominations. They are on the progress side and emphasizes helping the needy and bringing people together to do good. I have a friend who's a priest in the church and as an atheist I respect her work very much.",
                "I think I might like the Episcopalians."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 4865,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "*. We’re going to be working on the fundamentals of wrestling, proper stance, proper head position, how to hand fight and dominate your opponent,” Snyder says in a video.   “And we’re also going to be talking about the Lord Jesus. That’s the most important thing, how he’s going to change our life, bring us closer to him. Looking forward to seeing you guys. God bless*.”\n\nSnyder also holds a summer camp at Messiah University The Sting came up with 16 men, one of which, celeb Snyder, was the more important in pushing the message than all the others.",
                "Thank goodness this dangerous criminal is off the streets. It would have been nice if the police could have spent the time and effort put into this operation catching thieves and killers, but I guess you can't have everything."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Top UK Special Forces general oversaw blocking of Afghan 'war-crime' witnesses to Britain",
            "external_url": "https://www.bbc.com/news/articles/cp3q5xl9wqwo",
            "upvotes": 297,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/105f/live/08d6ac50-2cd8-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "\"...\n\nThousands of applications from individuals with credible evidence of service with Afghan Special Forces, including the units known as the Triples, were then rejected, leaving many of the former commandos at the mercy of the Taliban.\n\n...\n\nIf the Afghan commandos were in the UK, they could be called as witnesses - but the inquiry has no power to compel testimony from foreign nationals who are overseas.\n\nSome of those denied visas were subsequently tortured and killed by the Taliban, according to former colleagues, family members and lawyer.\n\n...\n\nPanorama has now heard eyewitness testimony from veterans who served in UK Special Forces detailing alleged war crimes stretching over more than a decade and involving the SBS as well as the SAS.\n\n ...\n\nAsked by Panorama about the government's rejection of Triples' applications, Bruce Houlder KC, who as a former director of service prosecutions was responsible for bringing charges against members of the armed forces, said the government must have known the Triples would have \"highly relevant\" evidence that would be \"much easier to obtain\" if they were in the UK.\n\n...\"",
                "War criminals like Bush, Cheney, Rumsfeld, were allowed to get away with war crimes with barely a wisp from the DNC when powerful democrats were implicated.  Decades later its the same deal with Gen Jenkins failing to report war crimes. Tony Blair may as well be back in power.",
                "Looks like this story might have some legs.",
                "People were tortured to death so this guy could save his career. I don't know UK law or whether this is considered criminal, but it's heinous conduct that should be something you end up in prison for.",
                "I wonder whether GB News will give this any coverage. After all these men would be denied asylum if that lot had their way."
            ],
            "aggregate_sentiment": 43.0
        },
        {
            "category": "NEW",
            "title": "Edan Alexander, U.S.-Israeli hostage, released after more than 19 months in captivity, Hamas says",
            "external_url": "https://www.cbsnews.com/news/edan-alexander-us-israeli-hostage-released-hamas-after-more-than-19-months-captivity/",
            "upvotes": 1943,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/12/9a3ce98b-616a-4de9-9f6d-156cdb148ce5/thumbnail/1200x630/0758355536b5340ff885c8019668d11f/gettyimages-2214166996.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "All it took to get a deal was Qatar gifting a plane to Trump.",
                "Man, comments are always so goddamn weird on threads like this. Astroturfing of all sorts along with a variety of genuine lunatics.",
                "i’m glad he’s going to get to see his family :)",
                "It's incredible any hostages are still alive. I dont even know where they are putting them. \n\nThis was a bit of good news to come out of Israel, so I thought I'd share it.\n\nHave an awesome day!",
                "[removed]",
                "This kids appearance is sure going to mess with some people’s narrative",
                "This article barely mentions that he's an active duty IDF soldier. The headline and photo make it seem like he's a teenage American tourist or something. ",
                "Good to see. He’s the one Corey Booker had a pin on for.",
                "I need a therapist to even think about this guy surviving the ordeal he has been through.",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Police investigate fire at Sir Keir Starmers house - BBC News",
            "external_url": "https://www.bbc.co.uk/news/articles/c9wgrngplnro",
            "upvotes": 527,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fff2/live/f46795c0-2f4a-11f0-b26b-ab62c890638b.jpg",
            "top_comments": [
                "Mark my words: it was a Russian sabotage action",
                "You can accuse Russia - and it is a reasonable and rational conclusion - but I'm sure there are no shortage of domestic nutbars who will do that on their own. Gleeful ignorance is its own form of stochastic terrorism.",
                "Most likely ruzzian (terrorist state) behavior. \n\n\nOr one of their useful puppets in reform",
                "Farage rubbing 2 sticks together.",
                "Maybe that crazy Baby Reindeer lady - she was ranting about him quite a bit between jabs at the guy who called her out on her shit.",
                "Imagine being fucking stupid enough to set fire to the PM’s house. Madness.",
                "Health secretary up to his old tricks again?",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "RISING",
            "title": "A Cybertruck Owner Says Tesla Reset His Odometer to Zero Following a Service Visit – Adds “I Bought My Cybertruck 5 Months Ago & I’ve Already Driven It 26,000 Miles”",
            "external_url": "https://www.torquenews.com/11826/cybertruck-owner-says-tesla-reset-his-odometer-zero-following-service-visit-adds-i-bought-my#comment-186461",
            "upvotes": 2156,
            "date": "05/13/2025",
            "thumbnail": "https://www.torquenews.com/sites/default/files/styles/amp_1200x675_16_9/public/images/Tesla%20Cybertruck%20road_0.jpg?itok=Iow10kCt",
            "top_comments": [
                "Just throwing this out there, but this is straight up fraud right?",
                "They roll back odometers?  Sounds like a place a shady salesman in a houndstooth coat would work.  Isn't rolling back odometers illegal?",
                "Soooo he gets an extra long warrantee?",
                "Nobody fucks over the musk cult quite like Elmo himself",
                "Among all of the horrible things Elon Musk is, I didn't have \"Danny Devito in Matilda\" on my bingo card.",
                "The fact that a reset or a rate change can even happen, accidentally or otherwise should by law be impossible or made infeasible by design.\n\nThough, after a search & seeing plenty of law that covers tampering & requirements for replacement or reset, I cannot find a law that covers design requirements.",
                "Don't you dare report it or you'll be driven to El Salvador. In a Cybertruck 💀",
                "I didn't even know dumpsters had odometers.",
                "All odometers should be mechanical.",
                "HAHAHAHAHA, just days after Musk disclaims accusations of odometer manipulation by Tesla, one of his own beloved Cybertrucks **betrays** him. That dumb fuck is so responsible for all of his own suffering. It's legit astonishing that he is so allergic to learning from his past mistakes. He deserves everything bad that could ever possibly happen to him."
            ],
            "aggregate_sentiment": 75.0
        },
        {
            "category": "RISING",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 283,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "It’s Argentina I’m not surprised at all",
                "Anything Kanye can use?",
                "We have top men working on it right now.",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "Argentina is still pro Nazi .",
                "What’s in the boxes. That’s what I want to know.",
                "They did nazi that coming"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Episcopal Church refuses to resettle white Afrikaners, citing moral opposition",
            "external_url": "https://www.npr.org/2025/05/12/g-s1-65988/episcopal-church-white-afrikaners-ends-partnership-u-s-government",
            "upvotes": 4129,
            "date": "05/12/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F34%2F1b1627bb47cabd2e3be01911d780%2Fap25079502278892.jpg",
            "top_comments": [
                "It is refreshing to see some Christians actually following their faith.",
                "Last week I'm agreeing with a Pope and this week I'm with an Episcopal church.  Weird couple of weeks as an atheist.",
                "It's outrageous our tax dollars were spent to bring these people here.  What a waste of resources.",
                "Trump isn't hiding who and what he is.",
                "Episcopalians do what Republicans can't.",
                "> Q: There are many people who fit the criteria of fleeing persecution. Afghans for example. But they're being denied refugee status. So why such an exception for the Afrikaners?\n\n> TRUMP ADMIN OFFICIAL: One of the criteria is making sure they can be assimilated easily into our country\n\nIt’s just racism. That’s it. \n\nSource: https://bsky.app/profile/atrupar.com/post/3loym4e3uts23",
                "Bringing white south afrikaners here is just trump DEI policies benefiting people who historically benefited from racism, and largely still do.\nAnd don't the white people in South Africa still own the majority of the land in South Africa? Land they stole from the ancestors the people that the trump administration is trying to paint as viEurope.\n\n MAYBE the European South afrikaners should go back to europe.",
                "As a DEI citizen, glad to see someone in this country has some integrity",
                "The Episcopal Church is not a part of the evangelical wing of Christian denominations. They are on the progress side and emphasizes helping the needy and bringing people together to do good. I have a friend who's a priest in the church and as an atheist I respect her work very much.",
                "I think I might like the Episcopalians."
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "RISING",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 1099,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "just outlaw thinking and get it over with. ",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some dude lost to a woman in chess, huh",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that.",
                "What’s not banned at this point?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Tory Lanez, in prison for Megan Thee Stallion shooting, hospitalized after attack by fellow inmate",
            "external_url": "https://abcnews.go.com/US/tory-lanez-prison-megan-thee-stallion-shooting-hospitalized/story?id=121729265",
            "upvotes": 624,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb558451-cf1b-4a98-98dd-73533d4b8e1e/tory-lanez-ap-jef-250512_1747070335627_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Ah, too bad. I bet that hurt. Kinda like getting shot.",
                "Article by Deena Zaru and Alex Stone\n\n>Tory Lanez was hospitalized on Monday after a fellow inmate at the California Correctional Institution in Tehachapi attacked the rapper at around 7:20 a.m. local time, a spokesperson for the prison told ABC News.\n\n>\"Staff immediately responded, activated 911 and began medical aid. Peterson was subsequently transported to an outside medical facility for further treatment,\" the spokesperson said.\n\n>The rapper, whose legal name is Daystar Peterson, is serving a [10-year prison sentence](https://abcnews.go.com/US/rapper-tory-lanez-set-sentenced-shooting-injuring-megan/story?id=102070344) for shooting and injuring fellow hip-hop star Megan Thee Stallion, whose legal name is Megan Pete, in July 2020.\n\n>The prison spokesperson did not provide further comment when asked about the nature of Peterson's injuries, whether he has been released from the hospital or whether a suspect has been charged in the attack.\n\n>Crystal Morgan, an attorney representing Peterson, confirmed to ABC News that the rapper was attacked at the correctional facility and said that as of Monday afternoon he remains hospitalized.\n\n>Morgan said she has not been able to obtain any information about his injuries or his condition and is \"in the dark\" like everyone else. Morgan added she called Peterson's family to notify them of the attack.\n\n>The prison's Investigative Services Unit and the Kern County District Attorney's Office launched a probe into the incident, while the Office of the Inspector General has been notified, the spokesperson said.\n\n>ABC News has reached out to the DA's office for additional comment.\n\n>Peterson [was found guilty](https://abcnews.go.com/US/verdict-reached-trial-rapper-tory-lanez-charged-shooting/story?id=95723751) on Dec. 23, 2022, of three charges for shooting and injuring Pete in both feet as they left a party in the Hollywood Hills on July 12, 2020.\n\n>He was initially charged in October 2020 with one felony count each of assault with a semi-automatic firearm (personal use of a firearm) and carrying a loaded, unregistered firearm in a vehicle, according to charging documents obtained by ABC News.\n\n>He was also charged ahead of his trial in December 2022 with an additional felony count of discharging a firearm with gross negligence. Lanez, who chose not to take the witness stand during the trial, pleaded not guilty to all three charges.\n\n>His defense attorneys argued during the trial that Lanez was not the shooter and he has maintained his innocence in multiple social media posts since his sentencing last year.\n\n>During his sentencing hearing, prosecutors read an impact statement from Pete -- who testified during the trial -- in which she called for Peterson to \"be forced to face the full consequences of his heinous actions and face justice.\"\n\n>\"He not only shot me, he made a mockery of my trauma. He tried to position himself as a victim and set out to destroy my character and my soul,\" Pete said in her impact statement.\n\n>Peterson was denied bond by a Los Angeles County Superior Court judge on Sept. 14, 2023, as his [legal team appeals his 10-year sentence](https://abcnews.go.com/US/tory-lanez-denied-bond-appeals-10-year-sentence/story?id=103185176).",
                "Let me play a song on the world’s smallest violin",
                "Actions have consequences. Sometimes those consequences come with a bunkmate named Karma.",
                "I will never understand how one minute you can be at a mansion party in the pool with Meg Thee Stallion and Kylie Jenner, and the next you're facing 10 years in prison for shooting at said ~~females~~ women. That's not how my night would've went, IJS.",
                "Kinda crazy to think I met this guy in Austin via a friend who’s a very close friend of Tory. \n\nI didn’t think he was that big.",
                "Finally some good news today!"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Top UK Special Forces general oversaw blocking of Afghan 'war-crime' witnesses to Britain",
            "external_url": "https://www.bbc.com/news/articles/cp3q5xl9wqwo",
            "upvotes": 303,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/105f/live/08d6ac50-2cd8-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "\"...\n\nThousands of applications from individuals with credible evidence of service with Afghan Special Forces, including the units known as the Triples, were then rejected, leaving many of the former commandos at the mercy of the Taliban.\n\n...\n\nIf the Afghan commandos were in the UK, they could be called as witnesses - but the inquiry has no power to compel testimony from foreign nationals who are overseas.\n\nSome of those denied visas were subsequently tortured and killed by the Taliban, according to former colleagues, family members and lawyer.\n\n...\n\nPanorama has now heard eyewitness testimony from veterans who served in UK Special Forces detailing alleged war crimes stretching over more than a decade and involving the SBS as well as the SAS.\n\n ...\n\nAsked by Panorama about the government's rejection of Triples' applications, Bruce Houlder KC, who as a former director of service prosecutions was responsible for bringing charges against members of the armed forces, said the government must have known the Triples would have \"highly relevant\" evidence that would be \"much easier to obtain\" if they were in the UK.\n\n...\"",
                "War criminals like Bush, Cheney, Rumsfeld, were allowed to get away with war crimes with barely a wisp from the DNC when powerful democrats were implicated.  Decades later its the same deal with Gen Jenkins failing to report war crimes. Tony Blair may as well be back in power.",
                "Looks like this story might have some legs.",
                "People were tortured to death so this guy could save his career. I don't know UK law or whether this is considered criminal, but it's heinous conduct that should be something you end up in prison for.",
                "I wonder whether GB News will give this any coverage. After all these men would be denied asylum if that lot had their way."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 9553,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FYI, the other state is North Dakota",
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "We don't need to be giving giant companies shields like that. We also don't need a jury deciding what causes cancer when the scientific results aren't there.",
                "Bayer is the beneficiary. Bayer is not a farmer. \n\n> The new law “demonstrates that Georgia stands with its farmers, who work tirelessly to produce safe and affordable food,” said Brian Naber, president of Bayer’s crop sciences in North America, Australia and New Zealand.",
                "Georgia is also the state where prosecutors have absolute immunity. If they lie or break the law to convict you, they face no consequences whatsoever and cannot be sued for their misconduct. I feel terrible for people stuck there with MTG",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "Why is everybody freaking out over unsubstantiated dubious cancer claims rather than the widespread ecosystem damage that's well known and understood? Like if you're going to hate it please learn to hate it for the right reasons.",
                "Save corporations from responsibility.",
                "I have been reading studies on this.  Humans don't have the chemical pathway to be directly poisoned by glycophate, however these studies seem to indicate that glycophate does directly kill much of the microflora in the intestines disrupting many of the metabolic functions in the gut.  This in turn has links to forms of cancer and autoimmune diseases.\n\nMedicine has barely touched on microbiome research, but I'm betting this is the source of the issue.  There are low doses of glycophate throughout much of our food supply.\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC4047521/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9145961/\n\nhttps://www.sciencedirect.com/science/article/abs/pii/S1382668923000911\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9321451/",
                "Georgia becomes second state to give Monsanto immunity."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 4862,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "*. We’re going to be working on the fundamentals of wrestling, proper stance, proper head position, how to hand fight and dominate your opponent,” Snyder says in a video.   “And we’re also going to be talking about the Lord Jesus. That’s the most important thing, how he’s going to change our life, bring us closer to him. Looking forward to seeing you guys. God bless*.”\n\nSnyder also holds a summer camp at Messiah University The Sting came up with 16 men, one of which, celeb Snyder, was the more important in pushing the message than all the others.",
                "Thank goodness this dangerous criminal is off the streets. It would have been nice if the police could have spent the time and effort put into this operation catching thieves and killers, but I guess you can't have everything."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Edan Alexander, U.S.-Israeli hostage, released after more than 19 months in captivity, Hamas says",
            "external_url": "https://www.cbsnews.com/news/edan-alexander-us-israeli-hostage-released-hamas-after-more-than-19-months-captivity/",
            "upvotes": 1945,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/12/9a3ce98b-616a-4de9-9f6d-156cdb148ce5/thumbnail/1200x630/0758355536b5340ff885c8019668d11f/gettyimages-2214166996.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "All it took to get a deal was Qatar gifting a plane to Trump.",
                "Man, comments are always so goddamn weird on threads like this. Astroturfing of all sorts along with a variety of genuine lunatics.",
                "i’m glad he’s going to get to see his family :)",
                "It's incredible any hostages are still alive. I dont even know where they are putting them. \n\nThis was a bit of good news to come out of Israel, so I thought I'd share it.\n\nHave an awesome day!",
                "[removed]",
                "This kids appearance is sure going to mess with some people’s narrative",
                "This article barely mentions that he's an active duty IDF soldier. The headline and photo make it seem like he's a teenage American tourist or something. ",
                "Good to see. He’s the one Corey Booker had a pin on for.",
                "I need a therapist to even think about this guy surviving the ordeal he has been through.",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Police investigate fire at Sir Keir Starmers house - BBC News",
            "external_url": "https://www.bbc.co.uk/news/articles/c9wgrngplnro",
            "upvotes": 518,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fff2/live/f46795c0-2f4a-11f0-b26b-ab62c890638b.jpg",
            "top_comments": [
                "Mark my words: it was a Russian sabotage action",
                "You can accuse Russia - and it is a reasonable and rational conclusion - but I'm sure there are no shortage of domestic nutbars who will do that on their own. Gleeful ignorance is its own form of stochastic terrorism.",
                "Most likely ruzzian (terrorist state) behavior. \n\n\nOr one of their useful puppets in reform",
                "Farage rubbing 2 sticks together.",
                "Maybe that crazy Baby Reindeer lady - she was ranting about him quite a bit between jabs at the guy who called her out on her shit.",
                "Imagine being fucking stupid enough to set fire to the PM’s house. Madness.",
                "Health secretary up to his old tricks again?",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": 25.0
        }
    ],
    "last_updated": "05/13/2025 00:44:00 UTC"
}