{
    "posts": [
        {
            "category": "HOT",
            "title": "Dollar General warns low-income Americans’ finances are getting worse",
            "external_url": "https://www.cnn.com/2025/03/13/business/dollar-general-shoppers-inflation/index.html",
            "upvotes": 17499,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1827147996-20250313141452450.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I grew up poor in the 80s, it must be frickin ruthless now.\n\nEdit: if my wife didn’t take care of me I’d be on the street. I’m a very lucky disabled person. Imagine making it in America on 800 bucks a month. It’s bonkers.\n\nEdit 2: imagine was a bad way to say it… I know people do it every day, my bad, I’m sorry.",
                "Dollar General is part of the problem.\n\n> True, the chain pays its workers industry-low wages in under-staffed stores that can be magnets for armed burglary. And yes, Dollar Store management targets economically struggling communities, focusing on customers who make less than $40,000 a year and visit the store multiple times a week. “The economy is continuing to create more of our core customer,” CEO Todd Vasos said in 2018.\n\n> But to those working class consumers, Dollar General promises to deliver “everyday low prices.” \n\n> In reality, without knowing it, customers are often paying Whole Foods prices for dollar store groceries. \n\n\nhttps://perfectunion.us/dollar-general-prices/",
                "In the 1960s, the gov't launched a War on Poverty. Today, it's fighting against the poor.",
                "To be fair, Dollar General giving people a bad price/unit because they can’t afford to buy the standard bulk sizes doesn’t help, but I digress.",
                "All while paying poverty wages and cutting hours so bad it's really not worth working for them",
                "So they’re thrilled to swoop in to open thousands more stores?\n\nYa that’s the ticket",
                "Because they are paying more for less at dollar general.",
                "Consumers making less than $50,000 a year are “pretty constrained,” she said, and “it’s also pretty, pretty challenging” for customers making less than $100,000 annually.\n\n\nCan confirm, it is pretty challenging.",
                "The phrasing of that headline reads like Dollar General has a sign on the door saying \"Just a heads up y'all bitches getting poorer everyday out here!\"",
                "Dollar general is a parasite on the ass of the lowest income families. No one should shop at dollar general."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "HOT",
            "title": "U.S. stock market loses $5 trillion in value in three weeks",
            "external_url": "https://www.cnbc.com/2025/03/14/us-stock-market-loses-5-trillion-in-value-in-three-weeks.html",
            "upvotes": 3929,
            "date": "03/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108107173-1741956255184-108107173-17405057832025-02-25t164922z_514643967_rc2q1davpagh_rtrmadp_0_usa-stocks.jpg?v=1741956265&w=1920&h=1080",
            "top_comments": [
                "A quick google search indicates the US stock markets total valuation as of Jan 2025 is about 62 trillion. That is an 8% loss in less than a month largely due to the actions of 1 man. If your company discovered 1 employee was directly responsible for an 8% drop in revenue the speed with which they would be removed by any means might break the laws of physics.",
                "*Opinion pending, awaiting MAGA marching orders*",
                "What's amazing is that millions of adults don't seem to notice his industrial strength incompetency.",
                "Somebody said it right, *Actions speak louder than words*",
                "All of a sudden conservatives do not care about the stock market",
                "The rich guys have figured out how to get at everybody's tax dollars now.\n\n\nAnd you can bet they're all buying/selling in tandem with Trump's \"tariffs on/tariffs off\" cycles.",
                "Can't believe Biden did this",
                "100% the fault of chairman orange shitbag.",
                "This is just cover for a massive wealth transfer from the 99% to the ultra rich. Similar to when COVID crashed the markets.",
                "What baffles me the most out of this insanity is that everyone's still just letting it happen\n\n\nAre we finally ready for the gen strike that should've already happened? Should we just allow and even wait for the toddler to dump ALL the cereal onto the floor before intervening? \n\n\nWhy haven't we collectively realized yet that the longer we wait, exponentially more damage will occur? Damage we may never be able to reverse, if we survive this volatile time..."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Newsmax agrees to pay $40m to settle defamation suit over false election claims",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/14/newsmax-smartmatic-settlement",
            "upvotes": 4396,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d293af4fb1c73e4056d80f11cbdb2cbc79938dc6/0_256_7689_4613/master/7689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b5e81cd116b62569b1e434137003bb",
            "top_comments": [
                "In case no one read past the headline, Newsmax is paying $40m to the voting machine maker Smartmatics.\n\nNewsmax claimed the election machines were compromised. Smartmatics sued for defamation. Newsmax lost the suit.\n\nThis is not the same as ABC/NBC paying Trump to settle their suit.",
                "So now both Fox News and also NewsMax have each had to pay millions of dollars for lying about the election. \n\nAnd conservatives still call every other station fake news",
                "After whatever Elon paid for the white house, this is the 2nd best deal of decade.",
                "Sounds like they got off awfully cheap to me.",
                "Is $40 mill significant or just a drop in the bucket?\n\nWhat's the precedent?",
                "Newsmax Breaking: Left-Wing Extremist Guardian Falsely Claims Newsmax Settled Lawsuit",
                "Wild how not one single \"election fraud\" claim has been prove true time and time again, with millions of dollars and man hours wasted on this bullshit, and yet your average Republican still can't admit it. \n\nSorry, not \"wild\", completely predictable and expected from my \"fiscally responsibility\" and \"personal responsibility\" friends.  Whatever it takes to appease god king Trump, eh?",
                "Newsmax is as bad as Fox, both are providing misinformation to the USA Citizens",
                "$40m seems about right as damages to Smartmatics. That's not nearly enough as damages to the USA.",
                "They aren’t news.  They are propaganda.  On top of the $40 million, they should be ordered to remove “News”from their company name"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Mark Carney sworn in as Canada’s PM after Trudeau steps down",
            "external_url": "https://www.cnn.com/2025/03/14/americas/canada-carney-prime-minister-trudeau-resigns-intl-latam?Date=20250314&Profile=cnnbrk&utm_content=1741967012&utm_medium=social&utm_source=twitter",
            "upvotes": 3284,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-09t233949z-1493832281-rc2s9daeyq4b-rtrmadp-3-canada-politics.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "As a Canadian, it's funny thinking how Trump thought Trudeau was using tariffs to hold on to power like a dictator, not understanding he already resigned and this is how the Canadian political process sometimes works. He simply talks out of his ass about everything he doesn't understand (which is a lot).",
                "Prime Minister Mark Carney is an extremely well educated and experienced man. I am wishing him the most success in steering our Country down the right path in these uncertain times.\n\nLong Live Canada 🇨🇦",
                "Trudeau may have not been great for Canada for a while domestically \n\nBut I really think he stepped up against Trump in the last few months in a way few others did \n\nHope the new guy is as resolute",
                "Finally.  A Carney to manage the Trump circus.",
                "I really hope Mark is the answer we have been looking for. Too many people in politics don’t understand the real world. This guy seems to get it.",
                "Trudeau seemingly got a lot of shit from Canadians for his domestic policies, but dude was a masterclass in Canadian international relations. Gonna miss seeing him on the news representing Canada.",
                "Damn, in my 22 years of living in Canada this is only the 3rd prime minister",
                "Now, let's see if Canadians can learn from the mistakes of our neighbors. Another Liberal gov( even a minority) will bury The CPC for years. They've placed all their eggs in the MAGA basket. After blowing a ~30 point lead PP would have to resign, and their is no heir apparent.\nI personally can't wait to see it.",
                "Finally, an expert who actually knows things running the show. A competent PhD in charge is infinitely better than the inconsistent and unprincipled career politicians/grifters that dominate politics in general.",
                "Pipelines baby.\nWill use lots of steel"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Trump administration asks Australian universities to justify US funding",
            "external_url": "https://www.abc.net.au/news/2025-03-14/trump-administration-asks-australian-universities-funding/105053784",
            "upvotes": 1884,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/c549b683374ddd719ec861682aab5289?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=6&width=862&height=485&imformat=generic",
            "top_comments": [
                "It’s grant money… isn’t the justification in the grant application?",
                "Folks it’s research grants. The title was shorten for clicks\n\n“Trump administration asked to explain after Australian universities told to justify US-funded research grants” \n\nIt’s quite common for countries to collaborate on joint research in science and technology fields",
                "Reminder for anyone who may be unaware - federal grant applications already contained very lengthy and detailed justifications for pretty much every individual part of the research. \n\nIf it's been approved, it's because it was well vetted by handful of individual reviewers who can demand edits or clarification, then present the application to an entire board of specialists who review further, and then all issues have been adequately justified is the grant awarded. \n\nThis additional work created by the Trumo organization is wildly unecessary and inefficient.",
                "\"The document also asks... what steps they've taken against \"Christian persecution\" or to \"protect women and to defend against gender ideology.\"\"\n\nWhat the hell is this backwards hick garbage? The US is absolute clown town right now.",
                "Although the U.S. sending money to foreign universities can be questioned, it's becoming apparent with chaos taking over the dysfunctional U.S. government, there are more people beside Ol' Elon inside the Trump Administration with their personal agendas just doing whatever they want.",
                "Every great leader in history embraced institutions of public learning as a cornerstone of society.",
                "Yeah what a waste of money to help foster collaboration between American scientists/researchers/professors and the top minds and institutions Australia has to offer.\n\nGod fucking forbid we go a single day without shitting on one of our allies.",
                "So it's been a bit since I've had to apply for one, but as I recall, you justify the grant when you fucking apply for it, you orange piece of shit.",
                "\"You haven't taken any steps to make sure the events shown in Maximum Overdrive never happen? Guess we'll have to cut your funding.\"\n\n \"Did you slay the required number of greebles this month? No? We'll I'm sorry to say we can't fund your school anymore.\"",
                "Well did any of these universities ever consider saying thank you???"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "US consumer sentiment deteriorates sharply in March",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-deteriorates-sharply-march-2025-03-14/",
            "upvotes": 3483,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s almost like when the world is completely unpredictable and positions change by the second people are not able to plan for the future and are less likely to spend money outside of absolute needs. And it’s almost like when an economy is built entirely on the spending of its consumers and the confidence in systems that uncertainties hurt the whole economy.",
                "Strangely enough, my job being threatened by illegal NIH grant cuts has triggered me to stop spending money and hoard cash.\n\nThat $30k I had pegged to remodel my bathroom would be churning into the economy if not for that.",
                "If the government won’t govern why should consumers consume?",
                "Trump and his administration has done nothing but harm to our country and certainly has not done anything good or beneficial. Unnecessary spending is completely off the table for the foreseeable future in our house.",
                "Don’t underestimate how bad this is. \n\nYou can look at the historic data series, but once consumer sentiment falls, it takes a long time to get back to normal.\n\nAnd in an era where price signals, recession signals, and uncertainty signals are flashing, this could worsen an economic downturn.\n\nSource: economist.",
                "I am getting dizzy from all that winning....",
                "Yeah, levying sudden heavy federal sales taxes will do that. ",
                "Can't risk egregious spending right now. For all I know we're gonna be back to fighting in the Thunderdome for toilet paper any moment.",
                "I'm just buying necessities.",
                "It’s almost like a blatant and mediocre conman is POTUS"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 6010,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "The largest pork processor in the US is Smithfield and they're Chinese owned.  I wonder how that'll work.",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "So, China just need to do nothing (not renew export licences) and “...$US3 billion ($A4.77B) worth of beef, pork and poultry no longer eligible to export to China.”.  That is just so low effort with highly effective impact.  Maybe, other countries that are affected by the U.S. tariffs need to look at this as a tactic to defend their economy.",
                "So much winning, non stop winning. The voters must be so proud",
                "Good for China. The US gets what it voted for.",
                "China gets a lot of it's good import meat from New Zealand and Australia anyways. This won't affect anyone but America.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "What sucks more? The \"art\" or the \"deal\"?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "America’s automakers aren’t rushing to move production to US factories to avoid tariffs",
            "external_url": "https://www.cnn.com/business/automakers-tariffs-new-us-plants/index.html",
            "upvotes": 1589,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-04t175159z-2098714084-rc2h6daud9v7-rtrmadp-3-usa-trump-tariffs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I remember when Ford promised to move production factories to the US right after Trump negotiated and signed the USMCA.   A few months later Ford moved more jobs to mexico.   \n   \nOf course they aren’t going to build plants in the US.  Tariffs are turned on and off by the hour, it takes longer than that to build one.",
                "People that think tariffs will change manufacturing locations think you can spin up a factory in a few weeks, lol",
                "By the time any new manufacturing plant would be up and running, the orange clown would have ended his current term.",
                "It takes ages to spin up a new factory. Why would they change their plans suddenly when in four years policy might dramatically change again?",
                "The ironic thing is all the Euro, Japanese, and Korean plants are in the US for the US market but the domestic brands outsource. If you want to buy made in America, don’t buy an American car brand.",
                "Stability matters more than cost of production.\n\nAlways has.\n\nAlways will.",
                "I used to work supplying automotive and their supply networks are vast and complicated. Even if they move the plants to the US (which is costly and there's good economic reason they have plants in Canada and Mexico) they'd then have to entirely rebuild their supply networks to get all the parts and materials they need. It's impossible to divorce the US auto industry from the Canadian and Mexican auto industries. ",
                "It will take longer than four years to move manufacturing home, and the next administration could just change everything again.",
                "Leave factories where they are, pass on tariff costs to customers. Then (if it would be cheaper for you) move factories into the US to eliminate the tariff impact, but leave the tariff pricing customers are now used to in place. Profit.",
                "Trump isn't consistent enough to build any strategy around.\n\nHis tariffs are looking  more like a pump and dump scheme for his allies than any sort of actual policy, which is why the S&P 500 is dropping like a rock as they extract funding from it."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Fierce protests as eight-year-old rape victim dies in Bangladesh",
            "external_url": "https://www.bbc.com/news/articles/ce30k9g6x2eo",
            "upvotes": 1398,
            "date": "03/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1897/live/ebd12f00-0094-11f0-93cc-fd4e777d3e70.jpg",
            "top_comments": [
                "Horrific \n\nwtf is wrong with people",
                "Her heart stopped 3 times, and on the third time they couldn’t bring her back.\n\nAs if the rape of an 8-year-old wasn’t bad enough, what on Earth did they do to her to cause that much damage to her heart?!\n\nThere is a special place in hell for people that do this sort of thing.",
                "She was just a little kid visiting her big sister. Jesus. \n\nI am so tired of the horrors we inflict on one another.",
                "Poor little girl, may she rest in peace while the rapists rot in hell.",
                "Humanity is a mistake.",
                "When you smother a country in a religion that respects nothing but male dominance, this is what you get.",
                "At least their home was burnt down.  There is a lot to be desired in how Asian countries handle sexual assault and women’s rights.",
                "Over 4000 child rape cases reported in Bangladesh? Yeah... This is a cultural issue. The culture thinks this is acceptable. They're going to have work really hard to change things.",
                ">The rape of minors is punishable by death in Bangladesh, as per a law that was passed in 2020.\n\nThe victim's older sister's husband and his family are shitting bricks right now.",
                "Those  are the tiki torches I could go behind."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Armenia and Azerbaijan agree to peace treaty after nearly four decades of war",
            "external_url": "https://www.cnn.com/2025/03/13/europe/armenia-and-azerbaijan-peace-agreement-conditions-intl-latam/index.html",
            "upvotes": 806,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1683926061.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The article doesn't state the reason for the diplomatic breakthrough after so many decades, but it seems to be a result of both Azerbaijan retaking Nagorno-Karabakh, and I'd assume Russian imperialism. It's probably best to settle your border disputes in order to focus on bigger picture threats.",
                "It's still sad that Azerbaijan managed to ethnically cleanse the Armenians of Nagorno-Karabakh.\n\n Almost no one knows about this because just 1 week later the Israel-Hamas war started, taking everyone's attention completely off of this conflict.",
                "“Now that we’ve ethnically cleansed your enclaves, let’s call it a draw.”",
                "Inb4 trump takes credit",
                "It says nearly 4 decades… people have had enough time to know about it. If it’s not Israel or Ukraine, nobody gives a shit.",
                "I visited both countries a couple of months ago - loved them both, nice people. Except for that corrupt cop in Baku.\n\nI have a YouTube with same name as my Reddit, if anyone’s interested. I’m a nomad that’s been to 40 countries.",
                "What a disgusting shame on europe that conflict has been.\n\nAzerbaijan has essentially been allowed to genocide Armenians, publically and proudly, and nothing was done.\n\nWe should have nuked Baku long ago.",
                "How will trump take credit for this…"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Voice of America ending contracts with Associated Press, Reuters and Agence France Presse",
            "external_url": "https://apnews.com/article/voa-government-media-contracts-2bd47cf0c1bbcdc5cbe08eea030c1454",
            "upvotes": 106,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Kari Lake, the former broadcaster turned Republican politician who was selected by President Donald Trump to run VOA, estimated the move would save $53 million.\n\n\nAs an Arizona resident, I'm sincerely sorry about Kari Lake. When we send them, we're not sending our best people ",
                "In other words: _These legitimate news services undermine the narratives we make up... so fuck 'em_.",
                "This is being done as per [Project 2025 (Chapter 8).](https://static.project2025.org/2025_MandateForLeadership_CHAPTER-08.pdf)’s plans.",
                "I dunno about this. If or when world or national news services have to use only internal staffs to assemble relevant or pertinent information then they become local news outlets and we have been there and found it wanting.       \nThat is why the 'wire' services are helpful.",
                "Easier to push out propaganda that way.",
                "That's because it's not the Voice of America anymore.\n\nIt's the Voice of Trump and Co.",
                "So save $53mil so fukFace trump can play another 16 days of golf.",
                "So it’ll become ‘voice of the morons’",
                "show us the nonsense, Lake",
                "In other words, we will stop forcing actual news agencies to carry our US propaganda. Good riddance"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Measles cases linked to Texas outbreak grows to 259, with just 2 among fully vaccinated people",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-grows-259-2/story?id=119799576",
            "upvotes": 312,
            "date": "03/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Truly the golden age here in the US.",
                "Since we are going backwards, What's next on menu? Civil war?",
                "As a kid, I wondered how an advanced civilization like Atlantis could possibly not exist anywhere. \n\nAs an adult, while I know Atlantis isn't real, I can totally understand how any advanced civilization could go bottoms up.\n\n  \nJust didn't think it would happen in my lifetime. And historians better call this the dumbest timeline.",
                "So. \n\n\nIs Texas planning on bringing back Polio, too?\n\n\nMaybe also Smallpox? Diphtheria? Hepatitis B?\n\n\nI'm so, so tired of science-denying ijuts.",
                "I thought there were dozens where status was unknown.   Have they figured it out?",
                "Today’s 36 new Texas cases is higher than the 25 new cases reported Tuesday, but lower than the 39 new cases reported last Friday.",
                "Make America Generally-Unwell Again.",
                "Said it before and will say it again. \n\nThe parents of unvaccinated children who get sick from measles should be charged with child abuse and/or endangerment. If the child dies they should be charged with first degree murder. If they want to claim it was \"God's will\" then they better be prepared to subpoena God to show up as a witness for their trial and testify that it was indeed preordained that this child would die of measles. Otherwise, fuck you, you allowed your child to contract (and die of) an easily preventable disease. That is, to me, textbook child abuse, and if the kid dies, considering you knew you could prevent it and still did nothing, that makes it premeditated murder. \n\nBut, it's Texas, so probably most of the parents of affected kids will profit off the death of their child by joining the anti-vax grift train and they'll be hailed as heroes for \"owning the libs\" by letting their child die a horrible death at a very young age.",
                "Is anyone surprised how few cases (relatively speaking) compared to how virulent this disease is?  Wouldn’t there be more than this by now, or is the reporting skewed by families not reporting cases unless they require significant medical intervention.  I guess most of the older population has immunity and it’s just the unvaccinated kids that are getting it?",
                "At least they don’t have to worry about autism now"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Police question Russian master of ship that hit tanker in North Sea | UK news",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/captain-arrested-over-uk-ship-collision-is-russian-owner-says",
            "upvotes": 39,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f785bcdf2460ac2b7086234cb10a03a269bf9eb1/0_300_5523_3314/master/5523.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7fe543d6f080043ce83ede9e9cf3fd90",
            "top_comments": [
                "There is a semi-credible conspiracy theory (unproven but plausible) that this was a deliberate action. There was jet fuel on board the Immaculate that was destined for Ukraine. It is possible that this was sabotage aimed at preventing that from happening. I'm not saying that this is what happened, but there is a possibility. It seems somewhat unnecessary to me, as Ukraine doesn't really have enough jets where lack of jet fuel would make a noticeable difference in the war, but what do I know, I'm no military analysist. Also if it was really Putin, why not hire a non-russian to do it? Unless he was sending some sort of message? Who knows. But, it's kind of weird for a Russian ship master to randomly hit a stationary tanker that just happened to be carrying fuel heading for Ukraine... a pretty remarkable coincidence.\n\nJust watched a youtube video covering topic (at the 6:00 mark) [https://www.youtube.com/watch?v=VcRLQwpBc1s](https://www.youtube.com/watch?v=VcRLQwpBc1s)\n\nWas curious what kinda responses I'd get here.",
                "I think it’s easy to jump to a knee-jerk reaction without having all the facts and blame it on sabotage. So that’s what I’ll do. Sabotage! \n\nNo but seriously, the basic facts of the situation are clearly suspicious given the cargo and timing."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "U.S. stock market loses $5 trillion in value in three weeks",
            "external_url": "https://www.cnbc.com/2025/03/14/us-stock-market-loses-5-trillion-in-value-in-three-weeks.html",
            "upvotes": 3925,
            "date": "03/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108107173-1741956255184-108107173-17405057832025-02-25t164922z_514643967_rc2q1davpagh_rtrmadp_0_usa-stocks.jpg?v=1741956265&w=1920&h=1080",
            "top_comments": [
                "A quick google search indicates the US stock markets total valuation as of Jan 2025 is about 62 trillion. That is an 8% loss in less than a month largely due to the actions of 1 man. If your company discovered 1 employee was directly responsible for an 8% drop in revenue the speed with which they would be removed by any means might break the laws of physics.",
                "*Opinion pending, awaiting MAGA marching orders*",
                "What's amazing is that millions of adults don't seem to notice his industrial strength incompetency.",
                "Somebody said it right, *Actions speak louder than words*",
                "All of a sudden conservatives do not care about the stock market",
                "The rich guys have figured out how to get at everybody's tax dollars now.\n\n\nAnd you can bet they're all buying/selling in tandem with Trump's \"tariffs on/tariffs off\" cycles.",
                "Can't believe Biden did this",
                "100% the fault of chairman orange shitbag.",
                "This is just cover for a massive wealth transfer from the 99% to the ultra rich. Similar to when COVID crashed the markets.",
                "What baffles me the most out of this insanity is that everyone's still just letting it happen\n\n\nAre we finally ready for the gen strike that should've already happened? Should we just allow and even wait for the toddler to dump ALL the cereal onto the floor before intervening? \n\n\nWhy haven't we collectively realized yet that the longer we wait, exponentially more damage will occur? Damage we may never be able to reverse, if we survive this volatile time..."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "More than 50 universities face federal investigations as part of Trump's anti-DEI campaign",
            "external_url": "https://apnews.com/article/trump-dei-universities-investigated-f89dc9ec2a98897577ed0a6c446fae7b?utm_source=flipboard&utm_content=user%2FAssociatedPress",
            "upvotes": 46,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's a lot of investigations.  They will want to be efficient about it by relying on as few facts as possible.",
                "They don't even link to the list of schools.\n\nhttps://www.ed.gov/about/news/press-release/us-department-of-educations-office-civil-rights-sends-letters-60-universities-under-investigation-antisemitic-discrimination-and-harassment",
                "Investigating Ohio State University? This is going to be problematic for MAGA Buckeye fans.",
                "UC Davis? I'm pretty surprised, I'm attending UC Davis at the moment"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Trump administration asks Australian universities to justify US funding",
            "external_url": "https://www.abc.net.au/news/2025-03-14/trump-administration-asks-australian-universities-funding/105053784",
            "upvotes": 1880,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/c549b683374ddd719ec861682aab5289?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=6&width=862&height=485&imformat=generic",
            "top_comments": [
                "It’s grant money… isn’t the justification in the grant application?",
                "Folks it’s research grants. The title was shorten for clicks\n\n“Trump administration asked to explain after Australian universities told to justify US-funded research grants” \n\nIt’s quite common for countries to collaborate on joint research in science and technology fields",
                "Reminder for anyone who may be unaware - federal grant applications already contained very lengthy and detailed justifications for pretty much every individual part of the research. \n\nIf it's been approved, it's because it was well vetted by handful of individual reviewers who can demand edits or clarification, then present the application to an entire board of specialists who review further, and then all issues have been adequately justified is the grant awarded. \n\nThis additional work created by the Trumo organization is wildly unecessary and inefficient.",
                "\"The document also asks... what steps they've taken against \"Christian persecution\" or to \"protect women and to defend against gender ideology.\"\"\n\nWhat the hell is this backwards hick garbage? The US is absolute clown town right now.",
                "Although the U.S. sending money to foreign universities can be questioned, it's becoming apparent with chaos taking over the dysfunctional U.S. government, there are more people beside Ol' Elon inside the Trump Administration with their personal agendas just doing whatever they want.",
                "Every great leader in history embraced institutions of public learning as a cornerstone of society.",
                "Yeah what a waste of money to help foster collaboration between American scientists/researchers/professors and the top minds and institutions Australia has to offer.\n\nGod fucking forbid we go a single day without shitting on one of our allies.",
                "So it's been a bit since I've had to apply for one, but as I recall, you justify the grant when you fucking apply for it, you orange piece of shit.",
                "\"You haven't taken any steps to make sure the events shown in Maximum Overdrive never happen? Guess we'll have to cut your funding.\"\n\n \"Did you slay the required number of greebles this month? No? We'll I'm sorry to say we can't fund your school anymore.\"",
                "Well did any of these universities ever consider saying thank you???"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Immigration officials arrest second person who participated in pro-Palestinian protests at Columbia",
            "external_url": "https://www.wftv.com/news/politics/columbias-mahmoud/W6PPLQLVY5DSLL7FMKN2XI2LYI/?outputType=amp",
            "upvotes": 306,
            "date": "03/14/2025",
            "thumbnail": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FE26T7XL4WACHU4HYKB5ERCKBYU.jpg?auth=5a0af1350facf60d9f6b189766c2aa27d84e7f45136c91a974eb02a9f9dc08fc&width=1200&height=630&smart=true",
            "top_comments": [
                "Immigration is super serious and overstaying a visa is super bad and you should be deported! \n\n\n\n...unless you're Musk",
                "I do think they're targeting these folks for being protesters, but to be clear:\n\n> Leqaa Kordia, a Palestinian from the West Bank, was arrested by immigration officers for overstaying her student visa, the Department of Homeland Security said.",
                "Her student visa was revoked three years ago for not attending classes... ",
                "Her student visa was revoked TWICE under Biden because she did't attend class. She made this decision super easy for the Trump admin. At least show up to class. geez",
                "believe nothing from this administration.",
                "Free speech is under attack. It is absolutely insane that students are being arrested for voicing free speech against a foreign country.",
                "Although I am not an Orange Tyrant voter or anything like it, I do agree that people that over stay their visas are to be removed and furthermore if you are a guest on a student visa, you better behave or take it back to your home country",
                "Land of the free, ladies and gentlemen, where you can have your life destroyed for voicing outrage against atrocities committed by a foreign regime.",
                "Tiananmen Square vibes.   Temporary privileges getting taken away. (George C.)",
                "Well, I hope that the Trump voters are happy ending the \\~250 year American Republic. Free speech is pretty much always the first thing dictators attack when they take power, and it seems Trump won't be breaking with tradition on that front."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Hamas says it's willing to release the five American hostages in Gaza",
            "external_url": "https://www.npr.org/2025/03/14/nx-s1-5328124/hamas-american-hostages-gaza-israel",
            "upvotes": 128,
            "date": "03/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5184x2916+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F63%2F9f%2Fb7d6fa554b9cadfe30fbe7796fce%2Fgettyimages-2203988642.jpg",
            "top_comments": [
                "Its one alive and four bodies .",
                "[removed]"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "NJ police lieutenant accused of stealing drugs from evidence locker",
            "external_url": "https://www.nbcnewyork.com/new-jersey/nj-police-lieutenant-accused-of-stealing-drugs-from-evidence-locker/6184322/",
            "upvotes": 265,
            "date": "03/14/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/03/kevin-matthews.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                ">Investigators say Lt. Kevin Matthew has more than $600,000 in unexplained cash deposits in his bank accounts\n\nMaybe he should have spent some time working that that group that investigates money laundering before launching his criminal enterprise.\n\nOr crypto. Whatever.",
                "I assumed all cops did that.",
                "At least he didn't OD in the evidence locker like this guy. \n\n\nhttps://www.kolotv.com/2021/01/23/winnemucca-detective-overdoses-on-drugs-stolen-from-evidence/",
                "Surprised anyone is surprised. This is ridiculously common.",
                "I’m waiting to see him claim “qualified immunity” - “I didn’t know as a cop it was illegal to steal evidence from a locker so I shouldn’t be able to be prosecuted for this. \n\n“*Next* time a cop steals drugs from a cocaine locker they’ll know  it’s illegal and *then* we can charge them!”",
                "As a new jersian, this doesn't surprise me at all. Our cops are comically corrupt here.",
                "The drugs shouldn’t have been dressed that way",
                "Just like in 21 Jump Street when they were getting supplies for their party.\n\n\n\"We're trying to show them a good time, not ruin their lives!\"",
                "Fletch: \"Cops have the best dope.\"",
                "Discount Giancarlo Esposito. "
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Mark Carney sworn in as Canada’s PM after Trudeau steps down",
            "external_url": "https://www.cnn.com/2025/03/14/americas/canada-carney-prime-minister-trudeau-resigns-intl-latam?Date=20250314&Profile=cnnbrk&utm_content=1741967012&utm_medium=social&utm_source=twitter",
            "upvotes": 3285,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-09t233949z-1493832281-rc2s9daeyq4b-rtrmadp-3-canada-politics.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "As a Canadian, it's funny thinking how Trump thought Trudeau was using tariffs to hold on to power like a dictator, not understanding he already resigned and this is how the Canadian political process sometimes works. He simply talks out of his ass about everything he doesn't understand (which is a lot).",
                "Prime Minister Mark Carney is an extremely well educated and experienced man. I am wishing him the most success in steering our Country down the right path in these uncertain times.\n\nLong Live Canada 🇨🇦",
                "Trudeau may have not been great for Canada for a while domestically \n\nBut I really think he stepped up against Trump in the last few months in a way few others did \n\nHope the new guy is as resolute",
                "Finally.  A Carney to manage the Trump circus.",
                "I really hope Mark is the answer we have been looking for. Too many people in politics don’t understand the real world. This guy seems to get it.",
                "Trudeau seemingly got a lot of shit from Canadians for his domestic policies, but dude was a masterclass in Canadian international relations. Gonna miss seeing him on the news representing Canada.",
                "Damn, in my 22 years of living in Canada this is only the 3rd prime minister",
                "Now, let's see if Canadians can learn from the mistakes of our neighbors. Another Liberal gov( even a minority) will bury The CPC for years. They've placed all their eggs in the MAGA basket. After blowing a ~30 point lead PP would have to resign, and their is no heir apparent.\nI personally can't wait to see it.",
                "Finally, an expert who actually knows things running the show. A competent PhD in charge is infinitely better than the inconsistent and unprincipled career politicians/grifters that dominate politics in general.",
                "Pipelines baby.\nWill use lots of steel"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "U.S. stock market loses $5 trillion in value in three weeks",
            "external_url": "https://www.cnbc.com/2025/03/14/us-stock-market-loses-5-trillion-in-value-in-three-weeks.html",
            "upvotes": 3929,
            "date": "03/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108107173-1741956255184-108107173-17405057832025-02-25t164922z_514643967_rc2q1davpagh_rtrmadp_0_usa-stocks.jpg?v=1741956265&w=1920&h=1080",
            "top_comments": [
                "A quick google search indicates the US stock markets total valuation as of Jan 2025 is about 62 trillion. That is an 8% loss in less than a month largely due to the actions of 1 man. If your company discovered 1 employee was directly responsible for an 8% drop in revenue the speed with which they would be removed by any means might break the laws of physics.",
                "*Opinion pending, awaiting MAGA marching orders*",
                "What's amazing is that millions of adults don't seem to notice his industrial strength incompetency.",
                "Somebody said it right, *Actions speak louder than words*",
                "All of a sudden conservatives do not care about the stock market",
                "The rich guys have figured out how to get at everybody's tax dollars now.\n\n\nAnd you can bet they're all buying/selling in tandem with Trump's \"tariffs on/tariffs off\" cycles.",
                "Can't believe Biden did this",
                "100% the fault of chairman orange shitbag.",
                "This is just cover for a massive wealth transfer from the 99% to the ultra rich. Similar to when COVID crashed the markets.",
                "What baffles me the most out of this insanity is that everyone's still just letting it happen\n\n\nAre we finally ready for the gen strike that should've already happened? Should we just allow and even wait for the toddler to dump ALL the cereal onto the floor before intervening? \n\n\nWhy haven't we collectively realized yet that the longer we wait, exponentially more damage will occur? Damage we may never be able to reverse, if we survive this volatile time..."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Measles cases linked to Texas outbreak grows to 259, with just 2 among fully vaccinated people",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-grows-259-2/story?id=119799576",
            "upvotes": 311,
            "date": "03/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Truly the golden age here in the US.",
                "Since we are going backwards, What's next on menu? Civil war?",
                "As a kid, I wondered how an advanced civilization like Atlantis could possibly not exist anywhere. \n\nAs an adult, while I know Atlantis isn't real, I can totally understand how any advanced civilization could go bottoms up.\n\n  \nJust didn't think it would happen in my lifetime. And historians better call this the dumbest timeline.",
                "So. \n\n\nIs Texas planning on bringing back Polio, too?\n\n\nMaybe also Smallpox? Diphtheria? Hepatitis B?\n\n\nI'm so, so tired of science-denying ijuts.",
                "I thought there were dozens where status was unknown.   Have they figured it out?",
                "Today’s 36 new Texas cases is higher than the 25 new cases reported Tuesday, but lower than the 39 new cases reported last Friday.",
                "Make America Generally-Unwell Again.",
                "Said it before and will say it again. \n\nThe parents of unvaccinated children who get sick from measles should be charged with child abuse and/or endangerment. If the child dies they should be charged with first degree murder. If they want to claim it was \"God's will\" then they better be prepared to subpoena God to show up as a witness for their trial and testify that it was indeed preordained that this child would die of measles. Otherwise, fuck you, you allowed your child to contract (and die of) an easily preventable disease. That is, to me, textbook child abuse, and if the kid dies, considering you knew you could prevent it and still did nothing, that makes it premeditated murder. \n\nBut, it's Texas, so probably most of the parents of affected kids will profit off the death of their child by joining the anti-vax grift train and they'll be hailed as heroes for \"owning the libs\" by letting their child die a horrible death at a very young age.",
                "Is anyone surprised how few cases (relatively speaking) compared to how virulent this disease is?  Wouldn’t there be more than this by now, or is the reporting skewed by families not reporting cases unless they require significant medical intervention.  I guess most of the older population has immunity and it’s just the unvaccinated kids that are getting it?",
                "At least they don’t have to worry about autism now"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Newsmax agrees to pay $40m to settle defamation suit over false election claims",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/14/newsmax-smartmatic-settlement",
            "upvotes": 4390,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d293af4fb1c73e4056d80f11cbdb2cbc79938dc6/0_256_7689_4613/master/7689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b5e81cd116b62569b1e434137003bb",
            "top_comments": [
                "In case no one read past the headline, Newsmax is paying $40m to the voting machine maker Smartmatics.\n\nNewsmax claimed the election machines were compromised. Smartmatics sued for defamation. Newsmax lost the suit.\n\nThis is not the same as ABC/NBC paying Trump to settle their suit.",
                "So now both Fox News and also NewsMax have each had to pay millions of dollars for lying about the election. \n\nAnd conservatives still call every other station fake news",
                "After whatever Elon paid for the white house, this is the 2nd best deal of decade.",
                "Sounds like they got off awfully cheap to me.",
                "Is $40 mill significant or just a drop in the bucket?\n\nWhat's the precedent?",
                "Newsmax Breaking: Left-Wing Extremist Guardian Falsely Claims Newsmax Settled Lawsuit",
                "Wild how not one single \"election fraud\" claim has been prove true time and time again, with millions of dollars and man hours wasted on this bullshit, and yet your average Republican still can't admit it. \n\nSorry, not \"wild\", completely predictable and expected from my \"fiscally responsibility\" and \"personal responsibility\" friends.  Whatever it takes to appease god king Trump, eh?",
                "Newsmax is as bad as Fox, both are providing misinformation to the USA Citizens",
                "$40m seems about right as damages to Smartmatics. That's not nearly enough as damages to the USA.",
                "They aren’t news.  They are propaganda.  On top of the $40 million, they should be ordered to remove “News”from their company name"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Immigration officials arrest second person who participated in pro-Palestinian protests at Columbia",
            "external_url": "https://www.wftv.com/news/politics/columbias-mahmoud/W6PPLQLVY5DSLL7FMKN2XI2LYI/?outputType=amp",
            "upvotes": 307,
            "date": "03/14/2025",
            "thumbnail": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FE26T7XL4WACHU4HYKB5ERCKBYU.jpg?auth=5a0af1350facf60d9f6b189766c2aa27d84e7f45136c91a974eb02a9f9dc08fc&width=1200&height=630&smart=true",
            "top_comments": [
                "Immigration is super serious and overstaying a visa is super bad and you should be deported! \n\n\n\n...unless you're Musk",
                "I do think they're targeting these folks for being protesters, but to be clear:\n\n> Leqaa Kordia, a Palestinian from the West Bank, was arrested by immigration officers for overstaying her student visa, the Department of Homeland Security said.",
                "Her student visa was revoked three years ago for not attending classes... ",
                "Her student visa was revoked TWICE under Biden because she did't attend class. She made this decision super easy for the Trump admin. At least show up to class. geez",
                "believe nothing from this administration.",
                "Free speech is under attack. It is absolutely insane that students are being arrested for voicing free speech against a foreign country.",
                "Although I am not an Orange Tyrant voter or anything like it, I do agree that people that over stay their visas are to be removed and furthermore if you are a guest on a student visa, you better behave or take it back to your home country",
                "Land of the free, ladies and gentlemen, where you can have your life destroyed for voicing outrage against atrocities committed by a foreign regime.",
                "Tiananmen Square vibes.   Temporary privileges getting taken away. (George C.)",
                "Well, I hope that the Trump voters are happy ending the \\~250 year American Republic. Free speech is pretty much always the first thing dictators attack when they take power, and it seems Trump won't be breaking with tradition on that front."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Mark Carney sworn in as Canada’s PM after Trudeau steps down",
            "external_url": "https://www.cnn.com/2025/03/14/americas/canada-carney-prime-minister-trudeau-resigns-intl-latam?Date=20250314&Profile=cnnbrk&utm_content=1741967012&utm_medium=social&utm_source=twitter",
            "upvotes": 3288,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-09t233949z-1493832281-rc2s9daeyq4b-rtrmadp-3-canada-politics.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "As a Canadian, it's funny thinking how Trump thought Trudeau was using tariffs to hold on to power like a dictator, not understanding he already resigned and this is how the Canadian political process sometimes works. He simply talks out of his ass about everything he doesn't understand (which is a lot).",
                "Prime Minister Mark Carney is an extremely well educated and experienced man. I am wishing him the most success in steering our Country down the right path in these uncertain times.\n\nLong Live Canada 🇨🇦",
                "Trudeau may have not been great for Canada for a while domestically \n\nBut I really think he stepped up against Trump in the last few months in a way few others did \n\nHope the new guy is as resolute",
                "Finally.  A Carney to manage the Trump circus.",
                "I really hope Mark is the answer we have been looking for. Too many people in politics don’t understand the real world. This guy seems to get it.",
                "Trudeau seemingly got a lot of shit from Canadians for his domestic policies, but dude was a masterclass in Canadian international relations. Gonna miss seeing him on the news representing Canada.",
                "Damn, in my 22 years of living in Canada this is only the 3rd prime minister",
                "Now, let's see if Canadians can learn from the mistakes of our neighbors. Another Liberal gov( even a minority) will bury The CPC for years. They've placed all their eggs in the MAGA basket. After blowing a ~30 point lead PP would have to resign, and their is no heir apparent.\nI personally can't wait to see it.",
                "Finally, an expert who actually knows things running the show. A competent PhD in charge is infinitely better than the inconsistent and unprincipled career politicians/grifters that dominate politics in general.",
                "Pipelines baby.\nWill use lots of steel"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "Trump administration asks Australian universities to justify US funding",
            "external_url": "https://www.abc.net.au/news/2025-03-14/trump-administration-asks-australian-universities-funding/105053784",
            "upvotes": 1881,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/c549b683374ddd719ec861682aab5289?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=6&width=862&height=485&imformat=generic",
            "top_comments": [
                "It’s grant money… isn’t the justification in the grant application?",
                "Folks it’s research grants. The title was shorten for clicks\n\n“Trump administration asked to explain after Australian universities told to justify US-funded research grants” \n\nIt’s quite common for countries to collaborate on joint research in science and technology fields",
                "Reminder for anyone who may be unaware - federal grant applications already contained very lengthy and detailed justifications for pretty much every individual part of the research. \n\nIf it's been approved, it's because it was well vetted by handful of individual reviewers who can demand edits or clarification, then present the application to an entire board of specialists who review further, and then all issues have been adequately justified is the grant awarded. \n\nThis additional work created by the Trumo organization is wildly unecessary and inefficient.",
                "\"The document also asks... what steps they've taken against \"Christian persecution\" or to \"protect women and to defend against gender ideology.\"\"\n\nWhat the hell is this backwards hick garbage? The US is absolute clown town right now.",
                "Although the U.S. sending money to foreign universities can be questioned, it's becoming apparent with chaos taking over the dysfunctional U.S. government, there are more people beside Ol' Elon inside the Trump Administration with their personal agendas just doing whatever they want.",
                "Every great leader in history embraced institutions of public learning as a cornerstone of society.",
                "Yeah what a waste of money to help foster collaboration between American scientists/researchers/professors and the top minds and institutions Australia has to offer.\n\nGod fucking forbid we go a single day without shitting on one of our allies.",
                "So it's been a bit since I've had to apply for one, but as I recall, you justify the grant when you fucking apply for it, you orange piece of shit.",
                "\"You haven't taken any steps to make sure the events shown in Maximum Overdrive never happen? Guess we'll have to cut your funding.\"\n\n \"Did you slay the required number of greebles this month? No? We'll I'm sorry to say we can't fund your school anymore.\"",
                "Well did any of these universities ever consider saying thank you???"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Armenia and Azerbaijan agree to peace treaty after nearly four decades of war",
            "external_url": "https://www.cnn.com/2025/03/13/europe/armenia-and-azerbaijan-peace-agreement-conditions-intl-latam/index.html",
            "upvotes": 803,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1683926061.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The article doesn't state the reason for the diplomatic breakthrough after so many decades, but it seems to be a result of both Azerbaijan retaking Nagorno-Karabakh, and I'd assume Russian imperialism. It's probably best to settle your border disputes in order to focus on bigger picture threats.",
                "It's still sad that Azerbaijan managed to ethnically cleanse the Armenians of Nagorno-Karabakh.\n\n Almost no one knows about this because just 1 week later the Israel-Hamas war started, taking everyone's attention completely off of this conflict.",
                "“Now that we’ve ethnically cleansed your enclaves, let’s call it a draw.”",
                "Inb4 trump takes credit",
                "It says nearly 4 decades… people have had enough time to know about it. If it’s not Israel or Ukraine, nobody gives a shit.",
                "I visited both countries a couple of months ago - loved them both, nice people. Except for that corrupt cop in Baku.\n\nI have a YouTube with same name as my Reddit, if anyone’s interested. I’m a nomad that’s been to 40 countries.",
                "What a disgusting shame on europe that conflict has been.\n\nAzerbaijan has essentially been allowed to genocide Armenians, publically and proudly, and nothing was done.\n\nWe should have nuked Baku long ago.",
                "How will trump take credit for this…"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "RISING",
            "title": "NJ police lieutenant accused of stealing drugs from evidence locker",
            "external_url": "https://www.nbcnewyork.com/new-jersey/nj-police-lieutenant-accused-of-stealing-drugs-from-evidence-locker/6184322/",
            "upvotes": 265,
            "date": "03/14/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/03/kevin-matthews.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                ">Investigators say Lt. Kevin Matthew has more than $600,000 in unexplained cash deposits in his bank accounts\n\nMaybe he should have spent some time working that that group that investigates money laundering before launching his criminal enterprise.\n\nOr crypto. Whatever.",
                "I assumed all cops did that.",
                "At least he didn't OD in the evidence locker like this guy. \n\n\nhttps://www.kolotv.com/2021/01/23/winnemucca-detective-overdoses-on-drugs-stolen-from-evidence/",
                "Surprised anyone is surprised. This is ridiculously common.",
                "I’m waiting to see him claim “qualified immunity” - “I didn’t know as a cop it was illegal to steal evidence from a locker so I shouldn’t be able to be prosecuted for this. \n\n“*Next* time a cop steals drugs from a cocaine locker they’ll know  it’s illegal and *then* we can charge them!”",
                "As a new jersian, this doesn't surprise me at all. Our cops are comically corrupt here.",
                "The drugs shouldn’t have been dressed that way",
                "Just like in 21 Jump Street when they were getting supplies for their party.\n\n\n\"We're trying to show them a good time, not ruin their lives!\"",
                "Fletch: \"Cops have the best dope.\"",
                "Discount Giancarlo Esposito. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US consumer sentiment deteriorates sharply in March",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-deteriorates-sharply-march-2025-03-14/",
            "upvotes": 3487,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s almost like when the world is completely unpredictable and positions change by the second people are not able to plan for the future and are less likely to spend money outside of absolute needs. And it’s almost like when an economy is built entirely on the spending of its consumers and the confidence in systems that uncertainties hurt the whole economy.",
                "Strangely enough, my job being threatened by illegal NIH grant cuts has triggered me to stop spending money and hoard cash.\n\nThat $30k I had pegged to remodel my bathroom would be churning into the economy if not for that.",
                "If the government won’t govern why should consumers consume?",
                "Trump and his administration has done nothing but harm to our country and certainly has not done anything good or beneficial. Unnecessary spending is completely off the table for the foreseeable future in our house.",
                "Don’t underestimate how bad this is. \n\nYou can look at the historic data series, but once consumer sentiment falls, it takes a long time to get back to normal.\n\nAnd in an era where price signals, recession signals, and uncertainty signals are flashing, this could worsen an economic downturn.\n\nSource: economist.",
                "I am getting dizzy from all that winning....",
                "Yeah, levying sudden heavy federal sales taxes will do that. ",
                "Can't risk egregious spending right now. For all I know we're gonna be back to fighting in the Thunderdome for toilet paper any moment.",
                "I'm just buying necessities.",
                "It’s almost like a blatant and mediocre conman is POTUS"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Dollar General warns low-income Americans’ finances are getting worse",
            "external_url": "https://www.cnn.com/2025/03/13/business/dollar-general-shoppers-inflation/index.html",
            "upvotes": 17504,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1827147996-20250313141452450.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I grew up poor in the 80s, it must be frickin ruthless now.\n\nEdit: if my wife didn’t take care of me I’d be on the street. I’m a very lucky disabled person. Imagine making it in America on 800 bucks a month. It’s bonkers.\n\nEdit 2: imagine was a bad way to say it… I know people do it every day, my bad, I’m sorry.",
                "Dollar General is part of the problem.\n\n> True, the chain pays its workers industry-low wages in under-staffed stores that can be magnets for armed burglary. And yes, Dollar Store management targets economically struggling communities, focusing on customers who make less than $40,000 a year and visit the store multiple times a week. “The economy is continuing to create more of our core customer,” CEO Todd Vasos said in 2018.\n\n> But to those working class consumers, Dollar General promises to deliver “everyday low prices.” \n\n> In reality, without knowing it, customers are often paying Whole Foods prices for dollar store groceries. \n\n\nhttps://perfectunion.us/dollar-general-prices/",
                "In the 1960s, the gov't launched a War on Poverty. Today, it's fighting against the poor.",
                "To be fair, Dollar General giving people a bad price/unit because they can’t afford to buy the standard bulk sizes doesn’t help, but I digress.",
                "All while paying poverty wages and cutting hours so bad it's really not worth working for them",
                "So they’re thrilled to swoop in to open thousands more stores?\n\nYa that’s the ticket",
                "Because they are paying more for less at dollar general.",
                "Consumers making less than $50,000 a year are “pretty constrained,” she said, and “it’s also pretty, pretty challenging” for customers making less than $100,000 annually.\n\n\nCan confirm, it is pretty challenging.",
                "The phrasing of that headline reads like Dollar General has a sign on the door saying \"Just a heads up y'all bitches getting poorer everyday out here!\"",
                "Dollar general is a parasite on the ass of the lowest income families. No one should shop at dollar general."
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "03/14/2025 20:09:11 UTC"
}