{
    "posts": [
        {
            "category": "HOT",
            "title": "USDA withdraws plan to limit salmonella levels in raw poultry",
            "external_url": "https://www.foxla.com/news/usda-salmonella-levels-raw-poultry-usda-withdraws-plan?taid=680e9f8b3d26750001e41bef",
            "upvotes": 9070,
            "date": "04/29/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/gettyimages-1212195382.jpg?ve=1&tl=1",
            "top_comments": [
                "Wow. How is our president making America great again with this ?",
                "This is the largest disease vector experiment I have ever seen.  \n\nWhich billionaire owns the biowarfare companies?",
                "Is it good for health now?",
                "So.... USDA plans to increase salmonella levels in raw poultry?",
                "It has been some time since I suspected that US elites want to kill an entire generation of adults and harvest the assets of the dead with the hope their kids would become destitute and be forced into any kind of labour relation.\n\n\nI now firmly believe that.",
                "We're all about to learn why our grandparents boiled the shit out of everything",
                "wtf, chicken is one of the few meats some people can afford!\n\nohhhhhhhhhh,\n\nthese motherfuckers are straight up evil.",
                "And at the same time, try to bully Europe into buying that crap. \n\nAnd not incidentally, poison the Cubans with the 200k tons that gets exported there.",
                "And he thinks this will make other countries want to import his trash? What a moron.",
                "Wow\n\nWell, always remember 165°F and wash your cutting board, knives, and hands well after handling.\n\nBe especially careful about washing when preparing different items in the kitchen.  You don't want to handle the raw chicken and then unbag salads without washing.\n\nOf course, there's always a chance the bagged salad has Salmonella..... doh"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "UPS announces 20,000 job cuts, 73 facility closures as Amazon reduces volume",
            "external_url": "https://www.denver7.com/politics/economy/ups-announces-job-cuts-and-facility-closures-as-amazon-reduces-volume",
            "upvotes": 14976,
            "date": "04/29/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/2e70855/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5e%2Ff0%2Fdd74befa41c1b6008401f4110cd2%2Fshutterstock-2301462565.jpg",
            "top_comments": [
                "There's been a lot of layoff headlines recently, but I don't recall seeing one this big. 20,000 lost jobs hurts.",
                "Can't wait to hear the White House spin on this one",
                "> “As a trusted leader in global logistics, we will leverage our integrated network and trade expertise to assist our customers as they adapt to a changing trade environment. Further, the actions we are taking to reconfigure our network and reduce costs across our business could not be timelier. The macro environment may be uncertain, but with our actions, we will emerge as an even stronger, more nimble UPS.”\n\nGot to love when PR tries to put a positive spin on people losing their jobs in this economy.",
                "The slow slide into recession continues.  I'm trying to sock enough away to tank what's coming.",
                "I bet the tariff does not help.",
                "20,000 well paying jobs with good benefits and pensions out the door.  What an idiot.",
                ">Earlier this year, UPS announced that Amazon would reduce its volume by over 50% by mid-2026. Tomé stated that Amazon is UPS' largest partner. In January, Tomé noted that Amazon represented 11.8% of the company's total revenue.\n\nThat's not the steepest cut. But as Amazon goes, other companies will follow. Seems like UPS is getting ahead of the whole thing before the ~~recession~~ amazing economic opportunity hits.",
                "That's a hostile and political act, so I have heard.",
                "Marks slowing down economy, fear, moving away from US$, recession, financial crisis, and finally, collapse.",
                "Here it comes. It's like watching the Tsunami eventually come into shore after an earthquake. It's going to start hitting now. Amazon, Etsy, shipping companies, Boeing, and any trade related to Canada. Housing will be fucked as we strip our own national forests for lumber and realize we can't even mill it all to keep up with the lumber that used to come from Canada. Auto manufacturers will be fucked as they can't get parts. \n\nTrump and the Republicans are about to reap what they sowed."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 3018,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "Some kids do need a leash.",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Fictitious value before. Fictitious value after.",
                "Wait this is my time! I can finally put all the sleepless hours spent watching Baumgartner Restoration to use.",
                "It’s Rothko no one will be able to tell"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 5002,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "“Stop breaking the law asshole.”",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness.",
                "I see they're using the Church of Scientology strategy with the lawsuits. It's a bold move Cotton!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 3569,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "The white house would rather nuke itself.\n\nI'm all for this happening those women were undermined and harassed and deserve it. They did what I told specialists and consultants couldn't do.",
                "So what does the Coward-in-Chief have to say about that?",
                "In before White House rages at this. But besides sorting mail did they see combat I’m confused isn’t the Medal of Honour reserved for acts that go on the call of duty sort of a thing ???\n\nEdit ok my dumb ass thought this was the congressional medal of honour my brain read ahead. Apologies.",
                "There's a Netflix movie about this unit titled \"The Six Triple Eight\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "After killing unarmed man, Texas deputy told colleague: 'I just smoked a dude'",
            "external_url": "https://www.nbcnews.com/news/us-news/killing-unarmed-man-texas-deputy-told-colleague-just-smoked-dude-rcna194909",
            "upvotes": 34388,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250429-timothy-randall-mb-1057-678efa.jpg",
            "top_comments": [
                "The \"I just smoked a dude\" isn't even the worst part of this.\n\nThe video in the article is wild to watch.  The officer attacks the dude for no reason, falls to the ground with the suspect and then pulls out his gun and kills the guy.  The guy was barely \"fighting back\".  The fact that the officer was not prosecuted for this very obvious murder shows how bad our justice system is.",
                "How is this anything other than straight up murder. He murdered him. This is not an “officer involved shooting”. This officer murdered an innocent man.",
                "Does anyone know how all the police body cam footage is stored? \nEverytime one of these videos is released its after years of trials and a court order. That's got to be a massive amount of footage to keep on hand and safely away from the people who would want it destroyed to protect themselves. \n\nJust curious.",
                "Jesus. The same idiot who claims he fired because \"I saw him running at me so I shot\" when the victim is pretty clearly running AWAY probably shouldn't get to claim that he found a meth pipe on him off screen. \n\nDudes clearly not a reliable witness. Probably his personal pipe.",
                "If your police talk about killing someone in the same way as a child playing Fortnite, that should be a hint that your hiring policies need some major reform.",
                ">“I just smoked a dude,” he said in a hushed voice.\"\n\nHey, back the blue folks: can we at least agree that not *everyone* is cut out to be a cop?",
                "If you want to escalate a situation and make it far worse, just involve a cop. That’s their speciality.",
                ">Tippitt's lawyer, Joseph Oxman, was in his office in Philadelphia when he played the clip for the first time. He said at first he couldn’t believe what it showed. \n\n>“I think it’s the worst police shooting I’ve ever seen,” Oxman said. “It looks like an execution.”\n\nThey tried everything in the book to keep this video from being seen, and it's certainly clear why.  That poor man didn't have a chance, and begged and begged for fairness while doing everything the officer asked. There just aren't any words to describe how wrong this was.",
                "This could happen to literally ANYONE in America. This guy was pulled over for running through a stop sign. The cop told him to get out of the car, felt something in this guys pocket that he thought could be a gun (turns out he felt a glasses case). Throws him to the ground and shoots him because he was running away.\n\nHow many times in a week could you be pulled over for some incredibly minor traffic violation, or even just a perceived violation by an officer? Officer decides you need to get out of the car because he sees an open can of an energy drink he's never heard of and thinks it might be alcohol. He pats you down and feels your phone in your pocket, decides it's probably a gun and suplexes you to the ground without warning. You don't know what the hell is happening and your fight or flight instincts take over so you start to run away and the officer \"smokes\" you right there.",
                "This is 'warrior mindset'. They're at war with the citizens "
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court weighs whether law enforcement can be held accountable for raid on wrong house",
            "external_url": "https://www.npr.org/2025/04/29/g-s1-62787/supreme-court-law-enforcement-raid",
            "upvotes": 9544,
            "date": "04/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8457x4757+0+440/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2F8e%2F2138380345e084d68d3d74e848d4%2Fgettyimages-1260961721.jpg",
            "top_comments": [
                ">The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations. \n\nYes, these armed LEOs can't be expected to make the same high-stakes determinations as, say, the pizza delivery guy",
                "If the answer to this is \"no,\" then it sets a precedent that \"law enforcement is not responsible for making mistakes that harm innocent people.\"\n\n\nStrange that this is even a discussion, let alone an issue that has to be brought to the Supreme Court. ",
                "Look man, I’m not asking for the world - I would just like our heavily militarized law enforcement agencies to be held to the same address identification standards we hold our Uber Eats drivers to. That bar is already pretty low.",
                "The U.S. government typically benefits from “sovereign immunity,” meaning it can’t be sued. But Congress passed the Federal Tort Claims Act in 1946 making an exception to allow lawsuits against the federal government for harms caused by its employees. The statute was amended in 1974, partly in response to two high-profile wrong-house FBI raids.\n\nThe question for the Supreme Court on Tuesday is whether the statute, as amended, now allows victims to sue, period. Or can they sue only if the perpetrators of the raid were following government orders, here orders from the FBI.",
                "I am curious how this one is going to go. There are too many times the police knock on the wrong door and someone answers it with a gun and it doesn't go well for them and the cops are cleared for it.",
                "Everyday we expect millions of packages, delivery food items to go to the right address.... \n\nBut somehow that minimum expectation is a bar too high for a group of heavily armed para-military forces with the authority to kill citizens as they see fit.",
                "\"The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations.\"\n\nThe FBI trained them. If they can't read a f'n mailbox number, that is a failure to train their agents for 'stressful situations.'\n\nThe CIA can train their agents to resist torture and having their fingers cut off but FBI can't figure out how to get their agents composed enough to read a street address? What are we doing?",
                "If this comes back that oopsies don’t count, then they aren’t really accountable for anything.\n\nThey literally can go to the “wrong” house on purpose and just claim mistakes.\n\nThis should be a no-brainer.",
                "I would like law enforcement agencies to do the work and have a strong case before going in on a warrant. That includes verify the residence.",
                "Incoming 5-4 with some scathing dissent sprinkled in"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 2883,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine your kid dies just so you can own the libs.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "666 and they can summon RFK Jr directly",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "If only there was some way this could have been prevented.",
                "Texas has a health department?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "FDA to undo some layoffs, after cuts to inspections and drug safety",
            "external_url": "https://www.cbsnews.com/news/fda-to-reverse-some-layoffs-food-drug-safety/",
            "upvotes": 1501,
            "date": "04/29/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/07/06/6155b273-0a87-4d22-97d4-b6aa87e83e74/thumbnail/1200x630/5904df83378be2beb3922f98d71ffa3c/fda-reuters.jpg?v=fbebbf93950d87ce40fccd82890f0617",
            "top_comments": [
                "What a fucking shit show. Hope we at least get some of those cheap groceries we were promised.",
                "Now if only someone had actually taken the fucking time to make sure vital functions weren't being affected before rubbing one out from the giant throbbing erection they got from a session of seig heil salutes.",
                "Even if you’re the sort of person who supports these cost cutting efforts, how can you not be embarrassed that the party you voted in are so fucking bad at their jobs? As someone on the other side, it’s hilarious watching these idiots fail to tie their own shoe laces, but if I was a GOP voter, I’d be furious that my master had hired such complete buffoons.",
                "I don't know which is more the hallmark of MAGA republicans:\n* Their open scorn of anything remotely resembling empathy\n-or-\n* Their sheer fucking incompetence\n\nIt's like the head of every government agency is just cosplaying at it.",
                "What do you mean \"undo\"? This isn't a fucking Word document, some of these guys probably already moved on and said \"fuck it and fuck the government\". You can't just go around and fuck people's lives then hit ctrl-z and call it a day. Bunch of clowns running this country.",
                "Trump is doing the one thing that could hurt the Republican brand the most.\n\nShowing people that the government actually does a lot of important things",
                "So uh... what are the odds \"Please Return\" Bonuses are going to be a thing?",
                "If it were me I wouldn't come back. Any employment that you can lose for no reason isn't reliable enough. I wouldn't apply to a company that just had massive lay offs.",
                "Fucking morons.\nIf we survive this, I hope the new blood lords this over the GOP. \nPersonally I'd want everyone involved in this, Including senators, dragged before a court.",
                "How do you go back to that job knowing it all might disappear again in a few days when a higher up has another whim?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "GM recalling nearly 600,000 U.S. vehicles over engine issue",
            "external_url": "https://www.cnbc.com/2025/04/29/gm-recalling-nearly-600000-us-vehicles-over-engine-issue-.html",
            "upvotes": 1966,
            "date": "04/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108010371-1721739042622-gettyimages-2131332053-widak-dailylif240403_npMPx.jpeg?v=1745923263&w=1920&h=1080",
            "top_comments": [
                "It's for 2021 through 2024 model year Cadillac Escalade and Escalade ESV, Chevrolet Silverado 1500, Suburban, and Tahoe, GMC Sierra 1500, Yukon, and Yukon XL vehicles with 6.2L V8 gas engines.",
                "Lifters, Torque converter/transmission issues and now connecting rod?  Damn.",
                "Bad timing, Bad timing, specially when Tariffs have made it impossible to buy imported cars.",
                "Will Arnett,\n\n\"Introducing the GMC Sierra—where bold design meets questionable reliability. With cutting-edge features that work just long enough to impress your neighbor and powertrain issues engineered to keep your mechanic in business, it's the truck that dares to ask, “How soon can you get it back in the shop?  Built with the same commitment to “Professional Grade” you’ve come to fear.\"",
                "*It said the connecting rod and crankshaft engine components may have manufacturing defects that can lead to engine damage or failure.*\n\nThe Chevy Silverado, one of the recalled models, also happens to be among the very top crash-frequency cars.",
                "That’s why GM stand for  “Gran Mierda”",
                "They should be recalling every engine they’ve put out since 2010. Decade and a half of Equinox models that disappear a quart of oil every 500 miles and destroy the engine before the next oil change is due.",
                "the issue being that they have an engine made by GM",
                "Talk about rolling a nat 1",
                "Oh man! So glad that trump put tariffs on high quality import cars so we can buy these amazing machines!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Iraq arrests ISIS member accused of 'inciting' Bourbon Street attack; FBI says attacker acted alone",
            "external_url": "https://www.wbrz.com/news/iraqi-officials-arrest-suspected-isis-member-accused-of-inciting-bourbon-street-attack-in-new-orleans/",
            "upvotes": 318,
            "date": "04/29/2025",
            "thumbnail": "https://dcer237tfveol.cloudfront.net/v2/WSXSwiO6pPgiLFo98vBWLg4XUPkFbQM3kbx5AT53sPVji-Ka5Qlx19IDklplNrYQ_SCYY_InFgwSY8I6wZCuR3_OkqHH0qtGXIMmWdmcr6KQ",
            "top_comments": [
                "How can a member of ISIS \"act alone\" in a bombing.... that doesn't make any sense to me",
                "Maybe I’m just uninformed and naive, but I never expected to see a story where Iraq arrested an ISIS member, let alone one who committed crimes in the US"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 3020,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "Some kids do need a leash.",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Fictitious value before. Fictitious value after.",
                "Wait this is my time! I can finally put all the sleepless hours spent watching Baumgartner Restoration to use.",
                "It’s Rothko no one will be able to tell"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "A man airlifted from Japan's Mount Fuji returns to the slope days later and is rescued again",
            "external_url": "https://apnews.com/article/japan-mount-fuji-rescue-climber-student-bc1fcc11150238dee96370697944991b",
            "upvotes": 566,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Susan Collins:\" I'm sure he's learned his lesson now.\"",
                "After I got rescued, I knew to NEVER go down that slope again. \n\n\nThankfully no airlift was involved but it was embarrassing as shit. ",
                "You may see foolishness. I see determination.",
                "Those flights aren't cheap. Charge him for the cost. He can keep going until he is broke.",
                "This mountain is basically non-technical walk up and they force you onto the established trails. There are mountain huts with rooms, food and water like every 300m of vertical. Since your starting about half way up the actual mountain, the vertical is only about 4000ft and doable in 2 or three days. \n\nThe only reason I would think you would need an airlift would be traumatic injury, hypothermia or cerebral edema from the altitude (which is only like 12,000 ft. Many mountains in the US rockies and sierras are taller).",
                "He just can’t get enough",
                "Imagine if he was airlifted twice in the U.S.",
                "To retrieve his phone. He should be billed for the costs of the second rescue.",
                "One time is a mistake.  Second time is rank idiocy.\n\nThey should be paying the costs associated with their rank idiocy.",
                "Twice the pride, double the fall"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "FDA to undo some layoffs, after cuts to inspections and drug safety",
            "external_url": "https://www.cbsnews.com/news/fda-to-reverse-some-layoffs-food-drug-safety/",
            "upvotes": 1500,
            "date": "04/29/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/07/06/6155b273-0a87-4d22-97d4-b6aa87e83e74/thumbnail/1200x630/5904df83378be2beb3922f98d71ffa3c/fda-reuters.jpg?v=fbebbf93950d87ce40fccd82890f0617",
            "top_comments": [
                "What a fucking shit show. Hope we at least get some of those cheap groceries we were promised.",
                "Now if only someone had actually taken the fucking time to make sure vital functions weren't being affected before rubbing one out from the giant throbbing erection they got from a session of seig heil salutes.",
                "Even if you’re the sort of person who supports these cost cutting efforts, how can you not be embarrassed that the party you voted in are so fucking bad at their jobs? As someone on the other side, it’s hilarious watching these idiots fail to tie their own shoe laces, but if I was a GOP voter, I’d be furious that my master had hired such complete buffoons.",
                "I don't know which is more the hallmark of MAGA republicans:\n* Their open scorn of anything remotely resembling empathy\n-or-\n* Their sheer fucking incompetence\n\nIt's like the head of every government agency is just cosplaying at it.",
                "What do you mean \"undo\"? This isn't a fucking Word document, some of these guys probably already moved on and said \"fuck it and fuck the government\". You can't just go around and fuck people's lives then hit ctrl-z and call it a day. Bunch of clowns running this country.",
                "Trump is doing the one thing that could hurt the Republican brand the most.\n\nShowing people that the government actually does a lot of important things",
                "So uh... what are the odds \"Please Return\" Bonuses are going to be a thing?",
                "If it were me I wouldn't come back. Any employment that you can lose for no reason isn't reliable enough. I wouldn't apply to a company that just had massive lay offs.",
                "Fucking morons.\nIf we survive this, I hope the new blood lords this over the GOP. \nPersonally I'd want everyone involved in this, Including senators, dragged before a court.",
                "How do you go back to that job knowing it all might disappear again in a few days when a higher up has another whim?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 2882,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine your kid dies just so you can own the libs.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "666 and they can summon RFK Jr directly",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "If only there was some way this could have been prevented.",
                "Texas has a health department?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 3569,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "The white house would rather nuke itself.\n\nI'm all for this happening those women were undermined and harassed and deserve it. They did what I told specialists and consultants couldn't do.",
                "So what does the Coward-in-Chief have to say about that?",
                "In before White House rages at this. But besides sorting mail did they see combat I’m confused isn’t the Medal of Honour reserved for acts that go on the call of duty sort of a thing ???\n\nEdit ok my dumb ass thought this was the congressional medal of honour my brain read ahead. Apologies.",
                "There's a Netflix movie about this unit titled \"The Six Triple Eight\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "GM recalling nearly 600,000 U.S. vehicles over engine issue",
            "external_url": "https://www.cnbc.com/2025/04/29/gm-recalling-nearly-600000-us-vehicles-over-engine-issue-.html",
            "upvotes": 1964,
            "date": "04/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108010371-1721739042622-gettyimages-2131332053-widak-dailylif240403_npMPx.jpeg?v=1745923263&w=1920&h=1080",
            "top_comments": [
                "It's for 2021 through 2024 model year Cadillac Escalade and Escalade ESV, Chevrolet Silverado 1500, Suburban, and Tahoe, GMC Sierra 1500, Yukon, and Yukon XL vehicles with 6.2L V8 gas engines.",
                "Lifters, Torque converter/transmission issues and now connecting rod?  Damn.",
                "Bad timing, Bad timing, specially when Tariffs have made it impossible to buy imported cars.",
                "Will Arnett,\n\n\"Introducing the GMC Sierra—where bold design meets questionable reliability. With cutting-edge features that work just long enough to impress your neighbor and powertrain issues engineered to keep your mechanic in business, it's the truck that dares to ask, “How soon can you get it back in the shop?  Built with the same commitment to “Professional Grade” you’ve come to fear.\"",
                "*It said the connecting rod and crankshaft engine components may have manufacturing defects that can lead to engine damage or failure.*\n\nThe Chevy Silverado, one of the recalled models, also happens to be among the very top crash-frequency cars.",
                "That’s why GM stand for  “Gran Mierda”",
                "They should be recalling every engine they’ve put out since 2010. Decade and a half of Equinox models that disappear a quart of oil every 500 miles and destroy the engine before the next oil change is due.",
                "the issue being that they have an engine made by GM",
                "Talk about rolling a nat 1",
                "Oh man! So glad that trump put tariffs on high quality import cars so we can buy these amazing machines!"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 5004,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "“Stop breaking the law asshole.”",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness.",
                "I see they're using the Church of Scientology strategy with the lawsuits. It's a bold move Cotton!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "'Spain, Portugal switch back on, seek answers after biggest ever blackout' - no cyber-attack & renewables not to blame",
            "external_url": "https://www.reuters.com/world/europe/spains-power-generation-nearly-back-normal-after-monday-blackout-says-grid-2025-04-29/",
            "upvotes": 475,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some poor person or animal got Zapped by 15 GW all at once. \n\nNothing left to see.",
                "They are very much going to blame renewable energy not themselves for neglecting infrastructure.",
                "First of all: most of the infrastructure is handled by private companies. The government is requesting answers from them right now and preparing independent investigations. Meaning the explanation given so far ( the solar power stuff) is not enough.\n\nSecond of all: latest comments of the government make it crystal clear, they DO NOT rule our any possibility yet. Including a cyber attack.\n\nSource:\n\nhttps://elpais.com/sociedad/2025-04-29/lo-que-se-sabe-y-no-del-apagon-masivo-red-electrica-niega-un-ciberataque-mientras-el-gobierno-se-resiste-a-descartar-nada.html",
                "Have they considered blaming DEI?",
                "> \"Induced atmospheric vibration\" is a term that has been used by Portugal's grid operator, REN, to describe a potential cause of the widespread power outage in Spain and Portugal on April 28, 2025.\n\nThe mechanical oscillation frequency of a span of cable is nowhere near the line frequency.\n\nSounds like an invented excuse.\n\nTypically bad management or faulty sensors leads to voltage excursions and oscillations.\n\nGenerator turbines are HUGE hunks of metal with a lot of inertia.  They don't change speed fast enough to cause a significant oscillation.  It takes several minutes to start a turbine.\n\nNeither does demand change rapidly.  Distribution switches are not very fast, and tend to fail closed (on, with contacts welded) not intermittent.",
                "If it was an attack there is a lot of reasons for a country to not reveal this at this time, for what it's worth.\n\nBasically nobody knows but what is being said openly right now doesn't make a whole lot of sense.",
                "I’m pretty sure it was Texas windmills that caused this.",
                "Everyone knows windmills can't work at night. That's just science.",
                "If anything, blackouts like these really make you think twice about getting solar panels and battery backups or generators...",
                "This would be some next level advertising for a new season of Money Heist."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Former school athletic director gets 4 months in jail in racist AI deepfake case",
            "external_url": "https://apnews.com/article/racist-ai-recording-maryland-high-school-487ea673b0449077cb23e7970546cb9f",
            "upvotes": 746,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Despite receiving a relatively short sentence, Darien could remain incarcerated longer as he faces a separate federal case in which he’s accused of sexual exploitation of children and possession of child sexual abuse material. Authorities said they discovered evidence of those crimes while searching Darien’s phone and other devices.\n\nI just don't have words. Dude was upset his contract wasn't getting renewed because of poor performance. So step one was to create a deepfake of the principal saying racist/antisemitic things. As if that what's going to solve the problem. Then, because of course he's the kind of guy, they find child sex abuse material on his computer.",
                ">Despite receiving a relatively short sentence, Darien could remain incarcerated longer as he faces a separate federal case in which he’s accused of sexual exploitation of children and possession of child sexual abuse material. Authorities said they discovered evidence of those crimes while searching Darien’s phone and other devices.\n\nLmfao he tried to frame his boss and got discovered for having CP. Fucking Imbecile.",
                "He should have gotten more time",
                "Love when my alma mater makes the news",
                "Expect profuse increase in AI deep fakes - audio and video. That toothpaste ain’t going back in the tube. Hopefully, most of us possess the critical thinking to keep from being a victim, but the con will no doubt fool many out of some cash. Think for yourselves friends.",
                "lol I’m not defending this guy but isn’t Trump always whining about Europe arresting people for “jokes”?",
                "You guys are behind, Stavvys World reported on this during Kush Brothers a few weeks back."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 4993,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "“Stop breaking the law asshole.”",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness.",
                "I see they're using the Church of Scientology strategy with the lawsuits. It's a bold move Cotton!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 2881,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine your kid dies just so you can own the libs.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "666 and they can summon RFK Jr directly",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "If only there was some way this could have been prevented.",
                "Texas has a health department?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "FDA to undo some layoffs, after cuts to inspections and drug safety",
            "external_url": "https://www.cbsnews.com/news/fda-to-reverse-some-layoffs-food-drug-safety/",
            "upvotes": 1503,
            "date": "04/29/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/07/06/6155b273-0a87-4d22-97d4-b6aa87e83e74/thumbnail/1200x630/5904df83378be2beb3922f98d71ffa3c/fda-reuters.jpg?v=fbebbf93950d87ce40fccd82890f0617",
            "top_comments": [
                "What a fucking shit show. Hope we at least get some of those cheap groceries we were promised.",
                "Now if only someone had actually taken the fucking time to make sure vital functions weren't being affected before rubbing one out from the giant throbbing erection they got from a session of seig heil salutes.",
                "Even if you’re the sort of person who supports these cost cutting efforts, how can you not be embarrassed that the party you voted in are so fucking bad at their jobs? As someone on the other side, it’s hilarious watching these idiots fail to tie their own shoe laces, but if I was a GOP voter, I’d be furious that my master had hired such complete buffoons.",
                "I don't know which is more the hallmark of MAGA republicans:\n* Their open scorn of anything remotely resembling empathy\n-or-\n* Their sheer fucking incompetence\n\nIt's like the head of every government agency is just cosplaying at it.",
                "What do you mean \"undo\"? This isn't a fucking Word document, some of these guys probably already moved on and said \"fuck it and fuck the government\". You can't just go around and fuck people's lives then hit ctrl-z and call it a day. Bunch of clowns running this country.",
                "Trump is doing the one thing that could hurt the Republican brand the most.\n\nShowing people that the government actually does a lot of important things",
                "So uh... what are the odds \"Please Return\" Bonuses are going to be a thing?",
                "If it were me I wouldn't come back. Any employment that you can lose for no reason isn't reliable enough. I wouldn't apply to a company that just had massive lay offs.",
                "Fucking morons.\nIf we survive this, I hope the new blood lords this over the GOP. \nPersonally I'd want everyone involved in this, Including senators, dragged before a court.",
                "How do you go back to that job knowing it all might disappear again in a few days when a higher up has another whim?"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Iraq arrests ISIS member accused of 'inciting' Bourbon Street attack; FBI says attacker acted alone",
            "external_url": "https://www.wbrz.com/news/iraqi-officials-arrest-suspected-isis-member-accused-of-inciting-bourbon-street-attack-in-new-orleans/",
            "upvotes": 316,
            "date": "04/29/2025",
            "thumbnail": "https://dcer237tfveol.cloudfront.net/v2/WSXSwiO6pPgiLFo98vBWLg4XUPkFbQM3kbx5AT53sPVji-Ka5Qlx19IDklplNrYQ_SCYY_InFgwSY8I6wZCuR3_OkqHH0qtGXIMmWdmcr6KQ",
            "top_comments": [
                "How can a member of ISIS \"act alone\" in a bombing.... that doesn't make any sense to me",
                "Maybe I’m just uninformed and naive, but I never expected to see a story where Iraq arrested an ISIS member, let alone one who committed crimes in the US"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 3570,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "The white house would rather nuke itself.\n\nI'm all for this happening those women were undermined and harassed and deserve it. They did what I told specialists and consultants couldn't do.",
                "So what does the Coward-in-Chief have to say about that?",
                "In before White House rages at this. But besides sorting mail did they see combat I’m confused isn’t the Medal of Honour reserved for acts that go on the call of duty sort of a thing ???\n\nEdit ok my dumb ass thought this was the congressional medal of honour my brain read ahead. Apologies.",
                "There's a Netflix movie about this unit titled \"The Six Triple Eight\""
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "USDA withdraws plan to limit salmonella levels in raw poultry",
            "external_url": "https://www.foxla.com/news/usda-salmonella-levels-raw-poultry-usda-withdraws-plan?taid=680e9f8b3d26750001e41bef",
            "upvotes": 9062,
            "date": "04/29/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/gettyimages-1212195382.jpg?ve=1&tl=1",
            "top_comments": [
                "Wow. How is our president making America great again with this ?",
                "This is the largest disease vector experiment I have ever seen.  \n\nWhich billionaire owns the biowarfare companies?",
                "Is it good for health now?",
                "So.... USDA plans to increase salmonella levels in raw poultry?",
                "It has been some time since I suspected that US elites want to kill an entire generation of adults and harvest the assets of the dead with the hope their kids would become destitute and be forced into any kind of labour relation.\n\n\nI now firmly believe that.",
                "We're all about to learn why our grandparents boiled the shit out of everything",
                "wtf, chicken is one of the few meats some people can afford!\n\nohhhhhhhhhh,\n\nthese motherfuckers are straight up evil.",
                "And at the same time, try to bully Europe into buying that crap. \n\nAnd not incidentally, poison the Cubans with the 200k tons that gets exported there.",
                "And he thinks this will make other countries want to import his trash? What a moron.",
                "Wow\n\nWell, always remember 165°F and wash your cutting board, knives, and hands well after handling.\n\nBe especially careful about washing when preparing different items in the kitchen.  You don't want to handle the raw chicken and then unbag salads without washing.\n\nOf course, there's always a chance the bagged salad has Salmonella..... doh"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "A man airlifted from Japan's Mount Fuji returns to the slope days later and is rescued again",
            "external_url": "https://apnews.com/article/japan-mount-fuji-rescue-climber-student-bc1fcc11150238dee96370697944991b",
            "upvotes": 564,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Susan Collins:\" I'm sure he's learned his lesson now.\"",
                "After I got rescued, I knew to NEVER go down that slope again. \n\n\nThankfully no airlift was involved but it was embarrassing as shit. ",
                "You may see foolishness. I see determination.",
                "Those flights aren't cheap. Charge him for the cost. He can keep going until he is broke.",
                "This mountain is basically non-technical walk up and they force you onto the established trails. There are mountain huts with rooms, food and water like every 300m of vertical. Since your starting about half way up the actual mountain, the vertical is only about 4000ft and doable in 2 or three days. \n\nThe only reason I would think you would need an airlift would be traumatic injury, hypothermia or cerebral edema from the altitude (which is only like 12,000 ft. Many mountains in the US rockies and sierras are taller).",
                "He just can’t get enough",
                "Imagine if he was airlifted twice in the U.S.",
                "To retrieve his phone. He should be billed for the costs of the second rescue.",
                "One time is a mistake.  Second time is rank idiocy.\n\nThey should be paying the costs associated with their rank idiocy.",
                "Twice the pride, double the fall"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court weighs whether law enforcement can be held accountable for raid on wrong house",
            "external_url": "https://www.npr.org/2025/04/29/g-s1-62787/supreme-court-law-enforcement-raid",
            "upvotes": 9549,
            "date": "04/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8457x4757+0+440/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2F8e%2F2138380345e084d68d3d74e848d4%2Fgettyimages-1260961721.jpg",
            "top_comments": [
                ">The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations. \n\nYes, these armed LEOs can't be expected to make the same high-stakes determinations as, say, the pizza delivery guy",
                "If the answer to this is \"no,\" then it sets a precedent that \"law enforcement is not responsible for making mistakes that harm innocent people.\"\n\n\nStrange that this is even a discussion, let alone an issue that has to be brought to the Supreme Court. ",
                "Look man, I’m not asking for the world - I would just like our heavily militarized law enforcement agencies to be held to the same address identification standards we hold our Uber Eats drivers to. That bar is already pretty low.",
                "The U.S. government typically benefits from “sovereign immunity,” meaning it can’t be sued. But Congress passed the Federal Tort Claims Act in 1946 making an exception to allow lawsuits against the federal government for harms caused by its employees. The statute was amended in 1974, partly in response to two high-profile wrong-house FBI raids.\n\nThe question for the Supreme Court on Tuesday is whether the statute, as amended, now allows victims to sue, period. Or can they sue only if the perpetrators of the raid were following government orders, here orders from the FBI.",
                "I am curious how this one is going to go. There are too many times the police knock on the wrong door and someone answers it with a gun and it doesn't go well for them and the cops are cleared for it.",
                "Everyday we expect millions of packages, delivery food items to go to the right address.... \n\nBut somehow that minimum expectation is a bar too high for a group of heavily armed para-military forces with the authority to kill citizens as they see fit.",
                "\"The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations.\"\n\nThe FBI trained them. If they can't read a f'n mailbox number, that is a failure to train their agents for 'stressful situations.'\n\nThe CIA can train their agents to resist torture and having their fingers cut off but FBI can't figure out how to get their agents composed enough to read a street address? What are we doing?",
                "If this comes back that oopsies don’t count, then they aren’t really accountable for anything.\n\nThey literally can go to the “wrong” house on purpose and just claim mistakes.\n\nThis should be a no-brainer.",
                "I would like law enforcement agencies to do the work and have a strong case before going in on a warrant. That includes verify the residence.",
                "Incoming 5-4 with some scathing dissent sprinkled in"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 3016,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "Some kids do need a leash.",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "Fictitious value before. Fictitious value after.",
                "Wait this is my time! I can finally put all the sleepless hours spent watching Baumgartner Restoration to use.",
                "It’s Rothko no one will be able to tell"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "GM recalling nearly 600,000 U.S. vehicles over engine issue",
            "external_url": "https://www.cnbc.com/2025/04/29/gm-recalling-nearly-600000-us-vehicles-over-engine-issue-.html",
            "upvotes": 1965,
            "date": "04/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108010371-1721739042622-gettyimages-2131332053-widak-dailylif240403_npMPx.jpeg?v=1745923263&w=1920&h=1080",
            "top_comments": [
                "It's for 2021 through 2024 model year Cadillac Escalade and Escalade ESV, Chevrolet Silverado 1500, Suburban, and Tahoe, GMC Sierra 1500, Yukon, and Yukon XL vehicles with 6.2L V8 gas engines.",
                "Lifters, Torque converter/transmission issues and now connecting rod?  Damn.",
                "Bad timing, Bad timing, specially when Tariffs have made it impossible to buy imported cars.",
                "Will Arnett,\n\n\"Introducing the GMC Sierra—where bold design meets questionable reliability. With cutting-edge features that work just long enough to impress your neighbor and powertrain issues engineered to keep your mechanic in business, it's the truck that dares to ask, “How soon can you get it back in the shop?  Built with the same commitment to “Professional Grade” you’ve come to fear.\"",
                "*It said the connecting rod and crankshaft engine components may have manufacturing defects that can lead to engine damage or failure.*\n\nThe Chevy Silverado, one of the recalled models, also happens to be among the very top crash-frequency cars.",
                "That’s why GM stand for  “Gran Mierda”",
                "They should be recalling every engine they’ve put out since 2010. Decade and a half of Equinox models that disappear a quart of oil every 500 miles and destroy the engine before the next oil change is due.",
                "the issue being that they have an engine made by GM",
                "Talk about rolling a nat 1",
                "Oh man! So glad that trump put tariffs on high quality import cars so we can buy these amazing machines!"
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "04/30/2025 00:43:00 UTC"
}