{
    "posts": [
        {
            "category": "HOT",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 12970,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                "The GOP has wanted to privatize Social Security since Reagan.",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Tariffs on Canadian goods having a 'devastating effect,' U.S. farmers say | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/manitoba/canada-us-tariffs-north-south-dakota-farmers-1.7502342",
            "upvotes": 2275,
            "date": "04/06/2025",
            "thumbnail": "https://i.cbc.ca/1.7394028.1732660838!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/combining-in-manitoba-one-day-before-rail-strike-also-grain-elev.jpg?im=Resize%3D620",
            "top_comments": [
                "> \"This was just a horrible idea,\" he said.\" Whoever thought that tariffs were good for the country, they really don't understand civics and/or economics very well.\" \nSombke said 90 per cent of the state's potash — which is used as a fertilizer and is currently being tariffed at 10 per cent — comes from Canada, while much of its farming equipment carries a \"made in Canada\" stamp.\n\nIt's almost like going isolationist in a global economy is a bad idea. There are goods and raw materials we will never be able to produce here in volume. I don't have a lot of sympathy for people who voted for this, but I do feel concerned about how even more smaller family farms will vanish. Industrial scale farming will enjoy buying up land.",
                "ND/SD overwhelmingly voted for him. \n\nNot sure what more to tell you.",
                "I like how the article mentioned how those states voted. 2/3rds voted for what they're getting.",
                "Land doesn't vote, but farmers do, and they overwhelmingly vote R. I feel bad for those few who have the sense not to.",
                "Why do i feel many would willingly vote for Trump all over again, as their savings evaporate...",
                "Trump's tariffs in his first term resulted in the largest closing of family farms since the Great Depression, and that was when he was only fucking with Canada and Mexico. Couple his new tariffs with the cuts at the USDA and USAID, and we are likely to see the very existence of family farms in the United States become an endangered species. Makes me wonder how tight Fat Donny is with the industrial agriculture industry.",
                "It's okay, just ask Trump for money like last time.",
                ">In North Dakota, where Trump took nearly 68 per cent of the vote\n\nYou think farmers would understand how to reap what they sow.",
                "Yeah they all voted for trump, cry me a River",
                "Yet all over the country you see Farmers for Trump signs. Fuck them. Morons."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 2600,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive.",
                "Maybe Trump will pop by and toss some paper towels around."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 1217,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "The one star state continues to show why education is important.",
                "Texas: torturing and murdering their children in the name of Freedumb.",
                "Now that child will never be at risk for autism. Mission accomplished. ",
                "My father told me about how sick he was as a boy when he had the measles. He had high fever and it was horrible. If children are dying, others are going through terrible suffering."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 7166,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Foreplay lasted 85 years! 🤣",
                "Feels like about the age I’ll be ready to have kids",
                "Wait till they find out how expensive is it to raise kids.",
                "In this economy??!?!",
                "Isn't this actually amazing news for the species?",
                "I take my son to the zoo every other weekend. Those tortoises are banging EVERYTIME we go."
            ],
            "aggregate_sentiment": 100.0
        },
        {
            "category": "HOT",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 576,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day....",
                "Snippet from this news article:”Nova Scotia Health conducted a campaign in November to attract United States health-care workers to the region, generating more than 500 nursing leads and five new hires.“The purpose of the campaign was to heighten our engagement directly with the U.S leads as a direct result of the current political climate. We are seeing this as an opportunity and we have tangible success stories that have confirmed the value that this campaign has,” says Laura O’Brien, Nova Scotia Health manager of recruitment services. \n\n“We are learning from the high interest that our recruitment efforts are working, health-care professionals and nurses are worried about the uncertainties in the American health-care system. The interest has been so, so much more and we are taking advantage of that.”\n\t•\tDownload the CTV News App for breaking news alerts and video on all the top stories\nNova Scotia Health says it received 65 serious inquiries from U.S. health-care workers that asked about licensing“What’s been great so far in seeing the results from this campaign is that we are seeing experienced nurses and experienced health-care workers. As recruiters here in Nova Scotia, student engagement is one of our top priorities but it is great to have as many graduates as we possibly can but we need those experienced professionals as well and this is giving us an opportunity to leverage that,” says O’Brien. \n\nHealth-care workers could be looking to leave the United States for a variety of reasons, but Nova Scotia Health believe politics is playing a part.“The number one reason is they are feeling uncertain, they’re feeling very uncomfortable depending on their current situation and how they are being portrayed. And I think they just don’t see a future for themselves anymore in that country,” says O’Brien. Roughly 30 per cent of the province’s recruitment is international and Nova Scotia Health has seen a recent uptick in interest from the U.S.“It really started in March of 2023 when Nova Scotia became the first province to allow U.S board-certified physicians to practice in Nova Scotia with additional certifications, so we saw an uptick then and really double the numbers of U.S physicians,” says Katrina Philopoulos, Nova Scotia Health physician recruitment director.",
                "Come on up!  The more the merrier :D",
                "Now would be the perfect time for a brain-drain of America.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "I thought no doctor from the US would want to move to Canada because they make so much more here /s"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis makes surprise public appearance after getting discharged two weeks ago",
            "external_url": "https://edition.cnn.com/2025/04/06/europe/pope-francis-health-public-vatican-intl?Date=20250406&Profile=CNN&utm_content=1743934219&utm_medium=social&utm_source=facebook&fbclid=IwY2xjawJfToJleHRuA2FlbQIxMQABHoP5pJcQROaoRVpqiDTkaJ0vGIM65ybjbzk_adKkzLn7LGt_AiwsTIBpEW5c_aem_L-j25aAUCgGgPtUDbqAPTA",
            "upvotes": 704,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25096352959850.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I strongly oppose the Catholic Church but I do believe Francis is a good man, and I'm happy to see he's feeling well enough.\n\nI think the movie Conclave (for as much as the Church condemns it) hit the nail on the head. This is a pivotal time for the Church, and it's going to be interesting to see just how measurable the divide that Francis and the other \"liberal\" church members have created. Is there another schism in the works? Could very well be. Catholics can't agree on anything, ever. I should know, I was one for decades.",
                "I'll certainly miss having Pope Francis as the pope when he passes. For all the complaints people seem to have with him, there's no doubt in my mind the Church will swing radically in the opposite direction — as they did after Benedict XVI — and I doubt that'll give the Church any better PR. He's certainly done more to embody core Christian virtues than many popes.",
                "Healthy as a fuckin rhino this guy",
                "Be nice if he actually did something about the corruption in the Catholic Church.  Just another super rich figurehead",
                "Looks like the cockroach guy from MIB",
                "Don't forget kids, do as the Pope asks and pray for the Dugin family.",
                "Discharge and pope shouldn’t be in the same sentence.",
                "He heard there were young kids present?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 10489,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "Weird time to try something.\n\n> ... the East Block houses the offices of senators and their staff, but there is little activity on the Hill because Parliament is dissolved for the ongoing federal election.",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks.",
                "jd vance peeking in the windows",
                ">The barricaded man call at East Block has ended without incident,” Ottawa police said on X. “One man is in custody. The @ottawapolice criminal investigation is ongoing and an update will be provided in the morning. We thank the public for its cooperation.”  \n\n\nokay then.   back to the buying Canadian. ",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                "Pierre Poilievres new campaign strat.",
                "Send in Kevin Vickers!",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "Send for Rowsdower, ON THE DOUBLE!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "5 nurses who work on the same floor at Massachusetts hospital have brain tumors",
            "external_url": "https://www.nbcnews.com/news/rcna199798",
            "upvotes": 27256,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-newton-mass-general-brigham-newton-wellesley-hospital-google-ac-754p-6d4eef.jpg",
            "top_comments": [
                "11 employees all on the maternity ward experienced illness - I wonder what the symptoms of the other six were",
                "Reminds me of the [Kramatorsk incident where residents were exposed to gamma radiation](https://en.m.wikipedia.org/wiki/Kramatorsk_radiological_accident) due to a capsule containing highly radioactive caesium-17 being in their walls. Residents kept succumbing to leukaemia.",
                "This happened to me. Four men on our block got brain tumours within a couple year span. All of us lived on the south side of the street. We all had different types of tumours. I was the only one that survived. One of them was Canadian rock legend Gord Downey of the Tragically Hip.",
                "I wonder if they all sat in the same area at work?  \n\n\nPerhaps near a shared wall with an imaging department that was not constructed properly?",
                "When i worked in pediatric hematology/oncology as a study coordinator, one of my tasks was maintaining the cancer registry. Basically, any time someone is diagnosed with cancer, it would be put in to the state, and there were things like zip code, date, and other stuff tracked. It was purely because if stuff like this. If ever there were 3 or more cancer patients with similar/the same type of cancer in a certain zip code/area, the state and CDC would send investigators. And, now that RFK Jr and Elon are in charge, that shit will end. And it will be really really bad.",
                "In case anyone didn’t read the article, it’s three different types of benign tumor, which would not meet the definition of a cancer cluster",
                "I ran this by a doctor friend and her take was that a lot of seeming cancer clusters end up being nothing, and it's possible that screening went way up once people started worrying so they found benign tumors that would never have been found otherwise. She thought it would be more likely that there would be a variety of different cancers if you were really dealing with some kind of radiation exposure. \n\n\nI don't know, but it was a possibility I hadn't considered before. ",
                "Well the first obvious step imo is to walk around their work / storage / parking with a Geiger counter at different times of the day / night to see if there's anything flaring were it's not supposed to",
                "Seems like low probability this should happen but there are like hundreds of thousands of hospital departments in the US, so lots of chances for something like this to occur. \n\nImprobable things happen all the time because the frequency of events in which those things might occur are also incredibly high.\n\nEdit: https://en.m.wikipedia.org/wiki/Law_of_truly_large_numbers \n\nI think of Murphy’s law as a corollary to the law of truly large numbers",
                "A similar event happened in my hometown of Canonsburg, Pennsylvania in 2019. Multiple people in the town were being diagnosed with cases of Ewing's Sarcoma (a rare bone cancer, less than 250 cases per year). One of the kids I went to school with died from it at 19, two months after graduating.\n\nA lot of people thought there to be an environmental cause, due to the area's natural gas drilling, and factoring that Canonsburg has long been considered \"the most radioactive town in America\" due to the radium refining done there in the 1920's (later sealed in concrete and fenced off).\n\nIt was ultimately determined that there was no statistical cancer diagnosis cluster, and that the cause of all the cancer was undetermined, which really didn't make anyone feel better about, you know, all the cancer.\n\nLinks:\n\nhttps://www.cbsnews.com/pittsburgh/news/families-demand-answers-pa-health-dept-cancer-cluster-findings/\n\nhttps://www.wpxi.com/news/local/mom-local-teen-who-died-ewing-sarcoma-speaks-out-recent-study/WIBES42TWZGFPJTUBYZWFNMSQE/\n\nhttps://thereasonswhy.us/stories/luke-blanock/"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US rescuers notably absent in Myanmar quake cleanup",
            "external_url": "https://www.nbcnewyork.com/news/national-international/myanmar-earthquake-us-aid-absent/6213545/",
            "upvotes": 6821,
            "date": "04/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2207977162.jpg?quality=85&strip=all&crop=0px%2C627px%2C6000px%2C3375px&resize=1200%2C675",
            "top_comments": [
                "\"Days after the Myanmar quake, the U.S. made its first announcement of help: It was sending a three-member assessment team of non-specialist advisers from a regional USAID office in Bangkok, Thailand. Coincidentally, like hundreds of other USAID staffers around the world, the three had received layoff notices from the Trump administration on March 28 within hours of the quake, current and former USAID officials confirmed.\"",
                "According to reports US has sent 3 advisors and no rescuers ,That is callous reaction by current Oval Office .",
                ">China shares a border and close ties with Myanmar. Chinese rescuers had their first success Sunday, fewer than 48 hours after the quake, when they joined hands with local people to pull an elderly man from a badly damaged hospital in the capital city of Naypyitaw.\n\n>By Wednesday, Chinese rescuers had pulled out nine survivors, including a pregnant woman and a child. In Mandalay, Chinese rescuers saved a 52-year-old man who trapped for nearly 125 hours.\n\nFor an administration that talks plenty about countering China, shit like this is boneheaded. In these developing countries, when a more pro-China and a more pro-US candidate are going head to head voters are gonna remember it was the Chinese saving them when disasters stuck.",
                "We've gone very quickly from being the World's Leader to the World's Assholes.\n\nThis absolutely does the opposite of making America great.",
                "Oh, and here's a 10% tariff for you when you rebuild.",
                "I live in Fairfax Co., and we always send our rescue teams for international disasters and they are NOT happy about having to sit on their hands.",
                "I work in emergency infrastructure response for a large municipality. As part of that I am also a member of our large state’s safety assessment program (SAP), which is what would be happening in Myanmar right now. \n\nThis is a very niche occupation that unless you work for a large agency you don’t really get much experience. In my work capacity I am handling emergency projects daily but other members of the SAP may go years without any real experience. \n\nThe point is, that it is on our best interests as a country to help other countries because valuable experience, knowledge and contacts are made that will directly benefit our abilities to respond. \n\nFEMA, SAP and other similar programs need qualified, experienced and knowledgeable members. \n\nThis presidency from a know nothing president and his team will cause damage that will be felt years from now. \n\nI mean we all know he is awful but in every thing he does when you drill down further you realize how much more harmful he is.",
                "This administration is busy firing them all.",
                "None of Trump’s puppeteers are in Myanmar, so they don’t get assistance.",
                "Fuck Trump and Fuck Elon musk - evil, vile people. Abdicating the US’s role as a powerful nation in the world."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Tariffs on Canadian goods having a 'devastating effect,' U.S. farmers say | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/manitoba/canada-us-tariffs-north-south-dakota-farmers-1.7502342",
            "upvotes": 2273,
            "date": "04/06/2025",
            "thumbnail": "https://i.cbc.ca/1.7394028.1732660838!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/combining-in-manitoba-one-day-before-rail-strike-also-grain-elev.jpg?im=Resize%3D620",
            "top_comments": [
                "> \"This was just a horrible idea,\" he said.\" Whoever thought that tariffs were good for the country, they really don't understand civics and/or economics very well.\" \nSombke said 90 per cent of the state's potash — which is used as a fertilizer and is currently being tariffed at 10 per cent — comes from Canada, while much of its farming equipment carries a \"made in Canada\" stamp.\n\nIt's almost like going isolationist in a global economy is a bad idea. There are goods and raw materials we will never be able to produce here in volume. I don't have a lot of sympathy for people who voted for this, but I do feel concerned about how even more smaller family farms will vanish. Industrial scale farming will enjoy buying up land.",
                "ND/SD overwhelmingly voted for him. \n\nNot sure what more to tell you.",
                "I like how the article mentioned how those states voted. 2/3rds voted for what they're getting.",
                "Land doesn't vote, but farmers do, and they overwhelmingly vote R. I feel bad for those few who have the sense not to.",
                "Why do i feel many would willingly vote for Trump all over again, as their savings evaporate...",
                "Trump's tariffs in his first term resulted in the largest closing of family farms since the Great Depression, and that was when he was only fucking with Canada and Mexico. Couple his new tariffs with the cuts at the USDA and USAID, and we are likely to see the very existence of family farms in the United States become an endangered species. Makes me wonder how tight Fat Donny is with the industrial agriculture industry.",
                "It's okay, just ask Trump for money like last time.",
                ">In North Dakota, where Trump took nearly 68 per cent of the vote\n\nYou think farmers would understand how to reap what they sow.",
                "Yeah they all voted for trump, cry me a River",
                "Yet all over the country you see Farmers for Trump signs. Fuck them. Morons."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 578,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day....",
                "Snippet from this news article:”Nova Scotia Health conducted a campaign in November to attract United States health-care workers to the region, generating more than 500 nursing leads and five new hires.“The purpose of the campaign was to heighten our engagement directly with the U.S leads as a direct result of the current political climate. We are seeing this as an opportunity and we have tangible success stories that have confirmed the value that this campaign has,” says Laura O’Brien, Nova Scotia Health manager of recruitment services. \n\n“We are learning from the high interest that our recruitment efforts are working, health-care professionals and nurses are worried about the uncertainties in the American health-care system. The interest has been so, so much more and we are taking advantage of that.”\n\t•\tDownload the CTV News App for breaking news alerts and video on all the top stories\nNova Scotia Health says it received 65 serious inquiries from U.S. health-care workers that asked about licensing“What’s been great so far in seeing the results from this campaign is that we are seeing experienced nurses and experienced health-care workers. As recruiters here in Nova Scotia, student engagement is one of our top priorities but it is great to have as many graduates as we possibly can but we need those experienced professionals as well and this is giving us an opportunity to leverage that,” says O’Brien. \n\nHealth-care workers could be looking to leave the United States for a variety of reasons, but Nova Scotia Health believe politics is playing a part.“The number one reason is they are feeling uncertain, they’re feeling very uncomfortable depending on their current situation and how they are being portrayed. And I think they just don’t see a future for themselves anymore in that country,” says O’Brien. Roughly 30 per cent of the province’s recruitment is international and Nova Scotia Health has seen a recent uptick in interest from the U.S.“It really started in March of 2023 when Nova Scotia became the first province to allow U.S board-certified physicians to practice in Nova Scotia with additional certifications, so we saw an uptick then and really double the numbers of U.S physicians,” says Katrina Philopoulos, Nova Scotia Health physician recruitment director.",
                "Come on up!  The more the merrier :D",
                "Now would be the perfect time for a brain-drain of America.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "I thought no doctor from the US would want to move to Canada because they make so much more here /s"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 1212,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "The one star state continues to show why education is important.",
                "Texas: torturing and murdering their children in the name of Freedumb.",
                "Now that child will never be at risk for autism. Mission accomplished. ",
                "My father told me about how sick he was as a boy when he had the measles. He had high fever and it was horrible. If children are dying, others are going through terrible suffering."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis makes surprise public appearance after getting discharged two weeks ago",
            "external_url": "https://edition.cnn.com/2025/04/06/europe/pope-francis-health-public-vatican-intl?Date=20250406&Profile=CNN&utm_content=1743934219&utm_medium=social&utm_source=facebook&fbclid=IwY2xjawJfToJleHRuA2FlbQIxMQABHoP5pJcQROaoRVpqiDTkaJ0vGIM65ybjbzk_adKkzLn7LGt_AiwsTIBpEW5c_aem_L-j25aAUCgGgPtUDbqAPTA",
            "upvotes": 707,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25096352959850.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I strongly oppose the Catholic Church but I do believe Francis is a good man, and I'm happy to see he's feeling well enough.\n\nI think the movie Conclave (for as much as the Church condemns it) hit the nail on the head. This is a pivotal time for the Church, and it's going to be interesting to see just how measurable the divide that Francis and the other \"liberal\" church members have created. Is there another schism in the works? Could very well be. Catholics can't agree on anything, ever. I should know, I was one for decades.",
                "I'll certainly miss having Pope Francis as the pope when he passes. For all the complaints people seem to have with him, there's no doubt in my mind the Church will swing radically in the opposite direction — as they did after Benedict XVI — and I doubt that'll give the Church any better PR. He's certainly done more to embody core Christian virtues than many popes.",
                "Healthy as a fuckin rhino this guy",
                "Be nice if he actually did something about the corruption in the Catholic Church.  Just another super rich figurehead",
                "Looks like the cockroach guy from MIB",
                "Don't forget kids, do as the Pope asks and pray for the Dugin family.",
                "Discharge and pope shouldn’t be in the same sentence.",
                "He heard there were young kids present?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 2601,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive.",
                "Maybe Trump will pop by and toss some paper towels around."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 12971,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                "The GOP has wanted to privatize Social Security since Reagan.",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Boy with Einstein-level IQ joins sister as member of Mensa",
            "external_url": "https://www.ctvnews.ca/lifestyle/article/gifted-5-year-old-boy-with-einstein-level-iq-joins-sister-as-member-of-mensa/",
            "upvotes": 0,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2DV3DHX255EPNCHMUDYOH36GBQ.JPG?smart=true&auth=a5bf74065c37f767a3d993e094e7241f17572bcf34a358859bc8f2318d72e593&width=1200&height=630",
            "top_comments": [
                "I was given an IQ test in 4th grade. They immediately moved me into the ‘talented and gifted’ programs and started letting me study all the math I wanted. I’ve grown up to be a scientist in biotech. I hang out with a lot of shockingly-smart people. \n\nEvery single person I’ve ever met who mentioned being in MENSA came off as an egotistical douche where this was supposed to impress me. This kid is too young to necessarily decide these things for himself. Here’s hoping this is the least impressive thing on his resume.",
                "I just hope they’re still teaching critical thinking skills to rest of the non-Einsteins in his school.",
                "I tested in elementary school with an IQ of 146 and then later in life with an IQ of 151. I also did not even bother to open the letter that Mensa sent to me which I can only assume regarded some type of membership. Absolutely zero desire to join. \n\nThis is just a number to me. An IQ score does not indicate that you are kind, empathetic, compassionate, or any other of a number of qualities which I find are more important. It is just a number to signify whether or not you scored well on a test, but not a measure of your worth in any regard.",
                "He's not going to enjoy living in this madhouse.",
                "I remember when they put me in gifted classes as a kid, I hated it so much I intentionally crashed my grades to go back to normal classes with my friends",
                "That and 50 cents will get you a candy bar",
                "Qualifying for Mensa means you are the smartest kid in a 50-person room of kids your age. I never get why that's something newsworthy.",
                "The reason IQ tests are given to children is because we don’t really have other metrics to evaluate them. When you’re an adult a lot of other skills matter in being a functional person (self-care, personal hygiene, inter-personal relationships). Look at how many engineers become terrorists. Ted Kaczynski was extremely intelligent, but he was also a misogynist who thought he was better than everyone else.",
                "I’m Gen X. There was an episode of The Bob Newhart Show where Emily got invited to Mensa and Bob didn’t and in my formative years I thought that was “smart people cool”. That it would be my club like being a Moose or a Mason. Then I got older and realized all those clubs are lame and I don’t have time for them. \n\n30 years later I still have the sealed transcript from grade school with my IQ and a Mensa application in my desk drawer. Knowing that I’m eligible is just as good as being a member to me. 🤷‍♂️"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "At least 16 dead as storms touch off tornadoes and widespread flooding in central US",
            "external_url": "https://edition.cnn.com/2025/04/06/weather/south-midwest-storm-peak-flooding-hnk/index.html",
            "upvotes": 435,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25095700312819.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Perfect time for President to go golfing!",
                "Hey Americans! Do you think our President will mention anything about our fellow Americans dying this weekend - unprompted!?",
                "The irony is no one in the media is screaming for FEMA or for the president, or anyone….I remember non stop around the clock coverage during Biden presidency when one tornado did any damages…",
                "They should have raked their forest better",
                "Curious where all the right wing Christians are, who blame this sort of disaster on the morally corrupt?\nSuddenly nothing to say now that Trump is in the White house 🤔",
                "Trump didn’t authorize that with his sharpie , so no relief",
                "So god is punishing the sinners? Maybe conservatives openly embracing pedophilia was a bad idea. \n\nAm I doing this right Christians?",
                "Guess we should cut FEMA spending.",
                "Red states learning what the phrase “chickens come home to roost” means",
                "Central USA equals Trump country. FEMA has all been eliminated so good luck receiving federal money. Unless you kiss the ring."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 7160,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Foreplay lasted 85 years! 🤣",
                "Feels like about the age I’ll be ready to have kids",
                "Wait till they find out how expensive is it to raise kids.",
                "In this economy??!?!",
                "Isn't this actually amazing news for the species?",
                "I take my son to the zoo every other weekend. Those tortoises are banging EVERYTIME we go."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "UK's Jaguar Land Rover to pause shipments to US over tariffs",
            "external_url": "https://www.reuters.com/business/autos-transportation/uks-jaguar-land-rover-pause-shipments-us-over-tariffs-times-says-2025-04-05/",
            "upvotes": 1167,
            "date": "04/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. \n\n\nNo Jaguars?!\n\n\nNo Land Rovers??!!\n\n\nThe billionaire-infested cabinet will not allow this to stand. They'll get exempted.",
                "Isn't Jaguar taking a semester off to find themselves?",
                "We're going to end up like Russia and North Korea at this rate; shunned by and cut off from the rest of the world for all time.",
                "Every one that will be tariffed should just stop shipments. The US will learn REAL fuckin fast then",
                "Dozens of people will be impacted by this, dozens!",
                "Damn it! I was just about to become a multi millionaire and buy one of each",
                "✓ 'Rovers, Defenders, and Jags (oh my)  \n✓ Nintendo Switch 2 pre-orders (stings a bit)  \n✓ Stuff I missed (do tell)  \n✓ More to come",
                "“Jaguar Land Rover will pause shipments of its Britain-made cars to the United States for a month, it said on Saturday, as it considers how to mitigate the cost of President Donald Trump's 25% tariff.\n\nJaguar Land Rover, which is owned by India's Tata Motors (TAMO.NS), opens new tab, confirmed the temporary export suspension after the Times newspaper reported the plan.”",
                "Didn’t Jaguar already pause production for a year?",
                "Wow not sure how we will recover from this"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 577,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day....",
                "Snippet from this news article:”Nova Scotia Health conducted a campaign in November to attract United States health-care workers to the region, generating more than 500 nursing leads and five new hires.“The purpose of the campaign was to heighten our engagement directly with the U.S leads as a direct result of the current political climate. We are seeing this as an opportunity and we have tangible success stories that have confirmed the value that this campaign has,” says Laura O’Brien, Nova Scotia Health manager of recruitment services. \n\n“We are learning from the high interest that our recruitment efforts are working, health-care professionals and nurses are worried about the uncertainties in the American health-care system. The interest has been so, so much more and we are taking advantage of that.”\n\t•\tDownload the CTV News App for breaking news alerts and video on all the top stories\nNova Scotia Health says it received 65 serious inquiries from U.S. health-care workers that asked about licensing“What’s been great so far in seeing the results from this campaign is that we are seeing experienced nurses and experienced health-care workers. As recruiters here in Nova Scotia, student engagement is one of our top priorities but it is great to have as many graduates as we possibly can but we need those experienced professionals as well and this is giving us an opportunity to leverage that,” says O’Brien. \n\nHealth-care workers could be looking to leave the United States for a variety of reasons, but Nova Scotia Health believe politics is playing a part.“The number one reason is they are feeling uncertain, they’re feeling very uncomfortable depending on their current situation and how they are being portrayed. And I think they just don’t see a future for themselves anymore in that country,” says O’Brien. Roughly 30 per cent of the province’s recruitment is international and Nova Scotia Health has seen a recent uptick in interest from the U.S.“It really started in March of 2023 when Nova Scotia became the first province to allow U.S board-certified physicians to practice in Nova Scotia with additional certifications, so we saw an uptick then and really double the numbers of U.S physicians,” says Katrina Philopoulos, Nova Scotia Health physician recruitment director.",
                "Come on up!  The more the merrier :D",
                "Now would be the perfect time for a brain-drain of America.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "I thought no doctor from the US would want to move to Canada because they make so much more here /s"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 1215,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "The one star state continues to show why education is important.",
                "Texas: torturing and murdering their children in the name of Freedumb.",
                "Now that child will never be at risk for autism. Mission accomplished. ",
                "My father told me about how sick he was as a boy when he had the measles. He had high fever and it was horrible. If children are dying, others are going through terrible suffering."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Tariffs on Canadian goods having a 'devastating effect,' U.S. farmers say | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/manitoba/canada-us-tariffs-north-south-dakota-farmers-1.7502342",
            "upvotes": 2274,
            "date": "04/06/2025",
            "thumbnail": "https://i.cbc.ca/1.7394028.1732660838!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/combining-in-manitoba-one-day-before-rail-strike-also-grain-elev.jpg?im=Resize%3D620",
            "top_comments": [
                "> \"This was just a horrible idea,\" he said.\" Whoever thought that tariffs were good for the country, they really don't understand civics and/or economics very well.\" \nSombke said 90 per cent of the state's potash — which is used as a fertilizer and is currently being tariffed at 10 per cent — comes from Canada, while much of its farming equipment carries a \"made in Canada\" stamp.\n\nIt's almost like going isolationist in a global economy is a bad idea. There are goods and raw materials we will never be able to produce here in volume. I don't have a lot of sympathy for people who voted for this, but I do feel concerned about how even more smaller family farms will vanish. Industrial scale farming will enjoy buying up land.",
                "ND/SD overwhelmingly voted for him. \n\nNot sure what more to tell you.",
                "I like how the article mentioned how those states voted. 2/3rds voted for what they're getting.",
                "Land doesn't vote, but farmers do, and they overwhelmingly vote R. I feel bad for those few who have the sense not to.",
                "Why do i feel many would willingly vote for Trump all over again, as their savings evaporate...",
                "Trump's tariffs in his first term resulted in the largest closing of family farms since the Great Depression, and that was when he was only fucking with Canada and Mexico. Couple his new tariffs with the cuts at the USDA and USAID, and we are likely to see the very existence of family farms in the United States become an endangered species. Makes me wonder how tight Fat Donny is with the industrial agriculture industry.",
                "It's okay, just ask Trump for money like last time.",
                ">In North Dakota, where Trump took nearly 68 per cent of the vote\n\nYou think farmers would understand how to reap what they sow.",
                "Yeah they all voted for trump, cry me a River",
                "Yet all over the country you see Farmers for Trump signs. Fuck them. Morons."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 12975,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                "The GOP has wanted to privatize Social Security since Reagan.",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis makes surprise public appearance after getting discharged two weeks ago",
            "external_url": "https://edition.cnn.com/2025/04/06/europe/pope-francis-health-public-vatican-intl?Date=20250406&Profile=CNN&utm_content=1743934219&utm_medium=social&utm_source=facebook&fbclid=IwY2xjawJfToJleHRuA2FlbQIxMQABHoP5pJcQROaoRVpqiDTkaJ0vGIM65ybjbzk_adKkzLn7LGt_AiwsTIBpEW5c_aem_L-j25aAUCgGgPtUDbqAPTA",
            "upvotes": 703,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25096352959850.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I strongly oppose the Catholic Church but I do believe Francis is a good man, and I'm happy to see he's feeling well enough.\n\nI think the movie Conclave (for as much as the Church condemns it) hit the nail on the head. This is a pivotal time for the Church, and it's going to be interesting to see just how measurable the divide that Francis and the other \"liberal\" church members have created. Is there another schism in the works? Could very well be. Catholics can't agree on anything, ever. I should know, I was one for decades.",
                "I'll certainly miss having Pope Francis as the pope when he passes. For all the complaints people seem to have with him, there's no doubt in my mind the Church will swing radically in the opposite direction — as they did after Benedict XVI — and I doubt that'll give the Church any better PR. He's certainly done more to embody core Christian virtues than many popes.",
                "Healthy as a fuckin rhino this guy",
                "Be nice if he actually did something about the corruption in the Catholic Church.  Just another super rich figurehead",
                "Looks like the cockroach guy from MIB",
                "Don't forget kids, do as the Pope asks and pray for the Dugin family.",
                "Discharge and pope shouldn’t be in the same sentence.",
                "He heard there were young kids present?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 2599,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive.",
                "Maybe Trump will pop by and toss some paper towels around."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "At least 16 dead as storms touch off tornadoes and widespread flooding in central US",
            "external_url": "https://edition.cnn.com/2025/04/06/weather/south-midwest-storm-peak-flooding-hnk/index.html",
            "upvotes": 438,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25095700312819.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Perfect time for President to go golfing!",
                "Hey Americans! Do you think our President will mention anything about our fellow Americans dying this weekend - unprompted!?",
                "The irony is no one in the media is screaming for FEMA or for the president, or anyone….I remember non stop around the clock coverage during Biden presidency when one tornado did any damages…",
                "They should have raked their forest better",
                "Curious where all the right wing Christians are, who blame this sort of disaster on the morally corrupt?\nSuddenly nothing to say now that Trump is in the White house 🤔",
                "Trump didn’t authorize that with his sharpie , so no relief",
                "So god is punishing the sinners? Maybe conservatives openly embracing pedophilia was a bad idea. \n\nAm I doing this right Christians?",
                "Guess we should cut FEMA spending.",
                "Red states learning what the phrase “chickens come home to roost” means",
                "Central USA equals Trump country. FEMA has all been eliminated so good luck receiving federal money. Unless you kiss the ring."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 7167,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Foreplay lasted 85 years! 🤣",
                "Feels like about the age I’ll be ready to have kids",
                "Wait till they find out how expensive is it to raise kids.",
                "In this economy??!?!",
                "Isn't this actually amazing news for the species?",
                "I take my son to the zoo every other weekend. Those tortoises are banging EVERYTIME we go."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 10489,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "Weird time to try something.\n\n> ... the East Block houses the offices of senators and their staff, but there is little activity on the Hill because Parliament is dissolved for the ongoing federal election.",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks.",
                "jd vance peeking in the windows",
                ">The barricaded man call at East Block has ended without incident,” Ottawa police said on X. “One man is in custody. The @ottawapolice criminal investigation is ongoing and an update will be provided in the morning. We thank the public for its cooperation.”  \n\n\nokay then.   back to the buying Canadian. ",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                "Pierre Poilievres new campaign strat.",
                "Send in Kevin Vickers!",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "Send for Rowsdower, ON THE DOUBLE!"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "5 nurses who work on the same floor at Massachusetts hospital have brain tumors",
            "external_url": "https://www.nbcnews.com/news/rcna199798",
            "upvotes": 27264,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-newton-mass-general-brigham-newton-wellesley-hospital-google-ac-754p-6d4eef.jpg",
            "top_comments": [
                "11 employees all on the maternity ward experienced illness - I wonder what the symptoms of the other six were",
                "Reminds me of the [Kramatorsk incident where residents were exposed to gamma radiation](https://en.m.wikipedia.org/wiki/Kramatorsk_radiological_accident) due to a capsule containing highly radioactive caesium-17 being in their walls. Residents kept succumbing to leukaemia.",
                "This happened to me. Four men on our block got brain tumours within a couple year span. All of us lived on the south side of the street. We all had different types of tumours. I was the only one that survived. One of them was Canadian rock legend Gord Downey of the Tragically Hip.",
                "I wonder if they all sat in the same area at work?  \n\n\nPerhaps near a shared wall with an imaging department that was not constructed properly?",
                "When i worked in pediatric hematology/oncology as a study coordinator, one of my tasks was maintaining the cancer registry. Basically, any time someone is diagnosed with cancer, it would be put in to the state, and there were things like zip code, date, and other stuff tracked. It was purely because if stuff like this. If ever there were 3 or more cancer patients with similar/the same type of cancer in a certain zip code/area, the state and CDC would send investigators. And, now that RFK Jr and Elon are in charge, that shit will end. And it will be really really bad.",
                "In case anyone didn’t read the article, it’s three different types of benign tumor, which would not meet the definition of a cancer cluster",
                "I ran this by a doctor friend and her take was that a lot of seeming cancer clusters end up being nothing, and it's possible that screening went way up once people started worrying so they found benign tumors that would never have been found otherwise. She thought it would be more likely that there would be a variety of different cancers if you were really dealing with some kind of radiation exposure. \n\n\nI don't know, but it was a possibility I hadn't considered before. ",
                "Well the first obvious step imo is to walk around their work / storage / parking with a Geiger counter at different times of the day / night to see if there's anything flaring were it's not supposed to",
                "Seems like low probability this should happen but there are like hundreds of thousands of hospital departments in the US, so lots of chances for something like this to occur. \n\nImprobable things happen all the time because the frequency of events in which those things might occur are also incredibly high.\n\nEdit: https://en.m.wikipedia.org/wiki/Law_of_truly_large_numbers \n\nI think of Murphy’s law as a corollary to the law of truly large numbers",
                "A similar event happened in my hometown of Canonsburg, Pennsylvania in 2019. Multiple people in the town were being diagnosed with cases of Ewing's Sarcoma (a rare bone cancer, less than 250 cases per year). One of the kids I went to school with died from it at 19, two months after graduating.\n\nA lot of people thought there to be an environmental cause, due to the area's natural gas drilling, and factoring that Canonsburg has long been considered \"the most radioactive town in America\" due to the radium refining done there in the 1920's (later sealed in concrete and fenced off).\n\nIt was ultimately determined that there was no statistical cancer diagnosis cluster, and that the cause of all the cancer was undetermined, which really didn't make anyone feel better about, you know, all the cancer.\n\nLinks:\n\nhttps://www.cbsnews.com/pittsburgh/news/families-demand-answers-pa-health-dept-cancer-cluster-findings/\n\nhttps://www.wpxi.com/news/local/mom-local-teen-who-died-ewing-sarcoma-speaks-out-recent-study/WIBES42TWZGFPJTUBYZWFNMSQE/\n\nhttps://thereasonswhy.us/stories/luke-blanock/"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/06/2025 16:08:51 UTC"
}