{
    "posts": [
        {
            "category": "HOT",
            "title": "Dozen states sue Trump in bid to block new tariffs",
            "external_url": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
            "upvotes": 35596,
            "date": "04/23/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108102916-1739560760118-gettyimages-2199659780-mms20867_kamriiiu.jpeg?v=1745437525&w=1920&h=1080",
            "top_comments": [
                "In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont",
                "Good, because this shit is weeks away from causing about half my industry to disappear.",
                "Take me back to 2024 before this administration",
                "There was clip of powerful bankers in his office and he  was saying he made 900 million yesterday, and this other guy made 2.5 billion. He’s causing dips on purpose so him and rich friends can buy low and then sell later. He announced some tariffs a while back then walked them back 90 days later. This is market manipulation.",
                "If you live in a red state (like me) and are thinking of moving somewhere away from the madness (at least a little bit) then you now have a list of states that will at least try to stand up for their citizens in the face of this insanity. \n\n\"In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont.\"\n\nNot saying there's not crazy to be had everywhere, but I'm going to assume most of these states are not trying to make it illegal to speak badly about Trump, make Trump's birthday a holiday, rename major airport after him, and ask his administration with help in ensuring they'll be able to keep the billions in federal tax subsidies for public education after they pass an unconstitutional bill to ban undocumented kids from public schools. All of this and more is happening in Tennessee- and the news says the tariffs will hurt TN too- but our spineless and horrid super majority GOP state government is too busy doing racist, bigoted victory laps to care.",
                "Taxation without representation!  Throw it all into the harbor, boys!",
                "I work for a solar company who everyone here (aside from me) are Trump voters. Yet they’re all still licking his boot.",
                "Couldn't they just get their congress members to, do their job instead?",
                "Thank you to every single state doing this, sadly I'm not in one.",
                "It’s one of the single dumbest things I’ve ever seen an individual do. And he happens to be the most powerful individual in the world. Pretty amazing, in a weird way"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 6219,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "He’s an abject failure of a human.",
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "First it was the leaks, now he has gone rouge.",
                "Truly a “ non military wimp “ - no example for soldiers",
                "Shouldn’t this be in r/nottheonion ?",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 14970,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.\n\nEdit Apologies, he may be at a concentration camp or death camp instead. I was going off the fact that the president of El Salvador said that he was going to be using these prisoners for labor.",
                "How many people have been disappeared that we don't  even know about?",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                ">Adrián, 27, came to the United States in 2023 by appointment through the CBP One app. Alejandro provided NBC News a photo of a printout confirming his brother’s June 12, 2023, appointment.  \n\n>Adrián had also applied for temporary protected status, according to a Dec. 1, 2024, document from U.S. Citizenship and Immigration Services, a part of DHS that handles immigration benefits. \n\nSo this guy did EXACTLY what the government asked him to do to come in legally, and they still said he was here illegally.",
                "\"The law holds that it is better that ten guilty persons escape than that one innocent suffer.\"\n\n\\-- William Blackstone, 1760s\n\n\"We're getting them out... and you can't have a trial for all of these people.\"\n\n\\-- Donald Trump, 04/22/2025",
                "> Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.”\n\nLiterally the administration is arguing that they shouldn’t have to prove anything in court or anywhere else.  They scoop people off the street, deport them to a foreign gulag, and when asked why, respond “trust me bro. . . “\n\nHow conservatives can defend this shit is beyond me.",
                "This is disgusting and disgraceful",
                "This is so goddamn repulsive. It’s ghoulish.",
                "That’s the thing… they’re all crying “We’re not members of Tren de Agua!” But the problem is we’ll never know. They never got to respond to the government’s very serious allegations against them and are now indefinitely detained in a country they are not from. This is actually really fucked."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "California Man Ordered to Leave the U.S. 'Immediately' Despite Providing Birth Certificate: 'I'm Not Trying to Be One of the Government's Mistakes'",
            "external_url": "https://www.latintimes.com/california-man-ordered-leave-us-immediately-despite-providing-birth-certificate-im-not-581422",
            "upvotes": 56092,
            "date": "04/23/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575008/california-man-ordered-leave-us-immediately-despite-providing.jpg",
            "top_comments": [
                "I think he had the right idea of going to the media. At least now, if the government makes good on its threats, there will be someone looking for him.",
                "> Despite providing his birth certificate to prove his US citizenship, Martinez-Gomez says he has been forced to make contingency plans with family members and now worries about being detained while performing his job.\n\nI'm just waiting for one of these poor people to become the target of \"fake birth certificate\" conspiracies.",
                "Why are they fucking emailing people? EMAIL? Why not a formal letter sent via certified mail?",
                "> An American citizen born and raised in California is unsettled after receiving an e-mail from the US Department of Homeland Security ordering him to leave the country \"immediately.\" Aldo Martinez-Gomez received the DHS notice on April 11, threatening \"criminal prosecution\" and fines if he does not depart within seven days. \"Do not attempt to remain in the United States - The federal government will find you,\" the e-mail warned.\n\n\nSo the US is sending their own citizens threats and hoping to deport them. Not sure how that makes America great again.",
                "Born and raised American. I was put in handcuffs when Arizona did their “citizenship check stops” a few years back and told i was going to be sent ‘back to my own country’. \n\nFuck these people.",
                "Here is their fascist version of probable cause\n\n“Martinez-Gomez works full-time assisting immigrants in court for a non-profit and believes his advocacy work may have placed him on the government's radar.”",
                "> \"Where do they want me to go?\" Martinez-Gomez told KTLA. \"I was born in National City. I was raised in San Diego County my whole life.\"\n\n> \"I believe I received it because I'm an accredited representative, and I represent immigrants, and I advocate for immigrants' rights in the court,\" he told ABC 10News.\n\n> In a statement, a senior DHS official said notices may have been accidentally sent to US citizens if their contact information was submitted by migrants — calling it a case of \"unintended recipients.\" The agency insisted it would address such issues individually.\n\nI know many aren't going to read the article and will rush to get their quips in....but Those three paragraphs stuck out. A US Citizen who was born in America being told to leave. Why are they being told to leave? Maybe because their job is to help immigrants. When asked by the media to clarify, the source acts as if it was just a mistake. \n\nBlack Americans of the past went through the same playbook. You're told to leave or that \"you don't belong here\". Why? Someone wants their land, or their prosperity, or something petty. When confronted? \"It was just a mistake :(\"\n\nThis is why it's important to learn history and to pay attention to history as it's truly being repeated right now. Don't believe me? Here's a fun bonus paragraph: \n\n> A Massachusetts immigration attorney reported receiving a similar e-mail last week.\n\nOH?",
                "okay so my dad got one of these. He came here as a refugee from Cuba in the early 60s. We are ignoring it because he was not paroled and was not given a finite amount of time, rather, the US government made him a citizen when he was 16. He's 80 now. Im pretty sure Marco Rubio is in the same banana boat. My impression is this is a scare tactic to cover as many bases as possible, hoping fear will make their true targets leave. Dark stuff with Stephen Miller's sulfuric stink all over it.",
                "I was told that I was dooming for suggesting that Trump would start deporting Americans to concentration camps",
                "Obama providing a birth certificate didn't change the minds of these fascists either "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "4-year-old migrant girl, other kids go to court in NYC with no lawyer: 'The cruelty is apparent'",
            "external_url": "https://gothamist.com/news/4-year-old-migrant-girl-other-kids-go-to-court-in-nyc-with-no-lawyer-the-cruelty-is-apparent?utm_medium=social&utm_source=reddit&utm_campaign=shared_reddit",
            "upvotes": 27060,
            "date": "04/23/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350828/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "It’s important too see what is actually occurring in deportation hearings, from article: “parties included a 7-year-old boy, wearing a shirt emblazoned with a pizza cartoon, who spun a toy windmill while the judge spoke. There was an 8-year-old girl and her 4-year-old sister, in a tie-dye shirt, who squeezed a pink plushy toy and stuffed it into her sleeve. None of the children were accompanied by parents or attorneys, only shelter workers who helped them log on to the hearing”",
                "This is unfortunately not new, children are not guaranteed ~~council~~ counsel in immigration court.\n\nJohn Oliver did a whole segment on it a few years back",
                "Dude what the fuck? How can a judge see this in the courtroom and not lose their fucking shit?",
                "This is a form of child abuse.\n\nDisgusting, evil and immoral.",
                "\"All men are created equal. But some men are more equal than others.\" –GOP",
                "Economy is nose diving and all trump can think about is deporting children.",
                "Where exactly do you \"deport\" a 4 year old with no guardians to?  What kind of monstrous evil is this?  Putting innocent, defenseless children into a situation like this?",
                "> The Trump administration on March 21 terminated part of a $200 million contract that funds attorneys and other legal services for unaccompanied children, who arrived in the United States without parents or legal guardians.\n\n> Nearly all of the people – 96% – appearing in New York state immigration courts without legal counsel are eventually ordered deported… Meanwhile, fewer than a quarter – 23% – of those with representation are deported.\n\nThere it is. Just awful, I really feel for these kids.",
                "My son just turned 4, I could not imagine him even understanding what is happening, let alone dealing with something like this on his own. Unbelievable. No child deserves this. Sick to my stomach right now. Something has to be done.",
                "Stay classy Trump administration"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 2193,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Another red state discovers leopards.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?",
                "Voted for this, just like GOP will gut rural American welfare under the flag that Cities using it all.   NOPE,  It’s farmers and Rural Communities that rely on Social Services the most and you just cut your own funding.   WE TOLD YOU this would happen."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "World Leaders From China to EU Hold Climate Meeting Without US",
            "external_url": "https://financialpost.com/pmn/business-pmn/world-leaders-from-china-to-eu-hold-climate-meeting-without-us",
            "upvotes": 1626,
            "date": "04/23/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/775566467.jpg",
            "top_comments": [
                "“A “certain major country” is keen on unilateralism and protectionism and has caused “serious impact” on international rules and order, Xi also said, according to the official Xinhua News Agency.”\n\n👀",
                "What if this is actually a free trade forum wrapped in a climate change skin.",
                "Everytime I hear news like this, I always keep thinking of Biden last speech about how an oligarchy is taking over the us",
                "The US doesn't care about the climate anyway. Pffft hahaha. They literally just slapped a huge tariff on solar panels. Some US states you can't even have solar on your house at all. EPA gutted. What is a Kei car? Other than Honda, are there even any regular size or compact cars even being sold in America anymore?",
                "Of course the US isn't there. Remember when Al Gore was passionate about the environment and he became the laughingstock of the country for *over a decade*? Even now I hear jokes about him breaking his projector in anger over trees.",
                "The USA being pushed away from dominance is happening a lot faster than I thought it would. It hasn't even been a year yet.",
                "Nice, more focus on climate is always welcome and needed!",
                "The U.S. is too busy jerking off in the corner!",
                "I was really hoping the retaliatory tariffs against America would be emissions based. If trump wants to steer policy with tariffs then the rest of the world can to. Apply a carbon tax based on tariffs and force America to clean up their emissions and level the playing field so everyone else does too.",
                "EV sales climbed a steep hill until a sudden drop in late 2024 outside of China. One wonders why."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "State of emergency declared as New Jersey wildfire explodes to 11,500 acres",
            "external_url": "https://abcnews.go.com/US/wildfire-new-jersey-explodes-8500-acres-residents-evacuated/story?id=121075913",
            "upvotes": 2885,
            "date": "04/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/ca0c92e6-61d6-4694-b4b3-a7acdc32e79f/nj-wildfire-2-ap-gmh-250423_1745423871343_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "For reference, that's nearly 18sq miles on fire. \n\nThat's larger than Jersey City - not counting the surface area of the Hudson & Hackensack rivers - and is only only slightly smaller than the city of Newark.",
                "[Trump fired the people who would normally be working to fight this fire.](https://www.govexec.com/federal-news/2025/04/trump-said-cuts-wouldnt-affect-public-safety-then-he-fired-hundreds-workers-who-help-fight-wildfires/404552/) If you think the DOGE cuts are a good thing, I ask you to not vote and stay away from the polls because I'm tired of seeing how people are getting hurt by Trump and Elon Musk.",
                "The fact that this is happening on the US East Coast is very concerning; unlike SoCal, the East Coast is supposed to get a lot more rain and is much more wet. It’s a completely different biome and it’s not supposed to be this dry.\n\n[Here](https://unitedstatesmaps.org/wordpress/wp-content/uploads/2021/07/usa-climate-map.pdf) is a map showing climate zones for reference.\n\n[Here](https://gisgeography.com/us-precipitation-map/) is another map that is more geared towards annual rainfall.",
                "My fellow Americans are about to discover that a lot of the jobs gutted by Trump and DOGE were thankless and were of the utmost importance to us functioning as a country. Oh well, at least that trans third grader in Iowa can be banned from playing soccer. /s",
                "Did they try turning on the water?",
                "So I live literally the town under this fire, the place it started \"Wells Mills County Park\" is like 10+ mins away. \n\nI woke up to my car with burnt wood on it. My university which is a half hour south has ash in the air flying. The parkway was closed entirely yesterday from Toms River to Manahawkin. That's a 30 minute stretch of a major highway closed. \n\nI read a comment in r/SouthJersey stating that a dude got out of work at 4 pm and got home at midnight. Lacey and Barnegat Townships got evacuated and power shut off. It's absolutely crazy and only now of this comment 35 percent contained.",
                "[visuals of the wildfire](https://www.reddit.com/r/USA24x7/s/52JAoOaI8n)",
                "Oh jeez, I wonder where our wildland firefighters went.",
                "Is Trump going to blame this on not sweeping the forests and poor water conservation in reservoirs hundreds of miles away from the fires?",
                "Wait, but trump said wild fires were woke and no fire would ever start again in his term"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "‘They just did what they wanted’: Crown outlines sex assault allegations against Canada world junior hockey players",
            "external_url": "https://www.thestar.com/news/they-just-did-what-they-wanted-crown-outlines-sex-assault-allegations-against-canada-world-junior/article_c31efe15-fabe-488c-94bd-43972d3e3f16.html",
            "upvotes": 2499,
            "date": "04/23/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/8f/d8fbdd20-4985-5f1a-ba31-b64c3cb84617/6808eb5c4dc24.image.jpg?crop=1889%2C992%2C0%2C52&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Absolutely nothing was learned after the University of Ottawa's hockey team's incident at Thunder Bay in 2014.",
                "TW: there are details in here about sexual assault and abuse. This is the highly publicized 2018 Canada World Juniors team that got covered up by Hockey Canada.",
                "I don't think it's just limited to hockey. Any high performing sports team usually gets away with a lot of shit that in other cases would not get a pass, and shouldn't get a pass.",
                "hmm, the last line of this story is very telling.",
                "Beartown is an excellent novel",
                "\"B-b-but boys will be boys...\"",
                "Hate to judge a book by their cover but they do have resting \"cover your drinks around this guy\" faces.",
                "Carter Hart ... maybe if you had just played goalie and, you know, **not sexually assaulted a woman**, my Flyers wouldn't stink like an armpit in a brick oven.",
                "I remember my hs football team doing the same thing back in 07. There really is a problem that all to often gets swept under the rug.",
                "Hockey culture is toxic and dangerous"
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "HOT",
            "title": "USDA cuts $1 billion for schools and food banks to buy fresh food from local farms",
            "external_url": "https://www.tcpalm.com/story/news/local/florida/2025/04/21/trump-doge-usda-cuts-funding-for-schools-food-banks-to-buy-fresh-food-from-local-farms-florida/83083264007/",
            "upvotes": 2029,
            "date": "04/23/2025",
            "thumbnail": "https://www.tcpalm.com/gcdn/authoring/authoring-images/2024/10/14/PTCN/75672449007-tcn-irc-food-distribution-003.JPG?crop=5759,3241,x0,y299&width=3200&height=1801&format=pjpg&auto=webp",
            "top_comments": [
                "> local farms\n\nGutting them to be bought up by hedge fund corporations.",
                "\"Why won't Americans have more babies?!\"\n\nThis. Right. Fucking. Here. \nThey say that they want to feed American healthier but then they also cut all federal funding from programs that helped with ensuring that kids in schools could get access to fresh farm food. Everyone in this scenario won. The kids, the farmers, and the country as a whole. But nah, instead we have oligarchs dismantling our country before our very eyes and a third of America is rooting for it.",
                "First 100 days so far…\n\nPardons all violent Jan 6th criminals\n\n2 Israeli ceasefires collapse\n\nUkrainian ceasefire collapse/fail to launch\n\nWar with houthis/ signal gate 1.0 and 2.0\n\nLets houthis shoot down 10+ reaper drones\n\nThreatens invasion of partner countries/alienates allies (Greenland, Canada, Mexico and Panama)\n\nThreatens war with Iran\n\nThreatens NATO alliance\n\nDoes Russia’s bidding against Ukraine/propaganda, pulling aid, intel, capitulation to land demands\n\nMark Fogal released for Russian cyber criminal\n\nDismantles foreign cyber crime defense\n\nMultiple aviation accidents/blames DEI\n\nDEI historical removals like Jackie Robinson/ Enola gay\n\nReleases millions of gallons of water in CA to wrong place after fires\n\nAddresses none of deadly tornadoes in central plains (busy winning his own golf tournament)\n\nMarkets down 10-20% / worse month since depression/market manipulation\n\nBlows up his own trade deals and erases trillions from the market with dollar down 9%\n\nGiant tariff tax / global trade war / *no tariffs on Russia\n\nCrypto scams / Trump and Melania coins\n\nPardons Silk Road creator and crypto crooks\n\nUS boycotts/travel warnings/prolonged detainment\n\nFroze NIH research grants and preventing federally funded scientists from travelling or talking about their work.\n\nGutted USAID wasting billions in aid and costing lives\n\nCuts funding to public media like npr + pbs\n\nTook over Kennedy center\n\nHangs mug shot in White House\n\nLet’s elons kid put a booger on resolute desk\n\nDoge chainsaw to fed agencies with no DOD cuts and an actual increase in federal spending /mass “DEI firings”\n\nStops loans and programs like farm to school\n\nInvites dictators to the White House\n\nLoss of 1st and 5th amendment rights/deporting for opinions/due process/deporting homegrown criminals\n\nEl salvadorian detention camps/ Guantanamo bay failure\n\nThreatens loss of 14th amendment - birthright citizenship\n\nThreatens 16th amendment rights- congress setting tax rules\n\nThreatens 19th amendment - save act/women’s voting rights\n\nThreatens 22nd amendment - 3rd term\n\nWeaponizes justice department/ Tesla vandalism = terrorism/ Jan 6 revenge\n\nMeasles + bird flu\n\nWasted 30k real eggs on Easter\n\nF-47 jet and proposals for his image on currency, Rushmore, airport naming\n\nCanceled Ebola prevention funding\n\nEliminates FDA regulations on food\n\nOpens federal forests for logging and opens protected ocean space for fishing/drilling\n\nWhite House = Tesla dealership\n\nGolf trips EVERY weekend and some weekdays\n\nWastes millions attending Super Bowl, NASCAR, and ufc events\n\nTrump Gaza /wants to create golden idols of himself\n\nAttacks and sues private, state, and federal entities over constitutional rights/extortion\n\nAttacks on trans including troops\n\nAttacks the independence of the FED\n\nPro Child labor legislation\n\nGets rid of price caps on medicine like insulin\n\nReverses student loan forgiveness\n\nTries to reverse overdraft fee protection\n\nReverses climate legislation/guts epa\n\nViolation of Separation of powers /criminal contempt\n\nMass Illegal Deportations\n\nMasked secret police kidnapping people\n\nRevoked citizenship for hundreds of thousands of refugees\n\nMass protests in all 50 states\n\nDidn’t know about dead soldiers in Lithuania/golfed with Saudis instead of being there for dignified transfer of bodies\n\nDidn’t release Epstein Files\n\nSays “these things happen” after Florida school shooting\n\nNo “no tax on tips/overtime”\n\nBrain worm autism theory/ persons list\n\nFruit loops made with real colors\n\nSOH gets robbed and does glam shoot with foreign prisoners\n\nDOI lies under oath\n\nA1 sauce secretary of education\n\nTrump GOLD card for Russian oligarchs\n\nAnnounces military parade for his birthday\n\n“Got rid” of PaPer straWs\n\nMade shower heads Great Again\n\nBaby bonus/mommy medals\n\n100ft flag pole at the White House\n\nGulF of AmEriCA",
                "\"Fuck them kids and little people\" really is the Republican platform, huh?",
                "People will focus on the school / food bank part of this, rightfully so, but this is an act to allow the mega corporations to buy up the last of the mom and pop farms who barely are able to exist as it is.",
                "These cuts disproportionately impact rural and low-income areas, many of which are located in red counties, where schools often rely heavily on federal assistance to provide meals to students. The reduction in funding may lead to increased food insecurity among students in these regions, potentially affecting their academic performance and overall well-being.\n\nThat's ok, though. Trump doesn't want you smart. Trump wants desperate, useful idiots.\n\nWho knew that wanting children to have any food at all was \"woke\"? I thought that children were the future/our most precious resource/some other platitude, but I stand corrected. Let the little children starve to death so they can meet God sooner.",
                "maybe don't do that if you want people to have kids, Trump.",
                "So much fraud!  So much abuse!  Imagine those poor, hungry kids taking two apples?!  \n\nThank goodness we nipped this in the bud.  So great again.\n\ns/",
                "Farmers with giant “Farmers for Trump” signs in your fields: you may notice an unusual number of chickens returning home. I think they were clucking about wanting to roost.",
                "Same week RFK Jr. claimed sugar is POISON the same administration took away access to fresh produce to millions of children. \n\nClassic Republicanism."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 2190,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Another red state discovers leopards.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?",
                "Voted for this, just like GOP will gut rural American welfare under the flag that Cities using it all.   NOPE,  It’s farmers and Rural Communities that rely on Social Services the most and you just cut your own funding.   WE TOLD YOU this would happen."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/latino/venezuelan-brother-deported-el-salvador-family-looking-rcna202279",
            "upvotes": 541,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "Just like in Trump's first term where they had no idea where the parents were sent after they separated them from their children.",
                "These poor families, it must be terrifying to not know where your family member is for 40 days, then to learn he is in a country he’s not even from in a prison known for human rights violations. Guy was just trying to go to work, how awful",
                "People who never committed any crimes are being thrown into torture camps with no way to get out by the American government. Never thought I would live to see this.",
                "They don't believe the families or the victims have rights.",
                "I like how the administration refuse to show proof this guy was a gang member.  This is a common fascist plot.  Mark someone as enemy. Refuse due process. Disappear them.  One the system is perfected, they can do the same to their political critics.",
                "If it was his brother. He may want to stay under the radar.",
                "At least have the balls to tell him you DHS asshats."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 6217,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "He’s an abject failure of a human.",
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "First it was the leaks, now he has gone rouge.",
                "Truly a “ non military wimp “ - no example for soldiers",
                "Shouldn’t this be in r/nottheonion ?",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "World Leaders From China to EU Hold Climate Meeting Without US",
            "external_url": "https://financialpost.com/pmn/business-pmn/world-leaders-from-china-to-eu-hold-climate-meeting-without-us",
            "upvotes": 1624,
            "date": "04/23/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/775566467.jpg",
            "top_comments": [
                "“A “certain major country” is keen on unilateralism and protectionism and has caused “serious impact” on international rules and order, Xi also said, according to the official Xinhua News Agency.”\n\n👀",
                "What if this is actually a free trade forum wrapped in a climate change skin.",
                "Everytime I hear news like this, I always keep thinking of Biden last speech about how an oligarchy is taking over the us",
                "The US doesn't care about the climate anyway. Pffft hahaha. They literally just slapped a huge tariff on solar panels. Some US states you can't even have solar on your house at all. EPA gutted. What is a Kei car? Other than Honda, are there even any regular size or compact cars even being sold in America anymore?",
                "Of course the US isn't there. Remember when Al Gore was passionate about the environment and he became the laughingstock of the country for *over a decade*? Even now I hear jokes about him breaking his projector in anger over trees.",
                "The USA being pushed away from dominance is happening a lot faster than I thought it would. It hasn't even been a year yet.",
                "Nice, more focus on climate is always welcome and needed!",
                "The U.S. is too busy jerking off in the corner!",
                "I was really hoping the retaliatory tariffs against America would be emissions based. If trump wants to steer policy with tariffs then the rest of the world can to. Apply a carbon tax based on tariffs and force America to clean up their emissions and level the playing field so everyone else does too.",
                "EV sales climbed a steep hill until a sudden drop in late 2024 outside of China. One wonders why."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen DHS detained for 10 days has intellectual disabilities, family claims",
            "external_url": "https://www.cbsnews.com/news/us-citizen-detained-border-nogales-arizona-dhs-10-days-intellectual-disabilities/",
            "upvotes": 3262,
            "date": "04/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/23/14fb3429-566b-4d95-81be-1974b346a084/thumbnail/1200x630/5b6bfe980cc70a6eda9c720b3e19c86e/gettyimages-460250602.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "I mean is anyone actually surprised by this?\n\n\"You can't expect ICE or CBP agents to be able to determine if someone is mentally competent or whether they're here legally or not.\" - Trump supporters most definitely.\n\nThe racism, incompetence, disorganization, cruelty, corruption, criminal actions, and rationalizations from Trump and his supporters are just going to get worse and worse before they ever get better, if they ever do.",
                "They said he was picked up because he didn't have papers....\n\nFolks, that means as Americans you apparently need to bring your passport or birth certificate with you on a walk....",
                "My oldest son has an intellectual disability. He works and drives, though. He's a forklift driver. My worst fucking nightmare is him getting pulled over by a traffic cop. He would get scared and not really listen to instructions. We all know how American cops respond to that.",
                "“That’s double points!”\n- Republicans probably",
                ">On Monday, the Department of Homeland Security argued his arrest, which has attracted national attention, was a \"direct result of his own actions and statements.\" A DHS spokesperson said Hermosillo approached a Border Patrol agent, said he had entered the U.S. illegally and identified himself as a Mexican citizen.\n\nDo you people not understand it's the go-go 90s? Who has time to check if someone is a US citizen when we pick them up!? We have quotas to meet, people! Quo-tas! If they ain't white, we arrest 'em; them's the rules.",
                "Well he’s going on RFK Jr.’s list of undesirables now. Because that is apparently how America works now.",
                "And the government officials get upset when you call them Nazis.",
                "Twenty-some years ago, when I first heard mention of a possible \"Department of Homeland Security\" I was immediately revolted, having read \"The Rise and Fall of the Third Reich.\" Today I absolutely revile it. If we ever dream of once again becoming the Shining City on the Hill, we need to start by breaking this up into smaller pieces...and watching those pieces very carefully.",
                "This is the fascist stage that we were told wasn’t going to happen .",
                "My daughter is a Spanish-speaking US citizen who was born with partial brain damage. \n\nHer being detained is my greatest fear. She seems “normal” and it takes time and patience to understand her. She would admit to anything and she is very gullible. I mean at 12 she still believes in the tooth fairy, Santa, and the easter bunny. \n\nIf they took her I would end up in jail."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "USDA cuts $1 billion for schools and food banks to buy fresh food from local farms",
            "external_url": "https://www.tcpalm.com/story/news/local/florida/2025/04/21/trump-doge-usda-cuts-funding-for-schools-food-banks-to-buy-fresh-food-from-local-farms-florida/83083264007/",
            "upvotes": 2030,
            "date": "04/23/2025",
            "thumbnail": "https://www.tcpalm.com/gcdn/authoring/authoring-images/2024/10/14/PTCN/75672449007-tcn-irc-food-distribution-003.JPG?crop=5759,3241,x0,y299&width=3200&height=1801&format=pjpg&auto=webp",
            "top_comments": [
                "> local farms\n\nGutting them to be bought up by hedge fund corporations.",
                "\"Why won't Americans have more babies?!\"\n\nThis. Right. Fucking. Here. \nThey say that they want to feed American healthier but then they also cut all federal funding from programs that helped with ensuring that kids in schools could get access to fresh farm food. Everyone in this scenario won. The kids, the farmers, and the country as a whole. But nah, instead we have oligarchs dismantling our country before our very eyes and a third of America is rooting for it.",
                "First 100 days so far…\n\nPardons all violent Jan 6th criminals\n\n2 Israeli ceasefires collapse\n\nUkrainian ceasefire collapse/fail to launch\n\nWar with houthis/ signal gate 1.0 and 2.0\n\nLets houthis shoot down 10+ reaper drones\n\nThreatens invasion of partner countries/alienates allies (Greenland, Canada, Mexico and Panama)\n\nThreatens war with Iran\n\nThreatens NATO alliance\n\nDoes Russia’s bidding against Ukraine/propaganda, pulling aid, intel, capitulation to land demands\n\nMark Fogal released for Russian cyber criminal\n\nDismantles foreign cyber crime defense\n\nMultiple aviation accidents/blames DEI\n\nDEI historical removals like Jackie Robinson/ Enola gay\n\nReleases millions of gallons of water in CA to wrong place after fires\n\nAddresses none of deadly tornadoes in central plains (busy winning his own golf tournament)\n\nMarkets down 10-20% / worse month since depression/market manipulation\n\nBlows up his own trade deals and erases trillions from the market with dollar down 9%\n\nGiant tariff tax / global trade war / *no tariffs on Russia\n\nCrypto scams / Trump and Melania coins\n\nPardons Silk Road creator and crypto crooks\n\nUS boycotts/travel warnings/prolonged detainment\n\nFroze NIH research grants and preventing federally funded scientists from travelling or talking about their work.\n\nGutted USAID wasting billions in aid and costing lives\n\nCuts funding to public media like npr + pbs\n\nTook over Kennedy center\n\nHangs mug shot in White House\n\nLet’s elons kid put a booger on resolute desk\n\nDoge chainsaw to fed agencies with no DOD cuts and an actual increase in federal spending /mass “DEI firings”\n\nStops loans and programs like farm to school\n\nInvites dictators to the White House\n\nLoss of 1st and 5th amendment rights/deporting for opinions/due process/deporting homegrown criminals\n\nEl salvadorian detention camps/ Guantanamo bay failure\n\nThreatens loss of 14th amendment - birthright citizenship\n\nThreatens 16th amendment rights- congress setting tax rules\n\nThreatens 19th amendment - save act/women’s voting rights\n\nThreatens 22nd amendment - 3rd term\n\nWeaponizes justice department/ Tesla vandalism = terrorism/ Jan 6 revenge\n\nMeasles + bird flu\n\nWasted 30k real eggs on Easter\n\nF-47 jet and proposals for his image on currency, Rushmore, airport naming\n\nCanceled Ebola prevention funding\n\nEliminates FDA regulations on food\n\nOpens federal forests for logging and opens protected ocean space for fishing/drilling\n\nWhite House = Tesla dealership\n\nGolf trips EVERY weekend and some weekdays\n\nWastes millions attending Super Bowl, NASCAR, and ufc events\n\nTrump Gaza /wants to create golden idols of himself\n\nAttacks and sues private, state, and federal entities over constitutional rights/extortion\n\nAttacks on trans including troops\n\nAttacks the independence of the FED\n\nPro Child labor legislation\n\nGets rid of price caps on medicine like insulin\n\nReverses student loan forgiveness\n\nTries to reverse overdraft fee protection\n\nReverses climate legislation/guts epa\n\nViolation of Separation of powers /criminal contempt\n\nMass Illegal Deportations\n\nMasked secret police kidnapping people\n\nRevoked citizenship for hundreds of thousands of refugees\n\nMass protests in all 50 states\n\nDidn’t know about dead soldiers in Lithuania/golfed with Saudis instead of being there for dignified transfer of bodies\n\nDidn’t release Epstein Files\n\nSays “these things happen” after Florida school shooting\n\nNo “no tax on tips/overtime”\n\nBrain worm autism theory/ persons list\n\nFruit loops made with real colors\n\nSOH gets robbed and does glam shoot with foreign prisoners\n\nDOI lies under oath\n\nA1 sauce secretary of education\n\nTrump GOLD card for Russian oligarchs\n\nAnnounces military parade for his birthday\n\n“Got rid” of PaPer straWs\n\nMade shower heads Great Again\n\nBaby bonus/mommy medals\n\n100ft flag pole at the White House\n\nGulF of AmEriCA",
                "\"Fuck them kids and little people\" really is the Republican platform, huh?",
                "People will focus on the school / food bank part of this, rightfully so, but this is an act to allow the mega corporations to buy up the last of the mom and pop farms who barely are able to exist as it is.",
                "These cuts disproportionately impact rural and low-income areas, many of which are located in red counties, where schools often rely heavily on federal assistance to provide meals to students. The reduction in funding may lead to increased food insecurity among students in these regions, potentially affecting their academic performance and overall well-being.\n\nThat's ok, though. Trump doesn't want you smart. Trump wants desperate, useful idiots.\n\nWho knew that wanting children to have any food at all was \"woke\"? I thought that children were the future/our most precious resource/some other platitude, but I stand corrected. Let the little children starve to death so they can meet God sooner.",
                "maybe don't do that if you want people to have kids, Trump.",
                "So much fraud!  So much abuse!  Imagine those poor, hungry kids taking two apples?!  \n\nThank goodness we nipped this in the bud.  So great again.\n\ns/",
                "Farmers with giant “Farmers for Trump” signs in your fields: you may notice an unusual number of chickens returning home. I think they were clucking about wanting to roost.",
                "Same week RFK Jr. claimed sugar is POISON the same administration took away access to fresh produce to millions of children. \n\nClassic Republicanism."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Dozen states sue Trump in bid to block new tariffs",
            "external_url": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
            "upvotes": 35601,
            "date": "04/23/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108102916-1739560760118-gettyimages-2199659780-mms20867_kamriiiu.jpeg?v=1745437525&w=1920&h=1080",
            "top_comments": [
                "In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont",
                "Good, because this shit is weeks away from causing about half my industry to disappear.",
                "Take me back to 2024 before this administration",
                "There was clip of powerful bankers in his office and he  was saying he made 900 million yesterday, and this other guy made 2.5 billion. He’s causing dips on purpose so him and rich friends can buy low and then sell later. He announced some tariffs a while back then walked them back 90 days later. This is market manipulation.",
                "If you live in a red state (like me) and are thinking of moving somewhere away from the madness (at least a little bit) then you now have a list of states that will at least try to stand up for their citizens in the face of this insanity. \n\n\"In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont.\"\n\nNot saying there's not crazy to be had everywhere, but I'm going to assume most of these states are not trying to make it illegal to speak badly about Trump, make Trump's birthday a holiday, rename major airport after him, and ask his administration with help in ensuring they'll be able to keep the billions in federal tax subsidies for public education after they pass an unconstitutional bill to ban undocumented kids from public schools. All of this and more is happening in Tennessee- and the news says the tariffs will hurt TN too- but our spineless and horrid super majority GOP state government is too busy doing racist, bigoted victory laps to care.",
                "Taxation without representation!  Throw it all into the harbor, boys!",
                "I work for a solar company who everyone here (aside from me) are Trump voters. Yet they’re all still licking his boot.",
                "Couldn't they just get their congress members to, do their job instead?",
                "Thank you to every single state doing this, sadly I'm not in one.",
                "It’s one of the single dumbest things I’ve ever seen an individual do. And he happens to be the most powerful individual in the world. Pretty amazing, in a weird way"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Book publishers see surging interest in the US Constitution and print new editions",
            "external_url": "https://apnews.com/article/constitution-declaration-independence-federalist-sales-meacham-5566e2c9ea4206f335dd912e9807bcf7",
            "upvotes": 931,
            "date": "04/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Like buying an artist's art when you find out they are dying. ",
                "Get 'em while you can; I'm sure this will be considered \"seditious materiel\" and get you shipped off to El Salvador soon enough.",
                "*“It is a tumultuous moment ... to put it kindly,” Meacham said. “One way to address the chaos of the present time, what Saint Paul would call the ‘tribulations’ of the present time, is to re-engage with the essential texts that are about creating a system that is still worth defending.”*\n\nThis means returning to external criteria, to political principles recognized outside oneself. It's a good direction to go in as long as enough agree to these truths.",
                "Send them daily to every Republican in Congress.",
                "I’ve had two copies of the declaration and constitution for many many years now and I JUST noticed that one of them is printed by the Heritage foundation 😒\n\nHow ironic they’d print it back in the day as they now try to assist and are succeeding in trampling the very thing they were touting as “the greatest document in human history” in the booklet",
                "I get what they mean, but “new editions” feels a little ominous 🤣",
                "Constitution might be the next thing that disappears to El Salvador or his bathroom at Maro Lago.",
                "Not in the Whitehouse.   No be there thinks it’s much above toilet paper",
                "Gotta clear out the old version before V2 comes in! Now with gold TRUMP branding! (Contents may be slightly edited).",
                "On one hand: having a printed copy of the constitution on hand at all times is something Americans may want to consider given the whole \"perpetual dumpster fire\" thing.\n\nOn the other hand: the only thing in there most people seem to care about (at least to an outsider) is being allowed to have guns."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 14969,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.\n\nEdit Apologies, he may be at a concentration camp or death camp instead. I was going off the fact that the president of El Salvador said that he was going to be using these prisoners for labor.",
                "How many people have been disappeared that we don't  even know about?",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                ">Adrián, 27, came to the United States in 2023 by appointment through the CBP One app. Alejandro provided NBC News a photo of a printout confirming his brother’s June 12, 2023, appointment.  \n\n>Adrián had also applied for temporary protected status, according to a Dec. 1, 2024, document from U.S. Citizenship and Immigration Services, a part of DHS that handles immigration benefits. \n\nSo this guy did EXACTLY what the government asked him to do to come in legally, and they still said he was here illegally.",
                "\"The law holds that it is better that ten guilty persons escape than that one innocent suffer.\"\n\n\\-- William Blackstone, 1760s\n\n\"We're getting them out... and you can't have a trial for all of these people.\"\n\n\\-- Donald Trump, 04/22/2025",
                "> Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.”\n\nLiterally the administration is arguing that they shouldn’t have to prove anything in court or anywhere else.  They scoop people off the street, deport them to a foreign gulag, and when asked why, respond “trust me bro. . . “\n\nHow conservatives can defend this shit is beyond me.",
                "This is disgusting and disgraceful",
                "This is so goddamn repulsive. It’s ghoulish.",
                "That’s the thing… they’re all crying “We’re not members of Tren de Agua!” But the problem is we’ll never know. They never got to respond to the government’s very serious allegations against them and are now indefinitely detained in a country they are not from. This is actually really fucked."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Judge orders Bail hearing for detained student Mohsen Madawi next week",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/23/mohsen-mahdawi-bail-hearing-vermont",
            "upvotes": 268,
            "date": "04/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/75d5898aee9335ce81b695efcf019d85ff8860a9/0_429_5712_3426/master/5712.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0f86fa44c0543cfb5cd4d62b5f673be5",
            "top_comments": [
                "It's wild how little the media seems to talk about the fact that a law that allows people to be deported as \"security risks\" for saying things the government doesn't like is about as clear cut of an example of abridging the freedom of speech as you can get.  It seems like the only time an outlet brings up the blatant 1A violation is if they're quoting someone else.  You'd think a free press would be more concerned with these violations.\n\n\nIf our courts weren't so hopelessly corrupted by authoritarian right wingers this sort of shit would be shot down immediately and repeatedly.",
                "Hopefully being located in Vermont will give him a stronger chance at bail! Others who've had their hearings (Khalil and Öztürk) have been denied - no surprise, considering the system in Louisiana is corrupt as hell."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/latino/venezuelan-brother-deported-el-salvador-family-looking-rcna202279",
            "upvotes": 537,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "Just like in Trump's first term where they had no idea where the parents were sent after they separated them from their children.",
                "These poor families, it must be terrifying to not know where your family member is for 40 days, then to learn he is in a country he’s not even from in a prison known for human rights violations. Guy was just trying to go to work, how awful",
                "People who never committed any crimes are being thrown into torture camps with no way to get out by the American government. Never thought I would live to see this.",
                "They don't believe the families or the victims have rights.",
                "I like how the administration refuse to show proof this guy was a gang member.  This is a common fascist plot.  Mark someone as enemy. Refuse due process. Disappear them.  One the system is perfected, they can do the same to their political critics.",
                "If it was his brother. He may want to stay under the radar.",
                "At least have the balls to tell him you DHS asshats."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 2185,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Another red state discovers leopards.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?",
                "Voted for this, just like GOP will gut rural American welfare under the flag that Cities using it all.   NOPE,  It’s farmers and Rural Communities that rely on Social Services the most and you just cut your own funding.   WE TOLD YOU this would happen."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 6212,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "He’s an abject failure of a human.",
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "First it was the leaks, now he has gone rouge.",
                "Truly a “ non military wimp “ - no example for soldiers",
                "Shouldn’t this be in r/nottheonion ?",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "World Leaders From China to EU Hold Climate Meeting Without US",
            "external_url": "https://financialpost.com/pmn/business-pmn/world-leaders-from-china-to-eu-hold-climate-meeting-without-us",
            "upvotes": 1623,
            "date": "04/23/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/775566467.jpg",
            "top_comments": [
                "“A “certain major country” is keen on unilateralism and protectionism and has caused “serious impact” on international rules and order, Xi also said, according to the official Xinhua News Agency.”\n\n👀",
                "What if this is actually a free trade forum wrapped in a climate change skin.",
                "Everytime I hear news like this, I always keep thinking of Biden last speech about how an oligarchy is taking over the us",
                "The US doesn't care about the climate anyway. Pffft hahaha. They literally just slapped a huge tariff on solar panels. Some US states you can't even have solar on your house at all. EPA gutted. What is a Kei car? Other than Honda, are there even any regular size or compact cars even being sold in America anymore?",
                "Of course the US isn't there. Remember when Al Gore was passionate about the environment and he became the laughingstock of the country for *over a decade*? Even now I hear jokes about him breaking his projector in anger over trees.",
                "The USA being pushed away from dominance is happening a lot faster than I thought it would. It hasn't even been a year yet.",
                "Nice, more focus on climate is always welcome and needed!",
                "The U.S. is too busy jerking off in the corner!",
                "I was really hoping the retaliatory tariffs against America would be emissions based. If trump wants to steer policy with tariffs then the rest of the world can to. Apply a carbon tax based on tariffs and force America to clean up their emissions and level the playing field so everyone else does too.",
                "EV sales climbed a steep hill until a sudden drop in late 2024 outside of China. One wonders why."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 14961,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.\n\nEdit Apologies, he may be at a concentration camp or death camp instead. I was going off the fact that the president of El Salvador said that he was going to be using these prisoners for labor.",
                "How many people have been disappeared that we don't  even know about?",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                ">Adrián, 27, came to the United States in 2023 by appointment through the CBP One app. Alejandro provided NBC News a photo of a printout confirming his brother’s June 12, 2023, appointment.  \n\n>Adrián had also applied for temporary protected status, according to a Dec. 1, 2024, document from U.S. Citizenship and Immigration Services, a part of DHS that handles immigration benefits. \n\nSo this guy did EXACTLY what the government asked him to do to come in legally, and they still said he was here illegally.",
                "\"The law holds that it is better that ten guilty persons escape than that one innocent suffer.\"\n\n\\-- William Blackstone, 1760s\n\n\"We're getting them out... and you can't have a trial for all of these people.\"\n\n\\-- Donald Trump, 04/22/2025",
                "> Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.”\n\nLiterally the administration is arguing that they shouldn’t have to prove anything in court or anywhere else.  They scoop people off the street, deport them to a foreign gulag, and when asked why, respond “trust me bro. . . “\n\nHow conservatives can defend this shit is beyond me.",
                "This is disgusting and disgraceful",
                "This is so goddamn repulsive. It’s ghoulish.",
                "That’s the thing… they’re all crying “We’re not members of Tren de Agua!” But the problem is we’ll never know. They never got to respond to the government’s very serious allegations against them and are now indefinitely detained in a country they are not from. This is actually really fucked."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "USDA cuts $1 billion for schools and food banks to buy fresh food from local farms",
            "external_url": "https://www.tcpalm.com/story/news/local/florida/2025/04/21/trump-doge-usda-cuts-funding-for-schools-food-banks-to-buy-fresh-food-from-local-farms-florida/83083264007/",
            "upvotes": 2031,
            "date": "04/23/2025",
            "thumbnail": "https://www.tcpalm.com/gcdn/authoring/authoring-images/2024/10/14/PTCN/75672449007-tcn-irc-food-distribution-003.JPG?crop=5759,3241,x0,y299&width=3200&height=1801&format=pjpg&auto=webp",
            "top_comments": [
                "> local farms\n\nGutting them to be bought up by hedge fund corporations.",
                "\"Why won't Americans have more babies?!\"\n\nThis. Right. Fucking. Here. \nThey say that they want to feed American healthier but then they also cut all federal funding from programs that helped with ensuring that kids in schools could get access to fresh farm food. Everyone in this scenario won. The kids, the farmers, and the country as a whole. But nah, instead we have oligarchs dismantling our country before our very eyes and a third of America is rooting for it.",
                "First 100 days so far…\n\nPardons all violent Jan 6th criminals\n\n2 Israeli ceasefires collapse\n\nUkrainian ceasefire collapse/fail to launch\n\nWar with houthis/ signal gate 1.0 and 2.0\n\nLets houthis shoot down 10+ reaper drones\n\nThreatens invasion of partner countries/alienates allies (Greenland, Canada, Mexico and Panama)\n\nThreatens war with Iran\n\nThreatens NATO alliance\n\nDoes Russia’s bidding against Ukraine/propaganda, pulling aid, intel, capitulation to land demands\n\nMark Fogal released for Russian cyber criminal\n\nDismantles foreign cyber crime defense\n\nMultiple aviation accidents/blames DEI\n\nDEI historical removals like Jackie Robinson/ Enola gay\n\nReleases millions of gallons of water in CA to wrong place after fires\n\nAddresses none of deadly tornadoes in central plains (busy winning his own golf tournament)\n\nMarkets down 10-20% / worse month since depression/market manipulation\n\nBlows up his own trade deals and erases trillions from the market with dollar down 9%\n\nGiant tariff tax / global trade war / *no tariffs on Russia\n\nCrypto scams / Trump and Melania coins\n\nPardons Silk Road creator and crypto crooks\n\nUS boycotts/travel warnings/prolonged detainment\n\nFroze NIH research grants and preventing federally funded scientists from travelling or talking about their work.\n\nGutted USAID wasting billions in aid and costing lives\n\nCuts funding to public media like npr + pbs\n\nTook over Kennedy center\n\nHangs mug shot in White House\n\nLet’s elons kid put a booger on resolute desk\n\nDoge chainsaw to fed agencies with no DOD cuts and an actual increase in federal spending /mass “DEI firings”\n\nStops loans and programs like farm to school\n\nInvites dictators to the White House\n\nLoss of 1st and 5th amendment rights/deporting for opinions/due process/deporting homegrown criminals\n\nEl salvadorian detention camps/ Guantanamo bay failure\n\nThreatens loss of 14th amendment - birthright citizenship\n\nThreatens 16th amendment rights- congress setting tax rules\n\nThreatens 19th amendment - save act/women’s voting rights\n\nThreatens 22nd amendment - 3rd term\n\nWeaponizes justice department/ Tesla vandalism = terrorism/ Jan 6 revenge\n\nMeasles + bird flu\n\nWasted 30k real eggs on Easter\n\nF-47 jet and proposals for his image on currency, Rushmore, airport naming\n\nCanceled Ebola prevention funding\n\nEliminates FDA regulations on food\n\nOpens federal forests for logging and opens protected ocean space for fishing/drilling\n\nWhite House = Tesla dealership\n\nGolf trips EVERY weekend and some weekdays\n\nWastes millions attending Super Bowl, NASCAR, and ufc events\n\nTrump Gaza /wants to create golden idols of himself\n\nAttacks and sues private, state, and federal entities over constitutional rights/extortion\n\nAttacks on trans including troops\n\nAttacks the independence of the FED\n\nPro Child labor legislation\n\nGets rid of price caps on medicine like insulin\n\nReverses student loan forgiveness\n\nTries to reverse overdraft fee protection\n\nReverses climate legislation/guts epa\n\nViolation of Separation of powers /criminal contempt\n\nMass Illegal Deportations\n\nMasked secret police kidnapping people\n\nRevoked citizenship for hundreds of thousands of refugees\n\nMass protests in all 50 states\n\nDidn’t know about dead soldiers in Lithuania/golfed with Saudis instead of being there for dignified transfer of bodies\n\nDidn’t release Epstein Files\n\nSays “these things happen” after Florida school shooting\n\nNo “no tax on tips/overtime”\n\nBrain worm autism theory/ persons list\n\nFruit loops made with real colors\n\nSOH gets robbed and does glam shoot with foreign prisoners\n\nDOI lies under oath\n\nA1 sauce secretary of education\n\nTrump GOLD card for Russian oligarchs\n\nAnnounces military parade for his birthday\n\n“Got rid” of PaPer straWs\n\nMade shower heads Great Again\n\nBaby bonus/mommy medals\n\n100ft flag pole at the White House\n\nGulF of AmEriCA",
                "\"Fuck them kids and little people\" really is the Republican platform, huh?",
                "People will focus on the school / food bank part of this, rightfully so, but this is an act to allow the mega corporations to buy up the last of the mom and pop farms who barely are able to exist as it is.",
                "These cuts disproportionately impact rural and low-income areas, many of which are located in red counties, where schools often rely heavily on federal assistance to provide meals to students. The reduction in funding may lead to increased food insecurity among students in these regions, potentially affecting their academic performance and overall well-being.\n\nThat's ok, though. Trump doesn't want you smart. Trump wants desperate, useful idiots.\n\nWho knew that wanting children to have any food at all was \"woke\"? I thought that children were the future/our most precious resource/some other platitude, but I stand corrected. Let the little children starve to death so they can meet God sooner.",
                "maybe don't do that if you want people to have kids, Trump.",
                "So much fraud!  So much abuse!  Imagine those poor, hungry kids taking two apples?!  \n\nThank goodness we nipped this in the bud.  So great again.\n\ns/",
                "Farmers with giant “Farmers for Trump” signs in your fields: you may notice an unusual number of chickens returning home. I think they were clucking about wanting to roost.",
                "Same week RFK Jr. claimed sugar is POISON the same administration took away access to fresh produce to millions of children. \n\nClassic Republicanism."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Book publishers see surging interest in the US Constitution and print new editions",
            "external_url": "https://apnews.com/article/constitution-declaration-independence-federalist-sales-meacham-5566e2c9ea4206f335dd912e9807bcf7",
            "upvotes": 927,
            "date": "04/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Like buying an artist's art when you find out they are dying. ",
                "Get 'em while you can; I'm sure this will be considered \"seditious materiel\" and get you shipped off to El Salvador soon enough.",
                "*“It is a tumultuous moment ... to put it kindly,” Meacham said. “One way to address the chaos of the present time, what Saint Paul would call the ‘tribulations’ of the present time, is to re-engage with the essential texts that are about creating a system that is still worth defending.”*\n\nThis means returning to external criteria, to political principles recognized outside oneself. It's a good direction to go in as long as enough agree to these truths.",
                "Send them daily to every Republican in Congress.",
                "I’ve had two copies of the declaration and constitution for many many years now and I JUST noticed that one of them is printed by the Heritage foundation 😒\n\nHow ironic they’d print it back in the day as they now try to assist and are succeeding in trampling the very thing they were touting as “the greatest document in human history” in the booklet",
                "I get what they mean, but “new editions” feels a little ominous 🤣",
                "Constitution might be the next thing that disappears to El Salvador or his bathroom at Maro Lago.",
                "Not in the Whitehouse.   No be there thinks it’s much above toilet paper",
                "Gotta clear out the old version before V2 comes in! Now with gold TRUMP branding! (Contents may be slightly edited).",
                "On one hand: having a printed copy of the constitution on hand at all times is something Americans may want to consider given the whole \"perpetual dumpster fire\" thing.\n\nOn the other hand: the only thing in there most people seem to care about (at least to an outsider) is being allowed to have guns."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Judge orders Bail hearing for detained student Mohsen Madawi next week",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/23/mohsen-mahdawi-bail-hearing-vermont",
            "upvotes": 268,
            "date": "04/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/75d5898aee9335ce81b695efcf019d85ff8860a9/0_429_5712_3426/master/5712.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0f86fa44c0543cfb5cd4d62b5f673be5",
            "top_comments": [
                "It's wild how little the media seems to talk about the fact that a law that allows people to be deported as \"security risks\" for saying things the government doesn't like is about as clear cut of an example of abridging the freedom of speech as you can get.  It seems like the only time an outlet brings up the blatant 1A violation is if they're quoting someone else.  You'd think a free press would be more concerned with these violations.\n\n\nIf our courts weren't so hopelessly corrupted by authoritarian right wingers this sort of shit would be shot down immediately and repeatedly.",
                "Hopefully being located in Vermont will give him a stronger chance at bail! Others who've had their hearings (Khalil and Öztürk) have been denied - no surprise, considering the system in Louisiana is corrupt as hell."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Dozen states sue Trump in bid to block new tariffs",
            "external_url": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
            "upvotes": 35598,
            "date": "04/23/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108102916-1739560760118-gettyimages-2199659780-mms20867_kamriiiu.jpeg?v=1745437525&w=1920&h=1080",
            "top_comments": [
                "In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont",
                "Good, because this shit is weeks away from causing about half my industry to disappear.",
                "Take me back to 2024 before this administration",
                "There was clip of powerful bankers in his office and he  was saying he made 900 million yesterday, and this other guy made 2.5 billion. He’s causing dips on purpose so him and rich friends can buy low and then sell later. He announced some tariffs a while back then walked them back 90 days later. This is market manipulation.",
                "If you live in a red state (like me) and are thinking of moving somewhere away from the madness (at least a little bit) then you now have a list of states that will at least try to stand up for their citizens in the face of this insanity. \n\n\"In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont.\"\n\nNot saying there's not crazy to be had everywhere, but I'm going to assume most of these states are not trying to make it illegal to speak badly about Trump, make Trump's birthday a holiday, rename major airport after him, and ask his administration with help in ensuring they'll be able to keep the billions in federal tax subsidies for public education after they pass an unconstitutional bill to ban undocumented kids from public schools. All of this and more is happening in Tennessee- and the news says the tariffs will hurt TN too- but our spineless and horrid super majority GOP state government is too busy doing racist, bigoted victory laps to care.",
                "Taxation without representation!  Throw it all into the harbor, boys!",
                "I work for a solar company who everyone here (aside from me) are Trump voters. Yet they’re all still licking his boot.",
                "Couldn't they just get their congress members to, do their job instead?",
                "Thank you to every single state doing this, sadly I'm not in one.",
                "It’s one of the single dumbest things I’ve ever seen an individual do. And he happens to be the most powerful individual in the world. Pretty amazing, in a weird way"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "State of emergency declared as New Jersey wildfire explodes to 11,500 acres",
            "external_url": "https://abcnews.go.com/US/wildfire-new-jersey-explodes-8500-acres-residents-evacuated/story?id=121075913",
            "upvotes": 2879,
            "date": "04/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/ca0c92e6-61d6-4694-b4b3-a7acdc32e79f/nj-wildfire-2-ap-gmh-250423_1745423871343_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "For reference, that's nearly 18sq miles on fire. \n\nThat's larger than Jersey City - not counting the surface area of the Hudson & Hackensack rivers - and is only only slightly smaller than the city of Newark.",
                "[Trump fired the people who would normally be working to fight this fire.](https://www.govexec.com/federal-news/2025/04/trump-said-cuts-wouldnt-affect-public-safety-then-he-fired-hundreds-workers-who-help-fight-wildfires/404552/) If you think the DOGE cuts are a good thing, I ask you to not vote and stay away from the polls because I'm tired of seeing how people are getting hurt by Trump and Elon Musk.",
                "The fact that this is happening on the US East Coast is very concerning; unlike SoCal, the East Coast is supposed to get a lot more rain and is much more wet. It’s a completely different biome and it’s not supposed to be this dry.\n\n[Here](https://unitedstatesmaps.org/wordpress/wp-content/uploads/2021/07/usa-climate-map.pdf) is a map showing climate zones for reference.\n\n[Here](https://gisgeography.com/us-precipitation-map/) is another map that is more geared towards annual rainfall.",
                "My fellow Americans are about to discover that a lot of the jobs gutted by Trump and DOGE were thankless and were of the utmost importance to us functioning as a country. Oh well, at least that trans third grader in Iowa can be banned from playing soccer. /s",
                "Did they try turning on the water?",
                "So I live literally the town under this fire, the place it started \"Wells Mills County Park\" is like 10+ mins away. \n\nI woke up to my car with burnt wood on it. My university which is a half hour south has ash in the air flying. The parkway was closed entirely yesterday from Toms River to Manahawkin. That's a 30 minute stretch of a major highway closed. \n\nI read a comment in r/SouthJersey stating that a dude got out of work at 4 pm and got home at midnight. Lacey and Barnegat Townships got evacuated and power shut off. It's absolutely crazy and only now of this comment 35 percent contained.",
                "[visuals of the wildfire](https://www.reddit.com/r/USA24x7/s/52JAoOaI8n)",
                "Oh jeez, I wonder where our wildland firefighters went.",
                "Is Trump going to blame this on not sweeping the forests and poor water conservation in reservoirs hundreds of miles away from the fires?",
                "Wait, but trump said wild fires were woke and no fire would ever start again in his term"
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "04/24/2025 04:11:23 UTC"
}