{
    "posts": [
        {
            "category": "HOT",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 23362,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "It's always the ones you most suspect. ",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "This is the free space on the BINGO card",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Thanks for reminding me that it's Wednesday, I almost missed movie night.",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 12587,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "Well, it's better than having the rocket blow up.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "I'm genuinely curious if reddit is astro turfed or if people don't read. Horrible headline but the top voted comments are shocking .",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 2089,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "i think that's illegal",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "The cruelty is the point. Never let them convince you otherwise.",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 4475,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "So glad we elected Trump to Make America Healthy Again",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane.",
                "“We don’t need trees from Canada, we have National Parks”"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "HOT",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 13766,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "Fuck the environment, fuck affordable healthcare, fuck vaccines, fuck FDA regulations for food handling! Being alive and healthy is woke liberal garbage! Let me breathe asbestos and eat lead and contract preventable diseases like our forefathers intended 😡"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 25250,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "Imagine being Putin and planning for this day for so long and finally seeing it come together.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "Minnesota is a blue state but all the farm areas are red as hell.  Good hit those soybeans, I have no more empthany for those people.  \n\nFarmers in Blue States really get me upset (I grew up among them), Minnesota has some of the best social programs and protections in the nation and all of them just shit on the Gov and everyone from the Twin Cities.  They themselves benefit from these programs and then talk about how great Christie Noem is from South Dakota.  GO FUCKING MOVE THERE THEN (yeah i know she's not the gov now) \n\nThey also hate anyone who accepts any assistance or benefits like snap or welfare, yet they're the biggest welfare queens I've ever met.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "They should have hit tech. That's all trump cares about because they stand in his room. Mark Twitter for being blocked, tons of valid reasons. Mark Apple because they store data in the US.\n\nMake them bleed where they live, they don't care about farmers.",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "If this keeps up, 2025 will go down as the beginning of The Great Tariff War.  The worst taxation since our ancestor threw tea into the harbor in protest."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 6401,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "This is not nearly as big a deal as some people think.",
                "Getting harder and harder to hate the French ffs",
                "Clearly a baguette class submarine",
                "I hope it stays there until trump is out of office",
                "I love the French.\n\nMacron should request that the U.S. return the Statue of Liberty since \"they arent using it\" anymore."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 5847,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "I was in a combat infantry unit. Our platoon initiation ritual consisted of inducted members holding down the new guys one at a time, yanking their pants down, beating their bare ass red then mock raping them by thrusting against their butt (while still clothed).  \n\nEvery man in my platoon swore up and down he was straight and I have no reason to doubt any of them.  \n\nWould I have trusted them to look after me in combat after that ritual sexual assault? Some of them, sure. Others, not so much. They took too much delight in meteing out pain and humiliation on me. And that's not even mentioning the rabidly Christian guys who found my atheism a cause for concern.  \n\nNot a drag queen. Not a trans person. Not an immigrant without documentation. These were all American men, born and raised, cis-het to the last.",
                ">Judge Reyes similarly pressed the government to explain the Pentagon's concerns about transgender soldiers facing a higher risk of suicidal ideation, saying the government fundamentally misunderstood the studies that were cited to defend the policy. At one point in the hearing, she considered ordering the attorneys to read the studies, which the attorneys admitted they had never read.\n\nThis article leaves out a few details.\n\nShe had told them, three weeks ago, that she was going to question them about these studies and they should be able to answer questions about them.\n\nAnd since they said today that they hadn't read them, she sent them to their rooms for a half hour to do so.\n\nAnd in response to this:\n\n>\"DoD has been particularly cautious about service by individuals with mental health conditions, given the unique mental and emotional stresses of military service,\" government lawyers argued.\n\nShe pointed out how one study said that one group of trans soldiers had been deployed for *longer* than their non-trans counterparts and had a lower diagnosis of depression afterwards."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 2584,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "Fascism, pure and simple",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Can someone please tell me exactly what this guy has done?",
                "Why did they send him to Louisiana?",
                "This is perhaps the most egregious First Amendment violation of many of our lifetimes.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Trump's regime and his supporters: Fuck the Constitution!",
                "This should be alarming regardless of your politics. This should absolutely be the final straw for anyone. Sadly too many will justify it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Mahmoud Khalil Speaks With Attorneys for First Time Since Detention",
            "external_url": "https://www.dropsitenews.com/p/mahmoud-khalil-speaks-with-attorneys-ice-detention",
            "upvotes": 321,
            "date": "03/13/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6005cfd2-d8d4-4482-9c12-58c3070c6433_7581x5054.jpeg",
            "top_comments": [
                "Just about to turn 60 and I don't recall a recent time where I've felt as sad for my country as these last few months. One third of this country supports this shit and another third appears asleep. I weep for my country.",
                "It just seems so blatant. Can anybody defend this? Does anybody know anything I'm missing? He has not been charged with any crime. He is in the country legally. I don't care if you are completely on the opposite side of the political spectrum from him. I can see no justification why this arrest is ok. Guess MAGA hates freedom.",
                "Trump was explicitly elected to terrorize the left and MAGA won’t stop until they get a reign of terror instituted as state policy.",
                "I don’t like Trump at all but this guy is a professional agitator paid by Iran. All this goodwill and energy deserves a beter cause.",
                "The internet has been turned into a weapon.  It has turned citizens against people who disagree with the seed that has been planted in their brain.",
                "US support for Israel is immoral and has been since 1948 at least. US policy regarding Israel [led to the 9/11 attacks](https://www.the-independent.com/voices/9-11-osama-bin-laden-interview-robert-fisk-world-trade-center-attack-al-qaeda-terror-a8532256.html) and the October 7 attacks and the $ [8 trillion war on terror](https://watson.brown.edu/costsofwar/figures/2021/BudgetaryCosts) (the wealth equivalent of 20 million homes).\n\n The 9/11 attacks are [why people like Trump exist in the first place](https://www.amazon.com/Reign-Terror-Destabilized-America-Produced/dp/1984879774). \n\n[https://www.reddit.com/r/Global\\_News\\_Hub/comments/1ij11wd/comment/mbcyfk3/](https://www.reddit.com/r/Global_News_Hub/comments/1ij11wd/comment/mbcyfk3/)\n\nEvil is unnatural and requires constant support and maintenance to keep going. This is why the Trump administration is going after people like Khalil.",
                "ITT: Liberals act surprised that a man on a student visa encouraging terrorism goes to jail and gets deported for encouraging terrorism."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Mahmoud Khalil Speaks With Attorneys for First Time Since Detention",
            "external_url": "https://www.dropsitenews.com/p/mahmoud-khalil-speaks-with-attorneys-ice-detention",
            "upvotes": 321,
            "date": "03/13/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6005cfd2-d8d4-4482-9c12-58c3070c6433_7581x5054.jpeg",
            "top_comments": [
                "Just about to turn 60 and I don't recall a recent time where I've felt as sad for my country as these last few months. One third of this country supports this shit and another third appears asleep. I weep for my country.",
                "It just seems so blatant. Can anybody defend this? Does anybody know anything I'm missing? He has not been charged with any crime. He is in the country legally. I don't care if you are completely on the opposite side of the political spectrum from him. I can see no justification why this arrest is ok. Guess MAGA hates freedom.",
                "Trump was explicitly elected to terrorize the left and MAGA won’t stop until they get a reign of terror instituted as state policy.",
                "I don’t like Trump at all but this guy is a professional agitator paid by Iran. All this goodwill and energy deserves a beter cause.",
                "The internet has been turned into a weapon.  It has turned citizens against people who disagree with the seed that has been planted in their brain.",
                "US support for Israel is immoral and has been since 1948 at least. US policy regarding Israel [led to the 9/11 attacks](https://www.the-independent.com/voices/9-11-osama-bin-laden-interview-robert-fisk-world-trade-center-attack-al-qaeda-terror-a8532256.html) and the October 7 attacks and the $ [8 trillion war on terror](https://watson.brown.edu/costsofwar/figures/2021/BudgetaryCosts) (the wealth equivalent of 20 million homes).\n\n The 9/11 attacks are [why people like Trump exist in the first place](https://www.amazon.com/Reign-Terror-Destabilized-America-Produced/dp/1984879774). \n\n[https://www.reddit.com/r/Global\\_News\\_Hub/comments/1ij11wd/comment/mbcyfk3/](https://www.reddit.com/r/Global_News_Hub/comments/1ij11wd/comment/mbcyfk3/)\n\nEvil is unnatural and requires constant support and maintenance to keep going. This is why the Trump administration is going after people like Khalil.",
                "ITT: Liberals act surprised that a man on a student visa encouraging terrorism goes to jail and gets deported for encouraging terrorism."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Chinese company develops nuclear battery with ultra-long lifespan",
            "external_url": "http://en.people.cn/n3/2025/0313/c90000-20288708.html",
            "upvotes": 6,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Elon Musk, SpaceX launch delay strands astronauts stuck on ISS",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/?utm_source=reddit.com",
            "upvotes": 106,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "###It is *not* a stranding.\n\nNo one was ever stranded, they were delayed. It was always just a delay. The capsule that will bring Sunni and Butch home was *already docked* when they arrived, and *always* had two seats reserved for them, as the backup plan. \n\n*They were never stranded, they were just held up (for a long time).*",
                "Thank you CERN for fucking up our timeline",
                "Trump falsely accuses Biden of stranding astronauts. Trump gets elected President (In Name Only). Finally Trump, through Musk, ACTUALLY strands astronauts... All within a span of six months.\n\n  \nHoly shit. I can't handle how fake this reality feels, anymore.",
                "JOe bIdEn LeFt tHeM thEre",
                "Fund NASA- think of their bone density.",
                "So the delay is due to a hydraulic system issue on the launch pad. They plan on launching Friday, a whole 2 days. This title seems overly politicized and not of good faith. Kinda sad for Reuters.",
                "Very one who calls them “stranded” or “stuck” is purposefully perpetuating an agenda. They have their own capsule to return on. They are just waiting for this capsule to arrive so there are enough people on the ISS.\n\nLet me explain. You have the early shift at a store in a city 20 minutes away from your home by car. Your co-worker who is supposed to do the late shift is due to arrive when his shift starts. When he does, you can get into your own car and leave. However, 1 hour after your early shift starts everyone is complaining that you are stuck and stranded at your work. Then your boss is declaring that he gave special command to your supervised to make sure your co-worker arrives when he was always meant to be so you can get rescued from your job in the car that was always parked in front of the store",
                "Musk too busy retweeting Acc like Blackstakingls or Garbagehuman to look into it. ",
                "And he was whinging about not being allowed to take them before.",
                "Did you change the title to Elon Musk rather than NASA? It doesn't even make any sense. Was Elon Musk supposed to launch?\n\nIt's a joint venture, that's why it rightly says \"NASA, SpaceX launch delay\"\n\nGod that's lame"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 2090,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "i think that's illegal",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "The cruelty is the point. Never let them convince you otherwise.",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "FTC asks judge to delay Amazon trial due to resource constraints",
            "external_url": "https://apnews.com/article/amazon-ftc-trial-date-df069a0a71d9627800a72cf07b6cf5de",
            "upvotes": 106,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a signal to all of corporate America that they are free to rip off and scam their customers at will and this administration will rip the teeth out of any enforcement of laws that prevent it.",
                "No wonder Bezos was sitting in the front row at the inauguration. Can't prosecute a case if they fire all the prosecutors.",
                "Some of these lawyers that are getting threatened by the MAGA cult show volunteer to help the FCC.",
                "Canceled my Kindle account, canceled my Prime Visa, uninstalled all my Amazon apps. Been a customer since practically the beginning. Fuck Amazon.",
                "Anyone know whether a judge could order the government to spend whatever's necessary to put on their case regardless? Sort of like how they can prevent a lawyer from dropping a client right before trial if the client hasn't paid their lawyer's fees."
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "NEW",
            "title": "Canada hits U.S. with dollar-for-dollar retaliation for Trump’s steel and aluminum tariffs",
            "external_url": "https://www.ctvnews.ca/world/trumps-tariffs/article/canada-to-announce-298-billion-in-retaliatory-tariffs-on-us-official-tells-reuters/",
            "upvotes": 645,
            "date": "03/13/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/O2Z3R2AGDRBHPAVMLPWN67KEVU.JPG?smart=true&auth=d37064364955204825c361d2b31d8e8e2ee31af7d9968a7e20c781659e87a7af&width=1200&height=630",
            "top_comments": [
                "What's crazy is even Trump still doesn't seem to understand he's taxing Americans.",
                "If only someone could have seen this coming...",
                "Wait until tomorrow I bet Lutnick will make a fool of himself with Ford",
                "Don't mess with Canada ",
                ">According to the federal government, the list of additional products affected by counter-tariffs includes tools, computers and servers, display monitors, water heaters, sport equipment, and cast-iron products.  \n  \nThe full list of fresh items slated to face tariffs as of Thursday, was issued late Wednesday afternoon. It includes jewelry, watches, tricycles, video game consoles, smartphones, umbrellas, gongs, golf clubs, fishing poles, and lighters.\n\nI wished there was a better way to see the products being tariffed. Even the video game consoles info gave me:\n\n>Video game consoles and machines, table or parlour games, including pintables, billiards, special tables for casino games and automatic bowling equipment, amusement machines operated by coins, bank notes, bank cards, tokens or by any other means of payment.",
                "A serious question \n\n\nIs it possible to \"tariff\" US big tech operating in Canada?\n\n\nOr it would be illegal or impossible because they are Canadian entities?",
                "Canadian dollar or US dollar?",
                "Band for Band, shooter for shooter",
                "Canadian Exceptionalism!"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Sandy Hook families ‘no longer see any benefit’ in Alex Jones’ Infowars fight, propose new plan",
            "external_url": "https://www.newstimes.com/news/article/alex-jones-infowars-sandy-hook-families-bankruptcy-20217270.php",
            "upvotes": 144,
            "date": "03/13/2025",
            "thumbnail": "https://s.hdnux.com/photos/01/27/46/40/22964270/5/rawImage.jpg",
            "top_comments": [
                "“In the over three years since (Infowars) and Jones first filed their bankruptcy cases, more than $10 million has been billed by estate professionals in these cases, either defending Jones or responding to objections from Jones … (a)nd yet, the Sandy Hook families have not yet received – and are no closer to receiving – a single dollar,” writes a team of seven attorneys representing the Sandy Hook families. “The Sandy Hook families have determined that the best path for collecting on their judgments against (Infowars) is to work together and pursue remedies in state court, which they will be doing in short order.”",
                "Why Trump hasn't given him a cabinet appointment yet, I'll never know",
                "Why can’t the courts get any money out of Alex Jones? What kind of BS is this",
                "Scum just kept hedging and hedging..",
                "Evan after all this Alex Jones is still only the 4th biggest piece of shit on the planet.",
                "I figure this will be the next US president the way things are going down there….",
                "When the President of the United States and the richest man in the world back the person who said you're a paid actor when your child was slaughtered in their school....\n\nI can't even imagine. Maybe it's time to escalate the issue when the legal system no longer has your back.",
                "If there's anyone that deserves to meet God in person it's Alex Jones.",
                "He keeps stalling but eventually they will get it. And it will only make the press worse for him.",
                "The dude looks like a walking heart attack"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "NOAA braces for mass layoffs, fueling concerns about lifesaving weather services",
            "external_url": "https://abcnews.go.com/Politics/noaa-braces-mass-layoffs-fueling-concerns-lifesaving-weather/story?id=119730398",
            "upvotes": 71,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1adaf63d-971b-42f5-9aef-5502689ad7bc/noaa-3-gty-gmh-250303_1741028114098_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It going to be interesting to see how people in tornado alley react when they lose lives and possessions to severe weather warnings coming in to late or not at all. So many people are going to suffer and die because of this."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 23365,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "It's always the ones you most suspect. ",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "This is the free space on the BINGO card",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Thanks for reminding me that it's Wednesday, I almost missed movie night.",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?"
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "NEW",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 4476,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "So glad we elected Trump to Make America Healthy Again",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane.",
                "“We don’t need trees from Canada, we have National Parks”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 2091,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "i think that's illegal",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "The cruelty is the point. Never let them convince you otherwise.",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "RISING",
            "title": "Canada hits U.S. with dollar-for-dollar retaliation for Trump’s steel and aluminum tariffs",
            "external_url": "https://www.ctvnews.ca/world/trumps-tariffs/article/canada-to-announce-298-billion-in-retaliatory-tariffs-on-us-official-tells-reuters/",
            "upvotes": 644,
            "date": "03/13/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/O2Z3R2AGDRBHPAVMLPWN67KEVU.JPG?smart=true&auth=d37064364955204825c361d2b31d8e8e2ee31af7d9968a7e20c781659e87a7af&width=1200&height=630",
            "top_comments": [
                "What's crazy is even Trump still doesn't seem to understand he's taxing Americans.",
                "If only someone could have seen this coming...",
                "Wait until tomorrow I bet Lutnick will make a fool of himself with Ford",
                "Don't mess with Canada ",
                ">According to the federal government, the list of additional products affected by counter-tariffs includes tools, computers and servers, display monitors, water heaters, sport equipment, and cast-iron products.  \n  \nThe full list of fresh items slated to face tariffs as of Thursday, was issued late Wednesday afternoon. It includes jewelry, watches, tricycles, video game consoles, smartphones, umbrellas, gongs, golf clubs, fishing poles, and lighters.\n\nI wished there was a better way to see the products being tariffed. Even the video game consoles info gave me:\n\n>Video game consoles and machines, table or parlour games, including pintables, billiards, special tables for casino games and automatic bowling equipment, amusement machines operated by coins, bank notes, bank cards, tokens or by any other means of payment.",
                "A serious question \n\n\nIs it possible to \"tariff\" US big tech operating in Canada?\n\n\nOr it would be illegal or impossible because they are Canadian entities?",
                "Canadian dollar or US dollar?",
                "Band for Band, shooter for shooter",
                "Canadian Exceptionalism!"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 23362,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "It's always the ones you most suspect. ",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "This is the free space on the BINGO card",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Thanks for reminding me that it's Wednesday, I almost missed movie night.",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Mahmoud Khalil Speaks With Attorneys for First Time Since Detention",
            "external_url": "https://www.dropsitenews.com/p/mahmoud-khalil-speaks-with-attorneys-ice-detention",
            "upvotes": 320,
            "date": "03/13/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6005cfd2-d8d4-4482-9c12-58c3070c6433_7581x5054.jpeg",
            "top_comments": [
                "Just about to turn 60 and I don't recall a recent time where I've felt as sad for my country as these last few months. One third of this country supports this shit and another third appears asleep. I weep for my country.",
                "It just seems so blatant. Can anybody defend this? Does anybody know anything I'm missing? He has not been charged with any crime. He is in the country legally. I don't care if you are completely on the opposite side of the political spectrum from him. I can see no justification why this arrest is ok. Guess MAGA hates freedom.",
                "Trump was explicitly elected to terrorize the left and MAGA won’t stop until they get a reign of terror instituted as state policy.",
                "I don’t like Trump at all but this guy is a professional agitator paid by Iran. All this goodwill and energy deserves a beter cause.",
                "The internet has been turned into a weapon.  It has turned citizens against people who disagree with the seed that has been planted in their brain.",
                "US support for Israel is immoral and has been since 1948 at least. US policy regarding Israel [led to the 9/11 attacks](https://www.the-independent.com/voices/9-11-osama-bin-laden-interview-robert-fisk-world-trade-center-attack-al-qaeda-terror-a8532256.html) and the October 7 attacks and the $ [8 trillion war on terror](https://watson.brown.edu/costsofwar/figures/2021/BudgetaryCosts) (the wealth equivalent of 20 million homes).\n\n The 9/11 attacks are [why people like Trump exist in the first place](https://www.amazon.com/Reign-Terror-Destabilized-America-Produced/dp/1984879774). \n\n[https://www.reddit.com/r/Global\\_News\\_Hub/comments/1ij11wd/comment/mbcyfk3/](https://www.reddit.com/r/Global_News_Hub/comments/1ij11wd/comment/mbcyfk3/)\n\nEvil is unnatural and requires constant support and maintenance to keep going. This is why the Trump administration is going after people like Khalil.",
                "ITT: Liberals act surprised that a man on a student visa encouraging terrorism goes to jail and gets deported for encouraging terrorism."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 4474,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "So glad we elected Trump to Make America Healthy Again",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane.",
                "“We don’t need trees from Canada, we have National Parks”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 12579,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "Well, it's better than having the rocket blow up.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "I'm genuinely curious if reddit is astro turfed or if people don't read. Horrible headline but the top voted comments are shocking .",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "Israel to occupy Syrian southern territory for ‘unlimited time’, says minister | Syria",
            "external_url": "https://www.theguardian.com/world/2025/mar/12/israel-to-occupy-syrian-southern-territory-for-unlimited-time-says-minister",
            "upvotes": 384,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e4f6302824bc1c9f72d2eecba91d7b5858529f3/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=debc208a7e25cdd0d0e95622faeaa7bc",
            "top_comments": [
                "While I recognise Israel's real security needs, sometimes I feel as if Israel purposefully provokes things in the middle east just to keep the hatred flowing.",
                "Israel's really planing to just take over the entire fucking Arabian Peninsula, aren't they? Same way the US wants to absorb Canada and Mexico, and Russia's planning to take all of Europe.",
                "This is fucked up, and this is what Syrians were scared about in the sub for Syria. \n\nWhy does Israel think and act like they can do whatever they want ugh. \n\nThis is so frustrating.",
                "So kind of like Nazis",
                "*All your deserts are belong to us!*\n\nIsrael has always wanted the biblical/antiquity Israel territory. That's the main pillar of the Zionism.\n\nImagine if all countries started using antiquity countries territories they claim inheriting from to define their own legitim territory today... Europe would be a mess.",
                "Maybe the EU can sanction Israel? This is bluntly a violation of a nations territorial sovereignty.",
                "next up ... kurdistan?",
                "This is why they pushed to remove Assad and destabilize the county. This will only continue until greater Israel is achieved. \n\nThe Jewish people and the world need to stand up to these Nazis that use antisemitism as a shield to continue this land grab.",
                "Count Israel among the new axis countries. ",
                "Trying to revive the Kingdom of Israel eh?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Britain’s oldest drag queen Maisie Trollette dies aged 91",
            "external_url": "https://www.bbc.com/news/articles/cm2yjnvjem3o",
            "upvotes": 558,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6d2b/live/3acc56d0-ff63-11ef-9c50-1fc1966647c9.png",
            "top_comments": [
                "I read that as “Bidens oldest drag queen”.  My eyes have never been that confusedly widened.",
                "You know, I don't understand why all this drama about drag queens. I have heard far worse stories about what the clergymen were doing to women and children especially the Catholic clergymen. People hear those stories on a daily basis yet drag queens get more attention than priests. I am not myself someone who believe that a man can become a woman or vice versa but still I don't get all the drama. Is life really that good in the West that they had to invent problems? I find that so entitled.",
                "It's a sad day for the Drag community as a whole, but especially those who Trollette encouraged and supported over her career. RIP, Maisie.",
                "I want to make a joke about another drag queen but i'll just say RIP.",
                "It seems to me that she lived her life like a feather boa in the wind.",
                "[removed]",
                "Drag queens are just fancy clowns. Change my mind.",
                "Honestly like any other wanna be or celebrety who da fuck cares , Kim who cares , Kanye who cares the diddler who cares let him rot in jail . Auge knight who cares he’s already in jail shit . They all want click baits and attention just the the big companies corporations no more dei no more deversity who wanna bet they won’t be a pride month this year ?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Victims identified in Mississippi medical helicopter crash",
            "external_url": "https://www.wdbj7.com/2025/03/12/victims-identified-mississippi-medical-helicopter-crash/",
            "upvotes": 186,
            "date": "03/12/2025",
            "thumbnail": "https://gray-wdbj-prod.gtv-cdn.com/resizer/v2/77776RDVWNDBRKNMGAX4KQGULI.png?auth=442c944370331cfb98c7ca84fb5841254a0bd5ed8def36bfbf05d2a3b9de86a3&width=1200&height=600&smart=true",
            "top_comments": [
                "My wife is a doctor (family medicine, Primary Care physician) she did her residency at UMMC. \n\nThis is tragic news. I don't think she ever knew any of the pilots personally, but she saw them all the time when she did her hospital rotations coming in and out. I remember her saying they took their job very seriously and always looked like a \"military unit\" when they would pack up and run to the helipad.\n\nLiving in Jackson MS, by UMMC I'd see/ hear the helicopter take off and land frequently. If I remember correctly you can see one of the landing pads right off of I-55. The pessimist in me always had intrusive thoughts of \"it would suck if that helicopter ever crashed\". I feel shame ever having that thought.\n\nWe have friends who are still living in Jackson MS who also work at UMMC, they have been posting non-stop about this.",
                "It's truly depressing how often I'm seeing medical air transport crash."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 13757,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "Fuck the environment, fuck affordable healthcare, fuck vaccines, fuck FDA regulations for food handling! Being alive and healthy is woke liberal garbage! Let me breathe asbestos and eat lead and contract preventable diseases like our forefathers intended 😡"
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "03/13/2025 08:11:46 UTC"
}