{
    "posts": [
        {
            "category": "HOT",
            "title": "NYU withholds diploma of student who condemned Israel in graduation speech",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/nyu-withholds-diploma-israel-gaza-speech",
            "upvotes": 3546,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/50a8b417bb29a67d134561adaf29dd02e7aca775/570_0_5700_4562/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c34e9eea0a814065090f92fa9f029a1",
            "top_comments": [
                "this will be an interesting one for the courts.\n\n\nfederal law [prevents colleges from withholding diplomas for disciplinary issues](https://registrar.lmu.edu/ferpa-rightsandprivacyact/#:~:text=FERPA%20requires%20that%20education%20records,on%20release%20of%20directory%20information.) to prevent this exact situation, a graduate isnt liked by someone on the schools board, so they choose to withhold their diploma. withholding one against federal law can lead to your school losing accreditation, which is a death sentence for a college because ALL diplomas issued by them become worthless in every career field.\n\n\nthey can only withhold it if you owe them money, or they believe you committed fraud to get your degree. the fraud claim requires an academic court ruling to withhold diplomas or honors",
                "The use of the term anti-governmental to describe the USAID speech a month ago was the sign of how fascist NYU already was. Anti-governmental is completely valid speech in the US. Just say Anti-regime you fucking cowards. I'm sure a lawyer will volunteer to inform NYU of their inability to withold the degree and this will be quietly resolved.",
                "> Following Rozos’s speech, NYU released a statement saying that it “strongly denounces the choice by a student at the Gallatin School’s graduation today … to misuse his role as student speaker to express his personal and one-sided political views”.\n\nTranslation: “As an educational institution, we strongly denounce the choice by a student to rightfully exercise their first amendment rights. As such, we are illegally withholding said student’s rightful diploma, due to the fact that we have an incredibly strong desire to suck the toad-like micropenis which belongs to the orange rapist/traitor/felon.”",
                ">Rozos went on to say: “The genocide currently occurring is supported politically and militarily by the United States, is paid for by our tax dollars and has been livestreamed to our phones for the past 18 months. And that I do not wish to speak only to my own politics today, but to speak for all people of conscience, and all people who feel the moral injury of this atrocity.”\n\n>\n\nThink about it.\n\nWhy is it so important to Democrats and Republicans that Americans or  foreigners in America support a Far Right Wing fascist foreign Government like Israel?  Free speech exists in America to support or condemn any country we want, to protect unpopular speech.   This is another person who was viewed as an \"Anti-semite\" for criticizing the Israel Government or Zionist that operate that government.",
                "This is the same university that shut down a speech a few weeks back that criticized the destruction of USAID claiming that that talk was “antigovernmental”, and which made “zionist” a protected class (but not Palestinian), so that self described Zionists like Joe Biden and Pete Hegseth become a protected class. \n\nWhat a joke of an institution",
                "Should read “NYU violates constitutional rights.”",
                "This always backfires when schools try this",
                "That is an interesting decision NYU just made.\n\nWhy would anyone PAY to go to a university that is so publicly against human rights?\n\nDoes NYU realize that without students paying them to go to their university, they are fucking fucked? Do they think we're dumb?\n\n**Edit**: For anyone currently deciding on where to go to college in a few months, just remember that giving money to immoral, amoral, faceless, and suppressive institutions will perpetuate this human rights problem. Vote with your wallet.",
                "NYU classifies “zionist” as discriminatory?  That is nuts.",
                "US really is Israel's little bitch."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 28643,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "How DARE they use that photo while reporting she was 9 weeks pregnant. They’re deliberately misleading the public into thinking this was a full term viable pregnancy rather than what it really is which is the same age most pregnancies fail. This is not only ghoulish on the people responsible but on NBC for this deliberately manipulative reporting. Shame on NBC and I hope you all will spread the word where you can. This has major implications.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "This is some genuine Handmaids Tale shit.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs.",
                "You can't donate the organs of someone who died without their consent but a braindead woman who does not consent to this (nor does her family) must remain an incubator. Corpses have more rights than women. This is fucking shameful. And when the baby is born, then what? The family takes the baby? And who has to pay for all these hospital bills to keep her alive? Like what if they were not in a place financially to do that? This is where the claim that this is \"pro life\" completely falls apart. These people do not give a fuck about anything except controlling the bodies of women. Some days it feels like my anger at this country is going to completely drive me insane.\n\nWomen are not state-sanctioned gestation tanks. Fuck anyone who voted for this administration.",
                "It's even worse than what a lot of posters here are reacting to: there's a good chance that if it weren't for the risks to the pregnancy, the doctors could have intervened with the clots that rendered her braindead, because they mentioned that they had found it in time and were about to try to relieve pressure. She's braindead because of that. They aren't just keeping her on life support to incubate the fetus, they KILLED HER in order to incubate the fetus."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Georgia woman missing in California's Sierra Nevada for weeks found alive in snow-covered cabin",
            "external_url": "https://www.cbsnews.com/sacramento/news/georgia-woman-missing-in-california-sierra-nevada-found-alive/",
            "upvotes": 9604,
            "date": "05/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/15/3f856e8d-3539-478f-b0c8-c10e8393c354/thumbnail/1200x630/8643f51bc3c0fa17ad8816e9033898a1/slaton.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "> Gutierrez said he leaves a cabin unlocked for situations like this, allowing for an increased chance of survival.\n\nThe true hero of this story.",
                "The first thing she did was go to hug her rescuer, the first thing her dad did when she knew she was safe was to hug the nearest person to him. 🥲",
                "I remember this woman's brother posting in some of the local hiking subs asking for help searching etc. Astonishing she was found, I'm so glad.",
                "Good news feels rare these days. So happy she was found alive",
                "The BLM handles the upkeep on alot of little cabins on public land for just this reason",
                "Driving the Alcan and took a wrong turn and ended up going a few hours out of our way which sucked. Pull over to a small cabin with a map board and confirm we were going the wrong way but man that cabin was soooo cool. It was a big out cabin hours from any civilization that had two bunk beds, basic canned food, firewood with a wood stove and other basics and an outhouse. There was a wonderful guest book and read through stories of people getting stuck in storms and finding the cabin and using it to survive the night or until the weather passed and they could get back on the road. Totally worth the detour, also saw my first and only white colored black bear.",
                "The cabin owner SAVED HER LIFE!\n\nHe admitted he only leaves one of his cabins unlocked and stocked with emergency supplies SPECIFICALLY for blizzard shelter in case of emergency like this.\n\nFucking saint.",
                "This is wonderful news! So happy that she was fine and going home to her family. \n\nAlso, how wonderful sounding is that family? Tiffany is found and the first thing she does is hug her rescuer. Her mother is told she’s been found and all she wants is a hug from a stranger. \n\nSound like lovely people which makes me extra glad Tiffany was found alive and well.",
                "She was lost for THREE weeks?! Wow that’s miraculous",
                "Everyone please, buy an SOS device."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Federal judge orders Marshall man detained by ICE to be immediately released",
            "external_url": "https://www.mprnews.org/story/2025/05/14/federal-judge-orders-marshall-man-detained-by-ice-to-be-immediately-released",
            "upvotes": 3791,
            "date": "05/15/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Some band recently had to cancel their European tour because their Mexican drummer, who was *in the country legally*, got detained at the airport to *fly out of the country*.",
                ">…arrested Harsono in March at his job at a Marshall hospital, days after his student visa was revoked without his knowledge.\n\nThey revoked his visa without his knowledge! Setting him up for his arrest. Disgusting.",
                "Honestly, does anyone think he's actually going to be released?",
                "Send ICE Barbie to El Salvador in his stead, she's overdue for another fashion show - this time let her do it from the other side of the bars.",
                "\"lol, no. Get fucked.\"\n\n\\-ICE to Judge, 2025.",
                "Our Concentration Camps are getting outta hand. Are we the bad guys?",
                "Ice: just put him in a plane to New Mexico",
                "Until the fascism stops, I’m not paying taxes. I refuse to fund this unconstitutional authoritarian clown show. We need a national tax strike.",
                "And they won’t comply",
                "That baby is adorable"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Florida becomes 2nd state to ban fluoride from public drinking water",
            "external_url": "https://abcnews.go.com/Health/florida-2nd-state-ban-fluoride-public-drinking-water/story?id=121852274",
            "upvotes": 3430,
            "date": "05/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2a3d41e-5255-469c-8dbf-7b0ed1716338/desantis-ap-jt-250515_1747334933336_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "As much as I just assume that Republicans hate all humanity and wants to hurt them, I'm wondering who got bribed by whom for this bizarre mental breakdown.",
                "I moved to rural America and they all really believe fluoride is some mind controlling substance or something. I can tell them that I spent most of my life with it and I’m fine but it goes in one ear and out the same ear. Also, there’s no shortage of fucked up teeth out here. Coincidence? Maybe.",
                "Judging by my nephew’s teeth I’m surprised Florida ever had Fluoride in its drinking water.",
                "Nice thing is we’ll have places to compare dental health differences between.  We’ll have states with fluoride and ones without and in 20 years we can check tooth healths between thing, as well as all the crazy things RFK says fluoride causes.  The science will be pretty easy with such large cohorts.",
                "\"You don't gotta force it and take away people's choices. But the whole crux of the issue is you should be able to make decisions on the basis of informed consent,\" said the motherfucker who funneled $10 Million in taxpayer money through his wife's charity and back to himself to fight legalization of weed.",
                "These clowns sure do love talking about choice. Funny how it's always for fringe conspiracy theories and not for whether or not people are forced to learn about the bible in schools, access to safe abortion, lifestyle choices, or many other things.\n\nFluoride? In our water? Not here! We don't want no stinking pacifying neurotoxins!",
                "Giving the \"Florida man\" persona a grin",
                "I had a moron of a neighbor back in 2015 and he was into the conspiracies, like the moon landing fake, flat earth, chem trails, and this fluoride bad bullshit.  \n\nThis idiot spent as he claims $1k on a water filter he found on \"the internet\" that removes the fluoride. This same idiot would then instead of brushing his teeth would use coconut oil to clean them. \n\nThen to top it off everyday he would put diatomaceous earth in water and drink it.  He inhaled so much of this silica that he ended up with a chronic cough and I think he possibly damaged his lungs enough that he basically now has asthma or COPD. \n\nOh and this same idiot thinks wooden soled shoes protect him from demons.\n\nI would like to give you an update on this guy but he was evicted in 2016 and I've no clue what became of him. It's a safe bet he's had teeth issues.",
                "New \"No Teeth\" DLC for GTA6 announced",
                "No fluoride on top of methmouth. \n\nSome Floridians are gonna be HELLA good looking"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "RFK Jr orders mifepristone review as anti-abortion groups push for ban",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/rfk-jr-fda-abortion-pill-mifepristone",
            "upvotes": 12729,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/67a815aac24a9d2dd041bbfd8fd6798a959d51d4/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1a221076062851cf9016b33ab6cb595",
            "top_comments": [
                "Didn't this man just say nobody should take health advice from him yesterday? This country has fully turned into a farce.",
                "We need to spread a rumor that mifepristone treats measles. He will defend it with gusto.",
                "“LeAvE iT tO tHe StAtEs”",
                "Review has already been done. It does exactly what it says it does and is perfectly safe",
                "For my miscarriage- I took mifepristone so that I would be in pain for a weekend instead of an indefinite time over the course of 4 weeks.  There was no fetal development.  But if my body couldn’t pass the tissue on its own, then I could have been in excruciating pain for a month or more and on the line to lose my job, or worse possibly developed sepsis.\n\n1 in 4 known pregnancies end in miscarriage.  It’s even higher for first time pregnancy.  This is not an outlier situation.  You know people who have had miscarriages and gotten treatment for it.  All this medication ban would do is make women suffer. \n\nThese people are extreme lunatics.   Death cult material who think women are property and status symbols, not people.",
                "Ladies and people who care about ladies: if you can acquire this, do so. The day is coming when it will be more difficult than just about anything to get, if not impossible. Miscarriages are incredibly dangerous if all of the tissue is not expelled, and many hospitals refuse to offer any kind of aid due to the new laws across much of the South until a woman is nearly dead.\n\n  \nAnd even then, if your baby is viable and you are not, they'll just keep you on machines until you deliver. Adriana Smith is suffering this fate in Georgia as we speak after a hospital refused care for a brain bleed when she was 9 weeks. She is now 21 weeks, and is being kept alive against her family's wishes due to the heartbeat law.",
                "The party of forced birth and indifference toward living children strikes again.",
                "What happens to women who are miscarrying/have miscarried but the tissue hasn't passed when they ban this and ban D&Cs?\n\nA shit ton of women are going to die from sepsis (aka infections that are easily preventable with the healthcare options they want to ban).\n\nNot a single fucking thing about these bans is \"pro-life.\"",
                "The US health secretary, Robert F Kennedy Jr, said on Wednesday that he had directed the FDA to review the regulations around the abortion pill mifepristone.\n\nThe review, he said, was necessary due to “new data” – data that emerged from a flawed analysis that top US anti-abortion groups are now using to pressure the Trump administration to reimpose restrictions on the abortion pill, if not pull it from the market entirely.\n\n...**The analysis, which has not been peer-reviewed or published in a medical journal**, came after the Food and Drug Administration commissioner said he was open to reviewing new safety data on the pills, which are used in nearly two-thirds of abortions nationwide.\n\nThe conservative organizations are rallying behind a paper published on 28 April by a rightwing thinktank, the Ethics and Public Policy Center, which claims there are higher complication rates from taking mifepristone than previously known.\n\nThe paper has attracted scrutiny for appearing to dramatically overstate what it characterizes as “serious adverse effects” associated with the pill, according to medical experts. For example, it counts ectopic pregnancies – when an embryo implants somewhere other than the uterine lining – as a serious complication.\n\nMifepristone does not cause an ectopic pregnancy and taking it will not harm someone with an ectopic. It also claims that needing an in-clinic procedure to complete the abortion is a complication, when patients are counseled in advance about the pills’ failure rate of about 3 to 4%.\n\n**The data, the authors say, means the FDA should reinstate earlier restrictions on mifepristone, including a ban on telemedicine and limiting use to the first seven weeks of pregnancy – but they do not intend to stop there.**\n\nThe authors note that restoring the limits could lead to better monitoring that could help “determine whether this drug should remain on the market”, statements that echo proposals found in Project 2025, the 900-page playbook published by the Heritage Foundation and for which the EPPC was an advisory board member.\n\n**Project 2025 calls to end telemedicine prescriptions of abortion pills as an “interim step” to revoking mifepristone’s approval altogether.**\n\nMore than 100 scientific studies have found the medications cited in the paper are safe and effective for ending a pregnancy.",
                "Weird that anyone doesn't believe that they are really just trying to legislate that women are basically children that need men to make their decisions, so if you think about it that's why it is OK for them to marry children.\n\nLiterally, that is a pretty clear overlap on the venn diagram of legislating agenda they have been on target for.\n\n  \n\\----\n\nA quick edit so I don't come accross as hyperbolic or simply lobbing petty insults:  \n\nI realized I should probably [bring reciepts](https://www.rollingstone.com/politics/politics-features/republican-lawmakers-child-marriage-abortion-1235018777/). \n\nThere are a [*lot*](https://www.nbcnews.com/politics/politics-news/end-child-marriage-u-s-you-might-be-surprised-who-n1050471) of reciepts. \n\nThey've tried \"[defending child marriage is actually pretty pro-choice of me](https://www.newsweek.com/republican-defends-child-marriage-im-pro-choice-1898619)\" and \"[if you ban child marriage, you're letting the gays win](https://www.tba.org/?pg=Articles&blAction=showEntry&blogEntry=30366)\"  along the way . . . landing on their most successful attack yet . . .  \n\n\"[a woman is like a child](https://www.yahoo.com/news/woman-child-maga-quickly-turns-105907677.html)\" . . . and if woman == child, then it stands to reason that child == women . . . \n\nObviously, you wouldn't say women shouldn't be allowed to have an adult sexual relationship within the confines of a legally binding marriage contract that they can leave anytime they want to have enough money and a good lawyer. Which is also why child labor is so important, so that they could obviously have left the marriage if they didn't want to be there.\n\nIt also makes sense of other agenda pushes that would otherwise feel pointless and unrelated, like the absolute insane amounts of hate against women they've pushed on the youth in recent years."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Voyager 1 alive for another day with Hail Mary thruster fix",
            "external_url": "https://www.theregister.com/2025/05/15/voyager_1_survives_with_thruster_fix/",
            "upvotes": 907,
            "date": "05/16/2025",
            "thumbnail": "https://regmedia.co.uk/2017/12/03/voyager_probe_shutterstock.jpg",
            "top_comments": [
                "Voyager has outlived nearly all the scientists and engineers that developed and launched her. Travel well, our pilgrim to infinity!",
                "Spirit of ingenuity under pressure still survive in NASA's Jet Propulsion Laboratory.  \n\nHat's off to engineers who thought of a solution and executed program that revived thruster that was thought to be irreparable.",
                "Pretty flipping cool.  I’d love to see some pics of us from that far out in the cosmos.",
                "I needed that. Godspeed Voyager!",
                "15.6 billion miles away.  And still not to the Oort Cloud.  Damn!",
                "Godspeed … We carbon based life forms eagerly await your return V’ger",
                "Voyager has a special place in my heart.  When everything else eventually ends here in our solar system, Voyager will be all that's left saying we were ever here.  Godspeed, Voyager.",
                "Receives its update from the US, becomes aware of current news… thrusters magically roar back to life as Voyager 1 tries with all of its might to get further away",
                "so wild, so human too. Keep going!",
                "Again, always amazing to me that voyager keeps orientation entirely  by chemical thrusters, not any form of reaction wheel. The precision involved in firing those thrusters must be incredible."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Texas mother accused of helping son plan school shooting",
            "external_url": "https://www.bbc.com/news/articles/c057l60y1r3o",
            "upvotes": 570,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b94d/live/6c7a72c0-31ae-11f0-8f86-0bc28dbbff83.jpg",
            "top_comments": [
                "Good on the grandmother for calling the authorities",
                "Wow, glad they caught them before anything serious happened!",
                "> A Texas mother has been arrested for allegedly buying ammunition and tactical gear for her son who she knew was planning \"mass targeted violence\" at his school, officials said.\n\n'Murica is on another level, holy hell.",
                "I do not think the BBC article mentions this, but according to [an ABC article](https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886), the explosive that the grandmother found had the words \"For Brenton Tarrant\" labeled on it along with the symbol \"SS\" and \"14 Words\".  I figured that I would mention this, since I know that the mother's appearance does not match the traditional stereotype of a White supremacist, and any time a shooter or accomplice is revealed in the media, people immediately propagandize it against minorities.",
                "I am having the hardest time trying to reconcile with the fact that white supremacist cholas exist.",
                "> Prosecutors say Ashley Pardo, 33. \n\nHas tattoo saying *1992*\n\nThe math checks out, guys.",
                "SMDH, what is the world coming to. Back in my day youngsters shot insurance company CEOs like respectable members of society.",
                "Horrible series of events in this story but great to see media continuing to refuse to use the name of the shitstain who murdered people in the mosques in NZ",
                "Sounds like conspiracy to commit murder.. in Texas no less.. have fun with that sentence.. especially going to court looking like THAT. (I'm not saying there's anything wrong with the way she looks, but from my experience judges tend to frown upon folks who, in their opinion; aren't taking court seriously by their appearance)",
                "A picture is worth a thousand words."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UK surgeon shares footage from Gaza hospital after deadly Israeli strike",
            "external_url": "https://www.bbc.com/news/videos/cd0lj4rnre9o",
            "upvotes": 706,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0031/live/1ec66240-3222-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "Israel has bombed *every single hospital in Gaza*. This is not a mistake or a one-off, this is a strategy of deliberately targeting civilian medical facilities, which is a *war crime*.",
                "Fuck IDF and Israel \n\nI hope they rot in hell who are involved in this genocide \n\nPeople who are enabling it just those who did in Nazi Germany",
                "I remember when this started and people used to analyze craters and argue that the hospital strikes were Hamas rocket misfirings. Simpler times.",
                "from the video It looks like a Bunker buster hit the driveway outside the hospital,\n\nso probably they hit an underground base and maybe the explosion knock some concrete off the walls and panels from the ceiling inside the hospital.",
                "The world will be safer without Hamas"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Walmart warns of higher prices, withholds second-quarter profit guidance",
            "external_url": "https://www.reuters.com/business/retail-consumer/walmart-warns-higher-prices-withholds-second-quarter-profit-guidance-2025-05-15/",
            "upvotes": 9424,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Article does not mention how they will address the empty shelves.  Wonder if they talked about this during their earnings call. ",
                "in a couple of years time there will be a lot less money to go around, and the billionaires will be on the race to being the first trillionaire.",
                "I wonder what on Earth might be causing those higher prices?  ;-)",
                "How many people on r/stocks are telling you tariffs are “priced in” and Walmart can’t even provide guidance for next quarter?",
                "But you axed your evil DEI programs shouldn’t you be drowning in money and efficientlcy and “merit” right now?\n\nWhat’s wrong Walmart? Not as excited for 4 years of Trump as you thought?",
                "They aren’t “withholding” profit guidance. Attempting to forecast it accurately in this environment is a step away from lying. It is literally the only responsible thing to do because they have no idea what their supply, revenue, profit, etc will be because policy changes literally by the minute.",
                "Not just walmart, everyone should get used to buying less stuff. Hard times are coming.\n\nwww.BoycottOligarchs.com",
                "This isn’t good coming from Wally’s World.  More bad to come this summer.",
                "I just got a notice on my Amazon cart/wishlist yesterday that 15 items I had went up in price, and not by cents. Seen some stuff go up from 30-60%",
                "Don't forget, once inflation happens, it doesn't reverse itself."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Elizabeth Holmes’s partner reportedly raises millions for blood-testing startup",
            "external_url": "https://www.theguardian.com/us-news/2025/may/11/elizabeth-holmes-partner-blood-testing-startup",
            "upvotes": 32,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e67d3fdc2199a5efafd2d0df8cd5c8584d35d536/1290_0_6425_5143/master/6425.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4f4b35a74165ca1329c57ac1f9ba4702",
            "top_comments": [
                "Fool me once, fool me twice...",
                "Is he trying to go to jail WITH her? That's so romantic 🥰",
                "Well wasn't part of the company real enough? She just took something that was \"5\" and claimed it was \"10000\"?",
                "Well how many times have you tried something, but it wasn't up to par? Should the world shun you for your imperfections? /s",
                "That’s going to end well.",
                "Times cover coming soon.",
                "Sounds like a good place to invest my savings. What could possibly go wrong?",
                "People. What are we doing. ",
                "_Ah shit, here we go again._",
                "So Theranos, part deux? Here we go again...."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "James Comey investigated over seashell photo claimed to be ‘threat’ against Trump | James Comey",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/james-comey-instagram-trump",
            "upvotes": 402,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7832fb1e817d30f8bd6f8e465fc9b6d9ade3a40c/290_0_2871_2297/master/2871.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d71f111554cc25fb4b0e0a44e155197",
            "top_comments": [
                "Nothing but a bunch of fucking children.",
                "I mean, when I think of seashells, I definitely think of Trump. Though only when it's 3 seashells, specifically.",
                "lol I remember when republicans put crosshairs over the profile pictures of all the dems they wanted to “eliminate” from their positions and then there was an assassination attempt on Gabby Giffords, who had been pictured.\n\nMidterms will shackle Trump. Hold strong everyone.",
                "Maybe he can open an investigation oh wait.",
                "86 means throw out, not kill.  They all know this, but if the outrage machine runs out of fuel it starts eating itself.",
                "Meanwhile, you can still buy T-shirts that read 86 46",
                "Should have been 66 47. Since he tried to cosplay as a jedi.",
                "All Comey has to do is gift him a jumbo jet and all is forgiven.",
                "This administration has become repressive fascism.  They'll keep pushing the limits further and further until they're voted out.",
                "You'd think the right would be more grateful to the man who put his finger on the scale in 2016 to help put us where we are."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas mother accused of helping son plan school shooting",
            "external_url": "https://www.bbc.com/news/articles/c057l60y1r3o",
            "upvotes": 569,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b94d/live/6c7a72c0-31ae-11f0-8f86-0bc28dbbff83.jpg",
            "top_comments": [
                "Good on the grandmother for calling the authorities",
                "Wow, glad they caught them before anything serious happened!",
                "> A Texas mother has been arrested for allegedly buying ammunition and tactical gear for her son who she knew was planning \"mass targeted violence\" at his school, officials said.\n\n'Murica is on another level, holy hell.",
                "I do not think the BBC article mentions this, but according to [an ABC article](https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886), the explosive that the grandmother found had the words \"For Brenton Tarrant\" labeled on it along with the symbol \"SS\" and \"14 Words\".  I figured that I would mention this, since I know that the mother's appearance does not match the traditional stereotype of a White supremacist, and any time a shooter or accomplice is revealed in the media, people immediately propagandize it against minorities.",
                "I am having the hardest time trying to reconcile with the fact that white supremacist cholas exist.",
                "> Prosecutors say Ashley Pardo, 33. \n\nHas tattoo saying *1992*\n\nThe math checks out, guys.",
                "SMDH, what is the world coming to. Back in my day youngsters shot insurance company CEOs like respectable members of society.",
                "Horrible series of events in this story but great to see media continuing to refuse to use the name of the shitstain who murdered people in the mosques in NZ",
                "Sounds like conspiracy to commit murder.. in Texas no less.. have fun with that sentence.. especially going to court looking like THAT. (I'm not saying there's anything wrong with the way she looks, but from my experience judges tend to frown upon folks who, in their opinion; aren't taking court seriously by their appearance)",
                "A picture is worth a thousand words."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Voyager 1 alive for another day with Hail Mary thruster fix",
            "external_url": "https://www.theregister.com/2025/05/15/voyager_1_survives_with_thruster_fix/",
            "upvotes": 906,
            "date": "05/16/2025",
            "thumbnail": "https://regmedia.co.uk/2017/12/03/voyager_probe_shutterstock.jpg",
            "top_comments": [
                "Voyager has outlived nearly all the scientists and engineers that developed and launched her. Travel well, our pilgrim to infinity!",
                "Spirit of ingenuity under pressure still survive in NASA's Jet Propulsion Laboratory.  \n\nHat's off to engineers who thought of a solution and executed program that revived thruster that was thought to be irreparable.",
                "Pretty flipping cool.  I’d love to see some pics of us from that far out in the cosmos.",
                "I needed that. Godspeed Voyager!",
                "15.6 billion miles away.  And still not to the Oort Cloud.  Damn!",
                "Godspeed … We carbon based life forms eagerly await your return V’ger",
                "Voyager has a special place in my heart.  When everything else eventually ends here in our solar system, Voyager will be all that's left saying we were ever here.  Godspeed, Voyager.",
                "Receives its update from the US, becomes aware of current news… thrusters magically roar back to life as Voyager 1 tries with all of its might to get further away",
                "so wild, so human too. Keep going!",
                "Again, always amazing to me that voyager keeps orientation entirely  by chemical thrusters, not any form of reaction wheel. The precision involved in firing those thrusters must be incredible."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "NYU withholds diploma of student who condemned Israel in graduation speech",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/nyu-withholds-diploma-israel-gaza-speech",
            "upvotes": 3552,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/50a8b417bb29a67d134561adaf29dd02e7aca775/570_0_5700_4562/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c34e9eea0a814065090f92fa9f029a1",
            "top_comments": [
                "this will be an interesting one for the courts.\n\n\nfederal law [prevents colleges from withholding diplomas for disciplinary issues](https://registrar.lmu.edu/ferpa-rightsandprivacyact/#:~:text=FERPA%20requires%20that%20education%20records,on%20release%20of%20directory%20information.) to prevent this exact situation, a graduate isnt liked by someone on the schools board, so they choose to withhold their diploma. withholding one against federal law can lead to your school losing accreditation, which is a death sentence for a college because ALL diplomas issued by them become worthless in every career field.\n\n\nthey can only withhold it if you owe them money, or they believe you committed fraud to get your degree. the fraud claim requires an academic court ruling to withhold diplomas or honors",
                "The use of the term anti-governmental to describe the USAID speech a month ago was the sign of how fascist NYU already was. Anti-governmental is completely valid speech in the US. Just say Anti-regime you fucking cowards. I'm sure a lawyer will volunteer to inform NYU of their inability to withold the degree and this will be quietly resolved.",
                "> Following Rozos’s speech, NYU released a statement saying that it “strongly denounces the choice by a student at the Gallatin School’s graduation today … to misuse his role as student speaker to express his personal and one-sided political views”.\n\nTranslation: “As an educational institution, we strongly denounce the choice by a student to rightfully exercise their first amendment rights. As such, we are illegally withholding said student’s rightful diploma, due to the fact that we have an incredibly strong desire to suck the toad-like micropenis which belongs to the orange rapist/traitor/felon.”",
                ">Rozos went on to say: “The genocide currently occurring is supported politically and militarily by the United States, is paid for by our tax dollars and has been livestreamed to our phones for the past 18 months. And that I do not wish to speak only to my own politics today, but to speak for all people of conscience, and all people who feel the moral injury of this atrocity.”\n\n>\n\nThink about it.\n\nWhy is it so important to Democrats and Republicans that Americans or  foreigners in America support a Far Right Wing fascist foreign Government like Israel?  Free speech exists in America to support or condemn any country we want, to protect unpopular speech.   This is another person who was viewed as an \"Anti-semite\" for criticizing the Israel Government or Zionist that operate that government.",
                "This is the same university that shut down a speech a few weeks back that criticized the destruction of USAID claiming that that talk was “antigovernmental”, and which made “zionist” a protected class (but not Palestinian), so that self described Zionists like Joe Biden and Pete Hegseth become a protected class. \n\nWhat a joke of an institution",
                "Should read “NYU violates constitutional rights.”",
                "This always backfires when schools try this",
                "That is an interesting decision NYU just made.\n\nWhy would anyone PAY to go to a university that is so publicly against human rights?\n\nDoes NYU realize that without students paying them to go to their university, they are fucking fucked? Do they think we're dumb?\n\n**Edit**: For anyone currently deciding on where to go to college in a few months, just remember that giving money to immoral, amoral, faceless, and suppressive institutions will perpetuate this human rights problem. Vote with your wallet.",
                "NYU classifies “zionist” as discriminatory?  That is nuts.",
                "US really is Israel's little bitch."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK surgeon shares footage from Gaza hospital after deadly Israeli strike",
            "external_url": "https://www.bbc.com/news/videos/cd0lj4rnre9o",
            "upvotes": 710,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0031/live/1ec66240-3222-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "Israel has bombed *every single hospital in Gaza*. This is not a mistake or a one-off, this is a strategy of deliberately targeting civilian medical facilities, which is a *war crime*.",
                "Fuck IDF and Israel \n\nI hope they rot in hell who are involved in this genocide \n\nPeople who are enabling it just those who did in Nazi Germany",
                "I remember when this started and people used to analyze craters and argue that the hospital strikes were Hamas rocket misfirings. Simpler times.",
                "from the video It looks like a Bunker buster hit the driveway outside the hospital,\n\nso probably they hit an underground base and maybe the explosion knock some concrete off the walls and panels from the ceiling inside the hospital.",
                "The world will be safer without Hamas"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Crozer closure: Gov. Josh Shapiro, Delaware County legislators unite behind bills to tackle private equity",
            "external_url": "https://whyy.org/articles/crozer-hospital-josh-shapiro-delaware-county/",
            "upvotes": 405,
            "date": "05/15/2025",
            "thumbnail": "https://whyy.org/wp-content/uploads/2025/05/gov-josh-shapiro-crozer-chester-med-center-press-conf-KC-051525-02.jpg",
            "top_comments": [
                "> “I am done letting private equity wreak havoc on our healthcare system, wreak havoc on our communities, treating our hospitals like a piggy bank that they can drain and then smash on the floor,” Shapiro said at a presser outside of Crozer-Chester Medical Center. “Those days are over. The time for action is right now.”\n\nPrivate equity firms in general need to be reined in."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Federal judge orders Marshall man detained by ICE to be immediately released",
            "external_url": "https://www.mprnews.org/story/2025/05/14/federal-judge-orders-marshall-man-detained-by-ice-to-be-immediately-released",
            "upvotes": 3790,
            "date": "05/15/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Some band recently had to cancel their European tour because their Mexican drummer, who was *in the country legally*, got detained at the airport to *fly out of the country*.",
                ">…arrested Harsono in March at his job at a Marshall hospital, days after his student visa was revoked without his knowledge.\n\nThey revoked his visa without his knowledge! Setting him up for his arrest. Disgusting.",
                "Honestly, does anyone think he's actually going to be released?",
                "Send ICE Barbie to El Salvador in his stead, she's overdue for another fashion show - this time let her do it from the other side of the bars.",
                "\"lol, no. Get fucked.\"\n\n\\-ICE to Judge, 2025.",
                "Our Concentration Camps are getting outta hand. Are we the bad guys?",
                "Ice: just put him in a plane to New Mexico",
                "Until the fascism stops, I’m not paying taxes. I refuse to fund this unconstitutional authoritarian clown show. We need a national tax strike.",
                "And they won’t comply",
                "That baby is adorable"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hudson’s Bay to sell brands to Canadian Tire for $30 million",
            "external_url": "https://www.ctvnews.ca/business/article/hudsons-bay-to-sell-brands-to-canadian-tire-for-30-million/",
            "upvotes": 66,
            "date": "05/15/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/OV2UHW6NSOW2C5A4X44CFJVO54.jpg?smart=true&auth=c01e16471ccab18a3491d2be05b094e846ceb745741b971afd8f8856d551934b&width=1200&height=630",
            "top_comments": [
                "The sale includes the overarching Hudson’s Bay brand, its iconic, multicoloured stripes motif, its coat of arms and other brand trademarks.\n\n...\n\nThe exchange includes houseware brands Gluckstein and Distinctly Home, as well as apparel line Hudson North"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Florida becomes 2nd state to ban fluoride from public drinking water",
            "external_url": "https://abcnews.go.com/Health/florida-2nd-state-ban-fluoride-public-drinking-water/story?id=121852274",
            "upvotes": 3422,
            "date": "05/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2a3d41e-5255-469c-8dbf-7b0ed1716338/desantis-ap-jt-250515_1747334933336_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "As much as I just assume that Republicans hate all humanity and wants to hurt them, I'm wondering who got bribed by whom for this bizarre mental breakdown.",
                "I moved to rural America and they all really believe fluoride is some mind controlling substance or something. I can tell them that I spent most of my life with it and I’m fine but it goes in one ear and out the same ear. Also, there’s no shortage of fucked up teeth out here. Coincidence? Maybe.",
                "Judging by my nephew’s teeth I’m surprised Florida ever had Fluoride in its drinking water.",
                "Nice thing is we’ll have places to compare dental health differences between.  We’ll have states with fluoride and ones without and in 20 years we can check tooth healths between thing, as well as all the crazy things RFK says fluoride causes.  The science will be pretty easy with such large cohorts.",
                "\"You don't gotta force it and take away people's choices. But the whole crux of the issue is you should be able to make decisions on the basis of informed consent,\" said the motherfucker who funneled $10 Million in taxpayer money through his wife's charity and back to himself to fight legalization of weed.",
                "These clowns sure do love talking about choice. Funny how it's always for fringe conspiracy theories and not for whether or not people are forced to learn about the bible in schools, access to safe abortion, lifestyle choices, or many other things.\n\nFluoride? In our water? Not here! We don't want no stinking pacifying neurotoxins!",
                "Giving the \"Florida man\" persona a grin",
                "I had a moron of a neighbor back in 2015 and he was into the conspiracies, like the moon landing fake, flat earth, chem trails, and this fluoride bad bullshit.  \n\nThis idiot spent as he claims $1k on a water filter he found on \"the internet\" that removes the fluoride. This same idiot would then instead of brushing his teeth would use coconut oil to clean them. \n\nThen to top it off everyday he would put diatomaceous earth in water and drink it.  He inhaled so much of this silica that he ended up with a chronic cough and I think he possibly damaged his lungs enough that he basically now has asthma or COPD. \n\nOh and this same idiot thinks wooden soled shoes protect him from demons.\n\nI would like to give you an update on this guy but he was evicted in 2016 and I've no clue what became of him. It's a safe bet he's had teeth issues.",
                "New \"No Teeth\" DLC for GTA6 announced",
                "No fluoride on top of methmouth. \n\nSome Floridians are gonna be HELLA good looking"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "NYU withholds diploma of student who condemned Israel in graduation speech",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/nyu-withholds-diploma-israel-gaza-speech",
            "upvotes": 3550,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/50a8b417bb29a67d134561adaf29dd02e7aca775/570_0_5700_4562/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c34e9eea0a814065090f92fa9f029a1",
            "top_comments": [
                "this will be an interesting one for the courts.\n\n\nfederal law [prevents colleges from withholding diplomas for disciplinary issues](https://registrar.lmu.edu/ferpa-rightsandprivacyact/#:~:text=FERPA%20requires%20that%20education%20records,on%20release%20of%20directory%20information.) to prevent this exact situation, a graduate isnt liked by someone on the schools board, so they choose to withhold their diploma. withholding one against federal law can lead to your school losing accreditation, which is a death sentence for a college because ALL diplomas issued by them become worthless in every career field.\n\n\nthey can only withhold it if you owe them money, or they believe you committed fraud to get your degree. the fraud claim requires an academic court ruling to withhold diplomas or honors",
                "The use of the term anti-governmental to describe the USAID speech a month ago was the sign of how fascist NYU already was. Anti-governmental is completely valid speech in the US. Just say Anti-regime you fucking cowards. I'm sure a lawyer will volunteer to inform NYU of their inability to withold the degree and this will be quietly resolved.",
                "> Following Rozos’s speech, NYU released a statement saying that it “strongly denounces the choice by a student at the Gallatin School’s graduation today … to misuse his role as student speaker to express his personal and one-sided political views”.\n\nTranslation: “As an educational institution, we strongly denounce the choice by a student to rightfully exercise their first amendment rights. As such, we are illegally withholding said student’s rightful diploma, due to the fact that we have an incredibly strong desire to suck the toad-like micropenis which belongs to the orange rapist/traitor/felon.”",
                ">Rozos went on to say: “The genocide currently occurring is supported politically and militarily by the United States, is paid for by our tax dollars and has been livestreamed to our phones for the past 18 months. And that I do not wish to speak only to my own politics today, but to speak for all people of conscience, and all people who feel the moral injury of this atrocity.”\n\n>\n\nThink about it.\n\nWhy is it so important to Democrats and Republicans that Americans or  foreigners in America support a Far Right Wing fascist foreign Government like Israel?  Free speech exists in America to support or condemn any country we want, to protect unpopular speech.   This is another person who was viewed as an \"Anti-semite\" for criticizing the Israel Government or Zionist that operate that government.",
                "This is the same university that shut down a speech a few weeks back that criticized the destruction of USAID claiming that that talk was “antigovernmental”, and which made “zionist” a protected class (but not Palestinian), so that self described Zionists like Joe Biden and Pete Hegseth become a protected class. \n\nWhat a joke of an institution",
                "Should read “NYU violates constitutional rights.”",
                "This always backfires when schools try this",
                "That is an interesting decision NYU just made.\n\nWhy would anyone PAY to go to a university that is so publicly against human rights?\n\nDoes NYU realize that without students paying them to go to their university, they are fucking fucked? Do they think we're dumb?\n\n**Edit**: For anyone currently deciding on where to go to college in a few months, just remember that giving money to immoral, amoral, faceless, and suppressive institutions will perpetuate this human rights problem. Vote with your wallet.",
                "NYU classifies “zionist” as discriminatory?  That is nuts.",
                "US really is Israel's little bitch."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Federal judge orders Marshall man detained by ICE to be immediately released",
            "external_url": "https://www.mprnews.org/story/2025/05/14/federal-judge-orders-marshall-man-detained-by-ice-to-be-immediately-released",
            "upvotes": 3792,
            "date": "05/15/2025",
            "thumbnail": "https://img.apmcdn.org/48056ada026c13a4c9c3517c9647583ef2515641/widescreen/a9b7fc-20250414-a-man-holds-his-baby-2000.jpg",
            "top_comments": [
                "Some band recently had to cancel their European tour because their Mexican drummer, who was *in the country legally*, got detained at the airport to *fly out of the country*.",
                ">…arrested Harsono in March at his job at a Marshall hospital, days after his student visa was revoked without his knowledge.\n\nThey revoked his visa without his knowledge! Setting him up for his arrest. Disgusting.",
                "Honestly, does anyone think he's actually going to be released?",
                "Send ICE Barbie to El Salvador in his stead, she's overdue for another fashion show - this time let her do it from the other side of the bars.",
                "\"lol, no. Get fucked.\"\n\n\\-ICE to Judge, 2025.",
                "Our Concentration Camps are getting outta hand. Are we the bad guys?",
                "Ice: just put him in a plane to New Mexico",
                "Until the fascism stops, I’m not paying taxes. I refuse to fund this unconstitutional authoritarian clown show. We need a national tax strike.",
                "And they won’t comply",
                "That baby is adorable"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Voyager 1 alive for another day with Hail Mary thruster fix",
            "external_url": "https://www.theregister.com/2025/05/15/voyager_1_survives_with_thruster_fix/",
            "upvotes": 914,
            "date": "05/16/2025",
            "thumbnail": "https://regmedia.co.uk/2017/12/03/voyager_probe_shutterstock.jpg",
            "top_comments": [
                "Voyager has outlived nearly all the scientists and engineers that developed and launched her. Travel well, our pilgrim to infinity!",
                "Spirit of ingenuity under pressure still survive in NASA's Jet Propulsion Laboratory.  \n\nHat's off to engineers who thought of a solution and executed program that revived thruster that was thought to be irreparable.",
                "Pretty flipping cool.  I’d love to see some pics of us from that far out in the cosmos.",
                "I needed that. Godspeed Voyager!",
                "15.6 billion miles away.  And still not to the Oort Cloud.  Damn!",
                "Godspeed … We carbon based life forms eagerly await your return V’ger",
                "Voyager has a special place in my heart.  When everything else eventually ends here in our solar system, Voyager will be all that's left saying we were ever here.  Godspeed, Voyager.",
                "Receives its update from the US, becomes aware of current news… thrusters magically roar back to life as Voyager 1 tries with all of its might to get further away",
                "so wild, so human too. Keep going!",
                "Again, always amazing to me that voyager keeps orientation entirely  by chemical thrusters, not any form of reaction wheel. The precision involved in firing those thrusters must be incredible."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UK surgeon shares footage from Gaza hospital after deadly Israeli strike",
            "external_url": "https://www.bbc.com/news/videos/cd0lj4rnre9o",
            "upvotes": 708,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0031/live/1ec66240-3222-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "Israel has bombed *every single hospital in Gaza*. This is not a mistake or a one-off, this is a strategy of deliberately targeting civilian medical facilities, which is a *war crime*.",
                "Fuck IDF and Israel \n\nI hope they rot in hell who are involved in this genocide \n\nPeople who are enabling it just those who did in Nazi Germany",
                "I remember when this started and people used to analyze craters and argue that the hospital strikes were Hamas rocket misfirings. Simpler times.",
                "from the video It looks like a Bunker buster hit the driveway outside the hospital,\n\nso probably they hit an underground base and maybe the explosion knock some concrete off the walls and panels from the ceiling inside the hospital.",
                "The world will be safer without Hamas"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Texas mother accused of helping son plan school shooting",
            "external_url": "https://www.bbc.com/news/articles/c057l60y1r3o",
            "upvotes": 564,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b94d/live/6c7a72c0-31ae-11f0-8f86-0bc28dbbff83.jpg",
            "top_comments": [
                "Good on the grandmother for calling the authorities",
                "Wow, glad they caught them before anything serious happened!",
                "> A Texas mother has been arrested for allegedly buying ammunition and tactical gear for her son who she knew was planning \"mass targeted violence\" at his school, officials said.\n\n'Murica is on another level, holy hell.",
                "I do not think the BBC article mentions this, but according to [an ABC article](https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886), the explosive that the grandmother found had the words \"For Brenton Tarrant\" labeled on it along with the symbol \"SS\" and \"14 Words\".  I figured that I would mention this, since I know that the mother's appearance does not match the traditional stereotype of a White supremacist, and any time a shooter or accomplice is revealed in the media, people immediately propagandize it against minorities.",
                "I am having the hardest time trying to reconcile with the fact that white supremacist cholas exist.",
                "> Prosecutors say Ashley Pardo, 33. \n\nHas tattoo saying *1992*\n\nThe math checks out, guys.",
                "SMDH, what is the world coming to. Back in my day youngsters shot insurance company CEOs like respectable members of society.",
                "Horrible series of events in this story but great to see media continuing to refuse to use the name of the shitstain who murdered people in the mosques in NZ",
                "Sounds like conspiracy to commit murder.. in Texas no less.. have fun with that sentence.. especially going to court looking like THAT. (I'm not saying there's anything wrong with the way she looks, but from my experience judges tend to frown upon folks who, in their opinion; aren't taking court seriously by their appearance)",
                "A picture is worth a thousand words."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "James Comey investigated over seashell photo claimed to be ‘threat’ against Trump | James Comey",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/james-comey-instagram-trump",
            "upvotes": 399,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7832fb1e817d30f8bd6f8e465fc9b6d9ade3a40c/290_0_2871_2297/master/2871.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d71f111554cc25fb4b0e0a44e155197",
            "top_comments": [
                "Nothing but a bunch of fucking children.",
                "I mean, when I think of seashells, I definitely think of Trump. Though only when it's 3 seashells, specifically.",
                "lol I remember when republicans put crosshairs over the profile pictures of all the dems they wanted to “eliminate” from their positions and then there was an assassination attempt on Gabby Giffords, who had been pictured.\n\nMidterms will shackle Trump. Hold strong everyone.",
                "Maybe he can open an investigation oh wait.",
                "86 means throw out, not kill.  They all know this, but if the outrage machine runs out of fuel it starts eating itself.",
                "Meanwhile, you can still buy T-shirts that read 86 46",
                "Should have been 66 47. Since he tried to cosplay as a jedi.",
                "All Comey has to do is gift him a jumbo jet and all is forgiven.",
                "This administration has become repressive fascism.  They'll keep pushing the limits further and further until they're voted out.",
                "You'd think the right would be more grateful to the man who put his finger on the scale in 2016 to help put us where we are."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia woman missing in California's Sierra Nevada for weeks found alive in snow-covered cabin",
            "external_url": "https://www.cbsnews.com/sacramento/news/georgia-woman-missing-in-california-sierra-nevada-found-alive/",
            "upvotes": 9601,
            "date": "05/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/15/3f856e8d-3539-478f-b0c8-c10e8393c354/thumbnail/1200x630/8643f51bc3c0fa17ad8816e9033898a1/slaton.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "> Gutierrez said he leaves a cabin unlocked for situations like this, allowing for an increased chance of survival.\n\nThe true hero of this story.",
                "The first thing she did was go to hug her rescuer, the first thing her dad did when she knew she was safe was to hug the nearest person to him. 🥲",
                "I remember this woman's brother posting in some of the local hiking subs asking for help searching etc. Astonishing she was found, I'm so glad.",
                "Good news feels rare these days. So happy she was found alive",
                "The BLM handles the upkeep on alot of little cabins on public land for just this reason",
                "Driving the Alcan and took a wrong turn and ended up going a few hours out of our way which sucked. Pull over to a small cabin with a map board and confirm we were going the wrong way but man that cabin was soooo cool. It was a big out cabin hours from any civilization that had two bunk beds, basic canned food, firewood with a wood stove and other basics and an outhouse. There was a wonderful guest book and read through stories of people getting stuck in storms and finding the cabin and using it to survive the night or until the weather passed and they could get back on the road. Totally worth the detour, also saw my first and only white colored black bear.",
                "The cabin owner SAVED HER LIFE!\n\nHe admitted he only leaves one of his cabins unlocked and stocked with emergency supplies SPECIFICALLY for blizzard shelter in case of emergency like this.\n\nFucking saint.",
                "This is wonderful news! So happy that she was fine and going home to her family. \n\nAlso, how wonderful sounding is that family? Tiffany is found and the first thing she does is hug her rescuer. Her mother is told she’s been found and all she wants is a hug from a stranger. \n\nSound like lovely people which makes me extra glad Tiffany was found alive and well.",
                "She was lost for THREE weeks?! Wow that’s miraculous",
                "Everyone please, buy an SOS device."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Crozer closure: Gov. Josh Shapiro, Delaware County legislators unite behind bills to tackle private equity",
            "external_url": "https://whyy.org/articles/crozer-hospital-josh-shapiro-delaware-county/",
            "upvotes": 403,
            "date": "05/15/2025",
            "thumbnail": "https://whyy.org/wp-content/uploads/2025/05/gov-josh-shapiro-crozer-chester-med-center-press-conf-KC-051525-02.jpg",
            "top_comments": [
                "> “I am done letting private equity wreak havoc on our healthcare system, wreak havoc on our communities, treating our hospitals like a piggy bank that they can drain and then smash on the floor,” Shapiro said at a presser outside of Crozer-Chester Medical Center. “Those days are over. The time for action is right now.”\n\nPrivate equity firms in general need to be reined in."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Florida becomes 2nd state to ban fluoride from public drinking water",
            "external_url": "https://abcnews.go.com/Health/florida-2nd-state-ban-fluoride-public-drinking-water/story?id=121852274",
            "upvotes": 3425,
            "date": "05/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a2a3d41e-5255-469c-8dbf-7b0ed1716338/desantis-ap-jt-250515_1747334933336_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "As much as I just assume that Republicans hate all humanity and wants to hurt them, I'm wondering who got bribed by whom for this bizarre mental breakdown.",
                "I moved to rural America and they all really believe fluoride is some mind controlling substance or something. I can tell them that I spent most of my life with it and I’m fine but it goes in one ear and out the same ear. Also, there’s no shortage of fucked up teeth out here. Coincidence? Maybe.",
                "Judging by my nephew’s teeth I’m surprised Florida ever had Fluoride in its drinking water.",
                "Nice thing is we’ll have places to compare dental health differences between.  We’ll have states with fluoride and ones without and in 20 years we can check tooth healths between thing, as well as all the crazy things RFK says fluoride causes.  The science will be pretty easy with such large cohorts.",
                "\"You don't gotta force it and take away people's choices. But the whole crux of the issue is you should be able to make decisions on the basis of informed consent,\" said the motherfucker who funneled $10 Million in taxpayer money through his wife's charity and back to himself to fight legalization of weed.",
                "These clowns sure do love talking about choice. Funny how it's always for fringe conspiracy theories and not for whether or not people are forced to learn about the bible in schools, access to safe abortion, lifestyle choices, or many other things.\n\nFluoride? In our water? Not here! We don't want no stinking pacifying neurotoxins!",
                "Giving the \"Florida man\" persona a grin",
                "I had a moron of a neighbor back in 2015 and he was into the conspiracies, like the moon landing fake, flat earth, chem trails, and this fluoride bad bullshit.  \n\nThis idiot spent as he claims $1k on a water filter he found on \"the internet\" that removes the fluoride. This same idiot would then instead of brushing his teeth would use coconut oil to clean them. \n\nThen to top it off everyday he would put diatomaceous earth in water and drink it.  He inhaled so much of this silica that he ended up with a chronic cough and I think he possibly damaged his lungs enough that he basically now has asthma or COPD. \n\nOh and this same idiot thinks wooden soled shoes protect him from demons.\n\nI would like to give you an update on this guy but he was evicted in 2016 and I've no clue what became of him. It's a safe bet he's had teeth issues.",
                "New \"No Teeth\" DLC for GTA6 announced",
                "No fluoride on top of methmouth. \n\nSome Floridians are gonna be HELLA good looking"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 28657,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-mn-1045-143cef.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "How DARE they use that photo while reporting she was 9 weeks pregnant. They’re deliberately misleading the public into thinking this was a full term viable pregnancy rather than what it really is which is the same age most pregnancies fail. This is not only ghoulish on the people responsible but on NBC for this deliberately manipulative reporting. Shame on NBC and I hope you all will spread the word where you can. This has major implications.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "This is some genuine Handmaids Tale shit.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs.",
                "You can't donate the organs of someone who died without their consent but a braindead woman who does not consent to this (nor does her family) must remain an incubator. Corpses have more rights than women. This is fucking shameful. And when the baby is born, then what? The family takes the baby? And who has to pay for all these hospital bills to keep her alive? Like what if they were not in a place financially to do that? This is where the claim that this is \"pro life\" completely falls apart. These people do not give a fuck about anything except controlling the bodies of women. Some days it feels like my anger at this country is going to completely drive me insane.\n\nWomen are not state-sanctioned gestation tanks. Fuck anyone who voted for this administration.",
                "It's even worse than what a lot of posters here are reacting to: there's a good chance that if it weren't for the risks to the pregnancy, the doctors could have intervened with the clots that rendered her braindead, because they mentioned that they had found it in time and were about to try to relieve pressure. She's braindead because of that. They aren't just keeping her on life support to incubate the fetus, they KILLED HER in order to incubate the fetus."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/16/2025 08:12:52 UTC"
}