{
    "posts": [
        {
            "category": "HOT",
            "title": "ICE detains University of Alabama doctoral student as government's college crackdown continues",
            "external_url": "https://www.nbcnews.com/news/us-news/university-alabama-doctoral-student-detained-ice-governments-college-c-rcna198320",
            "upvotes": 33340,
            "date": "03/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Alireza-Doroudi-mn-0745-bc5811.jpg",
            "top_comments": [
                "I remember hearing during winter break that exchange students should avoid going home because they might not be allowed back into the US.",
                "Whenever you get mad about this, remember that Congress (controlled by Republicans) could stop this at any time - and they choose not to because they like it.",
                "Where are the Don't Tread on Me guys now? This is rather...draconian.",
                "Man, I swear this is the kind of stuff that the right wing warned us would happen under liberal government....",
                "I earned my PhD a few years ago. One of the most stressful, engaging, and fucking stressful times of my life. To be suddenly deported? I can't imagine. So much of a PhD program is building and sustaining momentum. To be tanked out like this? These assholes are altering the lives of bright, intelligent, and young people.",
                "So we don't know where he is, what they say he's done, whether he has a lawyer, yet it's a \"crackdown\" as if there's something justifiable here in need of correction.\n\n\nFuck off. ",
                "Trump is making all of us less safe. He’s shredding the legal system and the constitution. And he’s crashing the economy.",
                "Abducted.  He was abducted not detained.",
                "This is 100% a trial run to cause some fear. This summer is going to have protests en masse and fully expect we'll start seeing even fully legal citizens start to disappear when those begin.",
                "The educated are being arrested meanwhile the criminals are running the country I'm confused"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Dow sinks more than 600 points. Stocks are on track for their worst quarter since 2023",
            "external_url": "https://www.cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility",
            "upvotes": 7234,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206185432.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Are we having fun yet?",
                "Ever since January 20  the economy has tanked and being on downward spiral because of poor policies .",
                "Trump's economy in action.",
                "They must be updating the headline. When I first saw it the headline said 500 points. OP posted 600. Clicking the link now at 1311 hours its 700 points.\n\nEDIT: Lol. On the top right under 'latest market news' there's a headline for 600 points and clicking on it takes you to the headline for 700 points. Silly website.",
                "Right now down 735. \n\nIt would need to fall another 700 points or so to hit the dip it was at a couple weeks ago. Another drop of that magnitude would take it to summer last year.",
                "Sec Treasury Bennet just included me in a chat about the declining stock market.  Will keep you all posted.",
                "Note to America - don’t elect idiots & crooks.",
                "I mean is anyone surprised? I literally can't think of any positive economic indicators or good news on the horizon. We haven't even started feeling the effects of the tariffs and the feds yanking billions of dollars of spending out of the economy, unemployment is going to spike with all the layoffs over the last couple of months, and inflation is taking off again.\n\nI've moved mostly into cash. I keep hearing people repeat a dumb slogan: \"Time in the market > timing the market!!!\" Maybe that's true sometimes, but not times like now where there is literally zero reason for the market to go up, and a zillion reasons it will continue going down.",
                "Somebody's winning.  It's just not us.",
                "Have you even said thank you?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 2328,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "Why did certain women vote for Trump again?",
                "Makes me sick to my stomach that this political party feels like it’s their priority to control and regulate women’s bodies",
                "Wonder why the birth rates are dropping?  It is too risky to get pregnant in this country.  It opens women up to too many legal issues and possible life-threatening results."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 6924,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "Keep destroying that local economy Kentucky. ",
                "At least they have enough whiskey to drown in.",
                "I hope they get everything they voted for.",
                "Most of these bill are bills that would hurt the people of Kentucky, so its time for those people to vote those representatives out.  That might mean voting for a democrat(oh no!) and if they don't then they get to suck it up and be happy with these horrible pieces of legislation.  Enjoy that brown water coming out of your tap.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "[removed]",
                "Gave them the power didn’t ya?"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Convicted founder of electric vehicle startup Nikola pardoned by Trump",
            "external_url": "https://apnews.com/article/nikola-trevor-milton-fraud-trump-pardon-3fcebb0a3820cecb205656f2dc3f6764",
            "upvotes": 2369,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fraudster helping fraudster.\n\n>the pardon could wipe out hundreds of millions of dollars in restitution that prosecutors were seeking for defrauded investors.\n\nOnce again, the victims and judicial system are spat upon by Trump. I wonder how many of them voted for him.",
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund less than a month before the November election, according to the Federal Election Commission,\n\nIn case you want to know what the current going rate for a pardon is, it's $1,800,000.00 for a four-year sentence.\n\n____\n>“I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\nA pardon doesn't grant innocence. Accepting one gives the pardoned person ['an imputation of guilt and acceptance of a confession of it'](https://en.wikipedia.org/wiki/Burdick_v._United_States#Decision).",
                "Lol are these the guys that got busted rolling a truck down a hill?",
                "Republican crime syndicate in action.",
                "President crime lover",
                "Milton was convicted by a jury. He was represented in that trial by Brad Bondi, a partner at law firm Paul Hastings and the brother of current U.S. Attorney General Pam Bondi.",
                "So Americans are just super okay now with blatant quid pro quo corruption in their government?",
                "What fucking idiot decided to name an EV startup \"Nikola\", like that's not even attempting to disguise that your intentions are to rip off a more well known brand, hinting that their products are likely shit.",
                "> “I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\n\nYeah, that's not what a pardon is, though.",
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund \n\n100% MAGAs and foreign MAGA-wannabes are Ok with this."
            ],
            "aggregate_sentiment": 46.0
        },
        {
            "category": "HOT",
            "title": "Utah becomes the first state to ban fluoride in public drinking water",
            "external_url": "https://apnews.com/article/utah-fluoride-ban-43f67153beb3e06ada9d782655fb15de",
            "upvotes": 1303,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wish I was a dentist and I lived in Utah.",
                "If only there were some 2011 event that could teach us about [what may happen](https://www.dentistryiq.com/dentistry/research-and-news/article/55248093/why-calgary-reversed-its-decision-on-fluoride-after-10-years). \n\n(Calgary reversed the decision 13 years later because they noticed a significant rise in decalcification along the gumline)",
                ">Utah lawmakers who pushed for a ban said putting fluoride in water was too expensive.\n\nAh, ok.\n\nAnd they tied this legislation to a tax cut for everyone in the state, right? Riiiiiight??",
                "First Sundance moves to Boulder. Now they ban fluoride. Come on Utah, get your act together.",
                "I hate that this says \"First\" and that Utah will definitely not be the last with this Idiocracy in place.",
                "Grew up in Portland, Its a lovely motivator that my teeth deteriorate faster than most anyone else. like an entropy war drum. Floss kids!",
                "Just call it T Dazzle and throw it back in the water.",
                "Calgary, Alberta did this. Just over a decade later they're reversing it. The data about how big a disaster this was is **very clear**\n\n\n> The number of children receiving IV antibiotics for dental infections at Alberta Children’s Hospital increased by 700% from 2011 to 2018. The majority of these patients were under five years old.\n\n\nAnd a study comparing Calgary with Edmonton (the other major city in Alberta)\n\n\n> [2018 and 2019 data showed] 64.8 per cent of participants in Calgary had one or more cavities in their baby teeth, compared with 55.1 per cent in Edmonton participants.\n\n\nCompared to 5 years earlier\n\n\n> [2013 and 2014 data showed] a 56.6 per cent prevalence of dental cavities in baby teeth in Calgary, and 58.7 per cent in Edmonton.\n\n\nFluoride toothpaste doesn't get the fluoride *inside* developing bones and teeth, it only treats the *outside* of the teeth. It's good for maintenance, it's not a replacement for dietary intake for children.",
                "Spent most of my life in civilization (a city) that used fluoride. I seem fine. But now I’m in rural American where they don’t use it and everybody out here’s got some fucked up teeth. So there’s that.",
                "Alabama is gonna be pissed that Utah out dumbed them."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump targets 'anti-American ideology' at Smithsonian museums",
            "external_url": "https://www.bbc.co.uk/news/articles/cdjy1jmvvwzo",
            "upvotes": 2590,
            "date": "03/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07df/live/3430c980-0ba4-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "I can't wait to find out all about the Trail of Happy Fun Times on my next visit where the Native Americans willing gave up their lands to the settlers acknowledging their superiority and in return we gave them comfort in the form of blankets.  I think a few got sick.....no they're all alive still and opened a casino and it's all gravy baby.",
                "Trying to change history, and enforce self censorship. Classic fascism from a blooming dictator.",
                "It’s not “anti-American” to accurately show our country & people’s history of doing terrible, terrible things — as well as very, very good things.\n\nWhat exactly are you so afraid of, Mr. President?",
                "Imagine thinking denying your past will make America great again.",
                "I went to the Smithsonian in 2023 and saw pictures of the KKK gathering on the White House lawn, the text by the photo described the situation and date but was completely neutral about the event. They also have a smashed bus window from an integration era school bus, again, no social commentary, just a statement that it happened because Americans were unhappy with the decision. They also have a case showing a minstrel show suit and black face makeup which is very strange to immortalize. \n\nI understand that the black history museum is right next door but I really didn’t expect American history to be segregated like that. I mean I should have but that’s my white optimism for ya. I know better now.",
                "Hey look, more nazi shit from the American nazi party, formerly known as the republican party.",
                "We've read about this in history class so many times. But never did I think that we would see white washing history right in front of our eyes.",
                "The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.",
                "Maybe he’s going to offer visitors a bucket of sand to bury their heads into?",
                "What's he gonna do at the zoo, paint all the zebras fucking white?"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Former Del. middle school principal charged with raping student for 4 years",
            "external_url": "https://www.nbcphiladelphia.com/news/local/middle-school-principal-rape-student-delaware-tasha-oliver-purnell/4143403/",
            "upvotes": 881,
            "date": "03/28/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/03/oliver-purnell-2.0.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "For 4 years. God damn.",
                "Holy crap an accurate headline for this circumstance for once",
                "Sadly, this probably is just the tip of the iceberg. Someone who felt like they got away with touching/abusing a young girl for 4 years a decade ago, isn't likely to have stopped, that's probably just the timeline for the victim that came forward. Glad she did though, may that young woman get justice and may she inspire others to do the same.",
                "Well would you look at that, a headline using the proper terms for a Female engaged in sexual activity with a minor. Weird they do it in this case 🤔",
                "Comments are all cheering for an accurate headline for this shit like they wouldn’t have just defaulted back to the same old bullshit if the teacher was white and blonde and in her 20s, but whatever.",
                "Imagine a world where I'm surprised that this actually says rape.",
                "trump's new Secretary of Education.",
                "She'll get suspended sentence with 90 days community service.",
                "The dark side of equal treatment for women, evil is gender neutral.  Hopefully, justice is, too.",
                "Still not a drag queen."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Israeli soldier tells CBS News he was ordered to use Palestinians as human shields in Gaza",
            "external_url": "https://www.cbsnews.com/news/israeli-soldier-palestinians-human-shields-gaza/",
            "upvotes": 1537,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/27/9043b153-7671-47e4-982f-7afa3a2f8870/thumbnail/1200x630/5d20706c78cad9cc8c025f6cab3cfe91/1743033727795.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                ">Tommy said his commander ordered his unit to use Gazan civilians to search buildings for explosives instead of dogs.\n\n>\"They were Palestinian,\" he said. \"We sent them in first to see if the building was clear and check for booby traps…They were trembling and shaking.\"\n\nI'd say it goes further than just using them as shields.",
                "We know. \n\nWe've watched them do it for years.",
                "Uh oh, masked agents are going to kidnap CBS execs off the streets now",
                "*I was just following orders*\n\n\nThis sounds familiar now we're have I heard this before 🤔",
                "Thank God the IDF member said it, because seeing it with my own eyes on a literal video wasn't believable enough.",
                "“I was just following orders” didn’t fly the first time and it shouldn’t fly this time either",
                "Being against using human shields is antisemetic. (s/)",
                "This is very anti-Semitic and anti-American of CBS News!\n\n\n\n\n/s for those who need it.",
                "If only that was the worst of the war crimes the IDF is committing.  But its not.\n\nEveryone knows they are deliberately committing genocide.  Imagine if during WWII the Americans went through Germany and killed as many civilians burning as possible burning down their homes using the the excuse that all the women and children supported Nazis.\n\nAnd I want to make it clear, most Jewish people I know are appalled at what the IDF is doing.  The IDF is not all Israelis.  Blaming all israelis is just as bad as blaming all palestinians.",
                "Bad as that sounds, that undersells how bad it is!\n\nIf you conduct activities in civilian areas so that the other side will not attack, that may be described as using human shields. But this soldier describes a protocol of ordering civilians (from the opposing side) into buildings to clear explosives, as this job was too dangerous for soldiers. Surely that's a specific crime beyond \"human shields.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Over 2000 protest in wake of student detainment",
            "external_url": "https://www.tuftsdaily.com/article/2025/03/over-2000-protest-in-wake-of-student-detainment",
            "upvotes": 309,
            "date": "03/28/2025",
            "thumbnail": "https://snworksceo.imgix.net/ttd/892ebf50-7170-4741-bd2d-38007efd0704.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "This is response to this video of a PhD student being abducted by ICE for writing an op-ed in the school newspaper. She committed no crime. She is in the US legally \n\n\nEven if you disagree with her opinion, she has a right to say it.\n\n\n\nhttps://www.youtube.com/watch?v=PuFIs7OkzYY",
                "Don't stop protesting until they undo it, otherwise you're wasting your time.",
                "Don't stop protesting boycotting, or this country will fall to government power abuse.",
                "At least some students have some courage to protest!?  The rest of us are pitiful and lazy!",
                "I applaud them for their bravery. We need to continue to speak truth to power.",
                "*“It is the immigrant communities, the undocumented communities, the working communities who are leading this struggle for our own liberation,” another said earlier.   Local residents of all ages attended the protest in addition to Tufts students, faculty and staff.*\n\nThe voices of connection vs the voices of FEAR, Repression, and Detainment.",
                "a russian troll farm set up two protests in texas on the same street corner."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US Securities and Exchange Commission beginning to onboard DOGE staff",
            "external_url": "https://www.reuters.com/world/us/us-securities-exchange-commission-beginning-onboard-doge-staff-email-says-2025-03-28/",
            "upvotes": 7,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "DODGE is the SS of the trump Reich.",
                "Musk to oversee the very agency investigating him. Can't make this stuff up. Straight out of the twilight zone.",
                "Paywalls are prohibited here."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Reynolds skips UNI ribbon cutting for Applied Engineering Bldg. as protest draws hundreds",
            "external_url": "https://cbs2iowa.com/news/local/reynolds-skips-uni-event-as-protest-draws-hundreds",
            "upvotes": 8,
            "date": "03/28/2025",
            "thumbnail": "https://cbs2iowa.com/resources/media2/16x9/4032/986/center/90/ec5877c0-8f68-4ae6-9054-257c08cde3fa-IMG_0899.jpeg",
            "top_comments": [
                "Spineless little shit."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "State Department formally notifies Congress it is effectively dissolving USAID",
            "external_url": "https://www.cnn.com/2025/03/28/politics/state-department-formally-notifies-congress-effectively-dissolving-usaid/index.html",
            "upvotes": 14,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198234083.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "66-year-old woman welcomes 10th child, her 8th since turning 53",
            "external_url": "https://globalnews.ca/news/11100640/berlin-germany-alexandra-hilderbrandt-ten-children/",
            "upvotes": 0,
            "date": "03/28/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/03/GettyImages-1028293228.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                ">Philipps’s eldest sibling, Svetlana, is 46 years his senior.\n\nShe's *more* than old enough to be his Grandmother. :O"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Trump pardons three co-founders of BitMEX crypto exchange",
            "external_url": "https://www.cnbc.com/2025/03/28/trump-pardon-bitmex-crypto-exchange-money-laundering.html",
            "upvotes": 43,
            "date": "03/28/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108123080-1743187995978-gettyimages-881226528-CONSENSUS_INVEST.jpeg?v=1743188010&w=1920&h=1080",
            "top_comments": [
                "Every scammer in the country must love Trump. They finally have someone to represent them in the Oval Office.",
                "Fat Donny sure does love him some criminals.",
                "It is only money laundering. Everyone does it.",
                "They'll be joining the administration shortly to oversee the scam \"crypto reserve\"",
                "It takes a real piece of shit to pardon other pieces of shit.",
                "Is this so they can help him funnel all the federal cash into crypto so they can finish robbing the country blind?",
                "Let me guess. White MAGA donors.",
                "Nothing sus about that. "
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Over 2000 protest in wake of student detainment",
            "external_url": "https://www.tuftsdaily.com/article/2025/03/over-2000-protest-in-wake-of-student-detainment",
            "upvotes": 310,
            "date": "03/28/2025",
            "thumbnail": "https://snworksceo.imgix.net/ttd/892ebf50-7170-4741-bd2d-38007efd0704.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "This is response to this video of a PhD student being abducted by ICE for writing an op-ed in the school newspaper. She committed no crime. She is in the US legally \n\n\nEven if you disagree with her opinion, she has a right to say it.\n\n\n\nhttps://www.youtube.com/watch?v=PuFIs7OkzYY",
                "Don't stop protesting until they undo it, otherwise you're wasting your time.",
                "Don't stop protesting boycotting, or this country will fall to government power abuse.",
                "At least some students have some courage to protest!?  The rest of us are pitiful and lazy!",
                "I applaud them for their bravery. We need to continue to speak truth to power.",
                "*“It is the immigrant communities, the undocumented communities, the working communities who are leading this struggle for our own liberation,” another said earlier.   Local residents of all ages attended the protest in addition to Tufts students, faculty and staff.*\n\nThe voices of connection vs the voices of FEAR, Repression, and Detainment.",
                "a russian troll farm set up two protests in texas on the same street corner."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "483 cases of measles reported across 19 states: CDC",
            "external_url": "https://abcnews.go.com/Health/500-cases-measles-reported-nationwide-19-states-cdc/story?id=120251851",
            "upvotes": 247,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8f40f12a-86a6-4903-a19c-5dfb224a4b33/measles-texas-gty-jt-250311_1741733208836_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Things like this flourishing into bigger and bigger problems will illustrate exactly how important public health workers are — or were, before they were fired. Of course, the culpable party will not recognize or acknowledge it.",
                "Don't worry, that will drop to zero when CDC stops reporting numbers that make the administration look bad.",
                ">Health and Human Services Secretary Robert F. Kennedy Jr. and other vaccine skeptics have promoted vitamin A amid the measles outbreak\n\nA skeptic is someone who doesn't believe that you have psychic powers until you prove it.  'Denialist' is the word we're looking for here.\n\n>During an interview on Fox News with Sean Hannity earlier this month, Kennedy said that HHS was currently providing vitamin A to measles patients for treatment, claiming vitamin A can \"dramatically\" reduce measles deaths.\n\nJust the other day, I was wondering if Sean Hannity is still a huge piece of crap.  Good to have my answer.",
                "Just a heads up, some adults could use the MMR vaccine too. If you got it before 1968, high risk, or you have health issues, speak to a Dr\n\n\nhttps://www.npr.org/sections/shots-health-news/2025/02/21/nx-s1-5304458/measles-vaccine-booster-health\n\n\nI got the one shot as a kid, but being in Texas and dealing with a health issue in the family, I received the MMR recently just in case. Was told I could have side effects but I was fine. Was free with my health insurance and less spicy than the flu vaccine. ",
                "Just wave cabbage leaves at the kids, they'll be fine ....",
                "I guess this is the start of how this current timeline is going to prune itself",
                "Elect stupid people and you get to die a preventable death.",
                "So..........much..........winning.......",
                "Dwarf siberian for measles, savoy only works for cholera."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 2322,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "Why did certain women vote for Trump again?",
                "Makes me sick to my stomach that this political party feels like it’s their priority to control and regulate women’s bodies",
                "Wonder why the birth rates are dropping?  It is too risky to get pregnant in this country.  It opens women up to too many legal issues and possible life-threatening results."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "West Texas children treated for vitamin A toxicity as medical disinformation spreads alongside measles outbreak",
            "external_url": "https://www.tpr.org/public-health/2025-03-27/west-texas-children-treated-for-vitamin-a-toxicity-as-medical-disinformation-spreads-alongside-measles-outbreak",
            "upvotes": 178,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/daf6fc5/2147483647/strip/true/crop/7643x4013+0+542/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F37%2F13%2F0953edf540aeb29c6df910b4b055%2F25063004603558.jpg",
            "top_comments": [
                "This was fixed.\n\nGo to any old cemetery or graveyard. Look around at all the kids, under 5, who passed away 120 years ago. 90 years ago. 75 years ago. Now look around for the kids who died 60 years ago. 40 years ago. You're hardly going to find any. This was fixed and now we're fucking it up again.",
                ">Covenant Children’s Hospital in Lubbock confirms it is treating children with severe cases of measles who are also suffering from vitamin A toxicity. According to the hospital, they have admitted fewer than 10 pediatric patients who were all initially hospitalized due to measles complications but have elevated levels of vitamin A that is resulting in abnormal liver function.\n\nBad enough that the parents are causing their children to get measles but they're further injuring them by forcing unhealthily high doses of vitamin A on them. This should be treated like the child abuse that it is.",
                "This is what happens when you put a non-doctor in charge of healthcare. Especially one who doesn't believe in the proven methods of treatments.",
                "Thanks for the advice Mr. Secretary.",
                "If only there were some sort of medical product they could give them to prevent all of this in the first place. Like a vaccination or an inoculation of sorts.  /sarcasm.",
                "So now they have measles and vitamin a overdose? \n\n\nRFK needs to be tried for murder",
                "Vit A supplementation is a valid treatment for measles IF AND ONLY IF the child is Vit A deficient to start with, as is the case in some undernourished nations, but NOT likely in the USA.\n\nOnce again, actual valid science/medicine in the hands of the \"do your own research\" crowd causing suffering for people who depend on those losers.",
                "RFK Jr. be like, \"Exactly as God intended.\"",
                "Oh, god. I was worried this might happen after RFK Jr's comments on vitamin A. Toxicity from this stuff is really bad. Like I read an article about an artic explorer who had to eat polar bear, got too much vitamin A from the liver and ended up... well, the story starts with him taking off his socks and the skin on his feet going with it. This stuff is BAD if you get too much. It's not \"oh, if some vitamins are good then more is better, right?\"\n\nThis very clearly lays at the feet of RFK Jr, the CDC and the Trump administration. So disgusting.",
                "Vaccines are good, it’s child circumcision that we should be getting rid of for being harmful"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Utah becomes the first state to ban fluoride in public drinking water",
            "external_url": "https://apnews.com/article/utah-fluoride-ban-43f67153beb3e06ada9d782655fb15de",
            "upvotes": 1302,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wish I was a dentist and I lived in Utah.",
                "If only there were some 2011 event that could teach us about [what may happen](https://www.dentistryiq.com/dentistry/research-and-news/article/55248093/why-calgary-reversed-its-decision-on-fluoride-after-10-years). \n\n(Calgary reversed the decision 13 years later because they noticed a significant rise in decalcification along the gumline)",
                ">Utah lawmakers who pushed for a ban said putting fluoride in water was too expensive.\n\nAh, ok.\n\nAnd they tied this legislation to a tax cut for everyone in the state, right? Riiiiiight??",
                "First Sundance moves to Boulder. Now they ban fluoride. Come on Utah, get your act together.",
                "I hate that this says \"First\" and that Utah will definitely not be the last with this Idiocracy in place.",
                "Grew up in Portland, Its a lovely motivator that my teeth deteriorate faster than most anyone else. like an entropy war drum. Floss kids!",
                "Just call it T Dazzle and throw it back in the water.",
                "Calgary, Alberta did this. Just over a decade later they're reversing it. The data about how big a disaster this was is **very clear**\n\n\n> The number of children receiving IV antibiotics for dental infections at Alberta Children’s Hospital increased by 700% from 2011 to 2018. The majority of these patients were under five years old.\n\n\nAnd a study comparing Calgary with Edmonton (the other major city in Alberta)\n\n\n> [2018 and 2019 data showed] 64.8 per cent of participants in Calgary had one or more cavities in their baby teeth, compared with 55.1 per cent in Edmonton participants.\n\n\nCompared to 5 years earlier\n\n\n> [2013 and 2014 data showed] a 56.6 per cent prevalence of dental cavities in baby teeth in Calgary, and 58.7 per cent in Edmonton.\n\n\nFluoride toothpaste doesn't get the fluoride *inside* developing bones and teeth, it only treats the *outside* of the teeth. It's good for maintenance, it's not a replacement for dietary intake for children.",
                "Spent most of my life in civilization (a city) that used fluoride. I seem fine. But now I’m in rural American where they don’t use it and everybody out here’s got some fucked up teeth. So there’s that.",
                "Alabama is gonna be pissed that Utah out dumbed them."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Over 2000 protest in wake of student detainment",
            "external_url": "https://www.tuftsdaily.com/article/2025/03/over-2000-protest-in-wake-of-student-detainment",
            "upvotes": 309,
            "date": "03/28/2025",
            "thumbnail": "https://snworksceo.imgix.net/ttd/892ebf50-7170-4741-bd2d-38007efd0704.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "This is response to this video of a PhD student being abducted by ICE for writing an op-ed in the school newspaper. She committed no crime. She is in the US legally \n\n\nEven if you disagree with her opinion, she has a right to say it.\n\n\n\nhttps://www.youtube.com/watch?v=PuFIs7OkzYY",
                "Don't stop protesting until they undo it, otherwise you're wasting your time.",
                "Don't stop protesting boycotting, or this country will fall to government power abuse.",
                "At least some students have some courage to protest!?  The rest of us are pitiful and lazy!",
                "I applaud them for their bravery. We need to continue to speak truth to power.",
                "*“It is the immigrant communities, the undocumented communities, the working communities who are leading this struggle for our own liberation,” another said earlier.   Local residents of all ages attended the protest in addition to Tufts students, faculty and staff.*\n\nThe voices of connection vs the voices of FEAR, Repression, and Detainment.",
                "a russian troll farm set up two protests in texas on the same street corner."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 2331,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "Why did certain women vote for Trump again?",
                "Makes me sick to my stomach that this political party feels like it’s their priority to control and regulate women’s bodies",
                "Wonder why the birth rates are dropping?  It is too risky to get pregnant in this country.  It opens women up to too many legal issues and possible life-threatening results."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "483 cases of measles reported across 19 states: CDC",
            "external_url": "https://abcnews.go.com/Health/500-cases-measles-reported-nationwide-19-states-cdc/story?id=120251851",
            "upvotes": 250,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8f40f12a-86a6-4903-a19c-5dfb224a4b33/measles-texas-gty-jt-250311_1741733208836_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Things like this flourishing into bigger and bigger problems will illustrate exactly how important public health workers are — or were, before they were fired. Of course, the culpable party will not recognize or acknowledge it.",
                "Don't worry, that will drop to zero when CDC stops reporting numbers that make the administration look bad.",
                ">Health and Human Services Secretary Robert F. Kennedy Jr. and other vaccine skeptics have promoted vitamin A amid the measles outbreak\n\nA skeptic is someone who doesn't believe that you have psychic powers until you prove it.  'Denialist' is the word we're looking for here.\n\n>During an interview on Fox News with Sean Hannity earlier this month, Kennedy said that HHS was currently providing vitamin A to measles patients for treatment, claiming vitamin A can \"dramatically\" reduce measles deaths.\n\nJust the other day, I was wondering if Sean Hannity is still a huge piece of crap.  Good to have my answer.",
                "Just a heads up, some adults could use the MMR vaccine too. If you got it before 1968, high risk, or you have health issues, speak to a Dr\n\n\nhttps://www.npr.org/sections/shots-health-news/2025/02/21/nx-s1-5304458/measles-vaccine-booster-health\n\n\nI got the one shot as a kid, but being in Texas and dealing with a health issue in the family, I received the MMR recently just in case. Was told I could have side effects but I was fine. Was free with my health insurance and less spicy than the flu vaccine. ",
                "Just wave cabbage leaves at the kids, they'll be fine ....",
                "I guess this is the start of how this current timeline is going to prune itself",
                "Elect stupid people and you get to die a preventable death.",
                "So..........much..........winning.......",
                "Dwarf siberian for measles, savoy only works for cholera."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Dow sinks more than 600 points. Stocks are on track for their worst quarter since 2023",
            "external_url": "https://www.cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility",
            "upvotes": 7240,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206185432.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Are we having fun yet?",
                "Ever since January 20  the economy has tanked and being on downward spiral because of poor policies .",
                "Trump's economy in action.",
                "They must be updating the headline. When I first saw it the headline said 500 points. OP posted 600. Clicking the link now at 1311 hours its 700 points.\n\nEDIT: Lol. On the top right under 'latest market news' there's a headline for 600 points and clicking on it takes you to the headline for 700 points. Silly website.",
                "Right now down 735. \n\nIt would need to fall another 700 points or so to hit the dip it was at a couple weeks ago. Another drop of that magnitude would take it to summer last year.",
                "Sec Treasury Bennet just included me in a chat about the declining stock market.  Will keep you all posted.",
                "Note to America - don’t elect idiots & crooks.",
                "I mean is anyone surprised? I literally can't think of any positive economic indicators or good news on the horizon. We haven't even started feeling the effects of the tariffs and the feds yanking billions of dollars of spending out of the economy, unemployment is going to spike with all the layoffs over the last couple of months, and inflation is taking off again.\n\nI've moved mostly into cash. I keep hearing people repeat a dumb slogan: \"Time in the market > timing the market!!!\" Maybe that's true sometimes, but not times like now where there is literally zero reason for the market to go up, and a zillion reasons it will continue going down.",
                "Somebody's winning.  It's just not us.",
                "Have you even said thank you?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Convicted founder of electric vehicle startup Nikola pardoned by Trump",
            "external_url": "https://apnews.com/article/nikola-trevor-milton-fraud-trump-pardon-3fcebb0a3820cecb205656f2dc3f6764",
            "upvotes": 2362,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fraudster helping fraudster.\n\n>the pardon could wipe out hundreds of millions of dollars in restitution that prosecutors were seeking for defrauded investors.\n\nOnce again, the victims and judicial system are spat upon by Trump. I wonder how many of them voted for him.",
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund less than a month before the November election, according to the Federal Election Commission,\n\nIn case you want to know what the current going rate for a pardon is, it's $1,800,000.00 for a four-year sentence.\n\n____\n>“I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\nA pardon doesn't grant innocence. Accepting one gives the pardoned person ['an imputation of guilt and acceptance of a confession of it'](https://en.wikipedia.org/wiki/Burdick_v._United_States#Decision).",
                "Lol are these the guys that got busted rolling a truck down a hill?",
                "Republican crime syndicate in action.",
                "President crime lover",
                "Milton was convicted by a jury. He was represented in that trial by Brad Bondi, a partner at law firm Paul Hastings and the brother of current U.S. Attorney General Pam Bondi.",
                "So Americans are just super okay now with blatant quid pro quo corruption in their government?",
                "What fucking idiot decided to name an EV startup \"Nikola\", like that's not even attempting to disguise that your intentions are to rip off a more well known brand, hinting that their products are likely shit.",
                "> “I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\n\nYeah, that's not what a pardon is, though.",
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund \n\n100% MAGAs and foreign MAGA-wannabes are Ok with this."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 6927,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "Keep destroying that local economy Kentucky. ",
                "At least they have enough whiskey to drown in.",
                "I hope they get everything they voted for.",
                "Most of these bill are bills that would hurt the people of Kentucky, so its time for those people to vote those representatives out.  That might mean voting for a democrat(oh no!) and if they don't then they get to suck it up and be happy with these horrible pieces of legislation.  Enjoy that brown water coming out of your tap.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "[removed]",
                "Gave them the power didn’t ya?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Israeli soldier tells CBS News he was ordered to use Palestinians as human shields in Gaza",
            "external_url": "https://www.cbsnews.com/news/israeli-soldier-palestinians-human-shields-gaza/",
            "upvotes": 1539,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/27/9043b153-7671-47e4-982f-7afa3a2f8870/thumbnail/1200x630/5d20706c78cad9cc8c025f6cab3cfe91/1743033727795.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                ">Tommy said his commander ordered his unit to use Gazan civilians to search buildings for explosives instead of dogs.\n\n>\"They were Palestinian,\" he said. \"We sent them in first to see if the building was clear and check for booby traps…They were trembling and shaking.\"\n\nI'd say it goes further than just using them as shields.",
                "We know. \n\nWe've watched them do it for years.",
                "Uh oh, masked agents are going to kidnap CBS execs off the streets now",
                "*I was just following orders*\n\n\nThis sounds familiar now we're have I heard this before 🤔",
                "Thank God the IDF member said it, because seeing it with my own eyes on a literal video wasn't believable enough.",
                "“I was just following orders” didn’t fly the first time and it shouldn’t fly this time either",
                "Being against using human shields is antisemetic. (s/)",
                "This is very anti-Semitic and anti-American of CBS News!\n\n\n\n\n/s for those who need it.",
                "If only that was the worst of the war crimes the IDF is committing.  But its not.\n\nEveryone knows they are deliberately committing genocide.  Imagine if during WWII the Americans went through Germany and killed as many civilians burning as possible burning down their homes using the the excuse that all the women and children supported Nazis.\n\nAnd I want to make it clear, most Jewish people I know are appalled at what the IDF is doing.  The IDF is not all Israelis.  Blaming all israelis is just as bad as blaming all palestinians.",
                "Bad as that sounds, that undersells how bad it is!\n\nIf you conduct activities in civilian areas so that the other side will not attack, that may be described as using human shields. But this soldier describes a protocol of ordering civilians (from the opposing side) into buildings to clear explosives, as this job was too dangerous for soldiers. Surely that's a specific crime beyond \"human shields.\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Utah becomes the first state to ban fluoride in public drinking water",
            "external_url": "https://apnews.com/article/utah-fluoride-ban-43f67153beb3e06ada9d782655fb15de",
            "upvotes": 1303,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wish I was a dentist and I lived in Utah.",
                "If only there were some 2011 event that could teach us about [what may happen](https://www.dentistryiq.com/dentistry/research-and-news/article/55248093/why-calgary-reversed-its-decision-on-fluoride-after-10-years). \n\n(Calgary reversed the decision 13 years later because they noticed a significant rise in decalcification along the gumline)",
                ">Utah lawmakers who pushed for a ban said putting fluoride in water was too expensive.\n\nAh, ok.\n\nAnd they tied this legislation to a tax cut for everyone in the state, right? Riiiiiight??",
                "First Sundance moves to Boulder. Now they ban fluoride. Come on Utah, get your act together.",
                "I hate that this says \"First\" and that Utah will definitely not be the last with this Idiocracy in place.",
                "Grew up in Portland, Its a lovely motivator that my teeth deteriorate faster than most anyone else. like an entropy war drum. Floss kids!",
                "Just call it T Dazzle and throw it back in the water.",
                "Calgary, Alberta did this. Just over a decade later they're reversing it. The data about how big a disaster this was is **very clear**\n\n\n> The number of children receiving IV antibiotics for dental infections at Alberta Children’s Hospital increased by 700% from 2011 to 2018. The majority of these patients were under five years old.\n\n\nAnd a study comparing Calgary with Edmonton (the other major city in Alberta)\n\n\n> [2018 and 2019 data showed] 64.8 per cent of participants in Calgary had one or more cavities in their baby teeth, compared with 55.1 per cent in Edmonton participants.\n\n\nCompared to 5 years earlier\n\n\n> [2013 and 2014 data showed] a 56.6 per cent prevalence of dental cavities in baby teeth in Calgary, and 58.7 per cent in Edmonton.\n\n\nFluoride toothpaste doesn't get the fluoride *inside* developing bones and teeth, it only treats the *outside* of the teeth. It's good for maintenance, it's not a replacement for dietary intake for children.",
                "Spent most of my life in civilization (a city) that used fluoride. I seem fine. But now I’m in rural American where they don’t use it and everybody out here’s got some fucked up teeth. So there’s that.",
                "Alabama is gonna be pissed that Utah out dumbed them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S. sees large rise in border seizures of eggs, while fentanyl rate falls",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5342554/eggs-border-seizures-fentanyl",
            "upvotes": 229,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8227x4628+0+256/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F24%2F9d%2Fa3965d3f4fc8acc7664c606246e3%2Fgettyimages-2205469857.jpg",
            "top_comments": [
                "Meanwhile more drugs continue to go over into Canada a week than any month the other way.",
                "I think we're gonna need a street name for eggs soon. Any ideas?",
                "Is there a subreddit for oddly uplifting news?",
                "This headline is objectively funny. At first glance, I was going to guess it was from The Onion",
                "I still don't understand egg smuggling. Like sure they cost a lot more than they did pre covid, but they're still really cheap by volume/weight. Just seems high risk low reward.",
                "Anyone can be Han Solo if you think about it."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Former Del. middle school principal charged with raping student for 4 years",
            "external_url": "https://www.nbcphiladelphia.com/news/local/middle-school-principal-rape-student-delaware-tasha-oliver-purnell/4143403/",
            "upvotes": 877,
            "date": "03/28/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/03/oliver-purnell-2.0.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "For 4 years. God damn.",
                "Holy crap an accurate headline for this circumstance for once",
                "Sadly, this probably is just the tip of the iceberg. Someone who felt like they got away with touching/abusing a young girl for 4 years a decade ago, isn't likely to have stopped, that's probably just the timeline for the victim that came forward. Glad she did though, may that young woman get justice and may she inspire others to do the same.",
                "Well would you look at that, a headline using the proper terms for a Female engaged in sexual activity with a minor. Weird they do it in this case 🤔",
                "Comments are all cheering for an accurate headline for this shit like they wouldn’t have just defaulted back to the same old bullshit if the teacher was white and blonde and in her 20s, but whatever.",
                "Imagine a world where I'm surprised that this actually says rape.",
                "trump's new Secretary of Education.",
                "She'll get suspended sentence with 90 days community service.",
                "The dark side of equal treatment for women, evil is gender neutral.  Hopefully, justice is, too.",
                "Still not a drag queen."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "03/28/2025 20:09:34 UTC"
}