{
    "posts": [
        {
            "category": "HOT",
            "title": "Musk signals 'significantly' stepping back from Doge as Tesla profits plunge",
            "external_url": "https://www.bbc.co.uk/news/articles/cy0x50yr46lo",
            "upvotes": 14387,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54dd/live/0534ad00-200c-11f0-8c2e-77498b1ce297.jpg",
            "top_comments": [
                "He's lying. It's a ruse to manipulate Tesla's stock price.",
                "Don’t think it’ll help. He’s destroyed his image in a short amount of time and there’s no taking it back.",
                "It's cute he thinks his reputation is salvageable at this point",
                "The damage is done. I am in the market for an EV and would never now consider a Tesla. So many others are in the exact same situation. ",
                "Won't matter. Damage is done. These tesla profits dropping are just the start. Wait for next quarter.",
                "Okay.. Elon is no longer publicly making an ass of himself. That doesn't change the fact that big balls and the other creeps Elon hired are dismantling everything",
                "Can't put the \"heil Hitler\" back in the tube. Fuck Tesla. Take it to zero.",
                "He's already wrecked the systems, stolen all our data, and installed his digital and personnel backdoors.\n\n.. but at least the world has finally seen what a narcissistic nazi douchebag he is.",
                "He stole what he wanted and bailed.\n\nWe’ve been watching/ reading this supervillain shit our whole lives, but when Dr. Villain shows up in real life we don’t have James Bond or the Avengers to save us.",
                "Lmao yea right. Anything good that could come from this administration wont and Elon leaving would be amazing for us so he wont be going anywhere."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Top US officials pull out of Russia-Ukraine ceasefire talks in London",
            "external_url": "https://bbc.com/news/articles/c78jx68d922o",
            "upvotes": 1793,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5a82/live/1a842290-2038-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "What happened to I will end the war on my first day in office?",
                "Trump stabbing Ukraine in the back while courting Russia is one of the most disgusting US foreign policy decisions in recent history. I’m so ashamed to be American.",
                "The US has never been as weak and pathetic as it is now.",
                "US will blame Ukraine and Zelenskyy and claim that Russia's proposals are fair and balanced. The real goal of the US is not peace, nor justice for Ukraine, but the agreement with Putin that he gets to keep four provinces and Crimea, so long as the US gets the resources from the rest of Ukraine.\n\nNo reasonable person could think that this is anything less than an attempt at forced capitulation by the US. What a hateful country it has become.",
                "President Russian Asset Pulls Out Of Russian Peace Talks As Planned",
                "“I will end the Russian-Ukraine war on day one” is the sequel to “I will build a border wall”.",
                "Probably because the US is pro-putin.",
                "Nothing to see here. Just Comrade Krasnov doing Putin's bidding.",
                "\"Peace\" talks. Why even bother calling them that if the end goal was never peace?",
                "The US wouldn't have added any benefit. Their \"final offer\" is a Ukranian capitulation, they've achieved precisely nothing except shown the world they're Putin's bottom."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Tesla sales plunge as carmaker warns ‘political sentiment’ could impact future demand",
            "external_url": "https://www.theguardian.com/technology/2025/apr/22/tesla-sales-musk-white-house-exit",
            "upvotes": 16012,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/84a18423ca2ed213d3451c93cff70ea1d454a856/0_53_7743_4646/master/7743.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d888d103ebc9308d688aa42c7c9ea3e0",
            "top_comments": [
                "I love that for them!\n\nFuck you, Elon.",
                "Obviously, you fucking idiots. Its not just political sentiment. The guy is making nazi gestures, making nazi jokes, propping up far right parties in germany, sending his goons in to capture data they weren't elected for in the States. Fuck Tesla. And this is coming from someone who owns an Model 3 but can't really get rid of it (family/young kids/mortgage/bills/etc take priority)",
                "The fact that a Hitler salute has to be described as \"political sentiment\" gives me feelings of disappointment in humanity.",
                "The fact that it also sucks as a company also doesn't help.  They've been massively overvalued for a long time, kept afloat primarily through Elon Musk's weird tech bro cult of personality.  With Musk's mask off and his fascism on full display, the fragile foundation of this house of cards - i.e., the goodwill toward Elon himself - has cracked and the whole thing is tumbling down.",
                "Kind of a stupid fucking move to try and sell electric cars to Nazi sympathizers. That's such a small overlap of American society.",
                "So anti-Nazi sentiment then? Okay that could be a problem yeah.",
                "My wife and I would be at least two teslas in…went so far as test driving but now, will never own one out of principle…who cares, it’s just two people but I’m guessing we are part of a not insignificant part of the target demo…get rekted Elmo…",
                "The CEO sieg heiled twice.",
                "> Analysts attribute the company’s overall difficulties to a number of factors, but ultimately conclude Elon Musk’s role in the White House has caused a branding crisis for Tesla. The company is at a major crossroads, analysts say, that will only be remedied if Musk leaves his role in the so-called “department of government efficiency” and returns to Tesla as CEO full time.\n\nElon is trash goods. People aren’t going to stop hating him just because he leaves. The damage he has caused to America’s democracy and government is unforgivable.",
                "How it is when you offend and fuck with your core demo."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Sarah Palin loses retrial of defamation case against New York Times",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/sarah-palin-loses-defamation-nyt-retrial",
            "upvotes": 23007,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8a71a1a108784657ab0666974cc8c763211db1b0/0_142_4300_2581/master/4300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e0e0a47794bea93c9f820c3c81f93292",
            "top_comments": [
                "I'm not joking, but I'd completely forgotten about Sarah Palin until I read this headline.",
                "Can she see this verdict from her front porch?",
                "Tina Fey made Sarah Palin more famous than Sarah Palin did.",
                "Dam they're really Nailin Palin",
                "\"Sarah Palin loses\", a tune now so common it's subtly and ever-so-slowly replacing that quintessential elevator music. Keep it up queen!",
                "I'm surprised she didn't quit half way through the case",
                "Not upset about this. She is one of the main reasons we are in the mess we are in now. Because she not only was a poor loser but a bad politician who couldn’t take a black man becoming president.",
                "Good. Now she can cry more.",
                "First The Masked Singer, and now this. Can't get a break.",
                "If you've never seen it, do yourself a favor and watch the movie Game Change about her campaign with John McCain. It's a decent movie with some big names but it has more of a TV movie feel IMHO. People on the campaign (and characters in the movie) like Nicole Wallace have said it is accurate. It's amazing how bad of a choice she was for his running mate. She did some wacky shit and really tanked his campaign."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Veterans affairs agency orders staff to report each other for ‘anti-Christian bias’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/veterans-affairs-anti-christian-bias?CMP=Share_AndroidApp_Other",
            "upvotes": 7723,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/61859c303c21779b1d4c162dfdfc73baffe0230c/0_187_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35ea48c1ee63f288cfa25a06cb609745",
            "top_comments": [
                "They have all the power now and they still act like they are the most oppressed people on the planet.",
                ">  The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”\n\nHostile to Christian views?\n\nSo, all instances of employees NOT discriminating against women, minorities, and the LGBTQ+ community will be reported.\n\nBasically, people will be punished for being decent.",
                "mY sUpErViSoR sAiD hApPy hOlIdAyS tO mE!",
                ">“The VA Task Force now requests all VA employees to **submit any instance of anti-Christian discrimination to Anti-ChristianBiasReporting.@va.gov,”** the email reads. “Submissions should include sufficient identifiers such as names, dates, and locations.”\n\nRedditors, you have your assignment.",
                "> The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”.\n\nWanting to maintain the separation of church and state is not an attack.",
                "So much for the separation of Church and State.",
                "wish jesus was real, and that he would come back - again - and take all these assholes to wherever it is that they belong ...",
                "Fuck these anti Constitutional traitors!That's a violation of the 1st amendment! These traitors won't stop until we make them, and they don't give a flying eff about protest signs they can't read anyways!",
                "Everyday, Trump's administration proves that both parties are in fact not the same. ",
                "Every president  and 87% of our congress are Christian. SCOTUS is all Christian. Not oppressed."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "FDA says it will phase out petroleum-based food dyes, authorize four natural color additives",
            "external_url": "https://www.cnn.com/2025/04/22/health/fda-food-dyes",
            "upvotes": 5036,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-22t203936z-1661349634-rc283eaquvca-rtrmadp-3-usa-trump-fda-dyes.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "But they can’t be fucked to enforce food safety regulations?",
                "[deleted]",
                "From a doctor, the issue with this is the HUGE amount of energy and effort being put into this (there’s no good evidence that the amount of dye used here causes any problems other than in pitri dish studies/feeding gallons to mice) and a COMPLETE disregard for things that are ACTIVELY harming people (food safety monitoring, lead, vaccine hesitancy, cost of healthy food, more strict regulations on air and water quality).\n\nThis is the medical equivalent of giving emergency chamomile tea to someone with insomnia…who also has a gaping gunshot wound to their leg.",
                "Any country that wants to export food products needs to meet the market’s food safety standards or the products will only be good for domestic use.  Other countries don’t need or want bright red fruit loops and blue icing and neon orange cheese dust. \n\nSome of these dyes have been banned for a decade in other countries - no one misses them one bit - and large companies have pivoted away from them without going broke.   It rarely changes the formulation or production of a product.   \n\nIt’s a super simple change.  The only thing party that loses here are the companies that make the petroleum based dyes.  Which will be replaced by companies that make non petroleum based dyes.  Who owns those?",
                "I think a lot of the fears about some food dyes are overhyped and at worst fear mongering, but I do believe if natural color additives can be used they should be. Doing things because they're cheaper or easier doesn't mean it should be that way. Natural dyes work just fine. I think it would make people in all areas of the conversation come to agreement.",
                "Plot twist: no one will be around at the FDA to test products for compliance",
                "These natural colors wouldn’t happen to be Colloidal Silver, Monoatomic Gold, Copper and Spirulina would they?",
                "Why is medicine loaded up with dyes? I have no fucks to give about the color of medicine, only that the stuff is effective.",
                "But let’s not check milk for safety anymore!!!!",
                "They can't test milk but they they'll be able to regulate and enforce this? Ya sure, totes."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 16887,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "I wonder if the fall of Rome was this stupid.",
                "It feels like this administration is doing its best to create different ways to kill us or make us so sick we wish for death.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "Guess this is how we kill people.",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "This reminds me of the Wisconsin or North Dakota politician that campaigned ***hard*** on allowing raw milk. They changed their state laws to allow for raw milk sales and at the press conference the politician drank a glass of raw milk in celebration. It immediately made him sick. Like, next day.",
                "Don’t drink milk, got it.",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "Next new peice of business from this admin is calling Canada and the EU evil for not wanting to buy US dairy products. I can't imagine why!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 38573,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "He should be fired and charged.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "I hope he gets fired via a Signal message in a group chat.",
                "Any other administration and he’d have been fired weeks ago",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "He might as well add Fox news to the chat.",
                "He is a traitor to the United States"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Trump must give some Venezuelan migrants 21 days' notice before deportations, judge rules",
            "external_url": "https://www.reuters.com/legal/trump-must-give-some-venezuelan-migrants-21-days-notice-before-deportations-2025-04-22/",
            "upvotes": 6052,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In coming Truth Social Post: \"All immigrants are hereby notified that you are subject to deportation in 21 days!!!\"",
                "I admire the judges that resist him with their rulings, but what does it ultimately mean if no one will enforce it? The people with the weapons have to follow the judges' orders before they are worth more than any rando's judgment.",
                "Doesn't matter what the judge rules if he never faces consequences for anything.",
                "Followed by him saying “I’m gonna do it anyway,” the judges saying “Well…you can’t,” and then him doing it anyway because the law is simply not enforced where Trump is concerned.",
                "> administration must tell the migrants in a language they understand that they have the right to consult a lawyer.\n\n  \nBut will they allow a lawyer to talk to them?  He know Trump goons going to skirt this part, these judges need to treat them like 5 y/o with their rulings and spell it out, every step.",
                "Good. Everyone in the US is legally entitled and morally deserving of due process.",
                "So, Trump will arrest them tomorrow - hold them for 21 days - then, it's off to El Salvador?!!",
                "In one ear right out the other. The fact this idiot hasn't already had the impeachment process started against him means he will ignore it and get away with it. I hate this country",
                "Trump: \"no\"\n\n\\~Probably.",
                "I’m SURE he’ll comply this time."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Bill Owens, Executive Producer Of ’60 Minutes,’ Resigns, Saying He Lost His Ability To Make “Independent Decisions” About The Show",
            "external_url": "https://deadline.com/2025/04/bill-owens-60-minutes-cbs-trump-1236373948/",
            "upvotes": 5352,
            "date": "04/22/2025",
            "thumbnail": "https://deadline.com/wp-content/uploads/2024/02/Bill-Owens-headshot-credit-Michele-Crowe-CBS.jpg?w=1024",
            "top_comments": [
                "*Owens’ departure comes amid settlement talks between CBS and Donald Trump‘s team over a lawsuit Trump filed over the way 60 Minutes edited an interview with Kamala Harris. Many legal observers call the lawsuit frivolous, but CBS’ parent company, Paramount Global, needs administration approval for its proposed merger with Skydance. A mediator was recently selected to try to resolve the dispute, sources said.*\n\nWell, that's pretty clear.",
                "Just a reminder, [CBS is currently in the process of a merger with Skydance Media](https://www.cnn.com/2024/07/08/media/paramount-global-skydance-merger-announcement/index.html) and is awaiting [FCC](https://www.fcc.gov/transaction/skydance-paramount) approval. \n\nTrump is currently suing CBS over [60 Minutes](https://apnews.com/article/cbs-60-minutes-lawsuit-trump-pelley-58339cc1a1eb52739bb365e2e8c6d8bc). A settlement that will need to be settled before the merger is approved.\n\nTrump's corruption is unparalleled.",
                "They pressured him to do Trump positive stuff, didn't they...",
                "CBS is going to outlive the worthless orange POS. Stop kissing this motherfucker's ring!",
                "It's The Insider all over again. But this time CBS isn't bowing to Big Tobacco, it bowing to Big Cheeto.",
                "In other words, 60 Minutes and CBS are now wings of the Ministry of Truth.",
                "We have to collectively start to push back at these 'Trump lashed out etc' - the Dump basically has this unmoderated loudspeaker that has zero rebuttal or ability to correct. It just gets on there and speaks BS and the deluded followers believe it. And no one - other than the media who are scared shitless - can actually rebut at the same magnitude. We all play nice to it with 'oh, only the crazy believe him' or 'its just noise and bullshit, don't listen' but its impacting everyone and everything and it is so beyond needing to be stopped and corrected. Its brutal!\n\nThe dipshit doesn't even understand how or what tariffs are and is cratering economies and peoples lives. Its insane!",
                "Another organisation with no backbone",
                "That was a good episode.  My last one.",
                "Canceled my Paramount+ subscription.  Hell with these fascist clowns..."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Top US officials pull out of Russia-Ukraine ceasefire talks in London",
            "external_url": "https://bbc.com/news/articles/c78jx68d922o",
            "upvotes": 1801,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5a82/live/1a842290-2038-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "What happened to I will end the war on my first day in office?",
                "Trump stabbing Ukraine in the back while courting Russia is one of the most disgusting US foreign policy decisions in recent history. I’m so ashamed to be American.",
                "The US has never been as weak and pathetic as it is now.",
                "US will blame Ukraine and Zelenskyy and claim that Russia's proposals are fair and balanced. The real goal of the US is not peace, nor justice for Ukraine, but the agreement with Putin that he gets to keep four provinces and Crimea, so long as the US gets the resources from the rest of Ukraine.\n\nNo reasonable person could think that this is anything less than an attempt at forced capitulation by the US. What a hateful country it has become.",
                "President Russian Asset Pulls Out Of Russian Peace Talks As Planned",
                "“I will end the Russian-Ukraine war on day one” is the sequel to “I will build a border wall”.",
                "Probably because the US is pro-putin.",
                "Nothing to see here. Just Comrade Krasnov doing Putin's bidding.",
                "\"Peace\" talks. Why even bother calling them that if the end goal was never peace?",
                "The US wouldn't have added any benefit. Their \"final offer\" is a Ukranian capitulation, they've achieved precisely nothing except shown the world they're Putin's bottom."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Russia-Ukraine war: London to host new ceasefire talks",
            "external_url": "https://www.bbc.co.uk/news/articles/c78jx68d922o",
            "upvotes": 174,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5a82/live/1a842290-2038-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "[removed]",
                "Read: London to host first real ceasefire talks.",
                "Why bother? Russia already violated the Easter ceasefire and Putin is biologically incapable of upholding agreements.",
                "in the meantime ruSSia droned bus full of people on their way to work... murdered at least 9 and injured 30.",
                "Everyone better make sure they say thank you"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Number of births in US increased by 1% in 2024, according to CDC data",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/23/births-increase",
            "upvotes": 165,
            "date": "04/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7002690c118a7f3998a21f3da638d1469a941a3/0_135_5375_3225/master/5375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=498380abac324496b09b713f4087c5a6",
            "top_comments": [
                "why are births holding steady with such high living costs?",
                " I’m sure with the new push for vaccines they’ll all live a long healthy life.",
                "That sounds more like a normal fluctuation than any meaningful increase.",
                "I imagine we're going to hear ~~forced birthers~~ \"pro-lifers\" brag about this",
                "Medicaid funding deduction. 2 billion dollars.",
                "Will drop under Trump.",
                "With the dollar worth 3x less its value then what it was 60 years ago I can only imagine how many kids will grow up as orphans or in poor conditions, no health care, going to school hungry, meanwhile MAGA will cheer about gun rights and protection their billionaires bank accounts",
                "The creepy administration will be thrilled to hear this",
                "We still have people to count this but we don’t have people to do safety checks on milk. Good times.",
                "Who looks at the state of the world and thinks, \"Yeah, now's a good time to start a family\"? You've got a 50-50 shot your kid grows up (if it survives measles) to spend its life in a techno-slum with Grok for a feudal lord and Dickbutt on its flag."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "El Paso Walmart shooter received forgiveness and a hug from victim’s sister",
            "external_url": "https://elpasomatters.org/2025/04/22/victims-sister-hugs-walmart-gunman-patrick-crusius-el-paso/",
            "upvotes": 661,
            "date": "04/23/2025",
            "thumbnail": "https://elpasomatters.org/wp-content/uploads/2025/04/crusius_hug_rrr_1.jpg",
            "top_comments": [
                "If somebody murders me and then my sister hugs them, I’d be so pissed!",
                "That's big of her but society will hold him accountable.",
                "Is this the Chudjak guy or someone else?",
                "And from another victim’s wife. Hard to fathom. \n\nAlso buried in the article:\n>gunman who said he wanted to stop “the Hispanic invasion of Texas.”\n\nA place that was literally Mexican before it was American. Teaching history is important, people. Teaching people not to be hateful bigoted murderers is also a good idea.",
                "Fucking terrorist. She’s better than me.",
                "I think some people after suffering traumatic loss of a loved one struggle to feel “whole” again. I can see her forgiveness as being something she feels she needs to do to move on or find peace. This is about her more than it is about him, and that’s okay!",
                "If someone took a loved one away from me like that I wouldn't forgive them. Not saying that's a good thing or anything. Good on her for being able to.",
                "Forgiveness is never a bad thing.\n\nForgiveness doesn’t mean he isn’t guilty, it doesn’t mean he shouldn’t suffer consequences. It’s just forgiveness, and forgiveness is *good*. \n\nYou can forgive people who do terrible things, too. It will make your life better if you do.",
                "Bigger people than I. If I got my hands on someone who killed my loves, I would only let go when they or I had joined them.\n\n\nWhich shows I have a lot of work to do on my anger response still.\n\n\nI hope they all heal as best as is possible. ",
                "All the so-called Christians who think all they have to do are recite a few spells once a week and they magically get into heaven no matter whatever else they may do, should take a lesson from this woman. This is what Christianity is really about. Forgiving people, even when they have wronged you in a very serious way.\n\nI respect the hell out of this woman. I'm not sure I could do the same, and I don't even particularly get along with my siblings."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Gaza health ministry denies manipulating death toll figures",
            "external_url": "https://www.bbc.co.uk/news/articles/cx25x35476yo",
            "upvotes": 98,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/30b0/live/bafeccd0-1f79-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Fine, let's go with the death toll figures quoted by external agencies like Lancet.\n\nThey were putting the numbers at 40% more than the figures quoted by the Gaza health ministry",
                "lbr if anything it's much higher. they went after the hospitals and infrastructure first so it couldn't be accurately counted.\n\nyou can't bomb a small territory for 2 years while destroying hospital and not allowing in aid or food and think that the death toll isn't higher.",
                "The US and Isreal have both accepted health ministry numbers for years.  Its only recently that the US media has started trying to besmirch the numbers by referring to it as the \"Hamas-lead.\"\n\nAnything to avoid responsibility for genocide.",
                "Seriously? Looking at the wholesale destruction and at where the IDF has launched missile strikes, including at clearly marked aid and medical convoys (UN, even),  does the Gaza Health Ministry really need to inflate the number of dead women and children?",
                "Like we're not still talking about tens of thousands of murders? When innocent people are killed it's called murder. When babies are blown to bits daily, it's murder. Twenty thousand, fifty thousand, what's the fucking difference they're arguing here? I hope every single person responsible dies a painful death. Absolutely breaks my heart to see the horror these people endure every day for people to argue, well not THAT many of em were killed. Give me a fucking break.",
                "\"At least 51,266 people have been killed in the 18 months since the Gaza war began, according to the Hamas-run Ministry of Health, with nearly a third of the dead aged under 18.\"\n\nAlways struck me as odd that the HAMAS controlled areas always have such a precise headcount for international media whenever there are deaths in Gaza, regardless of who did the killing. Just have to blame Israel and keep it in the news cycle long enough to have an impact before the correction is aired and the numbers end up being garbage.",
                "It's sickening that they prefer all these deaths of their families and neighbours to releasing the hostages.",
                "They should exaggerate them to shine light on the genocide "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Musk signals 'significantly' stepping back from Doge as Tesla profits plunge",
            "external_url": "https://www.bbc.co.uk/news/articles/cy0x50yr46lo",
            "upvotes": 14392,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54dd/live/0534ad00-200c-11f0-8c2e-77498b1ce297.jpg",
            "top_comments": [
                "He's lying. It's a ruse to manipulate Tesla's stock price.",
                "Don’t think it’ll help. He’s destroyed his image in a short amount of time and there’s no taking it back.",
                "It's cute he thinks his reputation is salvageable at this point",
                "The damage is done. I am in the market for an EV and would never now consider a Tesla. So many others are in the exact same situation. ",
                "Won't matter. Damage is done. These tesla profits dropping are just the start. Wait for next quarter.",
                "Okay.. Elon is no longer publicly making an ass of himself. That doesn't change the fact that big balls and the other creeps Elon hired are dismantling everything",
                "Can't put the \"heil Hitler\" back in the tube. Fuck Tesla. Take it to zero.",
                "He's already wrecked the systems, stolen all our data, and installed his digital and personnel backdoors.\n\n.. but at least the world has finally seen what a narcissistic nazi douchebag he is.",
                "He stole what he wanted and bailed.\n\nWe’ve been watching/ reading this supervillain shit our whole lives, but when Dr. Villain shows up in real life we don’t have James Bond or the Avengers to save us.",
                "Lmao yea right. Anything good that could come from this administration wont and Elon leaving would be amazing for us so he wont be going anywhere."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Lori Vallow Daybell jury returns guilty verdict in Arizona trial over Charles Vallow's death",
            "external_url": "https://www.cbsnews.com/news/lori-vallow-daybell-verdict-arizona-trial/",
            "upvotes": 757,
            "date": "04/22/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/22/7ce99098-c2df-4d24-8e6c-57e443d96687/thumbnail/1200x630/fae369373e14126636d473a1699164b0/ap23132709066020.jpg?v=edaea84d9f9990d3a4d8ddf0e6fb4e98",
            "top_comments": [
                "22 April 2025\n\nfrom the article:\n\n>Lori Vallow Daybell was convicted Tuesday of conspiracy to commit murder in the 2019 killing of her estranged husband in Arizona:\n\n>Daybell is already serving life sentences in Idaho for multiple murders and for conspiracy to commit murder.\n\n>Jurors deliberated for a total of three hours over two days. \n\n>During the trial, which began in Phoenix on March 31, prosecutors argued that Vallow Daybell and Cox had planned to kill Vallow so she could collect money from his life insurance policy and marry Daybell, an Idaho author who wrote several religious novels about prophecies and the end of the world.\n\n>\"What we see is a very planned out, premeditated murder,\" prosecutor Treena Kay told the jury in her closing argument.\n\n>Vallow Daybell represented herself at the trial despite not being a lawyer. She didn't call any witnesses or put on any evidence in her defense, but said in her opening and closing statements that Vallow's death wasn't a crime.\n\n>This trial was not Vallow Daybell's last. She is scheduled to go on trial again in early June on a charge of conspiring to murder Brandon Boudreaux, the ex-husband of her niece, Melani Pawlowski.",
                "*... prosecutors argued that Vallow Daybell and Cox had planned to kill Vallow so she could collect money from his life insurance policy and marry Daybell, an Idaho author who wrote several religious novels about prophecies and the end of the world.*\n\nI knew that cult indications had to come up at some point in this story.",
                "Her son Colby live streamed the verdict and broke down in tears. I’m honestly amazed by his strength and how he is rather grounded with a good head on his shoulders. He’s definitely not giving up. I can’t imagine being in his shoes. Lori is a fucking monster and even looks like a haggard demon.",
                ">Cox's account was later called into question and Vallow Daybell was charged in Vallow's death following other murders, including of her children, 16-year-old Tylee Ryan and 7-year-old Joshua \"JJ\" Vallow. Vallow Daybell is already [serving life sentences in Idaho](https://www.cbsnews.com/news/lori-vallow-daybell-doomsday-mom-trial-tylee-ryan-jj-vallow-what-to-know/) for those murders and conspiring to murder her then-boyfriend [Chad Daybell's](https://www.cbsnews.com/news/chad-daybell-trial-doomsday-cult-murder-case/) wife, Tammy.\n\nHoly fuck, no matter how many times I read that, I cannot make heads nor tails of it. Everyone is named either \"Vallow\" or \"Daybell\". I think it's saying she's serving life in Idaho for killing a couple of her kids, but the rest... 🤷 Anyone out there on the interwebs able to translate this for me?",
                "For anybody that really wants to dig into this crazy ass story, I recommend this podcast: https://youtu.be/iT4e3gRlQr8?si=DcYYiQMbsQUIc8o0",
                "Good. It still pisses me off that she didn't get the death penalty too because she fucking deserves it. If not for her those 4 people wouldn't be dead.",
                "how many people has this crazy person tried to kill??? damn",
                "Gonna see this on Snapped right quick.",
                "Can't wait for the lpotl side stories discussion on this.",
                "FYI there's a documentary on Netflix about this called Sins of Our Mother."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Veterans affairs agency orders staff to report each other for ‘anti-Christian bias’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/veterans-affairs-anti-christian-bias?CMP=Share_AndroidApp_Other",
            "upvotes": 7714,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/61859c303c21779b1d4c162dfdfc73baffe0230c/0_187_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35ea48c1ee63f288cfa25a06cb609745",
            "top_comments": [
                "They have all the power now and they still act like they are the most oppressed people on the planet.",
                ">  The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”\n\nHostile to Christian views?\n\nSo, all instances of employees NOT discriminating against women, minorities, and the LGBTQ+ community will be reported.\n\nBasically, people will be punished for being decent.",
                "mY sUpErViSoR sAiD hApPy hOlIdAyS tO mE!",
                ">“The VA Task Force now requests all VA employees to **submit any instance of anti-Christian discrimination to Anti-ChristianBiasReporting.@va.gov,”** the email reads. “Submissions should include sufficient identifiers such as names, dates, and locations.”\n\nRedditors, you have your assignment.",
                "> The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”.\n\nWanting to maintain the separation of church and state is not an attack.",
                "So much for the separation of Church and State.",
                "wish jesus was real, and that he would come back - again - and take all these assholes to wherever it is that they belong ...",
                "Fuck these anti Constitutional traitors!That's a violation of the 1st amendment! These traitors won't stop until we make them, and they don't give a flying eff about protest signs they can't read anyways!",
                "Everyday, Trump's administration proves that both parties are in fact not the same. ",
                "Every president  and 87% of our congress are Christian. SCOTUS is all Christian. Not oppressed."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "FDA says it will phase out petroleum-based food dyes, authorize four natural color additives",
            "external_url": "https://www.cnn.com/2025/04/22/health/fda-food-dyes",
            "upvotes": 5032,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-22t203936z-1661349634-rc283eaquvca-rtrmadp-3-usa-trump-fda-dyes.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "But they can’t be fucked to enforce food safety regulations?",
                "[deleted]",
                "From a doctor, the issue with this is the HUGE amount of energy and effort being put into this (there’s no good evidence that the amount of dye used here causes any problems other than in pitri dish studies/feeding gallons to mice) and a COMPLETE disregard for things that are ACTIVELY harming people (food safety monitoring, lead, vaccine hesitancy, cost of healthy food, more strict regulations on air and water quality).\n\nThis is the medical equivalent of giving emergency chamomile tea to someone with insomnia…who also has a gaping gunshot wound to their leg.",
                "Any country that wants to export food products needs to meet the market’s food safety standards or the products will only be good for domestic use.  Other countries don’t need or want bright red fruit loops and blue icing and neon orange cheese dust. \n\nSome of these dyes have been banned for a decade in other countries - no one misses them one bit - and large companies have pivoted away from them without going broke.   It rarely changes the formulation or production of a product.   \n\nIt’s a super simple change.  The only thing party that loses here are the companies that make the petroleum based dyes.  Which will be replaced by companies that make non petroleum based dyes.  Who owns those?",
                "I think a lot of the fears about some food dyes are overhyped and at worst fear mongering, but I do believe if natural color additives can be used they should be. Doing things because they're cheaper or easier doesn't mean it should be that way. Natural dyes work just fine. I think it would make people in all areas of the conversation come to agreement.",
                "Plot twist: no one will be around at the FDA to test products for compliance",
                "These natural colors wouldn’t happen to be Colloidal Silver, Monoatomic Gold, Copper and Spirulina would they?",
                "Why is medicine loaded up with dyes? I have no fucks to give about the color of medicine, only that the stuff is effective.",
                "But let’s not check milk for safety anymore!!!!",
                "They can't test milk but they they'll be able to regulate and enforce this? Ya sure, totes."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Tesla sales plunge as carmaker warns ‘political sentiment’ could impact future demand",
            "external_url": "https://www.theguardian.com/technology/2025/apr/22/tesla-sales-musk-white-house-exit",
            "upvotes": 16013,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/84a18423ca2ed213d3451c93cff70ea1d454a856/0_53_7743_4646/master/7743.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d888d103ebc9308d688aa42c7c9ea3e0",
            "top_comments": [
                "I love that for them!\n\nFuck you, Elon.",
                "Obviously, you fucking idiots. Its not just political sentiment. The guy is making nazi gestures, making nazi jokes, propping up far right parties in germany, sending his goons in to capture data they weren't elected for in the States. Fuck Tesla. And this is coming from someone who owns an Model 3 but can't really get rid of it (family/young kids/mortgage/bills/etc take priority)",
                "The fact that a Hitler salute has to be described as \"political sentiment\" gives me feelings of disappointment in humanity.",
                "The fact that it also sucks as a company also doesn't help.  They've been massively overvalued for a long time, kept afloat primarily through Elon Musk's weird tech bro cult of personality.  With Musk's mask off and his fascism on full display, the fragile foundation of this house of cards - i.e., the goodwill toward Elon himself - has cracked and the whole thing is tumbling down.",
                "Kind of a stupid fucking move to try and sell electric cars to Nazi sympathizers. That's such a small overlap of American society.",
                "So anti-Nazi sentiment then? Okay that could be a problem yeah.",
                "My wife and I would be at least two teslas in…went so far as test driving but now, will never own one out of principle…who cares, it’s just two people but I’m guessing we are part of a not insignificant part of the target demo…get rekted Elmo…",
                "The CEO sieg heiled twice.",
                "> Analysts attribute the company’s overall difficulties to a number of factors, but ultimately conclude Elon Musk’s role in the White House has caused a branding crisis for Tesla. The company is at a major crossroads, analysts say, that will only be remedied if Musk leaves his role in the so-called “department of government efficiency” and returns to Tesla as CEO full time.\n\nElon is trash goods. People aren’t going to stop hating him just because he leaves. The damage he has caused to America’s democracy and government is unforgivable.",
                "How it is when you offend and fuck with your core demo."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Top US officials pull out of Russia-Ukraine ceasefire talks in London",
            "external_url": "https://bbc.com/news/articles/c78jx68d922o",
            "upvotes": 1799,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5a82/live/1a842290-2038-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "What happened to I will end the war on my first day in office?",
                "Trump stabbing Ukraine in the back while courting Russia is one of the most disgusting US foreign policy decisions in recent history. I’m so ashamed to be American.",
                "The US has never been as weak and pathetic as it is now.",
                "US will blame Ukraine and Zelenskyy and claim that Russia's proposals are fair and balanced. The real goal of the US is not peace, nor justice for Ukraine, but the agreement with Putin that he gets to keep four provinces and Crimea, so long as the US gets the resources from the rest of Ukraine.\n\nNo reasonable person could think that this is anything less than an attempt at forced capitulation by the US. What a hateful country it has become.",
                "President Russian Asset Pulls Out Of Russian Peace Talks As Planned",
                "“I will end the Russian-Ukraine war on day one” is the sequel to “I will build a border wall”.",
                "Probably because the US is pro-putin.",
                "Nothing to see here. Just Comrade Krasnov doing Putin's bidding.",
                "\"Peace\" talks. Why even bother calling them that if the end goal was never peace?",
                "The US wouldn't have added any benefit. Their \"final offer\" is a Ukranian capitulation, they've achieved precisely nothing except shown the world they're Putin's bottom."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Musk signals 'significantly' stepping back from Doge as Tesla profits plunge",
            "external_url": "https://www.bbc.co.uk/news/articles/cy0x50yr46lo",
            "upvotes": 14379,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54dd/live/0534ad00-200c-11f0-8c2e-77498b1ce297.jpg",
            "top_comments": [
                "He's lying. It's a ruse to manipulate Tesla's stock price.",
                "Don’t think it’ll help. He’s destroyed his image in a short amount of time and there’s no taking it back.",
                "It's cute he thinks his reputation is salvageable at this point",
                "The damage is done. I am in the market for an EV and would never now consider a Tesla. So many others are in the exact same situation. ",
                "Won't matter. Damage is done. These tesla profits dropping are just the start. Wait for next quarter.",
                "Okay.. Elon is no longer publicly making an ass of himself. That doesn't change the fact that big balls and the other creeps Elon hired are dismantling everything",
                "Can't put the \"heil Hitler\" back in the tube. Fuck Tesla. Take it to zero.",
                "He's already wrecked the systems, stolen all our data, and installed his digital and personnel backdoors.\n\n.. but at least the world has finally seen what a narcissistic nazi douchebag he is.",
                "He stole what he wanted and bailed.\n\nWe’ve been watching/ reading this supervillain shit our whole lives, but when Dr. Villain shows up in real life we don’t have James Bond or the Avengers to save us.",
                "Lmao yea right. Anything good that could come from this administration wont and Elon leaving would be amazing for us so he wont be going anywhere."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Number of births in US increased by 1% in 2024, according to CDC data",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/23/births-increase",
            "upvotes": 166,
            "date": "04/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7002690c118a7f3998a21f3da638d1469a941a3/0_135_5375_3225/master/5375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=498380abac324496b09b713f4087c5a6",
            "top_comments": [
                "why are births holding steady with such high living costs?",
                " I’m sure with the new push for vaccines they’ll all live a long healthy life.",
                "That sounds more like a normal fluctuation than any meaningful increase.",
                "I imagine we're going to hear ~~forced birthers~~ \"pro-lifers\" brag about this",
                "Medicaid funding deduction. 2 billion dollars.",
                "Will drop under Trump.",
                "With the dollar worth 3x less its value then what it was 60 years ago I can only imagine how many kids will grow up as orphans or in poor conditions, no health care, going to school hungry, meanwhile MAGA will cheer about gun rights and protection their billionaires bank accounts",
                "The creepy administration will be thrilled to hear this",
                "We still have people to count this but we don’t have people to do safety checks on milk. Good times.",
                "Who looks at the state of the world and thinks, \"Yeah, now's a good time to start a family\"? You've got a 50-50 shot your kid grows up (if it survives measles) to spend its life in a techno-slum with Grok for a feudal lord and Dickbutt on its flag."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "El Paso Walmart shooter received forgiveness and a hug from victim’s sister",
            "external_url": "https://elpasomatters.org/2025/04/22/victims-sister-hugs-walmart-gunman-patrick-crusius-el-paso/",
            "upvotes": 665,
            "date": "04/23/2025",
            "thumbnail": "https://elpasomatters.org/wp-content/uploads/2025/04/crusius_hug_rrr_1.jpg",
            "top_comments": [
                "If somebody murders me and then my sister hugs them, I’d be so pissed!",
                "That's big of her but society will hold him accountable.",
                "Is this the Chudjak guy or someone else?",
                "And from another victim’s wife. Hard to fathom. \n\nAlso buried in the article:\n>gunman who said he wanted to stop “the Hispanic invasion of Texas.”\n\nA place that was literally Mexican before it was American. Teaching history is important, people. Teaching people not to be hateful bigoted murderers is also a good idea.",
                "Fucking terrorist. She’s better than me.",
                "I think some people after suffering traumatic loss of a loved one struggle to feel “whole” again. I can see her forgiveness as being something she feels she needs to do to move on or find peace. This is about her more than it is about him, and that’s okay!",
                "If someone took a loved one away from me like that I wouldn't forgive them. Not saying that's a good thing or anything. Good on her for being able to.",
                "Forgiveness is never a bad thing.\n\nForgiveness doesn’t mean he isn’t guilty, it doesn’t mean he shouldn’t suffer consequences. It’s just forgiveness, and forgiveness is *good*. \n\nYou can forgive people who do terrible things, too. It will make your life better if you do.",
                "Bigger people than I. If I got my hands on someone who killed my loves, I would only let go when they or I had joined them.\n\n\nWhich shows I have a lot of work to do on my anger response still.\n\n\nI hope they all heal as best as is possible. ",
                "All the so-called Christians who think all they have to do are recite a few spells once a week and they magically get into heaven no matter whatever else they may do, should take a lesson from this woman. This is what Christianity is really about. Forgiving people, even when they have wronged you in a very serious way.\n\nI respect the hell out of this woman. I'm not sure I could do the same, and I don't even particularly get along with my siblings."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Tesla sales plunge as carmaker warns ‘political sentiment’ could impact future demand",
            "external_url": "https://www.theguardian.com/technology/2025/apr/22/tesla-sales-musk-white-house-exit",
            "upvotes": 16008,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/84a18423ca2ed213d3451c93cff70ea1d454a856/0_53_7743_4646/master/7743.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d888d103ebc9308d688aa42c7c9ea3e0",
            "top_comments": [
                "I love that for them!\n\nFuck you, Elon.",
                "Obviously, you fucking idiots. Its not just political sentiment. The guy is making nazi gestures, making nazi jokes, propping up far right parties in germany, sending his goons in to capture data they weren't elected for in the States. Fuck Tesla. And this is coming from someone who owns an Model 3 but can't really get rid of it (family/young kids/mortgage/bills/etc take priority)",
                "The fact that a Hitler salute has to be described as \"political sentiment\" gives me feelings of disappointment in humanity.",
                "The fact that it also sucks as a company also doesn't help.  They've been massively overvalued for a long time, kept afloat primarily through Elon Musk's weird tech bro cult of personality.  With Musk's mask off and his fascism on full display, the fragile foundation of this house of cards - i.e., the goodwill toward Elon himself - has cracked and the whole thing is tumbling down.",
                "Kind of a stupid fucking move to try and sell electric cars to Nazi sympathizers. That's such a small overlap of American society.",
                "So anti-Nazi sentiment then? Okay that could be a problem yeah.",
                "My wife and I would be at least two teslas in…went so far as test driving but now, will never own one out of principle…who cares, it’s just two people but I’m guessing we are part of a not insignificant part of the target demo…get rekted Elmo…",
                "The CEO sieg heiled twice.",
                "> Analysts attribute the company’s overall difficulties to a number of factors, but ultimately conclude Elon Musk’s role in the White House has caused a branding crisis for Tesla. The company is at a major crossroads, analysts say, that will only be remedied if Musk leaves his role in the so-called “department of government efficiency” and returns to Tesla as CEO full time.\n\nElon is trash goods. People aren’t going to stop hating him just because he leaves. The damage he has caused to America’s democracy and government is unforgivable.",
                "How it is when you offend and fuck with your core demo."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Sarah Palin loses retrial of defamation case against New York Times",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/sarah-palin-loses-defamation-nyt-retrial",
            "upvotes": 22999,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8a71a1a108784657ab0666974cc8c763211db1b0/0_142_4300_2581/master/4300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e0e0a47794bea93c9f820c3c81f93292",
            "top_comments": [
                "I'm not joking, but I'd completely forgotten about Sarah Palin until I read this headline.",
                "Can she see this verdict from her front porch?",
                "Tina Fey made Sarah Palin more famous than Sarah Palin did.",
                "Dam they're really Nailin Palin",
                "\"Sarah Palin loses\", a tune now so common it's subtly and ever-so-slowly replacing that quintessential elevator music. Keep it up queen!",
                "I'm surprised she didn't quit half way through the case",
                "Not upset about this. She is one of the main reasons we are in the mess we are in now. Because she not only was a poor loser but a bad politician who couldn’t take a black man becoming president.",
                "Good. Now she can cry more.",
                "First The Masked Singer, and now this. Can't get a break.",
                "If you've never seen it, do yourself a favor and watch the movie Game Change about her campaign with John McCain. It's a decent movie with some big names but it has more of a TV movie feel IMHO. People on the campaign (and characters in the movie) like Nicole Wallace have said it is accurate. It's amazing how bad of a choice she was for his running mate. She did some wacky shit and really tanked his campaign."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Veterans affairs agency orders staff to report each other for ‘anti-Christian bias’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/veterans-affairs-anti-christian-bias?CMP=Share_AndroidApp_Other",
            "upvotes": 7713,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/61859c303c21779b1d4c162dfdfc73baffe0230c/0_187_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35ea48c1ee63f288cfa25a06cb609745",
            "top_comments": [
                "They have all the power now and they still act like they are the most oppressed people on the planet.",
                ">  The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”\n\nHostile to Christian views?\n\nSo, all instances of employees NOT discriminating against women, minorities, and the LGBTQ+ community will be reported.\n\nBasically, people will be punished for being decent.",
                "mY sUpErViSoR sAiD hApPy hOlIdAyS tO mE!",
                ">“The VA Task Force now requests all VA employees to **submit any instance of anti-Christian discrimination to Anti-ChristianBiasReporting.@va.gov,”** the email reads. “Submissions should include sufficient identifiers such as names, dates, and locations.”\n\nRedditors, you have your assignment.",
                "> The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”.\n\nWanting to maintain the separation of church and state is not an attack.",
                "So much for the separation of Church and State.",
                "wish jesus was real, and that he would come back - again - and take all these assholes to wherever it is that they belong ...",
                "Fuck these anti Constitutional traitors!That's a violation of the 1st amendment! These traitors won't stop until we make them, and they don't give a flying eff about protest signs they can't read anyways!",
                "Everyday, Trump's administration proves that both parties are in fact not the same. ",
                "Every president  and 87% of our congress are Christian. SCOTUS is all Christian. Not oppressed."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "FDA says it will phase out petroleum-based food dyes, authorize four natural color additives",
            "external_url": "https://www.cnn.com/2025/04/22/health/fda-food-dyes",
            "upvotes": 5024,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-22t203936z-1661349634-rc283eaquvca-rtrmadp-3-usa-trump-fda-dyes.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "But they can’t be fucked to enforce food safety regulations?",
                "[deleted]",
                "From a doctor, the issue with this is the HUGE amount of energy and effort being put into this (there’s no good evidence that the amount of dye used here causes any problems other than in pitri dish studies/feeding gallons to mice) and a COMPLETE disregard for things that are ACTIVELY harming people (food safety monitoring, lead, vaccine hesitancy, cost of healthy food, more strict regulations on air and water quality).\n\nThis is the medical equivalent of giving emergency chamomile tea to someone with insomnia…who also has a gaping gunshot wound to their leg.",
                "Any country that wants to export food products needs to meet the market’s food safety standards or the products will only be good for domestic use.  Other countries don’t need or want bright red fruit loops and blue icing and neon orange cheese dust. \n\nSome of these dyes have been banned for a decade in other countries - no one misses them one bit - and large companies have pivoted away from them without going broke.   It rarely changes the formulation or production of a product.   \n\nIt’s a super simple change.  The only thing party that loses here are the companies that make the petroleum based dyes.  Which will be replaced by companies that make non petroleum based dyes.  Who owns those?",
                "I think a lot of the fears about some food dyes are overhyped and at worst fear mongering, but I do believe if natural color additives can be used they should be. Doing things because they're cheaper or easier doesn't mean it should be that way. Natural dyes work just fine. I think it would make people in all areas of the conversation come to agreement.",
                "Plot twist: no one will be around at the FDA to test products for compliance",
                "These natural colors wouldn’t happen to be Colloidal Silver, Monoatomic Gold, Copper and Spirulina would they?",
                "Why is medicine loaded up with dyes? I have no fucks to give about the color of medicine, only that the stuff is effective.",
                "But let’s not check milk for safety anymore!!!!",
                "They can't test milk but they they'll be able to regulate and enforce this? Ya sure, totes."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 16892,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "I wonder if the fall of Rome was this stupid.",
                "It feels like this administration is doing its best to create different ways to kill us or make us so sick we wish for death.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "Guess this is how we kill people.",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "This reminds me of the Wisconsin or North Dakota politician that campaigned ***hard*** on allowing raw milk. They changed their state laws to allow for raw milk sales and at the press conference the politician drank a glass of raw milk in celebration. It immediately made him sick. Like, next day.",
                "Don’t drink milk, got it.",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "Next new peice of business from this admin is calling Canada and the EU evil for not wanting to buy US dairy products. I can't imagine why!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 38578,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "He should be fired and charged.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "I hope he gets fired via a Signal message in a group chat.",
                "Any other administration and he’d have been fired weeks ago",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "He might as well add Fox news to the chat.",
                "He is a traitor to the United States"
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "04/23/2025 12:16:13 UTC"
}