{
    "posts": [
        {
            "category": "HOT",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 6004,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 1067,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "hell, the US has two doing the same thing- can they take them too?",
                "was it JD and Little Marco?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                "I bet they were in Kegseth's Signal group.",
                "Why does America still have military bases in Germany in any case?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 5705,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "[removed]",
                "I thought this administration was about transparency?",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Does anybody who sat out this election regret their decision yet?",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 1435,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "Trash is what you can get away with",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Don't they own a colour printer?",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!",
                "And the world is better for it",
                "Understandable mistake."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 6462,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Who would've thought using cheaper ingredients and charging more for them wasn't a sustainable long term business model",
                "With the loss of traditional car antenna's, it was only a matter of when",
                "They fucked up Del Taco. Quality plummeted when they took over, to the point where even Taco Bell is using better quality ingredients. Carl's Jr did the same shit with Green Burrito, but they never sold it they just let it completely die out. Hopefully someone buys Del Taco and puts some effort into saving them.",
                ">In a statement, Jack in the Box CEO Lance Tucker said, “In my time thus far as CEO, I have worked quickly with our teams to conclude that Jack in the Box operates at its best, and maximizes shareholder return potential, within a simplified and asset-light business model. Our actions today focus on three main areas: addressing our balance sheet to accelerate cash flow and pay down debt, while preserving growth-oriented capital investments related to technology and restaurant reimage; closing underperforming restaurants to position ourselves for consistent net unit growth and competitive unit economics; and, an overall return to simplicity for the Jack in the Box business model and investor story.”\n\nHe sounds like he'd be fun at parties. Fuck maximizing shareholder return. Make fucking good fast food that is affordable.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "[removed]",
                "I’ve always preferred Del Taco over Taco Bell. They better not be shutting down Del Tacos next.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "Selling Del Taco? But where am I supposed to get my Fre Shava Cadoo?!\n\nFRE SHAVA CADOOOOOO"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 739,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "But Pakistan had cancelled all trade with India a few days back.",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Trump: “They never would have clashed if I was president!”",
                "Well that’s not great.",
                "Pakistan always starts shit and then gets brutally owned. Average Muslim behavior"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 60324,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "God this world feels so hopeless right now. Rest in peace, Virginia.",
                "The bad guys are winning.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 1437,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> State TV said \"negligence in handling flammable materials was a contributing factor\" in the explosion.\n\nWell they aren’t claiming any sort of attack, so there’s an end to any of that kind of speculation given they’re not likely to lie or downplay such an incident otherwise.",
                "Wonder if it’s a fertilizer mishandle like Beirut?",
                "I'm going to assume it was ammonium nitrate. It's always ammonium nitrate.",
                "Smoking near rocket fuel?",
                "“The blast occurred as Iran began a third round of nuclear talks with the United States in Oman, although the cause of the explosion was not immediately clear”. Here’s a completely unrelated thing that is also happening in the region that we  added to the article for absolutely no reason. The media sucks",
                "Beirut? And 2015 China? Do no one learn from their lesson about storing and handling of chemicals at the ports??",
                "\"It was just a crate of fireworks.\" \n\n-Iran regime",
                "If they are so incredibly incompetent with basic explosives imagine what their gross incompetence could do with nuclear weapons",
                "Hopefully it puts a dent in drone production and shipments",
                "mossad and cia working in mysterious ways"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Son of CIA deputy director was killed while fighting for Russia, report says | CIA",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/25/michael-alexander-gloss-cia-russia",
            "upvotes": 18164,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/08647fff3a32cb2f39cfcf68feff7e7f13abd216/0_33_1577_946/master/1577.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=040661ae85285a70377d84480d1f7f0f",
            "top_comments": [
                "You'd think that was something that would come up in a routine background check for any position at the CIA.",
                "Ok, so that IS weird, right?",
                "Died doing what he loved, being a fucking idiot.",
                "Loved homeland and hated fascism. Fought and died for Putin in the rare conflict that the US is 100 percent on the right side. This makes no fucking sense. This dude must be a really confused individual. Or maybe Russian disinformation machine is just that good. ",
                "This is such an odd story. The dude was apparently pro Russia and pro Palestine. In university, he championed gender equality and was very upset with the way the US supported Israel. \n\nHow the fuck can you have all those views and then go fight for Putin? I'm flabbergasted. Flummoxed.",
                "he was a tankie, for anyone wondering what he was doing supporting russia.\n\nTheres also a screenshot (allegedly) from an FPV drone floating around, moments before it strikes him in the face",
                "So he was an \"America Bad\" left-wing contrarian who hated \"imperialism\" so much that he gave his life to support a Russian war of expansion.\n\nThis is your brain on social media",
                "Good, another treasonous traitor not burdening this country. He made his choice, now he gets to die with it. ",
                "What a waste of a comfortable life.",
                "> In university, Gloss was active in gender equality and environmental protest circles. He joined Rainbow Family, a leftwing environmental protest group, and in 2023 traveled to Hatay, Turkey, to assist in the recovery following the earthquake that killed more than 56,000 people. He had also become increasingly angry at the US for its support of Israel and the war in Gaza.\n\n> While in Turkey, Gloss began expressing a desire to go on to Russia. “He was usually watching videos about Palestine and was so angry at America,” one acquaintance told iStories. “He started thinking about going to Russia. He wanted to war with the USA. But I think he was very influenced by the conspiracy theory videos.”\n\nAnother lost soul who tossed his life away after going down the rabbit hole of these batshit conspiracy videos…"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 36827,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "The same George Santos that built Rome in a couple days?",
                "Former President Santos going to prison, wow. ",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Man singlehandedly built this country, and this is how he's treated. Smdh."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 10,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "I'd be more impressed if it was written on the Titanic *after* it sank."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 1069,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "hell, the US has two doing the same thing- can they take them too?",
                "was it JD and Little Marco?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                "I bet they were in Kegseth's Signal group.",
                "Why does America still have military bases in Germany in any case?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 733,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "But Pakistan had cancelled all trade with India a few days back.",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Trump: “They never would have clashed if I was president!”",
                "Well that’s not great.",
                "Pakistan always starts shit and then gets brutally owned. Average Muslim behavior"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 1436,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "Trash is what you can get away with",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Don't they own a colour printer?",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!",
                "And the world is better for it",
                "Understandable mistake."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 6006,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 5701,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "[removed]",
                "I thought this administration was about transparency?",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Does anybody who sat out this election regret their decision yet?",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 1438,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> State TV said \"negligence in handling flammable materials was a contributing factor\" in the explosion.\n\nWell they aren’t claiming any sort of attack, so there’s an end to any of that kind of speculation given they’re not likely to lie or downplay such an incident otherwise.",
                "Wonder if it’s a fertilizer mishandle like Beirut?",
                "I'm going to assume it was ammonium nitrate. It's always ammonium nitrate.",
                "Smoking near rocket fuel?",
                "“The blast occurred as Iran began a third round of nuclear talks with the United States in Oman, although the cause of the explosion was not immediately clear”. Here’s a completely unrelated thing that is also happening in the region that we  added to the article for absolutely no reason. The media sucks",
                "Beirut? And 2015 China? Do no one learn from their lesson about storing and handling of chemicals at the ports??",
                "\"It was just a crate of fireworks.\" \n\n-Iran regime",
                "If they are so incredibly incompetent with basic explosives imagine what their gross incompetence could do with nuclear weapons",
                "Hopefully it puts a dent in drone production and shipments",
                "mossad and cia working in mysterious ways"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 6462,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Who would've thought using cheaper ingredients and charging more for them wasn't a sustainable long term business model",
                "With the loss of traditional car antenna's, it was only a matter of when",
                "They fucked up Del Taco. Quality plummeted when they took over, to the point where even Taco Bell is using better quality ingredients. Carl's Jr did the same shit with Green Burrito, but they never sold it they just let it completely die out. Hopefully someone buys Del Taco and puts some effort into saving them.",
                ">In a statement, Jack in the Box CEO Lance Tucker said, “In my time thus far as CEO, I have worked quickly with our teams to conclude that Jack in the Box operates at its best, and maximizes shareholder return potential, within a simplified and asset-light business model. Our actions today focus on three main areas: addressing our balance sheet to accelerate cash flow and pay down debt, while preserving growth-oriented capital investments related to technology and restaurant reimage; closing underperforming restaurants to position ourselves for consistent net unit growth and competitive unit economics; and, an overall return to simplicity for the Jack in the Box business model and investor story.”\n\nHe sounds like he'd be fun at parties. Fuck maximizing shareholder return. Make fucking good fast food that is affordable.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "[removed]",
                "I’ve always preferred Del Taco over Taco Bell. They better not be shutting down Del Tacos next.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "Selling Del Taco? But where am I supposed to get my Fre Shava Cadoo?!\n\nFRE SHAVA CADOOOOOO"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 60325,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "God this world feels so hopeless right now. Rest in peace, Virginia.",
                "The bad guys are winning.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Son of CIA deputy director was killed while fighting for Russia, report says | CIA",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/25/michael-alexander-gloss-cia-russia",
            "upvotes": 18169,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/08647fff3a32cb2f39cfcf68feff7e7f13abd216/0_33_1577_946/master/1577.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=040661ae85285a70377d84480d1f7f0f",
            "top_comments": [
                "You'd think that was something that would come up in a routine background check for any position at the CIA.",
                "Ok, so that IS weird, right?",
                "Died doing what he loved, being a fucking idiot.",
                "Loved homeland and hated fascism. Fought and died for Putin in the rare conflict that the US is 100 percent on the right side. This makes no fucking sense. This dude must be a really confused individual. Or maybe Russian disinformation machine is just that good. ",
                "This is such an odd story. The dude was apparently pro Russia and pro Palestine. In university, he championed gender equality and was very upset with the way the US supported Israel. \n\nHow the fuck can you have all those views and then go fight for Putin? I'm flabbergasted. Flummoxed.",
                "he was a tankie, for anyone wondering what he was doing supporting russia.\n\nTheres also a screenshot (allegedly) from an FPV drone floating around, moments before it strikes him in the face",
                "So he was an \"America Bad\" left-wing contrarian who hated \"imperialism\" so much that he gave his life to support a Russian war of expansion.\n\nThis is your brain on social media",
                "Good, another treasonous traitor not burdening this country. He made his choice, now he gets to die with it. ",
                "What a waste of a comfortable life.",
                "> In university, Gloss was active in gender equality and environmental protest circles. He joined Rainbow Family, a leftwing environmental protest group, and in 2023 traveled to Hatay, Turkey, to assist in the recovery following the earthquake that killed more than 56,000 people. He had also become increasingly angry at the US for its support of Israel and the war in Gaza.\n\n> While in Turkey, Gloss began expressing a desire to go on to Russia. “He was usually watching videos about Palestine and was so angry at America,” one acquaintance told iStories. “He started thinking about going to Russia. He wanted to war with the USA. But I think he was very influenced by the conspiracy theory videos.”\n\nAnother lost soul who tossed his life away after going down the rabbit hole of these batshit conspiracy videos…"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 1066,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "hell, the US has two doing the same thing- can they take them too?",
                "was it JD and Little Marco?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                "I bet they were in Kegseth's Signal group.",
                "Why does America still have military bases in Germany in any case?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 6012,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 735,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "But Pakistan had cancelled all trade with India a few days back.",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Trump: “They never would have clashed if I was president!”",
                "Well that’s not great.",
                "Pakistan always starts shit and then gets brutally owned. Average Muslim behavior"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 5696,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "[removed]",
                "I thought this administration was about transparency?",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Does anybody who sat out this election regret their decision yet?",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 1441,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "Trash is what you can get away with",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Don't they own a colour printer?",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!",
                "And the world is better for it",
                "Understandable mistake."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 6463,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Who would've thought using cheaper ingredients and charging more for them wasn't a sustainable long term business model",
                "With the loss of traditional car antenna's, it was only a matter of when",
                "They fucked up Del Taco. Quality plummeted when they took over, to the point where even Taco Bell is using better quality ingredients. Carl's Jr did the same shit with Green Burrito, but they never sold it they just let it completely die out. Hopefully someone buys Del Taco and puts some effort into saving them.",
                ">In a statement, Jack in the Box CEO Lance Tucker said, “In my time thus far as CEO, I have worked quickly with our teams to conclude that Jack in the Box operates at its best, and maximizes shareholder return potential, within a simplified and asset-light business model. Our actions today focus on three main areas: addressing our balance sheet to accelerate cash flow and pay down debt, while preserving growth-oriented capital investments related to technology and restaurant reimage; closing underperforming restaurants to position ourselves for consistent net unit growth and competitive unit economics; and, an overall return to simplicity for the Jack in the Box business model and investor story.”\n\nHe sounds like he'd be fun at parties. Fuck maximizing shareholder return. Make fucking good fast food that is affordable.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "[removed]",
                "I’ve always preferred Del Taco over Taco Bell. They better not be shutting down Del Tacos next.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "Selling Del Taco? But where am I supposed to get my Fre Shava Cadoo?!\n\nFRE SHAVA CADOOOOOO"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 60328,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "God this world feels so hopeless right now. Rest in peace, Virginia.",
                "The bad guys are winning.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "RISING",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 1441,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> State TV said \"negligence in handling flammable materials was a contributing factor\" in the explosion.\n\nWell they aren’t claiming any sort of attack, so there’s an end to any of that kind of speculation given they’re not likely to lie or downplay such an incident otherwise.",
                "Wonder if it’s a fertilizer mishandle like Beirut?",
                "I'm going to assume it was ammonium nitrate. It's always ammonium nitrate.",
                "Smoking near rocket fuel?",
                "“The blast occurred as Iran began a third round of nuclear talks with the United States in Oman, although the cause of the explosion was not immediately clear”. Here’s a completely unrelated thing that is also happening in the region that we  added to the article for absolutely no reason. The media sucks",
                "Beirut? And 2015 China? Do no one learn from their lesson about storing and handling of chemicals at the ports??",
                "\"It was just a crate of fireworks.\" \n\n-Iran regime",
                "If they are so incredibly incompetent with basic explosives imagine what their gross incompetence could do with nuclear weapons",
                "Hopefully it puts a dent in drone production and shipments",
                "mossad and cia working in mysterious ways"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Son of CIA deputy director was killed while fighting for Russia, report says | CIA",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/25/michael-alexander-gloss-cia-russia",
            "upvotes": 18168,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/08647fff3a32cb2f39cfcf68feff7e7f13abd216/0_33_1577_946/master/1577.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=040661ae85285a70377d84480d1f7f0f",
            "top_comments": [
                "You'd think that was something that would come up in a routine background check for any position at the CIA.",
                "Ok, so that IS weird, right?",
                "Died doing what he loved, being a fucking idiot.",
                "Loved homeland and hated fascism. Fought and died for Putin in the rare conflict that the US is 100 percent on the right side. This makes no fucking sense. This dude must be a really confused individual. Or maybe Russian disinformation machine is just that good. ",
                "This is such an odd story. The dude was apparently pro Russia and pro Palestine. In university, he championed gender equality and was very upset with the way the US supported Israel. \n\nHow the fuck can you have all those views and then go fight for Putin? I'm flabbergasted. Flummoxed.",
                "he was a tankie, for anyone wondering what he was doing supporting russia.\n\nTheres also a screenshot (allegedly) from an FPV drone floating around, moments before it strikes him in the face",
                "So he was an \"America Bad\" left-wing contrarian who hated \"imperialism\" so much that he gave his life to support a Russian war of expansion.\n\nThis is your brain on social media",
                "Good, another treasonous traitor not burdening this country. He made his choice, now he gets to die with it. ",
                "What a waste of a comfortable life.",
                "> In university, Gloss was active in gender equality and environmental protest circles. He joined Rainbow Family, a leftwing environmental protest group, and in 2023 traveled to Hatay, Turkey, to assist in the recovery following the earthquake that killed more than 56,000 people. He had also become increasingly angry at the US for its support of Israel and the war in Gaza.\n\n> While in Turkey, Gloss began expressing a desire to go on to Russia. “He was usually watching videos about Palestine and was so angry at America,” one acquaintance told iStories. “He started thinking about going to Russia. He wanted to war with the USA. But I think he was very influenced by the conspiracy theory videos.”\n\nAnother lost soul who tossed his life away after going down the rabbit hole of these batshit conspiracy videos…"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 36835,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "The same George Santos that built Rome in a couple days?",
                "Former President Santos going to prison, wow. ",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Man singlehandedly built this country, and this is how he's treated. Smdh."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "04/27/2025 00:45:37 UTC"
}