{
    "posts": [
        {
            "category": "HOT",
            "title": "UN finds 36 Israeli strikes on Gaza killed only women and children",
            "external_url": "https://www.france24.com/en/middle-east/20250411-un-finds-36-israeli-strikes-on-gaza-killed-only-women-and-children",
            "upvotes": 918,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Israel: they kept our hostages in terrible conditions and didn't give them enough food\nAlso Israel: let's continue to bomb the entire place back to the stone age and cut off all aid ",
                ">\"Between 18 March and 9 April 2025, there were some 224 incidents of Israeli strikes on residential buildings and tents,\"\n\nI don't know that I could live with myself if I airstriked a fucking tent of civilians. Jesus.",
                "Defense from Israel:  UN is antisemitic",
                "* r/worldnews greatly approves",
                "That’s not a bug for Israel it’s a feature.",
                "How many of the women and children were terrorists though?\n/s",
                "Well, of course. Those were the targets. Because Israel is conducting a genocide.",
                "Like killing men is okay. Its not.",
                "Israel is as bad as Nazi Germany.",
                "Israel is doing all this atrocities in front of the world and nobody is doing something to stop it!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 40008,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "“The Attorney General's television appearance was similar to her first two public statements\nin that she never mentioned that Mr. Mangione was **not indicted** nor that he has the presumption of innocence. \n\nShe emphasized, for the third time, that her decision to seek the death penalty was based on the President's directive, specifically that the administration will seek the death sentence \"whenever possible.\" She then invoked her personal experience, saying that she was a capital prosecutor, who tried death penalty cases and that \"If there was ever a death case, this is one.\" **The Attorney General stated during her television appearance that a reason she ordered the death sentence was because the alleged victim was a CEO. Counsel is aware of no provision in the death penalty statute or in the Department of Justice's death penalty protocol that allows for consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.”**\n\nI encourage everyone to read the motion, it makes some strong points.",
                "Why does he need a cop breathing down his neck in every shot lmao. They just get closer and closer every time I see him it's getting a bit intimate. By the time Luigi actually receives his sentence, half the precinct is going to be on his lap.",
                "I'd publicly ask for a pardon while I was at it. Just to get it on record.",
                "This trial is gonna be a whole media spectacle. I wonder what the reaction from the oligarchs will be if the jury refuses to convict him.",
                "But Pammy doesn’t care about the husband and father they “accidentally sent” to a brutal prison in El Salvador and refuses to get him removed.",
                "I'm still wondering how hard jury selection will be for this. It's going to be difficult considering how many people have strong opinions about the healthcare industry.",
                ">Counsel is aware of **no** provision in the death\npenalty statute or in the Department of Justice’s death penalty protocol that allows for\n**consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.**\n\n>Rather than relying on these reasons, **the Attorney General cited the professional status of\nthe victim as a CEO**, the fact that the previous administration had not sought the death penalty in\nfour years and that her decision to order it here was due to the **president’s policy to “Make America Safe Again.” **Also, if the death penalty was being ordered pursuant to policy instead of publicity, the** Attorney General would not have put her directive in the form of a press release followed by an Instagram post that effectively launched a new government social media account.**\n\nSome excellent points by his attorneys.",
                "When are they going to go after the people that killed the Boeing Whistleblowers?",
                "Absolutely crazy that from the start he’s been treated as guilty. What happened to due process?",
                "Didn't Trump already pardon him when he said, \"if it's good for the country, it's not illegal\"?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 3703,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "They quickly came up with narratives to support their bad ‘policing’,jst like they’re doingwith Weezer’s wife.",
                "Oh man, I know I'm just a random reddit commenter but this hits me hard. This kid, who never ever saw that much of life, just got it cut short. His tender body all in that hospital bed, it just, It reminds me of something, But I can't but my finger on it. This is terrible news, not just his parents, but also his friends{if he had any}, and also the autistic community. If this police officers just got scared and shot the boy, even though they had guns, more people, were fully grown adults, and could have easily gotten back up at any time, who knows how many other officers out there in the world could also lives like this. Rest in peace Victor.",
                ">We are also aware of the video circulating online, which shows only one angle.\n\nYes, from the other angle you'll see that he's a strapping 280 lb young man who could have easily closed the distance, hurdled the fence and stabbed one of the policeman and not a kid in distress with cerebral palsy who could barely stand. Fucking disgusting."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Mortgage rates surge over 7% as tariffs hit bond market",
            "external_url": "https://www.cnbc.com/2025/04/11/mortgage-rates-surge-tariffs-bond-market.html",
            "upvotes": 24287,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107400195-1712872692895-gettyimages-2148323929-rent403111_2ppre7by.jpeg?v=1744392745&w=1920&h=1080",
            "top_comments": [
                "Who could have guessed that daily chaos and incompetence would yield such results?",
                "Are we in the golden age yet?",
                "So everything is going up contrary to what Trump had promised.\n\nThis is just the first 3 months of Trump's presidency.",
                ">We’re going to get them back to we think 3%, maybe even lower than that, saving the average home buyer thousands per year.\n\n-[Trump, Sep 5, 2024](https://www.youtube.com/watch?v=lI3F0UpMiYc)\n\nIf you're a Republican, are we winning yet?",
                "I'll remember to say thank you I guess. /s",
                "Higher rates are MANLY. Just like the TARIFFS.",
                "Financial stress seems to be a speciality of new Oval Office .",
                "Just bought in February with the plan to refinance in a few years. Guess I should just consider myself lucky to not have waited.",
                "Well at least the 3 trans athletes in the U.S. are banned from women’s sports and that one innocent dad got sent to the Kessel Spice mines.",
                "How exactly is the market rising today?  I'm baffled by the move higher.  Is this just a move to provide liquidity for the market to short?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 6500,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in El Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "Funny how republicans are always all about freedom of speech … until someone says something they don’t like. Bunch of whiny ass racists and bigots is all they are anymore.",
                "Pretty soon nobody is gonna be allowed to hurt Israel's precious feelings without getting a boot on their neck.",
                "Very cool fascist country you have here."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Man has sex with corpse on NYC subway, sources say",
            "external_url": "https://www.nbcnewyork.com/new-york-city/man-sex-corpse-nyc-subway-video-r-train-body/6220060/",
            "upvotes": 10477,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/r-train-body.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Wait... so it sounds like this guy didn't bring the corpse there. Like, someone died on the subway, and someone decided to sexually assault the body.",
                "Well that's a new thought I should've never had \n\n\"Boy I sure hope I don't die on a train in New York.Wont even be able to rest peacefully.\"",
                "I wonder what the possible range of sentences in NYC for public necrophilia is.\n\nI also wonder what led us to the point in society where I can use 'public necrophilia' in a sentence and have it be 100% serious (and relevant).",
                "How does this decision process even work? You're in New York, for whatever reason you're a necrophiliac....You're out shopping, because I imagine necrophiliacs still need certain essentials, you take the Subway..\n\n\"Dear diary...JACKPOT.\"",
                "Can you imagine being the cops watching the surveillance video to see what happened to the dead guy and then seeing this whole sordid tale play out? ",
                "\"Investigators believe the body may have been on the train for hours...\"\n\nWhy are there so many NYPD cops down there then? Couldn't stop a shooting, a woman being burned alive, a dead person being violated sexually, etc. Literally what the fuck do they actually do besides play games on their phones like the adult versions of iPad babies?",
                ">“It's believed the entire assault... took several minutes.”\n\nGoodness... it's truly shocking to think about how long this went on, and I can't even fathom the level of depravity required to commit such an act, it's absolutely sickening, and I just hope that whoever did this is caught and brought to justice quickly, seriously, what kind of person does something like that?",
                "JFC...what a terrible day to be literate",
                "[removed]",
                "Not even Florida Man will top that."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump orders probes of two former officials who defied him",
            "external_url": "https://www.nbcnews.com/politics/national-security/trump-orders-probes-two-former-officials-defied-rcna200523?utm_source=NBC&utm_medium=iframely",
            "upvotes": 4238,
            "date": "04/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-05/230531-Christopher-Krebs-mjf-1024-27e3cc.jpg",
            "top_comments": [
                "Here it is from the horse’s mouth: https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/\n\nOfficial white house communication is starting to read like a ”conservative” news outlet.\n\n“Unite America” my ass.",
                "Dictator doing Dictator things ",
                "Trump, you stupid, fat, dumb, fat idiot, why don’t you do something to help this country? Like stuffing your fat fucking face with Big Macs till the cholesterol tipping point hits. ",
                "Dolores Trumpbridge : I am **a** tolerant man, but the **one thing** I will not **stand** for is **disloyalty!**",
                "Petty vindictive behavior like this looks like weakness. People with confidence and strength don’t need to lash out at others.",
                "Kim Jong Trump on duty.\n\nThe USA is the most ludicrous country in existence. Becoming a dictatorship by founding a cult around one of the shittiest people you can find on earth and then elect this person twice.",
                "Something like this has never happened in America before. The man who for years wailed and called his rightful prosecution a witch hunt is now sicing the DOJ right after his perceived enemies. \n\nFor someone who can't help but commit crimes, you'd think this is something he'll refrain from. Except he plans to die in office, Trump will still face the law coming after him when he leaves the white house and this time, under an attorney general who has no fucks to give. \n\nLike clockwork, he will go back to screaming witchhunt again but will he have the slimy skunk shit who refer to themselves as maga come out for him again? I think not. \n\nTrump cannot end well. His actions have made that impossible. He will keep looking over his back for the rest of his life. Him being in the whitehouse just makes that impractical now but it will happen.",
                "If I recall \"Just following orders\" is not a valid defense.",
                "Maybe Biden needed to cast a wider net with his pardons. Like anyone in trump’s first administration that said a word critical of trump.",
                "Imagine giving power to this biblical level criminal. Again."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Tuberculosis could end if there’s more US public health funding, experts say | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/12/tuberculosis-public-health-funding-us",
            "upvotes": 238,
            "date": "04/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/25751caeb122cc80be3d105fb71236237e56a27c/0_2_4724_2836/master/4724.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=81fad1e73685a04fb79cba6d3e9aba4c",
            "top_comments": [
                "Lol. Haven't you heard in America we're bringing all the oldies back. Eff vaccines we got god and trump and worm boy  on our side they'll keep us safe. No more wasted money on foolish science.  The Bible is doctor now.",
                "Cool, so no end in sight",
                "Everything they do is harmful. If it’s helpful (to anyone but billionaires) they will reject it. It’s really that simple.",
                "Does it involve science, help people, or make any rational sense? If so, Trump isn’t doing it, especially if it involves all three.",
                "US Public Health isn’t interested in ending anything. Harm & Human Suffering",
                "It's absolutely unacceptable that funding cuts are enabling a resurgence of tuberculosis, but I am genuinely encouraged to see citizen groups stepping up to safeguard the health of vulnerable populations globally, it's truly vital that lawmakers prioritize this crisis and act decisively, because, frankly, the potential for widespread suffering is simply terrifying.",
                "You’re a daisy if you do.",
                "Yeah more public health funding? With Trump in charge? Pretty soon we will have zero health funding.",
                "So, TB incoming. Got it.",
                "Bah ha ha ha! RFK will probably announce that cupping and b vitamins cures it."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Young mother traveled to Miami for plastic surgery. She died hours later while at recovery house",
            "external_url": "https://www.nbcmiami.com/investigations/womans-death-post-surgery-recovery-house/3586743/",
            "upvotes": 4089,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/04/Ahmonique-Miller-recovery-house-death-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Even worse, it was not a licensed surgery recovery place. “Instead, according to a Miami Police incident report, officers and fire rescue crews responded to the house the night of March 7, which they say was “operating as an illegal post-plastic surgery recovery home.” Inside, they found Ahmonique already dead, and showing signs of rigor mortis, an indication she had likely been dead for hours. They described finding her as heavily bandaged, face down on a bed.” how awful.",
                "I'm a doctor in North Florida. I have a lot of patients who don't have great insurance but want to have different plastic surgery procedures done and they travel down to Miami to get it done. I'm honestly not sure if it's just one group that does this or if there's several that compete. But apparently they have cheaper cash rates or some sort of payment plan that they can afford. I've had more complications from those handful of patients that go there than all of my other patients who've ever had it done locally have had. The problem is is it's difficult when there is a complication for a surgeon here to want to take on another doctor's mess that was from down 5 hours away at best. \n\nEvery time one of my patients says they're going to do that or looking at doing it. I try to talk them out of it. But I guess the price is just too good down there and they don't consider it a risk. I'll share this story with them from now on.",
                "Hopefully these stories are a reminder that plastic surgeries are no joke. Not something to try on a whim at a discount",
                "The amount of younger gals with clear signs of surgery at the gym and younger guys with clear signs of steroids is growing like crazy . Most don't even make any significant gains .",
                "Everyone is focused on the plastic surgery aspect and not that this was a “Recovery House” which generally advertise caring for patients post-op. \n\nYou’d be surprised at the number of people who use these services for non-elective procedures as well. Not everyone who has surgery has a support network to care for them and hospitals will not perform surgery unless you can be discharged into someone’s care. So while it is true these “recovery houses” often care for plastic surgery patients, I’ve seen them used by folks who needed non-elective surgeries. And no, you can’t just call an uber driver to take you home because you have to be discharged with someone who can actually take care of you post-op. \n\nThere’s minimal regulations and this is going to be another case where the new regulations are written in blood.",
                "It's not actually clear that a license is required for a \"recovery house\" for plastic surgery patients in Florida. The only info I can find refers to \"sober living homes,\" halfway houses, or debt recovery businesses. Even the 2024 Florida Statutes governing \"recovery residences\" refers to substance abuse and addiction and says nothing about procedures such plastic surgery.\n\nOne would think something like this would be covered by licensing requirements, but we are talking Florida here after all.",
                "I’ve got a lot of friends who are primary care providers. I’ve heard so many stories the last 5 years about patients of theirs who travel to Miami for plastic surg, usually a BBL, and come back for follow up treatment. \n\nBesides the unnecessary nature of the surgery, there’s a massive issue where these surgeons are having their patients pursue pre surg authorization from their family care providers for an out of state, out of network procedure. Then they often send them home far too early (day of), and push all post surg follow up care back onto the family care provider because the surgeon discharged them and said they were good to go home and to talk to their family care provide. The patients aren’t going to hop a flight back to Miami for care, so family med gets stuck with being cornered on taking out sutures and providing follow up care. It’s taking a massive liability for something they’re not really part of and it’s frustrating for them to say the least.",
                "“So, I don’t understand. Where is the legislation? Where is the follow-up? …Where is the outrage?” McLawrence asked, citing NBC6’s previous reporting.”\n\nIn Florida?",
                "Although the recovery house was unlicensed, I still think this has to do with BBL not being a safe procedure. It doesnt specify what surgery she got, but needing a recovery house in general means it was definitely something major",
                "I’d love to know if complication from the surgery is what caused her death, or if she was killed by the medication provided to her at the recovery home."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US fires Greenland military base chief for 'undermining' JD Vance",
            "external_url": "https://bbc.com/news/articles/creq99l218do",
            "upvotes": 48475,
            "date": "04/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bfc8/live/a395f500-16b9-11f0-a455-cf1d5f751d2f.jpg",
            "top_comments": [
                "This is the statement she was fired for: \"I do not presume to understand current politics, but what I do know is the concerns of the US administration discussed by Vice-President Vance on Friday are not reflective of Pituffik Space Base.\"\"",
                "Slapped arse VP basically says that having an opinion that differs from the party line is misconduct. Welcome to the 'land of the free'.",
                "Integrity will not be tolerated.",
                "They know she wouldn't obey the order if they ask them to take over the island.",
                "It’s funny that they say it is because she was undermining the chain of command by insulting Vance, when Vance isn’t in her chain of command.",
                "Is this the same JD Vance who likes to lecture Europe on freedom of speech?",
                "I’m not sure how one would Undermine Vance more than Vance.\n\nMotherfucker dragged a whole camera crew to show off how he doesn’t know how to order donuts and then released that video.\n\nGuy stands next to his Indian wife talking about how immigrants are destroying the nation.\n\nThe whole Admin’s a clown show, but JD’s the smaller, even stupider clown that can’t get out of the car without falling head first into an open sewer.",
                "Oh for fuck's sake.\n\nHello Americans. I am from Turkey. Everything that has been happening so far feels so familiar it is painful. It is almost like you lot just elected Erdoğan. The only difference is that your idiots are pretty much speedrunning this bullshit instead of spreading it over 20 or so years.\n\nAlmost like they are sharing notes. Fucking hell...",
                "There has never been a worse administration in the history of our country.",
                "The VP isn't even in the military chain of command lmao"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "UN finds 36 Israeli strikes on Gaza killed only women and children",
            "external_url": "https://www.france24.com/en/middle-east/20250411-un-finds-36-israeli-strikes-on-gaza-killed-only-women-and-children",
            "upvotes": 921,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Israel: they kept our hostages in terrible conditions and didn't give them enough food\nAlso Israel: let's continue to bomb the entire place back to the stone age and cut off all aid ",
                ">\"Between 18 March and 9 April 2025, there were some 224 incidents of Israeli strikes on residential buildings and tents,\"\n\nI don't know that I could live with myself if I airstriked a fucking tent of civilians. Jesus.",
                "Defense from Israel:  UN is antisemitic",
                "* r/worldnews greatly approves",
                "That’s not a bug for Israel it’s a feature.",
                "How many of the women and children were terrorists though?\n/s",
                "Well, of course. Those were the targets. Because Israel is conducting a genocide.",
                "Like killing men is okay. Its not.",
                "Israel is as bad as Nazi Germany.",
                "Israel is doing all this atrocities in front of the world and nobody is doing something to stop it!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Tuberculosis could end if there’s more US public health funding, experts say | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/12/tuberculosis-public-health-funding-us",
            "upvotes": 239,
            "date": "04/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/25751caeb122cc80be3d105fb71236237e56a27c/0_2_4724_2836/master/4724.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=81fad1e73685a04fb79cba6d3e9aba4c",
            "top_comments": [
                "Lol. Haven't you heard in America we're bringing all the oldies back. Eff vaccines we got god and trump and worm boy  on our side they'll keep us safe. No more wasted money on foolish science.  The Bible is doctor now.",
                "Cool, so no end in sight",
                "Everything they do is harmful. If it’s helpful (to anyone but billionaires) they will reject it. It’s really that simple.",
                "Does it involve science, help people, or make any rational sense? If so, Trump isn’t doing it, especially if it involves all three.",
                "US Public Health isn’t interested in ending anything. Harm & Human Suffering",
                "It's absolutely unacceptable that funding cuts are enabling a resurgence of tuberculosis, but I am genuinely encouraged to see citizen groups stepping up to safeguard the health of vulnerable populations globally, it's truly vital that lawmakers prioritize this crisis and act decisively, because, frankly, the potential for widespread suffering is simply terrifying.",
                "You’re a daisy if you do.",
                "Yeah more public health funding? With Trump in charge? Pretty soon we will have zero health funding.",
                "So, TB incoming. Got it.",
                "Bah ha ha ha! RFK will probably announce that cupping and b vitamins cures it."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "A Kentucky teacher working at a juvenile detention center is accused of trying to get an inmate to kill her husband.",
            "external_url": "https://www.wsfa.com/2025/04/04/teacher-accused-sexually-assaulting-student-inmate-trying-get-him-kill-her-husband/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 49,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/W2Z2RZLJMRD5FD7CAW5HZYVV3I.gif?auth=713f8be331a3e31dc015dbfdb9d5e36cb31d0991c6434fd79b0b1d4a464af01e&width=1200&height=600&smart=true",
            "top_comments": [
                "She is being held at the Adair County Detention Center on charges of solicitation for murder, first-degree sexual abuse, and distribution of obscene matter to a minor.",
                "Rookie mistake - inmates are inmates because they're bad at crime.  You need to find someone who hasn't been caught.",
                "Could have just got a divorce but no, had to go throw your life away with stupid decisions. Some people. Dumb ass.",
                "She even got herself arrested. Now she checks all the boxes to work for the Trump administration.",
                "Well at least she didn't have sex with them",
                "Hubby is probably her cousin or even brother,",
                "[deleted]",
                "Got it bad. \nGot it bad.\nGot it bad.\nI'm hot for teacher...\n\n\nwho also wants me to murder her spouse!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 3713,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "They quickly came up with narratives to support their bad ‘policing’,jst like they’re doingwith Weezer’s wife.",
                "Oh man, I know I'm just a random reddit commenter but this hits me hard. This kid, who never ever saw that much of life, just got it cut short. His tender body all in that hospital bed, it just, It reminds me of something, But I can't but my finger on it. This is terrible news, not just his parents, but also his friends{if he had any}, and also the autistic community. If this police officers just got scared and shot the boy, even though they had guns, more people, were fully grown adults, and could have easily gotten back up at any time, who knows how many other officers out there in the world could also lives like this. Rest in peace Victor.",
                ">We are also aware of the video circulating online, which shows only one angle.\n\nYes, from the other angle you'll see that he's a strapping 280 lb young man who could have easily closed the distance, hurdled the fence and stabbed one of the policeman and not a kid in distress with cerebral palsy who could barely stand. Fucking disgusting."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Judge rules Menendez brothers resentencing bid can move forward",
            "external_url": "https://www.bbc.com/news/articles/cp8kmrg1p8go",
            "upvotes": 383,
            "date": "04/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ea13/live/f5ca4e00-15b7-11f0-a658-83a7b9f03655.jpg",
            "top_comments": [
                "Oh this should be interesting",
                "Lets just go straight to Trump issuing some sort of pardon and giving them a medal on the ~~used car lot~~ Rose Lawn.",
                "If the sons were right about the fathers' sexual abuse as motive for the killing,  then they served more than enough time--but then again why kill the mother too (her silence doesn't seem like a good reason for guys who were young adults around 20 years old)",
                "These are the guys who said it was a mafia hit before one of them told their srink. And people actually believe them how gullible are you guys",
                "There's zero question about what the father did, there's already been another accuser independent of the brothers",
                "RemindMe! 1 year\n\nwe’ll see if this aged like wine or milk… time will tell. see you boys in a year!!",
                "[deleted]",
                "I am shocked Trump hasn't pardoned Derrick Chauvin...yet."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "In One Colorado Town, People Experiencing Homelessness Can Sleep in Their Car — if They Have a Job",
            "external_url": "https://www.nytimes.com/2025/04/11/realestate/colorado-homeless-parking-lot-affordable-housing.html?unlocked_article_code=1.-04.9C5S.OB5RRj2hZlYR&smid=url-share",
            "upvotes": 926,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Here in cars, trucks and vans, behind foggy windshields and zipped in sleeping bags, those who serve the vacationers who come to enjoy the snow tried to fall asleep on a recent night — two ski instructors, two snow plow drivers, a ski lift operator, an ice fishing guide, a dog sledding guide, the employee of a ski resort whose job includes scanning ski passes, two ER nurses who treat their injuries, a cashier at a drugstore, multiple servers at local restaurants, as well as Kristine Litchfield, who earns $24 an hour at a ski shop fitting people for their boots.\n\nThe cost of living affordability crisis is real. People demonize the homeless because it's easier than facing how easy it is to become homeless these days.",
                "Working homeless is a thing, sadly.\n\nWorst offender is Disneyland. Multi-billion dollar parent company, profitable theme parks, has workers who cannot afford a place and also has a community funded food pantry for the workers.",
                "And I'm sure they provide facilities for homeless in exchange of this ridiculous arbitrary decision right?\n\nRight?",
                "I HATE that they harass people sleeping in their cars! Giant empty store parking lots patrolled by security and police kicking people out for what?! What are they going to do to cement?",
                "It's ok to be homeless but only if you have a job is some next level dystopian bullshit",
                "Someone should form a non-profit. And they should hire every single homeless person in town, for 1 minute a day per year.  Or, you know, more If they can find some stuff for people to do. \n\nAs I have seen mentioned many times, there is plenty of work to be done. There are just no jobs to do those things because nobody can make a profit on getting them done.",
                "Man i know this is not the point of the thread BUT i spent years trying to live out of my car in the Bay Area only to constantly be awoken by security or law enforcement at anywhere from public streets to gym, hotel, and walmart parking spaces.  I had a decent paying daytime job that I thoroughly enjoyed but i just didn’t care about spending all my income sharing a space with strangers AND this regulation would have been great then for someone like me.  Anyways after the last incidence when i had cops pointing guns at me at 4 am, i relocated to the Midwest, found a decent job, and eventually met my now wife so not all lost.",
                "I had to check the sub because I feel like this is the kind of late stage capitalist shit that gets posted on r/upliftingnews all the time and just ends up pissing me off more, which defeats the purpose of why I'm even subbed there haha.",
                "We should be able to live somewhere besides their car if you have a job. Investment firms buy up the housing market and chagrin outrageous about for rent should be illegal",
                "So if I download the Uber Driver app, does this mean I can sleep in my car at this one Colorado town?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Taiwan charges Chinese ship captain with damaging undersea cables for the first time",
            "external_url": "https://www.abc.net.au/news/2025-04-11/taiwan-charges-chinese-ship-captain-damaging-undersea-cables/105166868",
            "upvotes": 728,
            "date": "04/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/7f80cae752d1315b45235d43472a690d?impolicy=wcms_watermark_news&cropH=1329&cropW=2363&xPos=0&yPos=222&width=862&height=485&imformat=generic",
            "top_comments": [
                "China pls don't do this. You literally just have to do nothing and you win the economic war bro pls",
                "This is not going to work out well.",
                "West Taiwan needs to calm the fuck down",
                "Let's tamp it down there folks"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "CDC denies help for lead poisoning in Milwaukee schools due to layoffs",
            "external_url": "https://www.cbsnews.com/news/milwaukee-schools-lead-poisoning-cdc-denies-help/",
            "upvotes": 2065,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/11/21f4e718-d7b9-4e1b-b0c0-48b2f0f561db/thumbnail/1200x630/de4ece6ff65a86c46f617dfb69e8ad7b/gettyimages-1331361574.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "So many kids will be im danger because of this.",
                "> Beyond lead poisoning, now-eliminated teams had also housed the federal government's public health experts for helping local and state health departments respond to a range of other environmental emergencies, said CDC officials, who spoke on the condition of anonymity.\n\"All expertise related to radiological and nuclear threats is eliminated. All capacity for natural disasters response has been eliminated,\" agency officials said in a memo after the layoffs.\nHealth experts tasked with investigating cancer clusters, overseeing chemical weapons demolition and responding to toxic substance spills, like the 2023 East Palestine train derailment, were also cut, multiple officials said.\n\nIt's not like any of those issues pose an extreme risk to the health and safety of Americans. /S",
                "fluoride makes you dumber so we recommend you remove it from water supply... anyway on an unrelated note sorry about the lead poison we cant help",
                "Trump is responsible for every death that occurs from this.",
                "“Well, MY kids go to a private school so why should I care?”\n- ELECTED Republican Leaders",
                "Wow. So who ordered the lay offs? Who hired the guy who ordered the lay offs? Maybe Wisconsin parents need to take this issue up with their representatives.",
                "Wtf are we even having this conversion? We knew 50 years ago lead paint kills. Has it been that long since the last paint job? \n\nAnd yeah, fuck the idiot’s for cutting CDC funding  at a time when it ought to be increased.",
                "It's all fun and games owning the libs until your kid gets lead poisoning.",
                "> “It's extremely concerning that there's no one who is going to be responding.”\n\nSeriously, this is just... unbelievable. Children are at risk, and the government is basically saying \"not our problem\", how could they even think that's okay? I mean, it's completely shocking, and I feel so angry about this, our kids deserve better protection. It's sickening to think about the potential harm, and the lack of accountability just makes it even worse, somebody needs to be held responsible for this failure. It's absolutely egregious.",
                "But we want our future voters to be brain dead, easily swayed, Fox News addicted moron Republicans."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 6505,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in El Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "Funny how republicans are always all about freedom of speech … until someone says something they don’t like. Bunch of whiny ass racists and bigots is all they are anymore.",
                "Pretty soon nobody is gonna be allowed to hurt Israel's precious feelings without getting a boot on their neck.",
                "Very cool fascist country you have here."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "UK woman says she was arrested after confiscating her daughters’ iPads",
            "external_url": "https://www.theguardian.com/uk-news/2025/apr/11/uk-woman-says-she-was-arrested-after-confiscating-her-daughters-ipads",
            "upvotes": 206,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b02f078ee63a46e141cef9ff5cdf1984d58b18e7/523_249_3865_2319/master/3865.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1f486a6a629fa704900a1022fe19a26",
            "top_comments": [
                "Guessing something like:\n\n- mum and dad are no longer together\n\n- dad gives ipads to daughters\n\n- mum confiscates ipads\n\n- daughters tell dad (possibly with some exaggeration)\n\n- dad calls police because ipads stolen (possibly with more exaggeration)\n\n- ipads are tracked down with some version of \"find my device\"\n\n- mum denies having them, despite police know they're there\n\n- police get more suspicious\n\n- police confirm she has the ipads\n\n- police arrest mum\n\nShe didn't do herself any favours by denying having them, when she did indeed have them.",
                "I'm very confused. They were reported stolen by a man in his 40s who lived nearby. Was it the father??",
                "A history teacher has said she was arrested and blocked from seeing her daughters after she confiscated their iPads.\n\nVanessa Brown, 50, described her “unspeakable devastation and trauma” after spending seven-and-a-half hours in a cell on 26 March after a claim that she had stolen two iPads.\n\nShe was later released with bail conditions that barred her from speaking to anyone connected to the investigation – including her children – until the case was dropped.\n\nBrown told LBC she had taken the iPads to encourage her daughters to focus on their schoolwork. Surrey police tracked the devices to Brown’s mother’s house in Cobham, Surrey, and later accepted the devices belonged to her children and she was “entitled” to confiscate them.",
                "Eric Cartman is reading the headline and thinking to the mother \"this is what you deserve!\"",
                "Believe it or not, in the state of Florida, minors cannot own property, even if they've bought it themselves, it belongs to their parent or guardian.",
                "I’d have a life sentence by now.",
                "[deleted]",
                "For one horrible second, the headline made me think iPads were some kind of hi tech tampon.  ",
                "Yeah, I’m generally opposed to authoritarian states and the boot lickers of the UK, but this woman definitely deserved this",
                "She's a known associate of the Staines Massive no doubt."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "UN finds 36 Israeli strikes on Gaza killed only women and children",
            "external_url": "https://www.france24.com/en/middle-east/20250411-un-finds-36-israeli-strikes-on-gaza-killed-only-women-and-children",
            "upvotes": 923,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Israel: they kept our hostages in terrible conditions and didn't give them enough food\nAlso Israel: let's continue to bomb the entire place back to the stone age and cut off all aid ",
                ">\"Between 18 March and 9 April 2025, there were some 224 incidents of Israeli strikes on residential buildings and tents,\"\n\nI don't know that I could live with myself if I airstriked a fucking tent of civilians. Jesus.",
                "Defense from Israel:  UN is antisemitic",
                "* r/worldnews greatly approves",
                "That’s not a bug for Israel it’s a feature.",
                "How many of the women and children were terrorists though?\n/s",
                "Well, of course. Those were the targets. Because Israel is conducting a genocide.",
                "Like killing men is okay. Its not.",
                "Yeah please tell me again how Trump was going to end all of this in one day? Or wait that was Russia of course we are in day 90 now.",
                "Israel is as bad as Nazi Germany."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Tuberculosis could end if there’s more US public health funding, experts say | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/12/tuberculosis-public-health-funding-us",
            "upvotes": 242,
            "date": "04/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/25751caeb122cc80be3d105fb71236237e56a27c/0_2_4724_2836/master/4724.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=81fad1e73685a04fb79cba6d3e9aba4c",
            "top_comments": [
                "Lol. Haven't you heard in America we're bringing all the oldies back. Eff vaccines we got god and trump and worm boy  on our side they'll keep us safe. No more wasted money on foolish science.  The Bible is doctor now.",
                "Cool, so no end in sight",
                "Everything they do is harmful. If it’s helpful (to anyone but billionaires) they will reject it. It’s really that simple.",
                "Does it involve science, help people, or make any rational sense? If so, Trump isn’t doing it, especially if it involves all three.",
                "US Public Health isn’t interested in ending anything. Harm & Human Suffering",
                "It's absolutely unacceptable that funding cuts are enabling a resurgence of tuberculosis, but I am genuinely encouraged to see citizen groups stepping up to safeguard the health of vulnerable populations globally, it's truly vital that lawmakers prioritize this crisis and act decisively, because, frankly, the potential for widespread suffering is simply terrifying.",
                "You’re a daisy if you do.",
                "Yeah more public health funding? With Trump in charge? Pretty soon we will have zero health funding.",
                "So, TB incoming. Got it.",
                "Bah ha ha ha! RFK will probably announce that cupping and b vitamins cures it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 3709,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "They quickly came up with narratives to support their bad ‘policing’,jst like they’re doingwith Weezer’s wife.",
                "Oh man, I know I'm just a random reddit commenter but this hits me hard. This kid, who never ever saw that much of life, just got it cut short. His tender body all in that hospital bed, it just, It reminds me of something, But I can't but my finger on it. This is terrible news, not just his parents, but also his friends{if he had any}, and also the autistic community. If this police officers just got scared and shot the boy, even though they had guns, more people, were fully grown adults, and could have easily gotten back up at any time, who knows how many other officers out there in the world could also lives like this. Rest in peace Victor.",
                ">We are also aware of the video circulating online, which shows only one angle.\n\nYes, from the other angle you'll see that he's a strapping 280 lb young man who could have easily closed the distance, hurdled the fence and stabbed one of the policeman and not a kid in distress with cerebral palsy who could barely stand. Fucking disgusting."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Judge rules Menendez brothers resentencing bid can move forward",
            "external_url": "https://www.bbc.com/news/articles/cp8kmrg1p8go",
            "upvotes": 389,
            "date": "04/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ea13/live/f5ca4e00-15b7-11f0-a658-83a7b9f03655.jpg",
            "top_comments": [
                "Oh this should be interesting",
                "Lets just go straight to Trump issuing some sort of pardon and giving them a medal on the ~~used car lot~~ Rose Lawn.",
                "If the sons were right about the fathers' sexual abuse as motive for the killing,  then they served more than enough time--but then again why kill the mother too (her silence doesn't seem like a good reason for guys who were young adults around 20 years old)",
                "These are the guys who said it was a mafia hit before one of them told their srink. And people actually believe them how gullible are you guys",
                "There's zero question about what the father did, there's already been another accuser independent of the brothers",
                "RemindMe! 1 year\n\nwe’ll see if this aged like wine or milk… time will tell. see you boys in a year!!",
                "[deleted]",
                "I am shocked Trump hasn't pardoned Derrick Chauvin...yet."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 40005,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "“The Attorney General's television appearance was similar to her first two public statements\nin that she never mentioned that Mr. Mangione was **not indicted** nor that he has the presumption of innocence. \n\nShe emphasized, for the third time, that her decision to seek the death penalty was based on the President's directive, specifically that the administration will seek the death sentence \"whenever possible.\" She then invoked her personal experience, saying that she was a capital prosecutor, who tried death penalty cases and that \"If there was ever a death case, this is one.\" **The Attorney General stated during her television appearance that a reason she ordered the death sentence was because the alleged victim was a CEO. Counsel is aware of no provision in the death penalty statute or in the Department of Justice's death penalty protocol that allows for consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.”**\n\nI encourage everyone to read the motion, it makes some strong points.",
                "Why does he need a cop breathing down his neck in every shot lmao. They just get closer and closer every time I see him it's getting a bit intimate. By the time Luigi actually receives his sentence, half the precinct is going to be on his lap.",
                "I'd publicly ask for a pardon while I was at it. Just to get it on record.",
                "This trial is gonna be a whole media spectacle. I wonder what the reaction from the oligarchs will be if the jury refuses to convict him.",
                "But Pammy doesn’t care about the husband and father they “accidentally sent” to a brutal prison in El Salvador and refuses to get him removed.",
                "I'm still wondering how hard jury selection will be for this. It's going to be difficult considering how many people have strong opinions about the healthcare industry.",
                ">Counsel is aware of **no** provision in the death\npenalty statute or in the Department of Justice’s death penalty protocol that allows for\n**consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.**\n\n>Rather than relying on these reasons, **the Attorney General cited the professional status of\nthe victim as a CEO**, the fact that the previous administration had not sought the death penalty in\nfour years and that her decision to order it here was due to the **president’s policy to “Make America Safe Again.” **Also, if the death penalty was being ordered pursuant to policy instead of publicity, the** Attorney General would not have put her directive in the form of a press release followed by an Instagram post that effectively launched a new government social media account.**\n\nSome excellent points by his attorneys.",
                "When are they going to go after the people that killed the Boeing Whistleblowers?",
                "Absolutely crazy that from the start he’s been treated as guilty. What happened to due process?",
                "Didn't Trump already pardon him when he said, \"if it's good for the country, it's not illegal\"?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Mortgage rates surge over 7% as tariffs hit bond market",
            "external_url": "https://www.cnbc.com/2025/04/11/mortgage-rates-surge-tariffs-bond-market.html",
            "upvotes": 24291,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107400195-1712872692895-gettyimages-2148323929-rent403111_2ppre7by.jpeg?v=1744392745&w=1920&h=1080",
            "top_comments": [
                "Who could have guessed that daily chaos and incompetence would yield such results?",
                "Are we in the golden age yet?",
                "So everything is going up contrary to what Trump had promised.\n\nThis is just the first 3 months of Trump's presidency.",
                ">We’re going to get them back to we think 3%, maybe even lower than that, saving the average home buyer thousands per year.\n\n-[Trump, Sep 5, 2024](https://www.youtube.com/watch?v=lI3F0UpMiYc)\n\nIf you're a Republican, are we winning yet?",
                "I'll remember to say thank you I guess. /s",
                "Higher rates are MANLY. Just like the TARIFFS.",
                "Financial stress seems to be a speciality of new Oval Office .",
                "Just bought in February with the plan to refinance in a few years. Guess I should just consider myself lucky to not have waited.",
                "Well at least the 3 trans athletes in the U.S. are banned from women’s sports and that one innocent dad got sent to the Kessel Spice mines.",
                "How exactly is the market rising today?  I'm baffled by the move higher.  Is this just a move to provide liquidity for the market to short?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 6498,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in El Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "Funny how republicans are always all about freedom of speech … until someone says something they don’t like. Bunch of whiny ass racists and bigots is all they are anymore.",
                "Pretty soon nobody is gonna be allowed to hurt Israel's precious feelings without getting a boot on their neck.",
                "Very cool fascist country you have here."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Man has sex with corpse on NYC subway, sources say",
            "external_url": "https://www.nbcnewyork.com/new-york-city/man-sex-corpse-nyc-subway-video-r-train-body/6220060/",
            "upvotes": 10486,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/r-train-body.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Wait... so it sounds like this guy didn't bring the corpse there. Like, someone died on the subway, and someone decided to sexually assault the body.",
                "Well that's a new thought I should've never had \n\n\"Boy I sure hope I don't die on a train in New York.Wont even be able to rest peacefully.\"",
                "I wonder what the possible range of sentences in NYC for public necrophilia is.\n\nI also wonder what led us to the point in society where I can use 'public necrophilia' in a sentence and have it be 100% serious (and relevant).",
                "How does this decision process even work? You're in New York, for whatever reason you're a necrophiliac....You're out shopping, because I imagine necrophiliacs still need certain essentials, you take the Subway..\n\n\"Dear diary...JACKPOT.\"",
                "Can you imagine being the cops watching the surveillance video to see what happened to the dead guy and then seeing this whole sordid tale play out? ",
                "\"Investigators believe the body may have been on the train for hours...\"\n\nWhy are there so many NYPD cops down there then? Couldn't stop a shooting, a woman being burned alive, a dead person being violated sexually, etc. Literally what the fuck do they actually do besides play games on their phones like the adult versions of iPad babies?",
                ">“It's believed the entire assault... took several minutes.”\n\nGoodness... it's truly shocking to think about how long this went on, and I can't even fathom the level of depravity required to commit such an act, it's absolutely sickening, and I just hope that whoever did this is caught and brought to justice quickly, seriously, what kind of person does something like that?",
                "JFC...what a terrible day to be literate",
                "[removed]",
                "Not even Florida Man will top that."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump orders probes of two former officials who defied him",
            "external_url": "https://www.nbcnews.com/politics/national-security/trump-orders-probes-two-former-officials-defied-rcna200523?utm_source=NBC&utm_medium=iframely",
            "upvotes": 4247,
            "date": "04/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-05/230531-Christopher-Krebs-mjf-1024-27e3cc.jpg",
            "top_comments": [
                "Here it is from the horse’s mouth: https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/\n\nOfficial white house communication is starting to read like a ”conservative” news outlet.\n\n“Unite America” my ass.",
                "Dictator doing Dictator things ",
                "Trump, you stupid, fat, dumb, fat idiot, why don’t you do something to help this country? Like stuffing your fat fucking face with Big Macs till the cholesterol tipping point hits. ",
                "Dolores Trumpbridge : I am **a** tolerant man, but the **one thing** I will not **stand** for is **disloyalty!**",
                "Petty vindictive behavior like this looks like weakness. People with confidence and strength don’t need to lash out at others.",
                "Kim Jong Trump on duty.\n\nThe USA is the most ludicrous country in existence. Becoming a dictatorship by founding a cult around one of the shittiest people you can find on earth and then elect this person twice.",
                "Something like this has never happened in America before. The man who for years wailed and called his rightful prosecution a witch hunt is now sicing the DOJ right after his perceived enemies. \n\nFor someone who can't help but commit crimes, you'd think this is something he'll refrain from. Except he plans to die in office, Trump will still face the law coming after him when he leaves the white house and this time, under an attorney general who has no fucks to give. \n\nLike clockwork, he will go back to screaming witchhunt again but will he have the slimy skunk shit who refer to themselves as maga come out for him again? I think not. \n\nTrump cannot end well. His actions have made that impossible. He will keep looking over his back for the rest of his life. Him being in the whitehouse just makes that impractical now but it will happen.",
                "If I recall \"Just following orders\" is not a valid defense.",
                "Maybe Biden needed to cast a wider net with his pardons. Like anyone in trump’s first administration that said a word critical of trump.",
                "Imagine giving power to this biblical level criminal. Again."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Young mother traveled to Miami for plastic surgery. She died hours later while at recovery house",
            "external_url": "https://www.nbcmiami.com/investigations/womans-death-post-surgery-recovery-house/3586743/",
            "upvotes": 4093,
            "date": "04/11/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/04/Ahmonique-Miller-recovery-house-death-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Even worse, it was not a licensed surgery recovery place. “Instead, according to a Miami Police incident report, officers and fire rescue crews responded to the house the night of March 7, which they say was “operating as an illegal post-plastic surgery recovery home.” Inside, they found Ahmonique already dead, and showing signs of rigor mortis, an indication she had likely been dead for hours. They described finding her as heavily bandaged, face down on a bed.” how awful.",
                "I'm a doctor in North Florida. I have a lot of patients who don't have great insurance but want to have different plastic surgery procedures done and they travel down to Miami to get it done. I'm honestly not sure if it's just one group that does this or if there's several that compete. But apparently they have cheaper cash rates or some sort of payment plan that they can afford. I've had more complications from those handful of patients that go there than all of my other patients who've ever had it done locally have had. The problem is is it's difficult when there is a complication for a surgeon here to want to take on another doctor's mess that was from down 5 hours away at best. \n\nEvery time one of my patients says they're going to do that or looking at doing it. I try to talk them out of it. But I guess the price is just too good down there and they don't consider it a risk. I'll share this story with them from now on.",
                "Hopefully these stories are a reminder that plastic surgeries are no joke. Not something to try on a whim at a discount",
                "The amount of younger gals with clear signs of surgery at the gym and younger guys with clear signs of steroids is growing like crazy . Most don't even make any significant gains .",
                "Everyone is focused on the plastic surgery aspect and not that this was a “Recovery House” which generally advertise caring for patients post-op. \n\nYou’d be surprised at the number of people who use these services for non-elective procedures as well. Not everyone who has surgery has a support network to care for them and hospitals will not perform surgery unless you can be discharged into someone’s care. So while it is true these “recovery houses” often care for plastic surgery patients, I’ve seen them used by folks who needed non-elective surgeries. And no, you can’t just call an uber driver to take you home because you have to be discharged with someone who can actually take care of you post-op. \n\nThere’s minimal regulations and this is going to be another case where the new regulations are written in blood.",
                "It's not actually clear that a license is required for a \"recovery house\" for plastic surgery patients in Florida. The only info I can find refers to \"sober living homes,\" halfway houses, or debt recovery businesses. Even the 2024 Florida Statutes governing \"recovery residences\" refers to substance abuse and addiction and says nothing about procedures such plastic surgery.\n\nOne would think something like this would be covered by licensing requirements, but we are talking Florida here after all.",
                "I’ve got a lot of friends who are primary care providers. I’ve heard so many stories the last 5 years about patients of theirs who travel to Miami for plastic surg, usually a BBL, and come back for follow up treatment. \n\nBesides the unnecessary nature of the surgery, there’s a massive issue where these surgeons are having their patients pursue pre surg authorization from their family care providers for an out of state, out of network procedure. Then they often send them home far too early (day of), and push all post surg follow up care back onto the family care provider because the surgeon discharged them and said they were good to go home and to talk to their family care provide. The patients aren’t going to hop a flight back to Miami for care, so family med gets stuck with being cornered on taking out sutures and providing follow up care. It’s taking a massive liability for something they’re not really part of and it’s frustrating for them to say the least.",
                "“So, I don’t understand. Where is the legislation? Where is the follow-up? …Where is the outrage?” McLawrence asked, citing NBC6’s previous reporting.”\n\nIn Florida?",
                "Although the recovery house was unlicensed, I still think this has to do with BBL not being a safe procedure. It doesnt specify what surgery she got, but needing a recovery house in general means it was definitely something major",
                "I’d love to know if complication from the surgery is what caused her death, or if she was killed by the medication provided to her at the recovery home."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/12/2025 12:13:34 UTC"
}