{
    "posts": [
        {
            "category": "HOT",
            "title": "California Man Ordered to Leave the U.S. 'Immediately' Despite Providing Birth Certificate: 'I'm Not Trying to Be One of the Government's Mistakes'",
            "external_url": "https://www.latintimes.com/california-man-ordered-leave-us-immediately-despite-providing-birth-certificate-im-not-581422",
            "upvotes": 34610,
            "date": "04/23/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575008/california-man-ordered-leave-us-immediately-despite-providing.jpg",
            "top_comments": [
                "I think he had the right idea of going to the media. At least now, if the government makes good on its threats, there will be someone looking for him.",
                "> Despite providing his birth certificate to prove his US citizenship, Martinez-Gomez says he has been forced to make contingency plans with family members and now worries about being detained while performing his job.\n\nI'm just waiting for one of these poor people to become the target of \"fake birth certificate\" conspiracies.",
                "Born and raised American. I was put in handcuffs when Arizona did their “citizenship check stops” a few years back and told i was going to be sent ‘back to my own country’. \n\nFuck these people.",
                "> An American citizen born and raised in California is unsettled after receiving an e-mail from the US Department of Homeland Security ordering him to leave the country \"immediately.\" Aldo Martinez-Gomez received the DHS notice on April 11, threatening \"criminal prosecution\" and fines if he does not depart within seven days. \"Do not attempt to remain in the United States - The federal government will find you,\" the e-mail warned.\n\n\nSo the US is sending their own citizens threats and hoping to deport them. Not sure how that makes America great again.",
                "Why are they fucking emailing people? EMAIL? Why not a formal letter sent via certified mail?",
                "okay so my dad got one of these. He came here as a refugee from Cuba in the early 60s. We are ignoring it because he was not paroled and was not given a finite amount of time, rather, the US government made him a citizen when he was 16. He's 80 now. Im pretty sure Marco Rubio is in the same banana boat. My impression is this is a scare tactic to cover as many bases as possible, hoping fear will make their true targets leave. Dark stuff with Stephen Miller's sulfuric stink all over it.",
                "Here is their fascist version of probable cause\n\n“Martinez-Gomez works full-time assisting immigrants in court for a non-profit and believes his advocacy work may have placed him on the government's radar.”",
                "> \"Where do they want me to go?\" Martinez-Gomez told KTLA. \"I was born in National City. I was raised in San Diego County my whole life.\"\n\n> \"I believe I received it because I'm an accredited representative, and I represent immigrants, and I advocate for immigrants' rights in the court,\" he told ABC 10News.\n\n> In a statement, a senior DHS official said notices may have been accidentally sent to US citizens if their contact information was submitted by migrants — calling it a case of \"unintended recipients.\" The agency insisted it would address such issues individually.\n\nI know many aren't going to read the article and will rush to get their quips in....but Those three paragraphs stuck out. A US Citizen who was born in America being told to leave. Why are they being told to leave? Maybe because their job is to help immigrants. When asked by the media to clarify, the source acts as if it was just a mistake. \n\nBlack Americans of the past went through the same playbook. You're told to leave or that \"you don't belong here\". Why? Someone wants their land, or their prosperity, or something petty. When confronted? \"It was just a mistake :(\"\n\nThis is why it's important to learn history and to pay attention to history as it's truly being repeated right now. Don't believe me? Here's a fun bonus paragraph: \n\n> A Massachusetts immigration attorney reported receiving a similar e-mail last week.\n\nOH?",
                "I was told that I was dooming for suggesting that Trump would start deporting Americans to concentration camps",
                "Obama providing a birth certificate didn't change the minds of these fascists either "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "4-year-old migrant girl, other kids go to court in NYC with no lawyer: 'The cruelty is apparent'",
            "external_url": "https://gothamist.com/news/4-year-old-migrant-girl-other-kids-go-to-court-in-nyc-with-no-lawyer-the-cruelty-is-apparent?utm_medium=social&utm_source=reddit&utm_campaign=shared_reddit",
            "upvotes": 17106,
            "date": "04/23/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350828/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "It’s important too see what is actually occurring in deportation hearings, from article: “parties included a 7-year-old boy, wearing a shirt emblazoned with a pizza cartoon, who spun a toy windmill while the judge spoke. There was an 8-year-old girl and her 4-year-old sister, in a tie-dye shirt, who squeezed a pink plushy toy and stuffed it into her sleeve. None of the children were accompanied by parents or attorneys, only shelter workers who helped them log on to the hearing”",
                "This is unfortunately not new, children are not guaranteed ~~council~~ counsel in immigration court.\n\nJohn Oliver did a whole segment on it a few years back",
                "Dude what the fuck? How can a judge see this in the courtroom and not lose their fucking shit?",
                "This is a form of child abuse.\n\nDisgusting, evil and immoral.",
                "\"All men are created equal. But some men are more equal than others.\" –GOP",
                "Economy is nose diving and all trump can think about is deporting children.",
                "> The Trump administration on March 21 terminated part of a $200 million contract that funds attorneys and other legal services for unaccompanied children, who arrived in the United States without parents or legal guardians.\n\n> Nearly all of the people – 96% – appearing in New York state immigration courts without legal counsel are eventually ordered deported… Meanwhile, fewer than a quarter – 23% – of those with representation are deported.\n\nThere it is. Just awful, I really feel for these kids.",
                "Stay classy Trump administration",
                "Is this supposed to be what due process is like?",
                "This is sickening. Every person involved in this at any level (including the people who voted for it) is pure evil."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "City of Uvalde reaches settlement with families of school shooting victims",
            "external_url": "https://abcnews.go.com/US/city-uvalde-reaches-settlement-families-robb-elementary-school/story?id=121072304",
            "upvotes": 2827,
            "date": "04/23/2025",
            "thumbnail": "https://s.abcnews.com/images/US/texas-school-shooting-victim-uvalde-rojelio-torres-mother-interview-02-ht-llr-220526_1653594841031_hpMain_16x9_992.jpg?w=1600",
            "top_comments": [
                ">In addition to a monetary settlement that would be paid out by the city's insurance, the families were asking for Uvalde Police to adopt new fitness standards for the force and boost officer training, attorneys announced at a press conference in May 2024.\n\nThis is for the city of Uvalde and *not* the Uvalde CISD police force. The Uvalde CISD police department had an active shooter drill the month prior.",
                "So... Cops don't do their job, children die, and then the taxpayers in the community are the ones who have to compensate the victims families? \nThey should take the money from the cops",
                "Nothing will make it right.",
                "Essentially a tax refund of your own money for the pigs listening to your children die. \n\nBut they voted the same sheriff back in so 🤷‍♂️",
                "Settlements do not mean justice!",
                "Everything about Uvalde just pisses me off.\n\nAt this point, even the name irks me. \n \nWhat incredible injustice.",
                "And I’m sure the settlement has “No Admission of Guilt” for the lack of response from all of the cowards that stood outside and let kids get slaughtered by a lone gunman!!!",
                "I feel so bad for these parents because this was probably the best outcome they could possibly get, considering everything working against them. Uvalde police intentionally withheld the video and it had to be stolen in order to get released... like ten months later, when parents begged for it. \n\nThis is not justice, nor is it ever enough. There should have been criminal proceedings. Arrendondo should have gotten jail. People should have licenses, badges, gun ownership, etc. revoked permanently.",
                "Was Ted Cruz there trying to get them to reduce the number of doors at the school?",
                "Any of these cowards fall on their swords yet?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "‘They just did what they wanted’: Crown outlines sex assault allegations against Canada world junior hockey players",
            "external_url": "https://www.thestar.com/news/they-just-did-what-they-wanted-crown-outlines-sex-assault-allegations-against-canada-world-junior/article_c31efe15-fabe-488c-94bd-43972d3e3f16.html",
            "upvotes": 975,
            "date": "04/23/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/8f/d8fbdd20-4985-5f1a-ba31-b64c3cb84617/6808eb5c4dc24.image.jpg?crop=1889%2C992%2C0%2C52&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Absolutely nothing was learned after the University of Ottawa's hockey team's incident at Thunder Bay in 2014.",
                "TW: there are details in here about sexual assault and abuse. This is the highly publicized 2018 Canada World Juniors team that got covered up by Hockey Canada.",
                "I don't think it's just limited to hockey. Any high performing sports team usually gets away with a lot of shit that in other cases would not get a pass, and shouldn't get a pass.",
                "\"B-b-but boys will be boys...\"",
                "hmm, the last line of this story is very telling.",
                "Hockey culture is toxic and dangerous",
                "This is always on the adults in charge. The players need to accept responsibility for their actions but true oversight and leadership needs to improve.",
                "Carter Hart ... maybe if you had just played goalie and, you know, **not sexually assaulted a woman**, my Flyers wouldn't stink like an armpit in a brick oven.",
                "Beartown is an excellent novel",
                "It will be interesting to learn whether the defendants were under the influence like the plaintiff. If so, it will be interesting to hear the Crown's arguments explaining why an intoxicated woman cannot consent but an intoxicated man should be capable not only of consent, but of accurately judging the ability of others to consent."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 661,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.",
                "This is disgusting and disgraceful",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                "How many people have been disappeared that we don't  even know about?",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "Weird how only some babies must be saved",
                "Disgraceful, barbaric, shameful shit. All of these people need to be released immediately from indefinite detention."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "State of emergency declared as New Jersey wildfire explodes to 11,500 acres",
            "external_url": "https://abcnews.go.com/US/wildfire-new-jersey-explodes-8500-acres-residents-evacuated/story?id=121075913",
            "upvotes": 990,
            "date": "04/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/ca0c92e6-61d6-4694-b4b3-a7acdc32e79f/nj-wildfire-2-ap-gmh-250423_1745423871343_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "For reference, that's nearly 18sq miles on fire. \n\nThat's larger than Jersey City - not counting the surface area of the Hudson & Hackensack rivers - and is only only slightly smaller than the city of Newark.",
                "The fact that this is happening on the US East Coast is very concerning; unlike SoCal, the East Coast is supposed to get a lot more rain and is much more wet. It’s a completely different biome and it’s not supposed to be this dry.\n\n[Here](https://unitedstatesmaps.org/wordpress/wp-content/uploads/2021/07/usa-climate-map.pdf) is a map showing climate zones for reference.\n\n[Here](https://gisgeography.com/us-precipitation-map/) is another map that is more geared towards annual rainfall.",
                "[Trump fired the people who would normally be working to fight this fire.](https://www.govexec.com/federal-news/2025/04/trump-said-cuts-wouldnt-affect-public-safety-then-he-fired-hundreds-workers-who-help-fight-wildfires/404552/) If you think the DOGE cuts are a good thing, I ask you to not vote and stay away from the polls because I'm tired of seeing how people are getting hurt by Trump and Elon Musk.",
                "My fellow Americans are about to discover that a lot of the jobs gutted by Trump and DOGE were thankless and were of the utmost importance to us functioning as a country. Oh well, at least that trans third grader in Iowa can be banned from playing soccer. /s",
                "Oh jeez, I wonder where our wildland firefighters went.",
                "[visuals of the wildfire](https://www.reddit.com/r/USA24x7/s/52JAoOaI8n)",
                "So I live literally the town under this fire, the place it started \"Wells Mills County Park\" is like 10+ mins away. \n\nI woke up to my car with burnt wood on it. My university which is a half hour south has ash in the air flying. The parkway was closed entirely yesterday from Toms River to Manahawkin. That's a 30 minute stretch of a major highway closed. \n\nI read a comment in r/SouthJersey stating that a dude got out of work at 4 pm and got home at midnight. Lacey and Barnegat Townships got evacuated and power shut off. It's absolutely crazy and only now of this comment 35 percent contained.",
                "Did they try turning on the water?",
                "Even the New Jersey Devil is having a shitty year",
                "Did they forget to rake the forest?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Musk signals 'significantly' stepping back from Doge as Tesla profits plunge",
            "external_url": "https://www.bbc.co.uk/news/articles/cy0x50yr46lo",
            "upvotes": 24626,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54dd/live/0534ad00-200c-11f0-8c2e-77498b1ce297.jpg",
            "top_comments": [
                "He's lying. It's a ruse to manipulate Tesla's stock price.",
                "Don’t think it’ll help. He’s destroyed his image in a short amount of time and there’s no taking it back.",
                "It's cute he thinks his reputation is salvageable at this point",
                "Won't matter. Damage is done. These tesla profits dropping are just the start. Wait for next quarter.",
                "Okay.. Elon is no longer publicly making an ass of himself. That doesn't change the fact that big balls and the other creeps Elon hired are dismantling everything",
                "The damage is done. I am in the market for an EV and would never now consider a Tesla. So many others are in the exact same situation. ",
                "Can't put the \"heil Hitler\" back in the tube. Fuck Tesla. Take it to zero.",
                "He's already wrecked the systems, stolen all our data, and installed his digital and personnel backdoors.\n\n.. but at least the world has finally seen what a narcissistic nazi douchebag he is.",
                "[deleted]",
                "Lmao yea right. Anything good that could come from this administration wont and Elon leaving would be amazing for us so he wont be going anywhere."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Tesla sales plunge as carmaker warns ‘political sentiment’ could impact future demand",
            "external_url": "https://www.theguardian.com/technology/2025/apr/22/tesla-sales-musk-white-house-exit",
            "upvotes": 18347,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/84a18423ca2ed213d3451c93cff70ea1d454a856/0_53_7743_4646/master/7743.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d888d103ebc9308d688aa42c7c9ea3e0",
            "top_comments": [
                "I love that for them!\n\nFuck you, Elon.",
                "The fact that a Hitler salute has to be described as \"political sentiment\" gives me feelings of disappointment in humanity.",
                "Obviously, you fucking idiots. Its not just political sentiment. The guy is making nazi gestures, making nazi jokes, propping up far right parties in germany, sending his goons in to capture data they weren't elected for in the States. Fuck Tesla. And this is coming from someone who owns an Model 3 but can't really get rid of it (family/young kids/mortgage/bills/etc take priority)",
                "Kind of a stupid fucking move to try and sell electric cars to Nazi sympathizers. That's such a small overlap of American society.",
                "So anti-Nazi sentiment then? Okay that could be a problem yeah.",
                "The fact that it also sucks as a company also doesn't help.  They've been massively overvalued for a long time, kept afloat primarily through Elon Musk's weird tech bro cult of personality.  With Musk's mask off and his fascism on full display, the fragile foundation of this house of cards - i.e., the goodwill toward Elon himself - has cracked and the whole thing is tumbling down.",
                "My wife and I would be at least two teslas in…went so far as test driving but now, will never own one out of principle…who cares, it’s just two people but I’m guessing we are part of a not insignificant part of the target demo…get rekted Elmo…",
                "The CEO sieg heiled twice.",
                "> Analysts attribute the company’s overall difficulties to a number of factors, but ultimately conclude Elon Musk’s role in the White House has caused a branding crisis for Tesla. The company is at a major crossroads, analysts say, that will only be remedied if Musk leaves his role in the so-called “department of government efficiency” and returns to Tesla as CEO full time.\n\nElon is trash goods. People aren’t going to stop hating him just because he leaves. The damage he has caused to America’s democracy and government is unforgivable.",
                "Get fucked Elon. May you become penniless"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Veterans affairs agency orders staff to report each other for ‘anti-Christian bias’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/veterans-affairs-anti-christian-bias?CMP=Share_AndroidApp_Other",
            "upvotes": 9597,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/61859c303c21779b1d4c162dfdfc73baffe0230c/0_187_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35ea48c1ee63f288cfa25a06cb609745",
            "top_comments": [
                "They have all the power now and they still act like they are the most oppressed people on the planet.",
                ">  The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”\n\nHostile to Christian views?\n\nSo, all instances of employees NOT discriminating against women, minorities, and the LGBTQ+ community will be reported.\n\nBasically, people will be punished for being decent.",
                ">“The VA Task Force now requests all VA employees to **submit any instance of anti-Christian discrimination to Anti-ChristianBiasReporting.@va.gov,”** the email reads. “Submissions should include sufficient identifiers such as names, dates, and locations.”\n\nRedditors, you have your assignment.",
                "mY sUpErViSoR sAiD hApPy hOlIdAyS tO mE!",
                "> The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”.\n\nWanting to maintain the separation of church and state is not an attack.",
                "Every president  and 87% of our congress are Christian. SCOTUS is all Christian. Not oppressed.",
                "wish jesus was real, and that he would come back - again - and take all these assholes to wherever it is that they belong ...",
                "So much for the separation of Church and State.",
                "Everyday, Trump's administration proves that both parties are in fact not the same. ",
                "So all it takes is for that one religious zealot at work is to ask you “Do you believe?” Then if you say no, you’re out of job? Ridiculous"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Sarah Palin loses retrial of defamation case against New York Times",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/sarah-palin-loses-defamation-nyt-retrial",
            "upvotes": 25584,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8a71a1a108784657ab0666974cc8c763211db1b0/0_142_4300_2581/master/4300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e0e0a47794bea93c9f820c3c81f93292",
            "top_comments": [
                "I'm not joking, but I'd completely forgotten about Sarah Palin until I read this headline.",
                "Tina Fey made Sarah Palin more famous than Sarah Palin did.",
                "\"Sarah Palin loses\", a tune now so common it's subtly and ever-so-slowly replacing that quintessential elevator music. Keep it up queen!",
                "Dam they're really Nailin Palin",
                "Can she see this verdict from her front porch?",
                "I'm surprised she didn't quit half way through the case",
                "Not upset about this. She is one of the main reasons we are in the mess we are in now. Because she not only was a poor loser but a bad politician who couldn’t take a black man becoming president.",
                "Good. Now she can cry more.",
                "First The Masked Singer, and now this. Can't get a break.",
                "If you've never seen it, do yourself a favor and watch the movie Game Change about her campaign with John McCain. It's a decent movie with some big names but it has more of a TV movie feel IMHO. People on the campaign (and characters in the movie) like Nicole Wallace have said it is accurate. It's amazing how bad of a choice she was for his running mate. She did some wacky shit and really tanked his campaign."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Book publishers see surging interest in the US Constitution and print new editions",
            "external_url": "https://apnews.com/article/constitution-declaration-independence-federalist-sales-meacham-5566e2c9ea4206f335dd912e9807bcf7",
            "upvotes": 3,
            "date": "04/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 651,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.",
                "This is disgusting and disgraceful",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                "How many people have been disappeared that we don't  even know about?",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "Weird how only some babies must be saved",
                "Disgraceful, barbaric, shameful shit. All of these people need to be released immediately from indefinite detention."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Judge orders Bail hearing for detained student Mohsen Madawi next week",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/23/mohsen-mahdawi-bail-hearing-vermont",
            "upvotes": 19,
            "date": "04/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/75d5898aee9335ce81b695efcf019d85ff8860a9/0_429_5712_3426/master/5712.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0f86fa44c0543cfb5cd4d62b5f673be5",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Boeing to sell Jeppesen unit to Thoma Bravo for $10.6 billion",
            "external_url": "https://www.reuters.com/business/aerospace-defense/buyout-firm-thoma-bravo-nears-deal-boeings-jeppesen-unit-bloomberg-news-reports-2025-04-22/",
            "upvotes": 24,
            "date": "04/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "this also includes foreflight"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "NFL champion Shannon Sharpe sued for sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c99pj3xj38do",
            "upvotes": 164,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e6e/live/1dc78bc0-204e-11f0-9177-cd94edc26715.jpg",
            "top_comments": [
                ">\"After many months of manipulating and controlling Plaintiff — a woman more than thirty years younger than he — and repeatedly threatening to brutally choke and violently slap her, Sharpe refused to accept the answer no and raped Plaintiff, despite her sobbing and repeated screams of 'no,'\" the complaint alleges.\n\n>In addition, she alleges in the suit that Mr Sharpe insisted on recording some of the sexual encounters, sometimes without her consent or knowledge, shared the videos with his \" friends and associates\".\n\nHe's calling it a shakedown and threatening to sue for defamation.",
                "Man that skip bayless really gets around",
                "Apparently there’s a video the gal made of the encounter but she’ll only release 10 seconds or so, while Sharpe is calling for the whole vid to be released, which suggests to me that she’s a gold digger.",
                "That Buzbee lawyer dude is really sus. \n\nI’m hesitant to believe his clients after he made that bogus claim against Jay Z. It’s also a bit weird he’s only been targeting rich black men.",
                "This may be a legit case, but hiring the scumbag lawyer really damages her case in the public eye. She's not doing herself any favors.",
                "Keep messing with them young broads..... lol",
                "Carly is definitely no Megan three Stallion and those text messages where she wants to put her tongue in  Shannon butt hole do not scream Sexual  assaulted And I'm ashamed of Shannon to get shook down by a mare",
                "Why would she sue him rather than charging him with sexual assault?\nSomething smells fishy...",
                "I don't think Shannon r*ped her, but I do thing he had sexual relations with her which is sick in it's own way. You're in your fucking 50s bruh, I don't care how much Test you're injecting, you have no business fucking a 19-20 year old. \n\nOn another note, this Busbee guy seems like a lying POS and I hope Jay Z and his lawyers smoke him. At this rate, I might get served papers tomorrow and I'm a fucking Redditor lol",
                "[deleted]"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "India vows ‘loud, clear’ response to Pahalgam killings.",
            "external_url": "https://www.aljazeera.com/news/liveblog/2025/4/23/kashmir-attack-live-india-looks-for-gunmen-after-26-killed-in-pahalgam?utm_source=chatgpt.com",
            "upvotes": 80,
            "date": "04/23/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-23T120001Z_1942996642_RC2M3EAMLRNE_RTRMADP_3_INDIA-KASHMIR-ATTACK-1745409763.jpg?resize=1920%2C1440",
            "top_comments": [
                "The Indian government moved to revoke specific visa privileges for Pakistani nationals and expelled some diplomats in response to this.\n\nHowever, most alarmingly is that they suspended the Indus Waters Treaty. That's a treaty dealing with water rights with the rivers that start up in and around Kashmir. \n\nThat's the kind of thing that could start a conflagration between two nuclear armed powers, and could prove incredibly problematic at best to apocalyptic at worst.\n\nBecause water, unlike territory or religion, is necessary to survive.",
                "They'll ban JD Vance from setting foot in India again?",
                "They can't do anything much to terrorists to appease the public, so it will be another oppression wave against civilian people of Kashmir"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "‘They just did what they wanted’: Crown outlines sex assault allegations against Canada world junior hockey players",
            "external_url": "https://www.thestar.com/news/they-just-did-what-they-wanted-crown-outlines-sex-assault-allegations-against-canada-world-junior/article_c31efe15-fabe-488c-94bd-43972d3e3f16.html",
            "upvotes": 972,
            "date": "04/23/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/8f/d8fbdd20-4985-5f1a-ba31-b64c3cb84617/6808eb5c4dc24.image.jpg?crop=1889%2C992%2C0%2C52&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Absolutely nothing was learned after the University of Ottawa's hockey team's incident at Thunder Bay in 2014.",
                "TW: there are details in here about sexual assault and abuse. This is the highly publicized 2018 Canada World Juniors team that got covered up by Hockey Canada.",
                "I don't think it's just limited to hockey. Any high performing sports team usually gets away with a lot of shit that in other cases would not get a pass, and shouldn't get a pass.",
                "\"B-b-but boys will be boys...\"",
                "hmm, the last line of this story is very telling.",
                "Hockey culture is toxic and dangerous",
                "This is always on the adults in charge. The players need to accept responsibility for their actions but true oversight and leadership needs to improve.",
                "Carter Hart ... maybe if you had just played goalie and, you know, **not sexually assaulted a woman**, my Flyers wouldn't stink like an armpit in a brick oven.",
                "Beartown is an excellent novel",
                "It will be interesting to learn whether the defendants were under the influence like the plaintiff. If so, it will be interesting to hear the Crown's arguments explaining why an intoxicated woman cannot consent but an intoxicated man should be capable not only of consent, but of accurately judging the ability of others to consent."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "State of emergency declared as New Jersey wildfire explodes to 11,500 acres",
            "external_url": "https://abcnews.go.com/US/wildfire-new-jersey-explodes-8500-acres-residents-evacuated/story?id=121075913",
            "upvotes": 996,
            "date": "04/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/ca0c92e6-61d6-4694-b4b3-a7acdc32e79f/nj-wildfire-2-ap-gmh-250423_1745423871343_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "For reference, that's nearly 18sq miles on fire. \n\nThat's larger than Jersey City - not counting the surface area of the Hudson & Hackensack rivers - and is only only slightly smaller than the city of Newark.",
                "The fact that this is happening on the US East Coast is very concerning; unlike SoCal, the East Coast is supposed to get a lot more rain and is much more wet. It’s a completely different biome and it’s not supposed to be this dry.\n\n[Here](https://unitedstatesmaps.org/wordpress/wp-content/uploads/2021/07/usa-climate-map.pdf) is a map showing climate zones for reference.\n\n[Here](https://gisgeography.com/us-precipitation-map/) is another map that is more geared towards annual rainfall.",
                "[Trump fired the people who would normally be working to fight this fire.](https://www.govexec.com/federal-news/2025/04/trump-said-cuts-wouldnt-affect-public-safety-then-he-fired-hundreds-workers-who-help-fight-wildfires/404552/) If you think the DOGE cuts are a good thing, I ask you to not vote and stay away from the polls because I'm tired of seeing how people are getting hurt by Trump and Elon Musk.",
                "My fellow Americans are about to discover that a lot of the jobs gutted by Trump and DOGE were thankless and were of the utmost importance to us functioning as a country. Oh well, at least that trans third grader in Iowa can be banned from playing soccer. /s",
                "Oh jeez, I wonder where our wildland firefighters went.",
                "[visuals of the wildfire](https://www.reddit.com/r/USA24x7/s/52JAoOaI8n)",
                "So I live literally the town under this fire, the place it started \"Wells Mills County Park\" is like 10+ mins away. \n\nI woke up to my car with burnt wood on it. My university which is a half hour south has ash in the air flying. The parkway was closed entirely yesterday from Toms River to Manahawkin. That's a 30 minute stretch of a major highway closed. \n\nI read a comment in r/SouthJersey stating that a dude got out of work at 4 pm and got home at midnight. Lacey and Barnegat Townships got evacuated and power shut off. It's absolutely crazy and only now of this comment 35 percent contained.",
                "Did they try turning on the water?",
                "Even the New Jersey Devil is having a shitty year",
                "Did they forget to rake the forest?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "California Man Ordered to Leave the U.S. 'Immediately' Despite Providing Birth Certificate: 'I'm Not Trying to Be One of the Government's Mistakes'",
            "external_url": "https://www.latintimes.com/california-man-ordered-leave-us-immediately-despite-providing-birth-certificate-im-not-581422",
            "upvotes": 34645,
            "date": "04/23/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575008/california-man-ordered-leave-us-immediately-despite-providing.jpg",
            "top_comments": [
                "I think he had the right idea of going to the media. At least now, if the government makes good on its threats, there will be someone looking for him.",
                "> Despite providing his birth certificate to prove his US citizenship, Martinez-Gomez says he has been forced to make contingency plans with family members and now worries about being detained while performing his job.\n\nI'm just waiting for one of these poor people to become the target of \"fake birth certificate\" conspiracies.",
                "Born and raised American. I was put in handcuffs when Arizona did their “citizenship check stops” a few years back and told i was going to be sent ‘back to my own country’. \n\nFuck these people.",
                "> An American citizen born and raised in California is unsettled after receiving an e-mail from the US Department of Homeland Security ordering him to leave the country \"immediately.\" Aldo Martinez-Gomez received the DHS notice on April 11, threatening \"criminal prosecution\" and fines if he does not depart within seven days. \"Do not attempt to remain in the United States - The federal government will find you,\" the e-mail warned.\n\n\nSo the US is sending their own citizens threats and hoping to deport them. Not sure how that makes America great again.",
                "Why are they fucking emailing people? EMAIL? Why not a formal letter sent via certified mail?",
                "okay so my dad got one of these. He came here as a refugee from Cuba in the early 60s. We are ignoring it because he was not paroled and was not given a finite amount of time, rather, the US government made him a citizen when he was 16. He's 80 now. Im pretty sure Marco Rubio is in the same banana boat. My impression is this is a scare tactic to cover as many bases as possible, hoping fear will make their true targets leave. Dark stuff with Stephen Miller's sulfuric stink all over it.",
                "Here is their fascist version of probable cause\n\n“Martinez-Gomez works full-time assisting immigrants in court for a non-profit and believes his advocacy work may have placed him on the government's radar.”",
                "> \"Where do they want me to go?\" Martinez-Gomez told KTLA. \"I was born in National City. I was raised in San Diego County my whole life.\"\n\n> \"I believe I received it because I'm an accredited representative, and I represent immigrants, and I advocate for immigrants' rights in the court,\" he told ABC 10News.\n\n> In a statement, a senior DHS official said notices may have been accidentally sent to US citizens if their contact information was submitted by migrants — calling it a case of \"unintended recipients.\" The agency insisted it would address such issues individually.\n\nI know many aren't going to read the article and will rush to get their quips in....but Those three paragraphs stuck out. A US Citizen who was born in America being told to leave. Why are they being told to leave? Maybe because their job is to help immigrants. When asked by the media to clarify, the source acts as if it was just a mistake. \n\nBlack Americans of the past went through the same playbook. You're told to leave or that \"you don't belong here\". Why? Someone wants their land, or their prosperity, or something petty. When confronted? \"It was just a mistake :(\"\n\nThis is why it's important to learn history and to pay attention to history as it's truly being repeated right now. Don't believe me? Here's a fun bonus paragraph: \n\n> A Massachusetts immigration attorney reported receiving a similar e-mail last week.\n\nOH?",
                "I was told that I was dooming for suggesting that Trump would start deporting Americans to concentration camps",
                "Obama providing a birth certificate didn't change the minds of these fascists either "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "4-year-old migrant girl, other kids go to court in NYC with no lawyer: 'The cruelty is apparent'",
            "external_url": "https://gothamist.com/news/4-year-old-migrant-girl-other-kids-go-to-court-in-nyc-with-no-lawyer-the-cruelty-is-apparent?utm_medium=social&utm_source=reddit&utm_campaign=shared_reddit",
            "upvotes": 17103,
            "date": "04/23/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350828/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "It’s important too see what is actually occurring in deportation hearings, from article: “parties included a 7-year-old boy, wearing a shirt emblazoned with a pizza cartoon, who spun a toy windmill while the judge spoke. There was an 8-year-old girl and her 4-year-old sister, in a tie-dye shirt, who squeezed a pink plushy toy and stuffed it into her sleeve. None of the children were accompanied by parents or attorneys, only shelter workers who helped them log on to the hearing”",
                "This is unfortunately not new, children are not guaranteed ~~council~~ counsel in immigration court.\n\nJohn Oliver did a whole segment on it a few years back",
                "Dude what the fuck? How can a judge see this in the courtroom and not lose their fucking shit?",
                "This is a form of child abuse.\n\nDisgusting, evil and immoral.",
                "\"All men are created equal. But some men are more equal than others.\" –GOP",
                "Economy is nose diving and all trump can think about is deporting children.",
                "> The Trump administration on March 21 terminated part of a $200 million contract that funds attorneys and other legal services for unaccompanied children, who arrived in the United States without parents or legal guardians.\n\n> Nearly all of the people – 96% – appearing in New York state immigration courts without legal counsel are eventually ordered deported… Meanwhile, fewer than a quarter – 23% – of those with representation are deported.\n\nThere it is. Just awful, I really feel for these kids.",
                "Stay classy Trump administration",
                "Is this supposed to be what due process is like?",
                "This is sickening. Every person involved in this at any level (including the people who voted for it) is pure evil."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 662,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.",
                "This is disgusting and disgraceful",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                "How many people have been disappeared that we don't  even know about?",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "Weird how only some babies must be saved",
                "Disgraceful, barbaric, shameful shit. All of these people need to be released immediately from indefinite detention."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "State of emergency declared as New Jersey wildfire explodes to 11,500 acres",
            "external_url": "https://abcnews.go.com/US/wildfire-new-jersey-explodes-8500-acres-residents-evacuated/story?id=121075913",
            "upvotes": 996,
            "date": "04/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/ca0c92e6-61d6-4694-b4b3-a7acdc32e79f/nj-wildfire-2-ap-gmh-250423_1745423871343_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "For reference, that's nearly 18sq miles on fire. \n\nThat's larger than Jersey City - not counting the surface area of the Hudson & Hackensack rivers - and is only only slightly smaller than the city of Newark.",
                "The fact that this is happening on the US East Coast is very concerning; unlike SoCal, the East Coast is supposed to get a lot more rain and is much more wet. It’s a completely different biome and it’s not supposed to be this dry.\n\n[Here](https://unitedstatesmaps.org/wordpress/wp-content/uploads/2021/07/usa-climate-map.pdf) is a map showing climate zones for reference.\n\n[Here](https://gisgeography.com/us-precipitation-map/) is another map that is more geared towards annual rainfall.",
                "[Trump fired the people who would normally be working to fight this fire.](https://www.govexec.com/federal-news/2025/04/trump-said-cuts-wouldnt-affect-public-safety-then-he-fired-hundreds-workers-who-help-fight-wildfires/404552/) If you think the DOGE cuts are a good thing, I ask you to not vote and stay away from the polls because I'm tired of seeing how people are getting hurt by Trump and Elon Musk.",
                "My fellow Americans are about to discover that a lot of the jobs gutted by Trump and DOGE were thankless and were of the utmost importance to us functioning as a country. Oh well, at least that trans third grader in Iowa can be banned from playing soccer. /s",
                "Oh jeez, I wonder where our wildland firefighters went.",
                "[visuals of the wildfire](https://www.reddit.com/r/USA24x7/s/52JAoOaI8n)",
                "So I live literally the town under this fire, the place it started \"Wells Mills County Park\" is like 10+ mins away. \n\nI woke up to my car with burnt wood on it. My university which is a half hour south has ash in the air flying. The parkway was closed entirely yesterday from Toms River to Manahawkin. That's a 30 minute stretch of a major highway closed. \n\nI read a comment in r/SouthJersey stating that a dude got out of work at 4 pm and got home at midnight. Lacey and Barnegat Townships got evacuated and power shut off. It's absolutely crazy and only now of this comment 35 percent contained.",
                "Did they try turning on the water?",
                "Even the New Jersey Devil is having a shitty year",
                "Did they forget to rake the forest?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "4-year-old migrant girl, other kids go to court in NYC with no lawyer: 'The cruelty is apparent'",
            "external_url": "https://gothamist.com/news/4-year-old-migrant-girl-other-kids-go-to-court-in-nyc-with-no-lawyer-the-cruelty-is-apparent?utm_medium=social&utm_source=reddit&utm_campaign=shared_reddit",
            "upvotes": 17129,
            "date": "04/23/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350828/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "It’s important too see what is actually occurring in deportation hearings, from article: “parties included a 7-year-old boy, wearing a shirt emblazoned with a pizza cartoon, who spun a toy windmill while the judge spoke. There was an 8-year-old girl and her 4-year-old sister, in a tie-dye shirt, who squeezed a pink plushy toy and stuffed it into her sleeve. None of the children were accompanied by parents or attorneys, only shelter workers who helped them log on to the hearing”",
                "This is unfortunately not new, children are not guaranteed ~~council~~ counsel in immigration court.\n\nJohn Oliver did a whole segment on it a few years back",
                "Dude what the fuck? How can a judge see this in the courtroom and not lose their fucking shit?",
                "This is a form of child abuse.\n\nDisgusting, evil and immoral.",
                "\"All men are created equal. But some men are more equal than others.\" –GOP",
                "Economy is nose diving and all trump can think about is deporting children.",
                "> The Trump administration on March 21 terminated part of a $200 million contract that funds attorneys and other legal services for unaccompanied children, who arrived in the United States without parents or legal guardians.\n\n> Nearly all of the people – 96% – appearing in New York state immigration courts without legal counsel are eventually ordered deported… Meanwhile, fewer than a quarter – 23% – of those with representation are deported.\n\nThere it is. Just awful, I really feel for these kids.",
                "Stay classy Trump administration",
                "Is this supposed to be what due process is like?",
                "This is sickening. Every person involved in this at any level (including the people who voted for it) is pure evil."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "‘They just did what they wanted’: Crown outlines sex assault allegations against Canada world junior hockey players",
            "external_url": "https://www.thestar.com/news/they-just-did-what-they-wanted-crown-outlines-sex-assault-allegations-against-canada-world-junior/article_c31efe15-fabe-488c-94bd-43972d3e3f16.html",
            "upvotes": 971,
            "date": "04/23/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/8f/d8fbdd20-4985-5f1a-ba31-b64c3cb84617/6808eb5c4dc24.image.jpg?crop=1889%2C992%2C0%2C52&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Absolutely nothing was learned after the University of Ottawa's hockey team's incident at Thunder Bay in 2014.",
                "TW: there are details in here about sexual assault and abuse. This is the highly publicized 2018 Canada World Juniors team that got covered up by Hockey Canada.",
                "I don't think it's just limited to hockey. Any high performing sports team usually gets away with a lot of shit that in other cases would not get a pass, and shouldn't get a pass.",
                "\"B-b-but boys will be boys...\"",
                "hmm, the last line of this story is very telling.",
                "Hockey culture is toxic and dangerous",
                "This is always on the adults in charge. The players need to accept responsibility for their actions but true oversight and leadership needs to improve.",
                "Carter Hart ... maybe if you had just played goalie and, you know, **not sexually assaulted a woman**, my Flyers wouldn't stink like an armpit in a brick oven.",
                "Beartown is an excellent novel",
                "It will be interesting to learn whether the defendants were under the influence like the plaintiff. If so, it will be interesting to hear the Crown's arguments explaining why an intoxicated woman cannot consent but an intoxicated man should be capable not only of consent, but of accurately judging the ability of others to consent."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "California Man Ordered to Leave the U.S. 'Immediately' Despite Providing Birth Certificate: 'I'm Not Trying to Be One of the Government's Mistakes'",
            "external_url": "https://www.latintimes.com/california-man-ordered-leave-us-immediately-despite-providing-birth-certificate-im-not-581422",
            "upvotes": 34613,
            "date": "04/23/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575008/california-man-ordered-leave-us-immediately-despite-providing.jpg",
            "top_comments": [
                "I think he had the right idea of going to the media. At least now, if the government makes good on its threats, there will be someone looking for him.",
                "> Despite providing his birth certificate to prove his US citizenship, Martinez-Gomez says he has been forced to make contingency plans with family members and now worries about being detained while performing his job.\n\nI'm just waiting for one of these poor people to become the target of \"fake birth certificate\" conspiracies.",
                "Born and raised American. I was put in handcuffs when Arizona did their “citizenship check stops” a few years back and told i was going to be sent ‘back to my own country’. \n\nFuck these people.",
                "> An American citizen born and raised in California is unsettled after receiving an e-mail from the US Department of Homeland Security ordering him to leave the country \"immediately.\" Aldo Martinez-Gomez received the DHS notice on April 11, threatening \"criminal prosecution\" and fines if he does not depart within seven days. \"Do not attempt to remain in the United States - The federal government will find you,\" the e-mail warned.\n\n\nSo the US is sending their own citizens threats and hoping to deport them. Not sure how that makes America great again.",
                "Why are they fucking emailing people? EMAIL? Why not a formal letter sent via certified mail?",
                "okay so my dad got one of these. He came here as a refugee from Cuba in the early 60s. We are ignoring it because he was not paroled and was not given a finite amount of time, rather, the US government made him a citizen when he was 16. He's 80 now. Im pretty sure Marco Rubio is in the same banana boat. My impression is this is a scare tactic to cover as many bases as possible, hoping fear will make their true targets leave. Dark stuff with Stephen Miller's sulfuric stink all over it.",
                "Here is their fascist version of probable cause\n\n“Martinez-Gomez works full-time assisting immigrants in court for a non-profit and believes his advocacy work may have placed him on the government's radar.”",
                "> \"Where do they want me to go?\" Martinez-Gomez told KTLA. \"I was born in National City. I was raised in San Diego County my whole life.\"\n\n> \"I believe I received it because I'm an accredited representative, and I represent immigrants, and I advocate for immigrants' rights in the court,\" he told ABC 10News.\n\n> In a statement, a senior DHS official said notices may have been accidentally sent to US citizens if their contact information was submitted by migrants — calling it a case of \"unintended recipients.\" The agency insisted it would address such issues individually.\n\nI know many aren't going to read the article and will rush to get their quips in....but Those three paragraphs stuck out. A US Citizen who was born in America being told to leave. Why are they being told to leave? Maybe because their job is to help immigrants. When asked by the media to clarify, the source acts as if it was just a mistake. \n\nBlack Americans of the past went through the same playbook. You're told to leave or that \"you don't belong here\". Why? Someone wants their land, or their prosperity, or something petty. When confronted? \"It was just a mistake :(\"\n\nThis is why it's important to learn history and to pay attention to history as it's truly being repeated right now. Don't believe me? Here's a fun bonus paragraph: \n\n> A Massachusetts immigration attorney reported receiving a similar e-mail last week.\n\nOH?",
                "I was told that I was dooming for suggesting that Trump would start deporting Americans to concentration camps",
                "Obama providing a birth certificate didn't change the minds of these fascists either "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "City of Uvalde reaches settlement with families of school shooting victims",
            "external_url": "https://abcnews.go.com/US/city-uvalde-reaches-settlement-families-robb-elementary-school/story?id=121072304",
            "upvotes": 2827,
            "date": "04/23/2025",
            "thumbnail": "https://s.abcnews.com/images/US/texas-school-shooting-victim-uvalde-rojelio-torres-mother-interview-02-ht-llr-220526_1653594841031_hpMain_16x9_992.jpg?w=1600",
            "top_comments": [
                ">In addition to a monetary settlement that would be paid out by the city's insurance, the families were asking for Uvalde Police to adopt new fitness standards for the force and boost officer training, attorneys announced at a press conference in May 2024.\n\nThis is for the city of Uvalde and *not* the Uvalde CISD police force. The Uvalde CISD police department had an active shooter drill the month prior.",
                "So... Cops don't do their job, children die, and then the taxpayers in the community are the ones who have to compensate the victims families? \nThey should take the money from the cops",
                "Nothing will make it right.",
                "Essentially a tax refund of your own money for the pigs listening to your children die. \n\nBut they voted the same sheriff back in so 🤷‍♂️",
                "Settlements do not mean justice!",
                "Everything about Uvalde just pisses me off.\n\nAt this point, even the name irks me. \n \nWhat incredible injustice.",
                "And I’m sure the settlement has “No Admission of Guilt” for the lack of response from all of the cowards that stood outside and let kids get slaughtered by a lone gunman!!!",
                "I feel so bad for these parents because this was probably the best outcome they could possibly get, considering everything working against them. Uvalde police intentionally withheld the video and it had to be stolen in order to get released... like ten months later, when parents begged for it. \n\nThis is not justice, nor is it ever enough. There should have been criminal proceedings. Arrendondo should have gotten jail. People should have licenses, badges, gun ownership, etc. revoked permanently.",
                "Was Ted Cruz there trying to get them to reduce the number of doors at the school?",
                "Any of these cowards fall on their swords yet?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "$50 million prize funded by Musk foundation goes to Indian carbon-capture company",
            "external_url": "https://apnews.com/article/xprize-climate-carbon-removal-musk-31d41e402fd5386bd564d7145e84e9db",
            "upvotes": 496,
            "date": "04/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Elmo's cranking the PR machine after yesterday's earnings call.",
                "Follow the money more closely...",
                "Carbon capture won’t fix things. It doesn’t work well enough. Maybe he should stop sponsoring fascism if he wants better PR. Until then, apologize to Vivian and stfu.",
                "Elon would have to undo everything he's done and solve world hunger before people would even start to wonder if he has a soul...",
                "[https://www.reddit.com/r/gifs/comments/1i7w4nz/comparison\\_of\\_elon\\_musks\\_nazi\\_salute\\_with\\_real/](https://www.reddit.com/r/gifs/comments/1i7w4nz/comparison_of_elon_musks_nazi_salute_with_real/)\n\n  \nAlternate title suggestion: \"Nazi shithead tries to buy goodwill after plan to convert America to far right backfires horribly\"",
                ">Mati Carbon was among more than 1,300 teams from 88 countries that participated in the four-year XPRIZE Carbon Removal competition, launched in 2021 to encourage deployment of carbon-removal technologies. Many scientists believe removing carbon is crucial in the fight against global warming, caused by the burning of fossil fuels like gasoline, coal and oil, which release carbon dioxide.\n\nI could have won this prize.\n\nIt's called a tree.  You plant them, and preserve them",
                "Critical to note that carbon capture technology is fundamentally flawed and almost totally ineffectual. It is supported by oil and gas companies as a tactic to say \"Hey look, we can have oil/gas and coal while mitigating the harm\" but it is in reality a lie.",
                "Too bad musk helped restart coal industry.  He bought an election to stay out of jail for defrauding investors and customers.  And i wouldn’t be surprised if this was another scam too.",
                "Looks like op's attempt to control the narrative got ratio'd until they self-deleted their posts.",
                "But his administration opposes carbon credits and the idea of global climate change being real. They actually want to ban carbon credits."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Musk signals 'significantly' stepping back from Doge as Tesla profits plunge",
            "external_url": "https://www.bbc.co.uk/news/articles/cy0x50yr46lo",
            "upvotes": 24626,
            "date": "04/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54dd/live/0534ad00-200c-11f0-8c2e-77498b1ce297.jpg",
            "top_comments": [
                "He's lying. It's a ruse to manipulate Tesla's stock price.",
                "Don’t think it’ll help. He’s destroyed his image in a short amount of time and there’s no taking it back.",
                "It's cute he thinks his reputation is salvageable at this point",
                "Won't matter. Damage is done. These tesla profits dropping are just the start. Wait for next quarter.",
                "Okay.. Elon is no longer publicly making an ass of himself. That doesn't change the fact that big balls and the other creeps Elon hired are dismantling everything",
                "The damage is done. I am in the market for an EV and would never now consider a Tesla. So many others are in the exact same situation. ",
                "Can't put the \"heil Hitler\" back in the tube. Fuck Tesla. Take it to zero.",
                "He's already wrecked the systems, stolen all our data, and installed his digital and personnel backdoors.\n\n.. but at least the world has finally seen what a narcissistic nazi douchebag he is.",
                "[deleted]",
                "Lmao yea right. Anything good that could come from this administration wont and Elon leaving would be amazing for us so he wont be going anywhere."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Tesla sales plunge as carmaker warns ‘political sentiment’ could impact future demand",
            "external_url": "https://www.theguardian.com/technology/2025/apr/22/tesla-sales-musk-white-house-exit",
            "upvotes": 18339,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/84a18423ca2ed213d3451c93cff70ea1d454a856/0_53_7743_4646/master/7743.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d888d103ebc9308d688aa42c7c9ea3e0",
            "top_comments": [
                "I love that for them!\n\nFuck you, Elon.",
                "The fact that a Hitler salute has to be described as \"political sentiment\" gives me feelings of disappointment in humanity.",
                "Obviously, you fucking idiots. Its not just political sentiment. The guy is making nazi gestures, making nazi jokes, propping up far right parties in germany, sending his goons in to capture data they weren't elected for in the States. Fuck Tesla. And this is coming from someone who owns an Model 3 but can't really get rid of it (family/young kids/mortgage/bills/etc take priority)",
                "Kind of a stupid fucking move to try and sell electric cars to Nazi sympathizers. That's such a small overlap of American society.",
                "So anti-Nazi sentiment then? Okay that could be a problem yeah.",
                "The fact that it also sucks as a company also doesn't help.  They've been massively overvalued for a long time, kept afloat primarily through Elon Musk's weird tech bro cult of personality.  With Musk's mask off and his fascism on full display, the fragile foundation of this house of cards - i.e., the goodwill toward Elon himself - has cracked and the whole thing is tumbling down.",
                "My wife and I would be at least two teslas in…went so far as test driving but now, will never own one out of principle…who cares, it’s just two people but I’m guessing we are part of a not insignificant part of the target demo…get rekted Elmo…",
                "The CEO sieg heiled twice.",
                "> Analysts attribute the company’s overall difficulties to a number of factors, but ultimately conclude Elon Musk’s role in the White House has caused a branding crisis for Tesla. The company is at a major crossroads, analysts say, that will only be remedied if Musk leaves his role in the so-called “department of government efficiency” and returns to Tesla as CEO full time.\n\nElon is trash goods. People aren’t going to stop hating him just because he leaves. The damage he has caused to America’s democracy and government is unforgivable.",
                "Get fucked Elon. May you become penniless"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Veterans affairs agency orders staff to report each other for ‘anti-Christian bias’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/22/veterans-affairs-anti-christian-bias?CMP=Share_AndroidApp_Other",
            "upvotes": 9606,
            "date": "04/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/61859c303c21779b1d4c162dfdfc73baffe0230c/0_187_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35ea48c1ee63f288cfa25a06cb609745",
            "top_comments": [
                "They have all the power now and they still act like they are the most oppressed people on the planet.",
                ">  The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”\n\nHostile to Christian views?\n\nSo, all instances of employees NOT discriminating against women, minorities, and the LGBTQ+ community will be reported.\n\nBasically, people will be punished for being decent.",
                ">“The VA Task Force now requests all VA employees to **submit any instance of anti-Christian discrimination to Anti-ChristianBiasReporting.@va.gov,”** the email reads. “Submissions should include sufficient identifiers such as names, dates, and locations.”\n\nRedditors, you have your assignment.",
                "mY sUpErViSoR sAiD hApPy hOlIdAyS tO mE!",
                "> The email states that the department will review “all instances of anti-Christian bias” but that it is specifically seeking instances including “any informal policies, procedures, or unofficially understandings hostile to Christian views”.\n\nWanting to maintain the separation of church and state is not an attack.",
                "Every president  and 87% of our congress are Christian. SCOTUS is all Christian. Not oppressed.",
                "wish jesus was real, and that he would come back - again - and take all these assholes to wherever it is that they belong ...",
                "So much for the separation of Church and State.",
                "Everyday, Trump's administration proves that both parties are in fact not the same. ",
                "So all it takes is for that one religious zealot at work is to ask you “Do you believe?” Then if you say no, you’re out of job? Ridiculous"
            ],
            "aggregate_sentiment": 62.0
        }
    ],
    "last_updated": "04/23/2025 20:10:30 UTC"
}