{
    "posts": [
        {
            "category": "HOT",
            "title": "American born doctor receives email from immigration officials telling her to leave the country immediately",
            "external_url": "https://www.nbcnews.com/news/rcna201698",
            "upvotes": 5465,
            "date": "04/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250417-lisa-anderson-mn-0900-993ef5.jpg",
            "top_comments": [
                "When incompetence meets abject cruelty, this is the result.",
                "So, there's two additional things to worry about.\n\n1) the government is sending out deportation emails without checking.\n\n2) ICE has shown a willingness to grab everyone nearby and deport them without checking.\n\nIt almost doesn't matter if you're a US citizen because no one will ever actually try to verify if you're the right person.",
                "This is the same system determining who goes to the gulag. And we see how well that works when they fuck up.",
                "When will enough people wake up? Or is it too late?",
                "Where are they going to deport her? To Narnia?",
                "I said as soon as he got elected this was coming. I'll put $50 that says inside of a year you see the first native born American citizen sent to El Salvador. \n\n\nThough I will admit they are likely to be some flavor of not white. And Maga will cheer it on.",
                "well since the supreme court basically put this whole program on judicial hold at about 1am est this morning, this person has extra time to contact the ACLU and get in on the massive class action lawsuit coming. \n\nThis kind of nazi garbage has to be done quickly, now that there are sticks in the spokes, I am optimistic that this can be stopped. \n\nWe are now waiting on the circuit courts rulings and the petition to the sup court from the solicitor general after. \n\nKeep putting the political and social pressure on this admin, and dont let the republicans try to pivot away and make people forget what they did!",
                "So when does the American military finally wake up and fulfill the oaths they took to defend your country from enemies foreign and DOMESTIC?",
                "Welcome to modern fascism, where a computer algorithm randomly picks you out for oppression. Maybe Leon Skum and the DOGE dipshits are behind this, or maybe it's puppy killer Noem's henchmen, but the end result is the same: this administration (regime) is arbitrarily and half-assedly targeting Americans in a blind exercise of pure cruelty.",
                "Typical. Daily incompetence from the Trump administration."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 5729,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "If not vaccinated [9 out of 10 people will contract measles after being exposed](https://www.cdc.gov/measles/about/index.html). \n\n\nThat doctor is a moron and superspreader.",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point.",
                "Are we playing Typhoid Mary again?",
                "RFK jr. Is the worm in americas brain. ",
                "Sigh. My brain autocorrected this to \"video shows doctor treating kids with measles\" and thought the surprising part was that RFK was actually showing respect for science based medicine. Well, turns out, that *would* have been more surprising."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US Supreme Court orders temporary halt to deportations of Venezuelan migrants",
            "external_url": "https://www.reuters.com/world/us/venezuelan-migrants-told-imminent-deportation-under-us-wartime-law-2025-04-18/",
            "upvotes": 13866,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are the consequences if this order is also ignored by the administration? Haven’t they been pathologically ignoring Supreme Court orders on this subject?",
                "If Trump ignores this order and the courts fail to hold his administration in contempt, the Supreme Court will have effectively lost its authority. The principle of equal but separate powers, a cornerstone of our democracy, will be dismantled.",
                "I disagree with some of the other comments here. This is the first ruling that has teeth and draws a line in the sand.\n\nThe last ruling was weakly worded, Administration will \"facilitate\" return.\n\nThis is definitive, and very, very clear.\n\n\"The Government is directed not to remove any member of the putative class of detainees from the United States until further order of this Court,\".\n\nIf the administration defies this order there is NO question about a constitutional crisis. This will one way or another cause things to come to a head.\n\nThis administration has pushed and pushed, however I think their card blanche is wearing off, and they know it. As the walked back tariffs on most of the world, and backed down from confrontations with Harvard and other Universities. Behind the scenes there is push back from the wealthy who ordered one brand of order, and got another.\n\nThey were pushing to get certain things done, and now their unified front of support is seeing cracks.\n\nI am not saying what will happen, I am saying this is pushing the line very far for some of their constitutionalist supporters and companies, that depend on the rule of law to be upheld at least at the supreme court level, even if it is bad law.",
                "Thomas and Alito dissent, of course.",
                "This order has teeth. Very good.  Clear line in the sand.\n\nWhat I think it’s the most interesting is the time. It’s 1am on the east coast when this dropped.",
                "In the middle of the night. 45 isn't going to sleep well",
                "I feel everyone is slowly realizing (which I don’t know why it has taken them so long) that if you give Trump an inch, he’ll go a mile. You have to hold firm like Harvard and now the admin is backing off of that.",
                "Of course, Thomas and Alito dissented",
                "Of course, the c*m stains Alito and Thomas dissented.",
                "Rubber meets the road now. "
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 18507,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                ">When reached by phone on Friday, Atallah said he was in Lebanon visiting family. He told CNN after his and wife’s treatment last week, he’s worried about returning to the U.S.\n\n>“I hope they don’t retaliate because I’m speaking out,” Atallah said.\n\n  \nReally worried for this guy. CBP has become so evil. Threatening a man by grabbing at your gun because he asked why he's being detained? what the fuck?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Russian ruble strengthens vs U.S. dollar, now up 40% since start of 2025",
            "external_url": "https://www.reuters.com/markets/currencies/russian-rouble-strengthens-past-81-vs-us-dollar-up-40-since-start-2025-2025-04-18/",
            "upvotes": 943,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Krasnov is doing the job Putin gave him.",
                "Trump isn't the only problem it's the entire Republican party",
                "Trump is a fucking economic genius. And by genius I mean he’s an absolute dumb ass. ",
                "\n\nIf a foreign nation was focused on more-or-less covertly damaging America's standing in the world, by damaging its economy, the dollar, public health, education, public safety, and its citizens' desire and ability to unify for the common good...\n\nHow would that look different from today?",
                "I’m sure that’s totally a coincidence NO COLLUSION!!",
                "Well of course. What else did you expect to happen from the Russian Agent acting President of the US",
                "Buy American, its the best investment ever. Putin did so in the GOP and look what its gotten him!",
                "Trump is Making Russia Great Again.\n\nAren’t we proud of his success?",
                "Just another stupid article, they print trillions of rubles to cover budget's deficit therefore inflation is through the roof, Russian central bank's interest rate is 21% (and they wanted to increase it but russian oligarchs are fighting against it), taxes are up, custom fees are up, various fines, government services are up too, there is no real exchange rate between ruble and dollar in Russia, they fully manipulate rates to slow down the inflation, don't listen to this dumb articles please.\n\n\"The Russian currency is up by over 40% against the dollar since the start of the year, mainly on expectation of easing of tensions between Russia and the United States.\"\n\nNo, they doing it to stop the inflation\n\n[https://ru.tradingeconomics.com/russia/money-supply-m2](https://ru.tradingeconomics.com/russia/money-supply-m2)\n\nHere you can see russian money supply m2 graph, check the numbers from february 2022 til now and you will see around 100% increase.\n\n\"The federal budget deficit in 2024 was estimated to be 3.485 trillion rubles (1.7% of GDP), the Ministry of Finance reported.\"\n\n\"The Russian budget deficit in January-March of 2025 amounted to 2.173 trillion rubles\"\n\nBut instead of this, reuters is trying to tell you that Russian ruble is doing great for some reason",
                "Making Russia Great Again"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 17960,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you. The terrorists want you to let your guard down so they can kidnap you in an unmarked vehicle and behead you.",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 6421,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "All else aside, who the hell designed that header graphic?",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "This is the longest Black Mirror episode ever. Where’s the remote?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "The icing on the cake is that his dumb face still has to be on the page. The guy absolutely cannot stop himself from making everything about him and seeking adulation. Amazing to watch the destruction of the American experiment all because Fred Trump couldn’t hug his kids and tell them they had value outside of how much money they make."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 61404,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "Uh huh. Now fucking enforce it.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 8940,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Please remember, this is the same administration that requested that the court take a recess on deciding whether to deport 239 people, and while the court was in recess, rushed those planes into the air, so they would be over international waters by the time recess was over, and then when the judge demanded that those planes stay on the ground, they said they could no longer do anything because they were already over international waters, and the judge's bench orders no longer had legal standing in international airspace.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Can we start figuring out who these agents are? They deserve to have their names be public."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Putin declares brief ‘Easter truce’ in war with Ukraine",
            "external_url": "https://www.cnn.com/2025/04/19/europe/russia-ukraine-war-easter-truce-intl?cid=ios_app",
            "upvotes": 264,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210066245.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Meaning that the assaults on the frontline will continue and that there will be missile attacks on Ukrainian cities again.\n\n  \nBusiness as usual then.",
                "So a bomb will drop sometime Easter Sunday.",
                "Need a truce while they advance their artillery.",
                "It’s nothing new - he announced the same thing during orthodox Christmas in 2023, and there was no ceasefire. \n  \nYou can’t just “declare” a truce, both sides have to agree. This is just a stunt so that trump could blame Ukraine once again.",
                "Wouldn't believe that for a microsecond if I were anyone in Ukraine",
                "Wouldn’t this suggest that they are the aggressor? If you can declare a truce in the war between two parties, and rather than requesting a brief truce between the two parties, you are the person that is causing the issue, not receiving the aggression.",
                "So magnaninous of him. But after Easter it's right back to killing children, so don't get too comfortable.",
                "Imagine bombing a country and killing thousands of people. And then be like, \"oh, it's Easter this Sunday. Hey, let's just chill and be cool for a day. You know, cause it's a holiday\"\n\nThat's not how that works 🤦‍♂️",
                "That means he will bomb churches.",
                "Watch out for the \"eggs\" the ruzzians are hiding.....they are grenades."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Orlando Police Seek Publics Help Identifying Persons of Interest in Orwin Manor Burglary and Assault Attempt",
            "external_url": "https://orlandonewtimes.com/orlando-police-seek-publics-help-identifying-persons-of-interest-in-orwin-manor-burglary-and-assault-attempt",
            "upvotes": 17,
            "date": "04/19/2025",
            "thumbnail": "https://assets.zyrosite.com/cdn-cgi/image/format=auto,w=1200,h=630,fit=crop,f=jpeg/YZ9xGo1QQ4t7LVxW/screenshot-2025-04-19-at-16-08-48-orlando-shooting-09-ht-jt-230805_1691258644117_hpmain_16x9t.jpg-jpeg-image-3072-a-1728-pixels-a-scaled-45_-Yyv90lbDEyuXeNZe.png",
            "top_comments": [
                "That site is absolute trash. Don't click the link",
                "Please tell me this isn't being downvoted just because \"cops bad!\"\n\nAnyway, I guess this sort of thing is always a reminder of what privileges I enjoy. In this case, not having to realistically worry about someone breaking into my home to rape me."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "Russian ruble strengthens vs U.S. dollar, now up 40% since start of 2025",
            "external_url": "https://www.reuters.com/markets/currencies/russian-rouble-strengthens-past-81-vs-us-dollar-up-40-since-start-2025-2025-04-18/",
            "upvotes": 952,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Krasnov is doing the job Putin gave him.",
                "Trump isn't the only problem it's the entire Republican party",
                "Trump is a fucking economic genius. And by genius I mean he’s an absolute dumb ass. ",
                "\n\nIf a foreign nation was focused on more-or-less covertly damaging America's standing in the world, by damaging its economy, the dollar, public health, education, public safety, and its citizens' desire and ability to unify for the common good...\n\nHow would that look different from today?",
                "I’m sure that’s totally a coincidence NO COLLUSION!!",
                "Well of course. What else did you expect to happen from the Russian Agent acting President of the US",
                "Buy American, its the best investment ever. Putin did so in the GOP and look what its gotten him!",
                "Trump is Making Russia Great Again.\n\nAren’t we proud of his success?",
                "Just another stupid article, they print trillions of rubles to cover budget's deficit therefore inflation is through the roof, Russian central bank's interest rate is 21% (and they wanted to increase it but russian oligarchs are fighting against it), taxes are up, custom fees are up, various fines, government services are up too, there is no real exchange rate between ruble and dollar in Russia, they fully manipulate rates to slow down the inflation, don't listen to this dumb articles please.\n\n\"The Russian currency is up by over 40% against the dollar since the start of the year, mainly on expectation of easing of tensions between Russia and the United States.\"\n\nNo, they doing it to stop the inflation\n\n[https://ru.tradingeconomics.com/russia/money-supply-m2](https://ru.tradingeconomics.com/russia/money-supply-m2)\n\nHere you can see russian money supply m2 graph, check the numbers from february 2022 til now and you will see around 100% increase.\n\n\"The federal budget deficit in 2024 was estimated to be 3.485 trillion rubles (1.7% of GDP), the Ministry of Finance reported.\"\n\n\"The Russian budget deficit in January-March of 2025 amounted to 2.173 trillion rubles\"\n\nBut instead of this, reuters is trying to tell you that Russian ruble is doing great for some reason",
                "Making Russia Great Again"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Putin declares brief ‘Easter truce’ in war with Ukraine",
            "external_url": "https://www.cnn.com/2025/04/19/europe/russia-ukraine-war-easter-truce-intl?cid=ios_app",
            "upvotes": 268,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210066245.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Meaning that the assaults on the frontline will continue and that there will be missile attacks on Ukrainian cities again.\n\n  \nBusiness as usual then.",
                "So a bomb will drop sometime Easter Sunday.",
                "Need a truce while they advance their artillery.",
                "It’s nothing new - he announced the same thing during orthodox Christmas in 2023, and there was no ceasefire. \n  \nYou can’t just “declare” a truce, both sides have to agree. This is just a stunt so that trump could blame Ukraine once again.",
                "Wouldn't believe that for a microsecond if I were anyone in Ukraine",
                "Wouldn’t this suggest that they are the aggressor? If you can declare a truce in the war between two parties, and rather than requesting a brief truce between the two parties, you are the person that is causing the issue, not receiving the aggression.",
                "So magnaninous of him. But after Easter it's right back to killing children, so don't get too comfortable.",
                "Imagine bombing a country and killing thousands of people. And then be like, \"oh, it's Easter this Sunday. Hey, let's just chill and be cool for a day. You know, cause it's a holiday\"\n\nThat's not how that works 🤦‍♂️",
                "That means he will bomb churches.",
                "Watch out for the \"eggs\" the ruzzians are hiding.....they are grenades."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "American born doctor receives email from immigration officials telling her to leave the country immediately",
            "external_url": "https://www.nbcnews.com/news/rcna201698",
            "upvotes": 5489,
            "date": "04/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250417-lisa-anderson-mn-0900-993ef5.jpg",
            "top_comments": [
                "When incompetence meets abject cruelty, this is the result.",
                "So, there's two additional things to worry about.\n\n1) the government is sending out deportation emails without checking.\n\n2) ICE has shown a willingness to grab everyone nearby and deport them without checking.\n\nIt almost doesn't matter if you're a US citizen because no one will ever actually try to verify if you're the right person.",
                "This is the same system determining who goes to the gulag. And we see how well that works when they fuck up.",
                "When will enough people wake up? Or is it too late?",
                "Where are they going to deport her? To Narnia?",
                "I said as soon as he got elected this was coming. I'll put $50 that says inside of a year you see the first native born American citizen sent to El Salvador. \n\n\nThough I will admit they are likely to be some flavor of not white. And Maga will cheer it on.",
                "well since the supreme court basically put this whole program on judicial hold at about 1am est this morning, this person has extra time to contact the ACLU and get in on the massive class action lawsuit coming. \n\nThis kind of nazi garbage has to be done quickly, now that there are sticks in the spokes, I am optimistic that this can be stopped. \n\nWe are now waiting on the circuit courts rulings and the petition to the sup court from the solicitor general after. \n\nKeep putting the political and social pressure on this admin, and dont let the republicans try to pivot away and make people forget what they did!",
                "So when does the American military finally wake up and fulfill the oaths they took to defend your country from enemies foreign and DOMESTIC?",
                "Welcome to modern fascism, where a computer algorithm randomly picks you out for oppression. Maybe Leon Skum and the DOGE dipshits are behind this, or maybe it's puppy killer Noem's henchmen, but the end result is the same: this administration (regime) is arbitrarily and half-assedly targeting Americans in a blind exercise of pure cruelty.",
                "Typical. Daily incompetence from the Trump administration."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 5732,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "If not vaccinated [9 out of 10 people will contract measles after being exposed](https://www.cdc.gov/measles/about/index.html). \n\n\nThat doctor is a moron and superspreader.",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point.",
                "Are we playing Typhoid Mary again?",
                "RFK jr. Is the worm in americas brain. ",
                "Sigh. My brain autocorrected this to \"video shows doctor treating kids with measles\" and thought the surprising part was that RFK was actually showing respect for science based medicine. Well, turns out, that *would* have been more surprising."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Iran, U.S. to hold talks in Rome in bid to reach nuclear deal",
            "external_url": "https://www.thehindu.com/news/international/iran-us-nuclear-deal-talk-second-round-rome-updates/article69467231.ece",
            "upvotes": 157,
            "date": "04/19/2025",
            "thumbnail": "https://th-i.thgim.com/public/incoming/237a0c/article69468144.ece/alternates/LANDSCAPE_1200/2025-04-19T120349Z_1507950875_RC201EACQBHK_RTRMADP_3_IRAN-NUCLEAR-USA.JPG",
            "top_comments": [
                "They’ll reach a deal equivalent or, most likely, worse than the one he ripped up and claim a win.",
                "He shitcanned the old deal just because it was an Obama win. Petty motherfucker.",
                "We did have a deal with Iran, but Trump threw it away 8 years ago because he’s an orange 🤡",
                "For a president who doesn't negotiate with terrorist, he certainly has a way of recognizing North Korea, Russia, and now Iran.",
                "How do you make a deal with someone who is constantly lying?",
                "How long till Trump finds out this one is hard too, and walks away?",
                "It's only a matter of time before Iran gets a nuke, or full on war happens to prevent it. Any deal at this point is just to save face to remove public culpability. I don't want anyone to have such powerful weapons, but how could you blame any country for not wanting their \"make peace\" equalizer? ",
                "Any deal must include IAEA inspection and disarmament of Israel’s program",
                "Earlier this week...\n\nTrump official: \"...and we will be meeting with representatives from Iran to discuss their nuclear policy...\"\n\nIranian official: \"This is news to us, though we welcome discourse. Just in case, the meeting will be in Rome... where even the American Idiot won't dare send a strike.\"\n\nTrump: \"They don't know me too well, do they?\"",
                "So something later and worse than the one Obama made?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Families displaced after fatal house explosion",
            "external_url": "https://www.bbc.com/news/articles/cx27n8g70deo",
            "upvotes": 91,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/faa7/live/9f0459c0-1bad-11f0-986e-ef151aa9adb2.png",
            "top_comments": [
                "Damn, someone wanted that dude dead. Blew up the whole block."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US Supreme Court orders temporary halt to deportations of Venezuelan migrants",
            "external_url": "https://www.reuters.com/world/us/venezuelan-migrants-told-imminent-deportation-under-us-wartime-law-2025-04-18/",
            "upvotes": 13869,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are the consequences if this order is also ignored by the administration? Haven’t they been pathologically ignoring Supreme Court orders on this subject?",
                "If Trump ignores this order and the courts fail to hold his administration in contempt, the Supreme Court will have effectively lost its authority. The principle of equal but separate powers, a cornerstone of our democracy, will be dismantled.",
                "I disagree with some of the other comments here. This is the first ruling that has teeth and draws a line in the sand.\n\nThe last ruling was weakly worded, Administration will \"facilitate\" return.\n\nThis is definitive, and very, very clear.\n\n\"The Government is directed not to remove any member of the putative class of detainees from the United States until further order of this Court,\".\n\nIf the administration defies this order there is NO question about a constitutional crisis. This will one way or another cause things to come to a head.\n\nThis administration has pushed and pushed, however I think their card blanche is wearing off, and they know it. As the walked back tariffs on most of the world, and backed down from confrontations with Harvard and other Universities. Behind the scenes there is push back from the wealthy who ordered one brand of order, and got another.\n\nThey were pushing to get certain things done, and now their unified front of support is seeing cracks.\n\nI am not saying what will happen, I am saying this is pushing the line very far for some of their constitutionalist supporters and companies, that depend on the rule of law to be upheld at least at the supreme court level, even if it is bad law.",
                "Thomas and Alito dissent, of course.",
                "This order has teeth. Very good.  Clear line in the sand.\n\nWhat I think it’s the most interesting is the time. It’s 1am on the east coast when this dropped.",
                "In the middle of the night. 45 isn't going to sleep well",
                "I feel everyone is slowly realizing (which I don’t know why it has taken them so long) that if you give Trump an inch, he’ll go a mile. You have to hold firm like Harvard and now the admin is backing off of that.",
                "Of course, Thomas and Alito dissented",
                "Of course, the c*m stains Alito and Thomas dissented.",
                "Rubber meets the road now. "
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 18510,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                ">When reached by phone on Friday, Atallah said he was in Lebanon visiting family. He told CNN after his and wife’s treatment last week, he’s worried about returning to the U.S.\n\n>“I hope they don’t retaliate because I’m speaking out,” Atallah said.\n\n  \nReally worried for this guy. CBP has become so evil. Threatening a man by grabbing at your gun because he asked why he's being detained? what the fuck?"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Russia sentences 19-year-old woman to nearly three years in a penal colony after poetic anti-war protest | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/europe/darya-kozyreva-russia-penal-colony-war-protest-intl-latam/index.html",
            "upvotes": 2066,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-18t133533z-372888836-rc2a0eak3wdb-rtrmadp-3-ukraine-crisis-russia-court.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Coming soon to a state near you.",
                "*Oh bury me, then rise ye up\nAnd break your heavy chains\nAnd water with the tyrants’ blood \nThe freedom you have gained,*\n\n\nBrave woman, standing on principle. If everyone, or even just enough people, were like her, tyranny would be impossible.",
                "Our administration wouldn't recognize poetry if it slapped them across the face, so we should be safe.",
                "Trump: Write that down! Write that down!",
                "Sebastian Gorka wants the same for Americans in America.",
                "I hope I have her character once things get that bad here",
                "If anybody doesn't think the same thing can happen here in the US under the Trump administration they are kidding themselves.",
                "How long until Amerika starts to do the same under the despot tRump?",
                "Sounds like Trump's US.",
                "Well now they've brought more attention to her poem."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Russian ruble strengthens vs U.S. dollar, now up 40% since start of 2025",
            "external_url": "https://www.reuters.com/markets/currencies/russian-rouble-strengthens-past-81-vs-us-dollar-up-40-since-start-2025-2025-04-18/",
            "upvotes": 948,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Krasnov is doing the job Putin gave him.",
                "Trump isn't the only problem it's the entire Republican party",
                "Trump is a fucking economic genius. And by genius I mean he’s an absolute dumb ass. ",
                "\n\nIf a foreign nation was focused on more-or-less covertly damaging America's standing in the world, by damaging its economy, the dollar, public health, education, public safety, and its citizens' desire and ability to unify for the common good...\n\nHow would that look different from today?",
                "I’m sure that’s totally a coincidence NO COLLUSION!!",
                "Well of course. What else did you expect to happen from the Russian Agent acting President of the US",
                "Buy American, its the best investment ever. Putin did so in the GOP and look what its gotten him!",
                "Trump is Making Russia Great Again.\n\nAren’t we proud of his success?",
                "Just another stupid article, they print trillions of rubles to cover budget's deficit therefore inflation is through the roof, Russian central bank's interest rate is 21% (and they wanted to increase it but russian oligarchs are fighting against it), taxes are up, custom fees are up, various fines, government services are up too, there is no real exchange rate between ruble and dollar in Russia, they fully manipulate rates to slow down the inflation, don't listen to this dumb articles please.\n\n\"The Russian currency is up by over 40% against the dollar since the start of the year, mainly on expectation of easing of tensions between Russia and the United States.\"\n\nNo, they doing it to stop the inflation\n\n[https://ru.tradingeconomics.com/russia/money-supply-m2](https://ru.tradingeconomics.com/russia/money-supply-m2)\n\nHere you can see russian money supply m2 graph, check the numbers from february 2022 til now and you will see around 100% increase.\n\n\"The federal budget deficit in 2024 was estimated to be 3.485 trillion rubles (1.7% of GDP), the Ministry of Finance reported.\"\n\n\"The Russian budget deficit in January-March of 2025 amounted to 2.173 trillion rubles\"\n\nBut instead of this, reuters is trying to tell you that Russian ruble is doing great for some reason",
                "Making Russia Great Again"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "American born doctor receives email from immigration officials telling her to leave the country immediately",
            "external_url": "https://www.nbcnews.com/news/rcna201698",
            "upvotes": 5489,
            "date": "04/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250417-lisa-anderson-mn-0900-993ef5.jpg",
            "top_comments": [
                "When incompetence meets abject cruelty, this is the result.",
                "So, there's two additional things to worry about.\n\n1) the government is sending out deportation emails without checking.\n\n2) ICE has shown a willingness to grab everyone nearby and deport them without checking.\n\nIt almost doesn't matter if you're a US citizen because no one will ever actually try to verify if you're the right person.",
                "This is the same system determining who goes to the gulag. And we see how well that works when they fuck up.",
                "When will enough people wake up? Or is it too late?",
                "Where are they going to deport her? To Narnia?",
                "I said as soon as he got elected this was coming. I'll put $50 that says inside of a year you see the first native born American citizen sent to El Salvador. \n\n\nThough I will admit they are likely to be some flavor of not white. And Maga will cheer it on.",
                "well since the supreme court basically put this whole program on judicial hold at about 1am est this morning, this person has extra time to contact the ACLU and get in on the massive class action lawsuit coming. \n\nThis kind of nazi garbage has to be done quickly, now that there are sticks in the spokes, I am optimistic that this can be stopped. \n\nWe are now waiting on the circuit courts rulings and the petition to the sup court from the solicitor general after. \n\nKeep putting the political and social pressure on this admin, and dont let the republicans try to pivot away and make people forget what they did!",
                "So when does the American military finally wake up and fulfill the oaths they took to defend your country from enemies foreign and DOMESTIC?",
                "Welcome to modern fascism, where a computer algorithm randomly picks you out for oppression. Maybe Leon Skum and the DOGE dipshits are behind this, or maybe it's puppy killer Noem's henchmen, but the end result is the same: this administration (regime) is arbitrarily and half-assedly targeting Americans in a blind exercise of pure cruelty.",
                "Typical. Daily incompetence from the Trump administration."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 5734,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "If not vaccinated [9 out of 10 people will contract measles after being exposed](https://www.cdc.gov/measles/about/index.html). \n\n\nThat doctor is a moron and superspreader.",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point.",
                "Are we playing Typhoid Mary again?",
                "RFK jr. Is the worm in americas brain. ",
                "Sigh. My brain autocorrected this to \"video shows doctor treating kids with measles\" and thought the surprising part was that RFK was actually showing respect for science based medicine. Well, turns out, that *would* have been more surprising."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "RISING",
            "title": "Putin declares brief ‘Easter truce’ in war with Ukraine",
            "external_url": "https://www.cnn.com/2025/04/19/europe/russia-ukraine-war-easter-truce-intl?cid=ios_app",
            "upvotes": 267,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210066245.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Meaning that the assaults on the frontline will continue and that there will be missile attacks on Ukrainian cities again.\n\n  \nBusiness as usual then.",
                "So a bomb will drop sometime Easter Sunday.",
                "Need a truce while they advance their artillery.",
                "It’s nothing new - he announced the same thing during orthodox Christmas in 2023, and there was no ceasefire. \n  \nYou can’t just “declare” a truce, both sides have to agree. This is just a stunt so that trump could blame Ukraine once again.",
                "Wouldn't believe that for a microsecond if I were anyone in Ukraine",
                "Wouldn’t this suggest that they are the aggressor? If you can declare a truce in the war between two parties, and rather than requesting a brief truce between the two parties, you are the person that is causing the issue, not receiving the aggression.",
                "So magnaninous of him. But after Easter it's right back to killing children, so don't get too comfortable.",
                "Imagine bombing a country and killing thousands of people. And then be like, \"oh, it's Easter this Sunday. Hey, let's just chill and be cool for a day. You know, cause it's a holiday\"\n\nThat's not how that works 🤦‍♂️",
                "That means he will bomb churches.",
                "Watch out for the \"eggs\" the ruzzians are hiding.....they are grenades."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court orders temporary halt to deportations of Venezuelan migrants",
            "external_url": "https://www.reuters.com/world/us/venezuelan-migrants-told-imminent-deportation-under-us-wartime-law-2025-04-18/",
            "upvotes": 13874,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are the consequences if this order is also ignored by the administration? Haven’t they been pathologically ignoring Supreme Court orders on this subject?",
                "If Trump ignores this order and the courts fail to hold his administration in contempt, the Supreme Court will have effectively lost its authority. The principle of equal but separate powers, a cornerstone of our democracy, will be dismantled.",
                "I disagree with some of the other comments here. This is the first ruling that has teeth and draws a line in the sand.\n\nThe last ruling was weakly worded, Administration will \"facilitate\" return.\n\nThis is definitive, and very, very clear.\n\n\"The Government is directed not to remove any member of the putative class of detainees from the United States until further order of this Court,\".\n\nIf the administration defies this order there is NO question about a constitutional crisis. This will one way or another cause things to come to a head.\n\nThis administration has pushed and pushed, however I think their card blanche is wearing off, and they know it. As the walked back tariffs on most of the world, and backed down from confrontations with Harvard and other Universities. Behind the scenes there is push back from the wealthy who ordered one brand of order, and got another.\n\nThey were pushing to get certain things done, and now their unified front of support is seeing cracks.\n\nI am not saying what will happen, I am saying this is pushing the line very far for some of their constitutionalist supporters and companies, that depend on the rule of law to be upheld at least at the supreme court level, even if it is bad law.",
                "Thomas and Alito dissent, of course.",
                "This order has teeth. Very good.  Clear line in the sand.\n\nWhat I think it’s the most interesting is the time. It’s 1am on the east coast when this dropped.",
                "In the middle of the night. 45 isn't going to sleep well",
                "I feel everyone is slowly realizing (which I don’t know why it has taken them so long) that if you give Trump an inch, he’ll go a mile. You have to hold firm like Harvard and now the admin is backing off of that.",
                "Of course, Thomas and Alito dissented",
                "Of course, the c*m stains Alito and Thomas dissented.",
                "Rubber meets the road now. "
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 18511,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                ">When reached by phone on Friday, Atallah said he was in Lebanon visiting family. He told CNN after his and wife’s treatment last week, he’s worried about returning to the U.S.\n\n>“I hope they don’t retaliate because I’m speaking out,” Atallah said.\n\n  \nReally worried for this guy. CBP has become so evil. Threatening a man by grabbing at your gun because he asked why he's being detained? what the fuck?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 17959,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you. The terrorists want you to let your guard down so they can kidnap you in an unmarked vehicle and behead you.",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 6422,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "All else aside, who the hell designed that header graphic?",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "This is the longest Black Mirror episode ever. Where’s the remote?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "The icing on the cake is that his dumb face still has to be on the page. The guy absolutely cannot stop himself from making everything about him and seeking adulation. Amazing to watch the destruction of the American experiment all because Fred Trump couldn’t hug his kids and tell them they had value outside of how much money they make."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 61399,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "Uh huh. Now fucking enforce it.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON."
            ],
            "aggregate_sentiment": 87.0
        },
        {
            "category": "RISING",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 8934,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Please remember, this is the same administration that requested that the court take a recess on deciding whether to deport 239 people, and while the court was in recess, rushed those planes into the air, so they would be over international waters by the time recess was over, and then when the judge demanded that those planes stay on the ground, they said they could no longer do anything because they were already over international waters, and the judge's bench orders no longer had legal standing in international airspace.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Can we start figuring out who these agents are? They deserve to have their names be public."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/19/2025 16:08:49 UTC"
}