{
    "posts": [
        {
            "category": "HOT",
            "title": "French paedophile surgeon who abused hundreds sentenced to 20 years in jail.",
            "external_url": "https://www.bbc.com/news/articles/cvgdkyge198o",
            "upvotes": 2233,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7cd7/live/db9f8ae0-3bb9-11f0-91a0-abc9c23352d4.jpg",
            "top_comments": [
                "They caught him because he journaled about the abuse in extreme detail. I think that's the part of this that disturbs me the most, the fact that he kept a personal record of what he did and to whom he did it, complete with enough detail that police were able to easily find and notify his victims.",
                "20 years for sexual assault of hundreds of children feels light but he's 74.  He should never be free but at his age 20 years is basically life in prison.",
                "My heart goes out to all the victims, such a horrific story. All those who knew or were aware in their community and in the medical establishment should be so ashamed they allowed this to continue. I am glad the victims finally have some sense of closure and were able to support each other throughout the court proceedings, the one light to come out of such a pitch black case.",
                "It’s terrible what people do to children, especially when they are in a position of trust and they abuse it to push their own beliefs and desires over the child’s best interest",
                "In France if you kill or rape 20 people, you’ll only be sentenced to the maximum time, you’ve been condemned for one case.\n\nLet’s say you received a 15 years sentence for the first victim, and 8 years for a second one, you’ll go to jail for 15 years (the maximum amount time received)",
                "With a 20 year sentence, he's likely to die before seeing freedom. But it provides no sense of security, comfort, or justice to his victims, who will suffer lifelong consequences because of his sick and evil actions.",
                "Should’ve been the wood chipper",
                "This is even worse than standard pedophile considering the damage to the medical world reputation. Fucking piece of human trash.",
                "Twenty years for almost 300 child rapes across a decade? What a way to advertise themselves as the most lenient country for pedophiles. Punishments are supposed to be a deterrent, not a tourism selling point.",
                "I’m looking over the details and I’m very confused. He wasn’t a drag queen or trans so how could a straight white man in a position of authority be a pedophile? /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FEMA rescinds strategic plan less than 2 weeks before hurricane season",
            "external_url": "https://www.cbsnews.com/news/fema-rescinds-strategic-plan-less-than-2-weeks-before-hurricane-season/",
            "upvotes": 1769,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/21/72a084e2-608f-46ff-ab86-137b692838a3/thumbnail/1200x630/b554101e1ecdce606b889b227cb90283/ap25128165711233.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "Hey Florida, guess what's about to happen..",
                "I always feel bad for the voters in these red states that literally did not vote for this. About 4.7 million Floridians voted for Kamala. Those folks also all bear the brunt of the other side’s short-sightedness. These states are purple. Not red or blue. There is no “mandate,” only madness.",
                "Fucking. Egomaniac. MAGA. Assholes",
                "Oh no, all those voters are nearing the Find Out phase, ah geez.",
                "They mention a \"smaller footprint\".  FEMA used to cover the entire United States.  I wonder if they mean that only red states will get aid or nobody will?  Does anyone think they will come up with a new strategic plan or just fold like a cheap suit?",
                "Is there a word for when you're intentionally incompetent with the purpose of watching poor people die for amusement?",
                "I’m confused. Did the article confirm there is no official FEMA plans yet because the last ones were set to expire? And that their new plans aren’t intended to be revealed until after the summer?",
                "\"The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees\"\n\nI love how all these assholes don't know how to read and have the attention spans of goldfish.",
                ">The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees. \n\nShould it also includes pictures so that perhaps Mango could understand it if he even looked at it? What even is this kind of rule?",
                "These MAGA assholes are killing people in ways they can “morally justify” to themselves because they’re not doing it directly. This will cost lives. Fucking idiots."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ex-UFC star BJ Penn arrested on family abuse charges in Hawaii",
            "external_url": "https://www.espn.com/mma/story/_/id/45353400/ex-ufc-star-bj-penn-faces-family-abuse-charges-hawaii",
            "upvotes": 1069,
            "date": "05/28/2025",
            "thumbnail": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0801%2Fr577751_1296x729_16%2D9.jpg",
            "top_comments": [
                "This guy is going to do something absolutely horrific. He believes his mother was replaced and not his actual “mother”. \n\nHe very much has CTE and he’s not going to get better unfortunately.",
                "Penn \"recently claimed online that multiple members of his family are missing. He has accused unnamed imposters of replacing those family members in an effort to steal his inheritance\"\n\nThat's really bad and this guy needs help ASAP.",
                "In the next few years, it's going to become clearer and clearer just how brutal MMA is to fighters' brains. It's getting sad to be a longtime fan, and seeing your heroes go out like this.",
                "Kind of terrifying it took this long. He’s been making the statements & threats for a while. Hope he gets the help he needs.",
                "I met him when I lived in Hawaii about fifteen years ago and he didn't seem \"right\" then. Ironically it was at an army mma event so there was plenty of CTE going around so he fit in perfectly.",
                "It was very apparent this guy is not mentally all there when he was on Joe Rogan with Tulsi Gabbard not too long ago",
                "I hope he gets the help he needs. It's obvious he's suffered some CTE.",
                "The rise of UFC has been awful for society. It’s giving the worst types of people fame and money and a long leash to be pieces of shit, and the beatings they take in the sport only create more of these people.",
                "He’s clearly suffering from Capgras Syndrome and has been for a while.",
                "Bj was always nuts. I grew up the same town."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Delta flight erupts into chaos as pigeons fly around main cabin",
            "external_url": "https://www.nbcnews.com/news/us-news/delta-flight-erupts-chaos-pigeons-fly-main-cabin-rcna209400",
            "upvotes": 1275,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-Pigeon-flight-RS-674959.jpg",
            "top_comments": [
                "According to an Instagram post from another passenger, Tom Caw was the passenger who spotted the first pigeon before the plane departed from Minneapolis-Saint Paul International Airport. Caw said the pilot announced the pigeon sighting and returned the plane to the gate to have the bird removed.\n\nAs the flight taxied out to take off again, a second pigeon emerged and flew down the main aisle of the cabin, video Caw posted on Instagram and NBC News obtained shows. The bird prompted several passengers to scream.",
                "Clearly the first officer just didn’t feel comfortable enough to speak up and ask the pilot to not bring pigeons onto the plane.",
                "Snakes on a Plane sequel is looking wild.",
                "Homing pigeons just taking shortcuts now?",
                "Sir, a second pigeon has hit the cabin",
                "Damn I really have to catch up on The Rehearsal.",
                "Me to my wife: “see, this is why I need that magician costume. What a perfect time to yell out “ta da!””\n\nMy wife: *eye roll*",
                "It is my emotional support pigeon and I can't fly without it!",
                "Seriously. No mention on how they got aboard?",
                "DELTA: \"Sorry to do this to you but we have to charge you all for the extra two flights...\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 822,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How is that even possible?!? What a broken system!",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "You see, that 92 year-old could've been a serious threat...",
                "\"He was impossible to control!\"\n\n\n*While being interviewed at Planet Fitness doing 200# bench presses.",
                "all i would have needed is a block of wood and some gardening gloves",
                "Some of those who work forces are the same who burn crosses.",
                "Not like one of the officers could get behind him, hold his arm, and the other take the knife away.  Two kids could have done that.",
                "Maybe cops would stop shooting and abusing innocent people if we actually punished them for it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Aldi and Lidl fight price war in Germany",
            "external_url": "https://www.retaildetail.eu/news/food/aldi-and-lidl-fight-price-war-in-germany/",
            "upvotes": 2064,
            "date": "05/28/2025",
            "thumbnail": "https://www.retaildetail.eu/wp-content/uploads/sites/2/2025/05/shutterstock_1092014636-aldi-lidl.jpg",
            "top_comments": [
                "Good for us consumers 👍🏼",
                "Meanwhile in Australia Coles and Woolies collude for higher prices and lower wages.\n\nDisappointed Lidl didn't break in to the Aussie market",
                "Luckily here theyre fighting about who can increase prices the most ...",
                "I don't even have either of those two nearby. I only have Edeka and Rewe, and both of them are stupidly expensive.\n\nTo clarify: I'm talking about vegetables and fruits.",
                "So this is basically an ad.",
                "Like stores should be doing, instead of collectively raising prices...",
                "Why can’t we have this in America. They’re fighting over who gets to charge more and people are lining up to decide who gets to pay more. I hate it here.",
                "In the UK Sainsburys and Tesco fight price war to see who can charge the most.",
                "That's an acceptable war",
                "Please come to Greece and start a price war."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 14567,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Another reminder that for ICE, an asylum hearing is a perfectly safe place to get their numbers up. No dangerous drug dealers with guns, no rapists, no murderers or thugs, just honest people trying to obey the law. Easy pickings.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "How many of these are we not hearing about? Because it seems like we're seeing multiple a day.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "America is a dystopian nightmare."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 583,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "56% of votes were for this.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Can't you see the golden age Donnie promised is coming?",
                "Did the tariffs actually start? ",
                "We're winning so hard right now!",
                "Oh well, I got food so I don’t care about them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 30483,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Its not corruption if its out in the open, right?",
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                "Can we collectively pay Trump to go fuck himself?",
                "Well, now you know how much a pardon costs.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "Before dessert, they all lined up and sat on his lap and told him what they wanted for Christmas",
                "Launch DOGE to find government fraud,  pardons a guy that committed actual tax fraud.  Makes sense",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years.",
                "Oh and of course he's a nursing home executive. Might as well own a payday loan business.\n\nEdit: *and he shorted the healthcare workers' paychecks to buy himself a fucking yacht.*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Violent break-in at Beanie Babies mogul Ty Warner's California home left woman in coma: DA",
            "external_url": "https://abcnews.go.com/US/beanie-babies-mogul-ty-warner-california-home-invasion/story?id=122249852",
            "upvotes": 521,
            "date": "05/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/04fa225b-8ba6-48c3-976e-32d88887436d/beanie-babies_1748391049310_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "A Nevada man now faces multiple charges, including attempted murder, in connection with the home invasion and assault, according to the Santa Barbara County District Attorney's Office.\n\nThe incident unfolded on May 21 at the Montecito home of Warner, according to court filings obtained by ABC News.",
                "The victim — identified in the criminal complaint as L. Malek-Aslanian — was transported by ambulance to a local hospital. The attack left her “comatose due to brain injury,” the complaint stated.\n\nThe complaint alleges that Phay entered the mansion with the intent to burglarize it, then held Malek-Aslanian against her will and assaulted her, causing great bodily injury. The victim was “particularly vulnerable,” the complaint stated.",
                "The article doesn’t mention who the woman is at all.",
                "Did anyone watch the video on that site?  That newsreader's voice is so unsettling I thought it was AI.  It has to be AI.",
                "> Beanie Babies mogul\n\n\nThat should not be an actual thing.",
                "Not lying here my first thoughts were oh great some guy who couldn't give up on beenie babie investment. However after reading the article umm it would have been funnier it was but dang the poor woman. hope she pulls through."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "In first-ever operational use, Israel reveals it shot down Hezbollah drones with laser air defense system",
            "external_url": "https://www.ynetnews.com/article/ryq5yjezex",
            "upvotes": 1,
            "date": "05/28/2025",
            "thumbnail": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/05/28/B1bktFjVGeg/B1bktFjVGeg_0_0_1600_900_0_large.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 583,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "56% of votes were for this.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Can't you see the golden age Donnie promised is coming?",
                "Did the tariffs actually start? ",
                "We're winning so hard right now!",
                "Oh well, I got food so I don’t care about them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 821,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How is that even possible?!? What a broken system!",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "You see, that 92 year-old could've been a serious threat...",
                "\"He was impossible to control!\"\n\n\n*While being interviewed at Planet Fitness doing 200# bench presses.",
                "all i would have needed is a block of wood and some gardening gloves",
                "Some of those who work forces are the same who burn crosses.",
                "Not like one of the officers could get behind him, hold his arm, and the other take the knife away.  Two kids could have done that.",
                "Maybe cops would stop shooting and abusing innocent people if we actually punished them for it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ex-UFC star BJ Penn arrested on family abuse charges in Hawaii",
            "external_url": "https://www.espn.com/mma/story/_/id/45353400/ex-ufc-star-bj-penn-faces-family-abuse-charges-hawaii",
            "upvotes": 1073,
            "date": "05/28/2025",
            "thumbnail": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0801%2Fr577751_1296x729_16%2D9.jpg",
            "top_comments": [
                "This guy is going to do something absolutely horrific. He believes his mother was replaced and not his actual “mother”. \n\nHe very much has CTE and he’s not going to get better unfortunately.",
                "Penn \"recently claimed online that multiple members of his family are missing. He has accused unnamed imposters of replacing those family members in an effort to steal his inheritance\"\n\nThat's really bad and this guy needs help ASAP.",
                "In the next few years, it's going to become clearer and clearer just how brutal MMA is to fighters' brains. It's getting sad to be a longtime fan, and seeing your heroes go out like this.",
                "Kind of terrifying it took this long. He’s been making the statements & threats for a while. Hope he gets the help he needs.",
                "I met him when I lived in Hawaii about fifteen years ago and he didn't seem \"right\" then. Ironically it was at an army mma event so there was plenty of CTE going around so he fit in perfectly.",
                "It was very apparent this guy is not mentally all there when he was on Joe Rogan with Tulsi Gabbard not too long ago",
                "I hope he gets the help he needs. It's obvious he's suffered some CTE.",
                "The rise of UFC has been awful for society. It’s giving the worst types of people fame and money and a long leash to be pieces of shit, and the beatings they take in the sport only create more of these people.",
                "He’s clearly suffering from Capgras Syndrome and has been for a while.",
                "Bj was always nuts. I grew up the same town."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FEMA rescinds strategic plan less than 2 weeks before hurricane season",
            "external_url": "https://www.cbsnews.com/news/fema-rescinds-strategic-plan-less-than-2-weeks-before-hurricane-season/",
            "upvotes": 1771,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/21/72a084e2-608f-46ff-ab86-137b692838a3/thumbnail/1200x630/b554101e1ecdce606b889b227cb90283/ap25128165711233.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "Hey Florida, guess what's about to happen..",
                "I always feel bad for the voters in these red states that literally did not vote for this. About 4.7 million Floridians voted for Kamala. Those folks also all bear the brunt of the other side’s short-sightedness. These states are purple. Not red or blue. There is no “mandate,” only madness.",
                "Fucking. Egomaniac. MAGA. Assholes",
                "Oh no, all those voters are nearing the Find Out phase, ah geez.",
                "They mention a \"smaller footprint\".  FEMA used to cover the entire United States.  I wonder if they mean that only red states will get aid or nobody will?  Does anyone think they will come up with a new strategic plan or just fold like a cheap suit?",
                "Is there a word for when you're intentionally incompetent with the purpose of watching poor people die for amusement?",
                "I’m confused. Did the article confirm there is no official FEMA plans yet because the last ones were set to expire? And that their new plans aren’t intended to be revealed until after the summer?",
                "\"The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees\"\n\nI love how all these assholes don't know how to read and have the attention spans of goldfish.",
                ">The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees. \n\nShould it also includes pictures so that perhaps Mango could understand it if he even looked at it? What even is this kind of rule?",
                "These MAGA assholes are killing people in ways they can “morally justify” to themselves because they’re not doing it directly. This will cost lives. Fucking idiots."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Slovakia approves sale of brown bear meat to public",
            "external_url": "https://www.bbc.com/news/articles/c4gkpy3x3ndo",
            "upvotes": 82,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2bca/live/10009d80-3b9f-11f0-8881-91fcaa07de15.jpg",
            "top_comments": [
                "[Family infected with brain worms after eating bear meat](https://www.usatoday.com/story/news/nation/2024/05/25/brain-worms-black-bear-meat/73853429007/). About a third of all bears carry parasitic worms.",
                ">In April, a man was mauled to death while walking in a forest in Central Slovakia.\n\n>Shortly after, Prime Minister Robert Fico announced the cull, saying: \"We can't live in a country where people are afraid to go into the woods.\"\n\nI dunno. There's fewer 'wild' places left. Maybe we should be afraid to go into the woods. I feel bad for the guy but the woods aren't our home. \n\nOn the flip side, I would like to try some bear meat. One of the things I'm looking forward to is widely available lab grown meat. Then bear meat, panda steaks and penguin McNuggets will be part of my diet.",
                "Can you already hear RFKs plane coming in?",
                "Does this mean \"Russian flavored\" soylent green?",
                "As someone who’s eaten black bear, all I can say is gross. ",
                "Eww, that meat is NOT worth the kill. It's literally less than a pound of usable meat. Carnivore meat is the worst meat to eat.",
                "It probably doesnt even taste good",
                "Bear meat is super hazardous to eat",
                "Maybe we should start selling human meat, lord knows there's fucking plenty of us walking around. There are bears in the woods, carry some mace if you're that worried. Or better yet, cut down all the trees and turn what little natural habitat we have left into a giant Walmart parking lot. Nice and safe, just like we love.\n\nThe sooner we get eradicated due to a natural disaster or whatever is in store for us, the better. Not one square foot of the globe we haven't fucked up or are actively turning into a barren wasteland devoid of any life but our own.",
                "[Brown bears bloves fishing](https://www.youtube.com/watch?v=PjroTXtMtIA)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Germany's Merz promises to help Ukraine produce long-range missiles",
            "external_url": "https://www.bbc.com/news/articles/cpw7vllepx7o",
            "upvotes": 154,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3fce/live/6f6bb7f0-3bc2-11f0-a3f8-3983078865f2.jpg",
            "top_comments": [
                "Germany stepping up where the US won't. Crazy timeline we're in.",
                "I sit here embarrassed by our current \"leadership\" in the US. It's disgusting.",
                "Well I'd be wary trying to use the Kerch Bridge now."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Delta flight erupts into chaos as pigeons fly around main cabin",
            "external_url": "https://www.nbcnews.com/news/us-news/delta-flight-erupts-chaos-pigeons-fly-main-cabin-rcna209400",
            "upvotes": 1274,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-Pigeon-flight-RS-674959.jpg",
            "top_comments": [
                "According to an Instagram post from another passenger, Tom Caw was the passenger who spotted the first pigeon before the plane departed from Minneapolis-Saint Paul International Airport. Caw said the pilot announced the pigeon sighting and returned the plane to the gate to have the bird removed.\n\nAs the flight taxied out to take off again, a second pigeon emerged and flew down the main aisle of the cabin, video Caw posted on Instagram and NBC News obtained shows. The bird prompted several passengers to scream.",
                "Clearly the first officer just didn’t feel comfortable enough to speak up and ask the pilot to not bring pigeons onto the plane.",
                "Snakes on a Plane sequel is looking wild.",
                "Homing pigeons just taking shortcuts now?",
                "Sir, a second pigeon has hit the cabin",
                "Damn I really have to catch up on The Rehearsal.",
                "Me to my wife: “see, this is why I need that magician costume. What a perfect time to yell out “ta da!””\n\nMy wife: *eye roll*",
                "It is my emotional support pigeon and I can't fly without it!",
                "Seriously. No mention on how they got aboard?",
                "DELTA: \"Sorry to do this to you but we have to charge you all for the extra two flights...\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "French paedophile surgeon who abused hundreds sentenced to 20 years in jail.",
            "external_url": "https://www.bbc.com/news/articles/cvgdkyge198o",
            "upvotes": 2242,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7cd7/live/db9f8ae0-3bb9-11f0-91a0-abc9c23352d4.jpg",
            "top_comments": [
                "They caught him because he journaled about the abuse in extreme detail. I think that's the part of this that disturbs me the most, the fact that he kept a personal record of what he did and to whom he did it, complete with enough detail that police were able to easily find and notify his victims.",
                "20 years for sexual assault of hundreds of children feels light but he's 74.  He should never be free but at his age 20 years is basically life in prison.",
                "My heart goes out to all the victims, such a horrific story. All those who knew or were aware in their community and in the medical establishment should be so ashamed they allowed this to continue. I am glad the victims finally have some sense of closure and were able to support each other throughout the court proceedings, the one light to come out of such a pitch black case.",
                "It’s terrible what people do to children, especially when they are in a position of trust and they abuse it to push their own beliefs and desires over the child’s best interest",
                "In France if you kill or rape 20 people, you’ll only be sentenced to the maximum time, you’ve been condemned for one case.\n\nLet’s say you received a 15 years sentence for the first victim, and 8 years for a second one, you’ll go to jail for 15 years (the maximum amount time received)",
                "With a 20 year sentence, he's likely to die before seeing freedom. But it provides no sense of security, comfort, or justice to his victims, who will suffer lifelong consequences because of his sick and evil actions.",
                "Should’ve been the wood chipper",
                "This is even worse than standard pedophile considering the damage to the medical world reputation. Fucking piece of human trash.",
                "Twenty years for almost 300 child rapes across a decade? What a way to advertise themselves as the most lenient country for pedophiles. Punishments are supposed to be a deterrent, not a tourism selling point.",
                "I’m looking over the details and I’m very confused. He wasn’t a drag queen or trans so how could a straight white man in a position of authority be a pedophile? /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India's alarm over Chinese spying rocks the surveillance industry | Reuters",
            "external_url": "https://www.reuters.com/world/china/indias-alarm-over-chinese-spying-rocks-surveillance-industry-2025-05-28/",
            "upvotes": 139,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I bet back in China, the citizens took these spies for granite.",
                "Fr thought Chinese were spying rocks.",
                "What the hell is that headline.",
                "Dammit Marie,  they're agents.",
                "The Chinese have spying rocks now??",
                "This is another stupid bureaucratic move made by an illiterate Indian bureaucrat who decided the best way to curb China using networked technology for foreign surveillance",
                "Rofl.... never trust a rock",
                "Any movies on Chinese spies?",
                "The testing requirements apply to all devices not just those purchased by the public sector. Making such low tech devices and sourcing all the components internally shouldn’t be that hard if India had an efficient bureaucracy.",
                "Who else read it as “Chinese Spying Rockets”?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 584,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "56% of votes were for this.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Can't you see the golden age Donnie promised is coming?",
                "Did the tariffs actually start? ",
                "We're winning so hard right now!",
                "Oh well, I got food so I don’t care about them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 824,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How is that even possible?!? What a broken system!",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "You see, that 92 year-old could've been a serious threat...",
                "\"He was impossible to control!\"\n\n\n*While being interviewed at Planet Fitness doing 200# bench presses.",
                "all i would have needed is a block of wood and some gardening gloves",
                "Some of those who work forces are the same who burn crosses.",
                "Not like one of the officers could get behind him, hold his arm, and the other take the knife away.  Two kids could have done that.",
                "Maybe cops would stop shooting and abusing innocent people if we actually punished them for it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FEMA rescinds strategic plan less than 2 weeks before hurricane season",
            "external_url": "https://www.cbsnews.com/news/fema-rescinds-strategic-plan-less-than-2-weeks-before-hurricane-season/",
            "upvotes": 1775,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/21/72a084e2-608f-46ff-ab86-137b692838a3/thumbnail/1200x630/b554101e1ecdce606b889b227cb90283/ap25128165711233.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "Hey Florida, guess what's about to happen..",
                "I always feel bad for the voters in these red states that literally did not vote for this. About 4.7 million Floridians voted for Kamala. Those folks also all bear the brunt of the other side’s short-sightedness. These states are purple. Not red or blue. There is no “mandate,” only madness.",
                "Fucking. Egomaniac. MAGA. Assholes",
                "Oh no, all those voters are nearing the Find Out phase, ah geez.",
                "They mention a \"smaller footprint\".  FEMA used to cover the entire United States.  I wonder if they mean that only red states will get aid or nobody will?  Does anyone think they will come up with a new strategic plan or just fold like a cheap suit?",
                "Is there a word for when you're intentionally incompetent with the purpose of watching poor people die for amusement?",
                "I’m confused. Did the article confirm there is no official FEMA plans yet because the last ones were set to expire? And that their new plans aren’t intended to be revealed until after the summer?",
                "\"The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees\"\n\nI love how all these assholes don't know how to read and have the attention spans of goldfish.",
                ">The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees. \n\nShould it also includes pictures so that perhaps Mango could understand it if he even looked at it? What even is this kind of rule?",
                "These MAGA assholes are killing people in ways they can “morally justify” to themselves because they’re not doing it directly. This will cost lives. Fucking idiots."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "French paedophile surgeon who abused hundreds sentenced to 20 years in jail.",
            "external_url": "https://www.bbc.com/news/articles/cvgdkyge198o",
            "upvotes": 2235,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7cd7/live/db9f8ae0-3bb9-11f0-91a0-abc9c23352d4.jpg",
            "top_comments": [
                "They caught him because he journaled about the abuse in extreme detail. I think that's the part of this that disturbs me the most, the fact that he kept a personal record of what he did and to whom he did it, complete with enough detail that police were able to easily find and notify his victims.",
                "20 years for sexual assault of hundreds of children feels light but he's 74.  He should never be free but at his age 20 years is basically life in prison.",
                "My heart goes out to all the victims, such a horrific story. All those who knew or were aware in their community and in the medical establishment should be so ashamed they allowed this to continue. I am glad the victims finally have some sense of closure and were able to support each other throughout the court proceedings, the one light to come out of such a pitch black case.",
                "It’s terrible what people do to children, especially when they are in a position of trust and they abuse it to push their own beliefs and desires over the child’s best interest",
                "In France if you kill or rape 20 people, you’ll only be sentenced to the maximum time, you’ve been condemned for one case.\n\nLet’s say you received a 15 years sentence for the first victim, and 8 years for a second one, you’ll go to jail for 15 years (the maximum amount time received)",
                "With a 20 year sentence, he's likely to die before seeing freedom. But it provides no sense of security, comfort, or justice to his victims, who will suffer lifelong consequences because of his sick and evil actions.",
                "Should’ve been the wood chipper",
                "This is even worse than standard pedophile considering the damage to the medical world reputation. Fucking piece of human trash.",
                "Twenty years for almost 300 child rapes across a decade? What a way to advertise themselves as the most lenient country for pedophiles. Punishments are supposed to be a deterrent, not a tourism selling point.",
                "I’m looking over the details and I’m very confused. He wasn’t a drag queen or trans so how could a straight white man in a position of authority be a pedophile? /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Delta flight erupts into chaos as pigeons fly around main cabin",
            "external_url": "https://www.nbcnews.com/news/us-news/delta-flight-erupts-chaos-pigeons-fly-main-cabin-rcna209400",
            "upvotes": 1275,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-Pigeon-flight-RS-674959.jpg",
            "top_comments": [
                "According to an Instagram post from another passenger, Tom Caw was the passenger who spotted the first pigeon before the plane departed from Minneapolis-Saint Paul International Airport. Caw said the pilot announced the pigeon sighting and returned the plane to the gate to have the bird removed.\n\nAs the flight taxied out to take off again, a second pigeon emerged and flew down the main aisle of the cabin, video Caw posted on Instagram and NBC News obtained shows. The bird prompted several passengers to scream.",
                "Clearly the first officer just didn’t feel comfortable enough to speak up and ask the pilot to not bring pigeons onto the plane.",
                "Snakes on a Plane sequel is looking wild.",
                "Homing pigeons just taking shortcuts now?",
                "Sir, a second pigeon has hit the cabin",
                "Damn I really have to catch up on The Rehearsal.",
                "Me to my wife: “see, this is why I need that magician costume. What a perfect time to yell out “ta da!””\n\nMy wife: *eye roll*",
                "It is my emotional support pigeon and I can't fly without it!",
                "Seriously. No mention on how they got aboard?",
                "DELTA: \"Sorry to do this to you but we have to charge you all for the extra two flights...\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ex-UFC star BJ Penn arrested on family abuse charges in Hawaii",
            "external_url": "https://www.espn.com/mma/story/_/id/45353400/ex-ufc-star-bj-penn-faces-family-abuse-charges-hawaii",
            "upvotes": 1074,
            "date": "05/28/2025",
            "thumbnail": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0801%2Fr577751_1296x729_16%2D9.jpg",
            "top_comments": [
                "This guy is going to do something absolutely horrific. He believes his mother was replaced and not his actual “mother”. \n\nHe very much has CTE and he’s not going to get better unfortunately.",
                "Penn \"recently claimed online that multiple members of his family are missing. He has accused unnamed imposters of replacing those family members in an effort to steal his inheritance\"\n\nThat's really bad and this guy needs help ASAP.",
                "In the next few years, it's going to become clearer and clearer just how brutal MMA is to fighters' brains. It's getting sad to be a longtime fan, and seeing your heroes go out like this.",
                "Kind of terrifying it took this long. He’s been making the statements & threats for a while. Hope he gets the help he needs.",
                "I met him when I lived in Hawaii about fifteen years ago and he didn't seem \"right\" then. Ironically it was at an army mma event so there was plenty of CTE going around so he fit in perfectly.",
                "It was very apparent this guy is not mentally all there when he was on Joe Rogan with Tulsi Gabbard not too long ago",
                "I hope he gets the help he needs. It's obvious he's suffered some CTE.",
                "The rise of UFC has been awful for society. It’s giving the worst types of people fame and money and a long leash to be pieces of shit, and the beatings they take in the sport only create more of these people.",
                "He’s clearly suffering from Capgras Syndrome and has been for a while.",
                "Bj was always nuts. I grew up the same town."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Violent break-in at Beanie Babies mogul Ty Warner's California home left woman in coma: DA",
            "external_url": "https://abcnews.go.com/US/beanie-babies-mogul-ty-warner-california-home-invasion/story?id=122249852",
            "upvotes": 523,
            "date": "05/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/04fa225b-8ba6-48c3-976e-32d88887436d/beanie-babies_1748391049310_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "A Nevada man now faces multiple charges, including attempted murder, in connection with the home invasion and assault, according to the Santa Barbara County District Attorney's Office.\n\nThe incident unfolded on May 21 at the Montecito home of Warner, according to court filings obtained by ABC News.",
                "The victim — identified in the criminal complaint as L. Malek-Aslanian — was transported by ambulance to a local hospital. The attack left her “comatose due to brain injury,” the complaint stated.\n\nThe complaint alleges that Phay entered the mansion with the intent to burglarize it, then held Malek-Aslanian against her will and assaulted her, causing great bodily injury. The victim was “particularly vulnerable,” the complaint stated.",
                "The article doesn’t mention who the woman is at all.",
                "Did anyone watch the video on that site?  That newsreader's voice is so unsettling I thought it was AI.  It has to be AI.",
                "> Beanie Babies mogul\n\n\nThat should not be an actual thing.",
                "Not lying here my first thoughts were oh great some guy who couldn't give up on beenie babie investment. However after reading the article umm it would have been funnier it was but dang the poor woman. hope she pulls through."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Aldi and Lidl fight price war in Germany",
            "external_url": "https://www.retaildetail.eu/news/food/aldi-and-lidl-fight-price-war-in-germany/",
            "upvotes": 2063,
            "date": "05/28/2025",
            "thumbnail": "https://www.retaildetail.eu/wp-content/uploads/sites/2/2025/05/shutterstock_1092014636-aldi-lidl.jpg",
            "top_comments": [
                "Good for us consumers 👍🏼",
                "Meanwhile in Australia Coles and Woolies collude for higher prices and lower wages.\n\nDisappointed Lidl didn't break in to the Aussie market",
                "Luckily here theyre fighting about who can increase prices the most ...",
                "I don't even have either of those two nearby. I only have Edeka and Rewe, and both of them are stupidly expensive.\n\nTo clarify: I'm talking about vegetables and fruits.",
                "So this is basically an ad.",
                "Like stores should be doing, instead of collectively raising prices...",
                "Why can’t we have this in America. They’re fighting over who gets to charge more and people are lining up to decide who gets to pay more. I hate it here.",
                "In the UK Sainsburys and Tesco fight price war to see who can charge the most.",
                "That's an acceptable war",
                "Please come to Greece and start a price war."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hawaii's Kilauea volcano shoots lava 1,000 feet in the air in latest eruption",
            "external_url": "https://abcnews.go.com/US/latest-kilauea-eruption-shoots-lava-1000-feet-air/story?id=122230394",
            "upvotes": 428,
            "date": "05/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7a1dc971-63c2-4998-86ac-d0701d563922/kilauea-eruption-ht-jt-250527_1748367334006_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The Hawaiian Volcano Observatory reported that the dramatic eruption produced large lava flows that covered approximately half of the Halema'uma'u crater floor. According to their measurements, the volcanic plume from the eruption reached heights of more than 14,000 feet into the sky.",
                "How often does this happen?",
                "This is episode 23 of this series that started in of 2024. We saw episode 9 in February which was spectacular but a fraction of this episode. Each episode last 24 hours or so .",
                "How many celebrities are in danger this time?  I’m tuning up my micro-violin…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "High schoolers returning from prom hailed as heroes for helping save family from fire",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-returning-prom-hailed-heroes-helping-family-fire-rcna209372",
            "upvotes": 194,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-house-fire-prom-heroes-mn-0800-af3649.jpg",
            "top_comments": [
                "“Your house is on fire! Your house is on fire,” Aiden Kane, 17, is heard in cellphone video yelling to alert the occupants of the house in Marcy — a town of around 8,700 — on May 17.\n\nKane, his girlfriend, Morgan Randall, and their friends Donato Jellenich and Tyler Sojda were driving back from the junior prom at Whitesboro High School when they saw the garage engulfed in flames.",
                "One day I hope to be rescued by people in tuxedos.",
                "After prom I ran over a possum."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/28/2025 16:10:00 UTC"
}