{
    "posts": [
        {
            "category": "HOT",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 5813,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "If they were light on jokes they should have invited Tim Pool.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 15559,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable.",
                "heart goes out to everyone affected, this shit is horrible."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 1704,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "But they said the cuts would have no effect on benefits.",
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "Have 82 voting Republican farmers in my church. It's becoming more common to hear them saying, \"this crop of non-republican politicians should be left to burn in the field so as to get rid of the blight.\" I asked if they meant Democrats and Independents. \"Nope, at least they're feeding America.\"",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 8839,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "I am liberal as they come on social issues, but this lady overstayed her visa by 8 fucking years and last minute married an American to stay. Fuck that noise, why should we throw a fit that she got deported? \n\n\nI honestly can understand the position on fighting for asylum seekers, and people who had been here decades as a kid with no problems. Not getting a proper trial, thats a huge problem. Someone clearly illegally staying in the US getting deported should be fine if she got a trial and sent back. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 350,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "It is an open attack on the judiciary.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "someone messed with the wrong soft drink mega corporation",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "No matter what happens in the next 1350ish days, there will be some “trumped up” charges lumped in with real ones because Trump likes it that way, loads of room to flex in."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 8836,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 1381,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "[removed]",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "[removed]",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "The auction house did a video on it with the History Hit channel, it was really cool to see! But I do hope the 3 items from the passenger who died were kept together in the end (basically a body they recovered a day or so after that had 3 items on they used to identify the body with and the family were going to auction them all separately)",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 9870,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "[removed]",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Due process doesn't exist for enemies of the regime",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 2280,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "Don't they own a colour printer?",
                "Trash is what you can get away with",
                "inside theft, and a great coverup",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1589,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "Trump: “They never would have clashed if I was president!”",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "But Pakistan had cancelled all trade with India a few days back.",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Well that’s not great.",
                "I like it when they use sticks and other melee weapons, though! :("
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 350,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "It is an open attack on the judiciary.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "someone messed with the wrong soft drink mega corporation",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "No matter what happens in the next 1350ish days, there will be some “trumped up” charges lumped in with real ones because Trump likes it that way, loads of room to flex in."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 5817,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "If they were light on jokes they should have invited Tim Pool.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 1707,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "But they said the cuts would have no effect on benefits.",
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "Have 82 voting Republican farmers in my church. It's becoming more common to hear them saying, \"this crop of non-republican politicians should be left to burn in the field so as to get rid of the blight.\" I asked if they meant Democrats and Independents. \"Nope, at least they're feeding America.\"",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 15566,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable.",
                "heart goes out to everyone affected, this shit is horrible."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 8851,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "I am liberal as they come on social issues, but this lady overstayed her visa by 8 fucking years and last minute married an American to stay. Fuck that noise, why should we throw a fit that she got deported? \n\n\nI honestly can understand the position on fighting for asylum seekers, and people who had been here decades as a kid with no problems. Not getting a proper trial, thats a huge problem. Someone clearly illegally staying in the US getting deported should be fine if she got a trial and sent back. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 1383,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "[removed]",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "[removed]",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "The auction house did a video on it with the History Hit channel, it was really cool to see! But I do hope the 3 items from the passenger who died were kept together in the end (basically a body they recovered a day or so after that had 3 items on they used to identify the body with and the family were going to auction them all separately)",
                "[removed]"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1588,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "Trump: “They never would have clashed if I was president!”",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "But Pakistan had cancelled all trade with India a few days back.",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Well that’s not great.",
                "I like it when they use sticks and other melee weapons, though! :("
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 2283,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "Don't they own a colour printer?",
                "Trash is what you can get away with",
                "inside theft, and a great coverup",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 8845,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 9874,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "[removed]",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Due process doesn't exist for enemies of the regime",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 350,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "It is an open attack on the judiciary.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "someone messed with the wrong soft drink mega corporation",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "No matter what happens in the next 1350ish days, there will be some “trumped up” charges lumped in with real ones because Trump likes it that way, loads of room to flex in."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 5806,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "If they were light on jokes they should have invited Tim Pool.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 1709,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "But they said the cuts would have no effect on benefits.",
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "Have 82 voting Republican farmers in my church. It's becoming more common to hear them saying, \"this crop of non-republican politicians should be left to burn in the field so as to get rid of the blight.\" I asked if they meant Democrats and Independents. \"Nope, at least they're feeding America.\"",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 15565,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable.",
                "heart goes out to everyone affected, this shit is horrible."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 8840,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "I am liberal as they come on social issues, but this lady overstayed her visa by 8 fucking years and last minute married an American to stay. Fuck that noise, why should we throw a fit that she got deported? \n\n\nI honestly can understand the position on fighting for asylum seekers, and people who had been here decades as a kid with no problems. Not getting a proper trial, thats a huge problem. Someone clearly illegally staying in the US getting deported should be fine if she got a trial and sent back. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 8840,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 1383,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "[removed]",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "[removed]",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "The auction house did a video on it with the History Hit channel, it was really cool to see! But I do hope the 3 items from the passenger who died were kept together in the end (basically a body they recovered a day or so after that had 3 items on they used to identify the body with and the family were going to auction them all separately)",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 9868,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "[removed]",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Due process doesn't exist for enemies of the regime",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 2284,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "Don't they own a colour printer?",
                "Trash is what you can get away with",
                "inside theft, and a great coverup",
                "We have Van Gogh and Rembrandt, who needs that warhal crap, chuck it out!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1592,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "Trump: “They never would have clashed if I was president!”",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "But Pakistan had cancelled all trade with India a few days back.",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Well that’s not great.",
                "I like it when they use sticks and other melee weapons, though! :("
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "04/27/2025 16:08:56 UTC"
}