{
    "posts": [
        {
            "category": "HOT",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 19257,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "wow that article was way more horrifying than I expected it to be."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 11850,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "We've seen this movie already. First time was shitty by the way",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Insider trading go brrr.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 1064,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Gonna end up dead soon.",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "He decided he didn't want to be there anymore so he left.",
                "I guess he would know how to do it 💁‍♀️",
                "Rape and murder and only 30 years in prison?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "An Oregon man who quit his job to set sail with his cat arrives to cheering fans in Hawaii",
            "external_url": "https://apnews.com/article/sailing-cat-phoenix-oregon-hawaii-d6dbdaea88e09c9b6d24fba61d8729a3",
            "upvotes": 12237,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "News snippet:\n“HONOLULU (AP) — An Oregon man who quit his job at a tire company and liquidated his retirement savings to set sail for Hawaii with his cat, Phoenix, reached his destination Saturday, welcomed by cheering fans at the end of a weekslong journey that he documented for his mass of followers on social media.\n\nOliver Widger, who also was greeted by Hawaii Gov. Josh Green at the Waikiki Yacht Club on Oahu, acknowledged he was nervous facing the crowd, which included reporters. Widger said he was feeling “really weird” — not seasick, but, “I just feel like I have to, like, hold on to things to not fall over.”\nHe became an online sensation with his story, which followed a diagnosis four years ago with a syndrome that carried a risk of paralysis and made him realize he disliked his managerial job. He quit his job with “no money, no plan” and $10,000 of debt — and the goal of buying a sailboat and sailing around the world. \n\nHe taught himself to sail mostly via YouTube and moved from Portland to the Oregon coast. He spent months refitting the $50,000 boat he bought.\n\nHe set sail for Hawaii with Phoenix in late April, documenting their experiences for his more than 1 million followers on TikTok and 1.7 million followers on Instagram. He said he thinks his story, which made national news, resonated with people. \n“I think a lot of people are, you know, you’re grinding at your job all day long and it doesn’t really matter how much money you make at this point, everybody’s just trying to do enough to get by and that just wears you out,” he said. “It’s just the world’s in a weird place, and I think people have seen that it’s possible to break.",
                "I could not begin to imagine the juxtaposition of being totally solitary (all due respect to Phoenix the cat) for weeks, and then to arrive to a big crowd gathered for just you to socialize. I suppose it’s a different kind of “solitary” when he’s locked into social media, but still has to be night and day. \n\nThe magnitude of accomplishment isn’t the same, but I believe he and Charles Lindbergh could see eye to eye on what that feeling was like. ",
                "I'm bummed the journey is over, but I'm glad I got to see it! It was really cool to watch him pull off his dream in real(ish) time.",
                "To answer the first question on everybody's mind:\n\nYes, the article has a picture of the cat.",
                "I had to scroll to the 4th picture just to see the cat!",
                "Arriving in Hawaii by ship like he did, will likely elicit one of two responses:\n\nEither we welcome you like Monkey D. Luffy... or Captain Cook 😂\n\nRefreshing to see he enjoyed the former!",
                "I followed his journey on IG and it was super entertaining.\n\nThe guy is pretty chill and naturally funny and the cat is cute so it was really cool seeing the trip.\n\nAlso low key worried for the guy half the time but it was cool seeing stuff go wrong and he'd figure out how to fix whatever it was.",
                "It BOGGLES my fckin MIND how people still go out in the deep sea water like that after seeing videos on the internet of catastrophes that have happened out there let alone with there CAT. He got BALLS",
                "Before everyone jumps in their boat with their cat, get a [FAVN test](https://ksvdl.org/laboratories/rabies-laboratory/favn-test/) for Mr. Fluffers because there's a 2 month wait list in Hawaii, and your cat will be in quarantine until it's cleared.",
                "I'm glad he made it.  Wasn't terribly worried, the weather had been nice and he had constant communications.  But still, things happen at sea.\n\nMakes me think of Steve and Alix over in Massachusetts, with their massive multi-year project to build a sail ship called *Arabella* and start taking her around the world.  When she got put in the water for the first time it was a huge deal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 2018,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "When I got back into comics in the 00s, one of my favorite Marvel series was X-Factor. It was like the x-files but in the marvel universe. I loved it. I guess it's time for a re-read. RIP Peter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 673,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Summer fun is starting.",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Maybe this time thought and prayers will do something",
                "Only 11? How is this news?",
                "be american on memorial day weekend\n\nget shot",
                "My parents are there, unfortunately. I do not care for their hobbies myself."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Florida man who shot and poisoned dolphins sentenced to 1 month",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-man-shot-poisoned-dolphins-sentenced-1-month-rcna208937",
            "upvotes": 8448,
            "date": "05/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-florida-dolphin-shooting-poison-rc-922p-edf349.jpg",
            "top_comments": [
                ">A Florida man who shot dolphins attracted to baited fishing lines cast from boats he operated was sentenced to 30 days in prison and one year of supervised release.\n\n>Zackery Brandon Barfield, 31, not only shot the bottlenose dolphins but also used poisoned bait after growing frustrated that they were eating from his charter fishing clients, according to prosecutors, who said the crimes happened in 2022 and 2023.\n\n>Prosecutors and federal law enforcement with the National Oceanic and Atmospheric Administration said Barfield shot at five dolphins, killing at least one, and used poisoned bait on dozens more during outings from Panama City.\n\n>“He knew the regulations protecting dolphins, yet he killed them anyway — once in front of children,” federal environmental prosecutor Adam Gustafson said Friday in a statement. Barfield’s attorney in the case did not immediately respond to a request for comment Saturday.\n\n>Barfield opened fire while two elementary school-aged children were on board and, separately, while more than a dozen fishermen were on board boats he operated, prosecutors said.\n\n>He used poisoned bait even more prodigiously, they said.\n\n>\"Barfield fed an estimated 24–70 dolphins poison-laden baitfish on charter trips that he captained,\" NOAA Fisheries said in a separate statement Friday.\n\nHe was mad because the dolphins were doing a better job at catching the fish than his customers were. \n\nIt’s a light sentence considering how long he was doing this and how many dolphins he cruelly killed. He should really lose his boat because he has no business being in the boat charter business after this.",
                "Too light a punishment for that ass.",
                "What a piece of shit. Should be going to prison for a long time, never be allowed to fish ever again, and his company should be seized.",
                "1 month? f**k that, should be years in jail",
                "Florida should at least pretend to care about marine life.",
                "I’m from the area, all of the locals are pissed at the joke of a sentence he received, absolutely no recourse for those poor animals",
                "1 so-called month, for **purposely** murdering dolphins...and he doesn't even lose his boating license or his boat. JFC, the American judicial system is a complete joke.",
                "And he will lose his fishing license in Florida for life right? This is the final part of the judgement, right? He will pay a fine, serve time, and never legally harvest a fish ever again, right?",
                "Is he going to remain in business?\n\nThis is where being a billionaire would be useful. I could open a \"We don't kill dolphins\" charter business right by him, with big, beautiful boats, low prices, and advertised heavily.\n\nI'd consider that a public good and set up a foundation to fund it.",
                "Another great example at how horribly inadequate our laws protecting animals are.\nThis guy is a psychopath and should lose everything.  F this broken system."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Second suspected sabotage in France as power cut hits Nice, affecting 45,000 homes",
            "external_url": "https://www.bbc.com/news/articles/c20xvnge3qno",
            "upvotes": 3612,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/487c/live/42ea3640-395e-11f0-a1b9-9b7594c95a97.jpg",
            "top_comments": [
                "A second major power outage in France within two days has raised serious concerns about potential sabotage.\nAfter a suspected arson attack in Cannes disrupted the film festival, another fire hit a power substation in Nice early Sunday. It cut electricity to 45,000 homes, the airport, and the tram network.\n\nAuthorities found signs of forced entry and vehicle tracks at the scene, suggesting it was no accident. French police have launched an investigation into possible organized sabotage.",
                "Probing for weak points. ",
                "We must start cutting cables in russia as well. Find their weak points and choke them. What are we waiting for? This is already war with them.",
                "I'm not saying it's the Ruzzis, but it was the Ruzzis.",
                "It's 10 pm do you know where your far right domestic terrorists are?",
                "They tried this in the states a little while back and didn't accomplish much because Americans tend to try to shoot everything. I seem to recall several outages where they found bullet holes.\n\n\nDepartment of Energy data suggests suspicious energy grid disruptions are on the rise, especially in the Western U.S., historically a white supremacist stronghold. In reports filed to the DOE, power grid operators identified 200 instances of vandalism, suspicious activity, sabotage or physical attacks in 2023, comprising 58% of all reported incidents. (Other reports cited factors like severe weather, cyberattacks or equipment failures.) That represents a large increase over the last five years. In 2017, just 9.3% of reported disturbances noted suspicious circumstances, a number that rises to 20-to-30% from 2018 to 2021. Over the past decade, roughly half of these attacks happened in the West. \n\nThe FBI made arrests in three different white supremacist plots involving substations, all interrupted in 2020. In one case, three men who met through a neo-Nazi chat room planned to shoot up substations to take down the national energy grid. They were caught only because a man the group was recruiting lost his phone; the person who found it found Nazi propaganda on it and turned it over to the police. In the government’s sentencing memorandum for one of the men, prosecutors said they “planned to attack substations with powerful rifles that would penetrate the transformers” because they believed it would “cause confusion and unrest” and cost the government millions. “There was even discussion that their plan could succeed in producing a race war and the next Great Depression,” the memo says. All three pleaded guilty to one count of conspiring to provide material support to terrorists; one still awaits sentencing, and the other two are serving five- and seven-year prison terms.\n\nAnother three men were arrested at a Las Vegas Black Lives Matter protest with Molotov cocktails in their car, according to a Department of Justice statement. The government alleges that the men, who claimed to be members of the far-right “Boogaloo” movement, had also plotted to firebomb a substation. Two pled guilty and were sentenced to between four and 20 years, while a third received life in prison.\n\nThe FBI also charged four men in another 2020 plot that involved conspiring to destroy an energy facility, as well as stealing military gear to carry out the attack. Two of them pleaded guilty; the other two pleaded not guilty and are still awaiting trial. Court documents allege that two of the co-conspirators met online in a neo-Nazi forum and recruited others, and the group shared photos of themselves giving the Nazi “Sieg Heil” salute. In a detention hearing for one of the accused, Chris Little, a special agent for the Naval Criminal Investigative Service (NCIS), testified that one of the men had compiled a list of assassination targets associated with the Black Lives Matter movement. Little testified that the person also handwrote a list of intersections in cities across the West, including Boise, Portland, Seattle and San Francisco. Every intersection contained energy infrastructure. \n\nThe men, Little testified, wanted to create an outage because it “diverts the police, causes chaos from the outage itself, causes damage to the equipment, takes a long time to replace and causes an outage of significant length.” They planned to use that chaos “to create a favorable operating environment to conduct an assassination.” In the far-right movement, this twisted logic falls under the banner of an ideology called “accelerationism”: the belief that accelerating the collapse of society will enable white people to take over and rebuild the world they want.",
                "I’m sorry to hear that France was going through the same shit the US did a few years ago. When yallqueda was shooting at transformer stations.",
                "The world is heading towards war.",
                "“It’s not *nice* to have our power out for so long.”\n\nIs it Nice, or is it not nice? Make up your mind!",
                "Another test run. Charles Schwab talked about this in his books"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US arrests man for allegedly trying to firebomb embassy in Israel",
            "external_url": "https://www.bbc.com/news/articles/c780n71rr24o",
            "upvotes": 1093,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/09ef/live/e053cbe0-398f-11f0-9622-11e0d330cba3.jpg",
            "top_comments": [
                "I went to college with this guy and am friends with him on Facebook. It was wild watching him go from rabid MAGA to violently anti-Trump. He’s clearly very sick, but also was always very public with his “plans.” Can’t believe he finally made the news",
                "If you look at his socials a few weeks ago he started posting publicly about plans to burn down the embassy—why was he admitted to Israel when they do a very thorough job of checking your socials and anything that could remotely seem like a security issue? He is himself Jewish and eligible for “birthright” citizenship, is that why?\n\nIt is odd because his socials until very recently were extremely pro-Israel and anti-Palestinian—like cheering on the killing of Palestinians, calling the west bank “reclaimed Judea and Samaria”, etc \n\nSuch a 180 shift….\n\nEdit to add: his company is directly partnered with the State of Israel , and the social media pages for his company were as of this month still ardently posting extremely Zionist, everything-is-greater-Israel things (eg claiming Sinai, Golan Heights, Lebanon, West Bank, Gaza, etc) \n\nI’m sorry but this is all extremely sus",
                "A useful idiot is how terrorist view him.",
                "If he's American and German why did they send him to America? Germany has much harsher things they do to people who try to hurt Israelis these days.",
                "He was arrested in Israel for committing a crime within their borders why did they deport him?",
                "Reddit tankies: \"he was just anti-zionist!!\"",
                "Soon to be locked I bet.",
                "It was wrong when Israel bombed the Iranian embassy in Syria last year, and it’s wrong that this random guy tried to bomb this embassy in Israel.  \n\nWe should give both this random guy and Israel the same amount of military aid(zero).",
                "Smells like false flag bullshit to me. Spit on the guard with a backpack full of explosives? Then ran and left the backpack? \n\nSorry not falling for it.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia launches largest air attack yet on Ukraine",
            "external_url": "https://www.bbc.com/news/articles/cx2rx8kxdm4o",
            "upvotes": 2966,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/77a6/live/f474bf40-3989-11f0-ad10-b91b1b1069c6.jpg",
            "top_comments": [
                "Peace talks are just a stall tactic while they rearm themselves.",
                "Has it been 24 hours yet?",
                "Trump’s “Peace On Day One” promise is looking like his biggest policy failure",
                "Russia sending a message to Trump, “nice phone call the other day. This is our response. We know you are our bitch. We do what we want and we know you won’t do anything about it.”",
                "As long as Putin lives, peace talks are a fantasy.",
                "I thought they were running out of munitions...",
                "This will all be over when Trump tweets “STOP VLAD” again.",
                "I see no end to this mess. What about you? Give me hope please.",
                "Good job Shlump . I guess his talking to Putin really left an impression on him . The clown of the whole world right now",
                "Heartbreaking to see, hoping for strength and safety for everyone affected in Ukraine."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 1071,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Gonna end up dead soon.",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "He decided he didn't want to be there anymore so he left.",
                "I guess he would know how to do it 💁‍♀️",
                "Rape and murder and only 30 years in prison?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 665,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Summer fun is starting.",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Maybe this time thought and prayers will do something",
                "Only 11? How is this news?",
                "be american on memorial day weekend\n\nget shot",
                "My parents are there, unfortunately. I do not care for their hobbies myself."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 2024,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "When I got back into comics in the 00s, one of my favorite Marvel series was X-Factor. It was like the x-files but in the marvel universe. I loved it. I guess it's time for a re-read. RIP Peter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 11849,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "We've seen this movie already. First time was shitty by the way",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Insider trading go brrr.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 19254,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "wow that article was way more horrifying than I expected it to be."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US arrests man for allegedly trying to firebomb embassy in Israel",
            "external_url": "https://www.bbc.com/news/articles/c780n71rr24o",
            "upvotes": 1094,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/09ef/live/e053cbe0-398f-11f0-9622-11e0d330cba3.jpg",
            "top_comments": [
                "I went to college with this guy and am friends with him on Facebook. It was wild watching him go from rabid MAGA to violently anti-Trump. He’s clearly very sick, but also was always very public with his “plans.” Can’t believe he finally made the news",
                "If you look at his socials a few weeks ago he started posting publicly about plans to burn down the embassy—why was he admitted to Israel when they do a very thorough job of checking your socials and anything that could remotely seem like a security issue? He is himself Jewish and eligible for “birthright” citizenship, is that why?\n\nIt is odd because his socials until very recently were extremely pro-Israel and anti-Palestinian—like cheering on the killing of Palestinians, calling the west bank “reclaimed Judea and Samaria”, etc \n\nSuch a 180 shift….\n\nEdit to add: his company is directly partnered with the State of Israel , and the social media pages for his company were as of this month still ardently posting extremely Zionist, everything-is-greater-Israel things (eg claiming Sinai, Golan Heights, Lebanon, West Bank, Gaza, etc) \n\nI’m sorry but this is all extremely sus",
                "A useful idiot is how terrorist view him.",
                "If he's American and German why did they send him to America? Germany has much harsher things they do to people who try to hurt Israelis these days.",
                "He was arrested in Israel for committing a crime within their borders why did they deport him?",
                "Reddit tankies: \"he was just anti-zionist!!\"",
                "Soon to be locked I bet.",
                "It was wrong when Israel bombed the Iranian embassy in Syria last year, and it’s wrong that this random guy tried to bomb this embassy in Israel.  \n\nWe should give both this random guy and Israel the same amount of military aid(zero).",
                "Smells like false flag bullshit to me. Spit on the guard with a backpack full of explosives? Then ran and left the backpack? \n\nSorry not falling for it.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia hits Ukraine with massive drone, missile barrage amid prisoner exchange",
            "external_url": "https://abcnews.go.com/International/russia-hits-ukraine-massive-drone-missile-barrage-amid/story?id=122173886",
            "upvotes": 482,
            "date": "05/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/278fcdf4-4c31-48b2-bbec-eea3a1184263/Kyiv-explosion-DB-250525_1748156939198_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Putin needs to be in jail for war crimes",
                "Putin doesn’t want peace. He’s found an enemy he likes for propaganda purposes and is sticking with it",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "An Oregon man who quit his job to set sail with his cat arrives to cheering fans in Hawaii",
            "external_url": "https://apnews.com/article/sailing-cat-phoenix-oregon-hawaii-d6dbdaea88e09c9b6d24fba61d8729a3",
            "upvotes": 12238,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "News snippet:\n“HONOLULU (AP) — An Oregon man who quit his job at a tire company and liquidated his retirement savings to set sail for Hawaii with his cat, Phoenix, reached his destination Saturday, welcomed by cheering fans at the end of a weekslong journey that he documented for his mass of followers on social media.\n\nOliver Widger, who also was greeted by Hawaii Gov. Josh Green at the Waikiki Yacht Club on Oahu, acknowledged he was nervous facing the crowd, which included reporters. Widger said he was feeling “really weird” — not seasick, but, “I just feel like I have to, like, hold on to things to not fall over.”\nHe became an online sensation with his story, which followed a diagnosis four years ago with a syndrome that carried a risk of paralysis and made him realize he disliked his managerial job. He quit his job with “no money, no plan” and $10,000 of debt — and the goal of buying a sailboat and sailing around the world. \n\nHe taught himself to sail mostly via YouTube and moved from Portland to the Oregon coast. He spent months refitting the $50,000 boat he bought.\n\nHe set sail for Hawaii with Phoenix in late April, documenting their experiences for his more than 1 million followers on TikTok and 1.7 million followers on Instagram. He said he thinks his story, which made national news, resonated with people. \n“I think a lot of people are, you know, you’re grinding at your job all day long and it doesn’t really matter how much money you make at this point, everybody’s just trying to do enough to get by and that just wears you out,” he said. “It’s just the world’s in a weird place, and I think people have seen that it’s possible to break.",
                "I could not begin to imagine the juxtaposition of being totally solitary (all due respect to Phoenix the cat) for weeks, and then to arrive to a big crowd gathered for just you to socialize. I suppose it’s a different kind of “solitary” when he’s locked into social media, but still has to be night and day. \n\nThe magnitude of accomplishment isn’t the same, but I believe he and Charles Lindbergh could see eye to eye on what that feeling was like. ",
                "I'm bummed the journey is over, but I'm glad I got to see it! It was really cool to watch him pull off his dream in real(ish) time.",
                "To answer the first question on everybody's mind:\n\nYes, the article has a picture of the cat.",
                "I had to scroll to the 4th picture just to see the cat!",
                "Arriving in Hawaii by ship like he did, will likely elicit one of two responses:\n\nEither we welcome you like Monkey D. Luffy... or Captain Cook 😂\n\nRefreshing to see he enjoyed the former!",
                "I followed his journey on IG and it was super entertaining.\n\nThe guy is pretty chill and naturally funny and the cat is cute so it was really cool seeing the trip.\n\nAlso low key worried for the guy half the time but it was cool seeing stuff go wrong and he'd figure out how to fix whatever it was.",
                "It BOGGLES my fckin MIND how people still go out in the deep sea water like that after seeing videos on the internet of catastrophes that have happened out there let alone with there CAT. He got BALLS",
                "Before everyone jumps in their boat with their cat, get a [FAVN test](https://ksvdl.org/laboratories/rabies-laboratory/favn-test/) for Mr. Fluffers because there's a 2 month wait list in Hawaii, and your cat will be in quarantine until it's cleared.",
                "I'm glad he made it.  Wasn't terribly worried, the weather had been nice and he had constant communications.  But still, things happen at sea.\n\nMakes me think of Steve and Alix over in Massachusetts, with their massive multi-year project to build a sail ship called *Arabella* and start taking her around the world.  When she got put in the water for the first time it was a huge deal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Second suspected sabotage in France as power cut hits Nice, affecting 45,000 homes",
            "external_url": "https://www.bbc.com/news/articles/c20xvnge3qno",
            "upvotes": 3611,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/487c/live/42ea3640-395e-11f0-a1b9-9b7594c95a97.jpg",
            "top_comments": [
                "A second major power outage in France within two days has raised serious concerns about potential sabotage.\nAfter a suspected arson attack in Cannes disrupted the film festival, another fire hit a power substation in Nice early Sunday. It cut electricity to 45,000 homes, the airport, and the tram network.\n\nAuthorities found signs of forced entry and vehicle tracks at the scene, suggesting it was no accident. French police have launched an investigation into possible organized sabotage.",
                "Probing for weak points. ",
                "We must start cutting cables in russia as well. Find their weak points and choke them. What are we waiting for? This is already war with them.",
                "I'm not saying it's the Ruzzis, but it was the Ruzzis.",
                "It's 10 pm do you know where your far right domestic terrorists are?",
                "They tried this in the states a little while back and didn't accomplish much because Americans tend to try to shoot everything. I seem to recall several outages where they found bullet holes.\n\n\nDepartment of Energy data suggests suspicious energy grid disruptions are on the rise, especially in the Western U.S., historically a white supremacist stronghold. In reports filed to the DOE, power grid operators identified 200 instances of vandalism, suspicious activity, sabotage or physical attacks in 2023, comprising 58% of all reported incidents. (Other reports cited factors like severe weather, cyberattacks or equipment failures.) That represents a large increase over the last five years. In 2017, just 9.3% of reported disturbances noted suspicious circumstances, a number that rises to 20-to-30% from 2018 to 2021. Over the past decade, roughly half of these attacks happened in the West. \n\nThe FBI made arrests in three different white supremacist plots involving substations, all interrupted in 2020. In one case, three men who met through a neo-Nazi chat room planned to shoot up substations to take down the national energy grid. They were caught only because a man the group was recruiting lost his phone; the person who found it found Nazi propaganda on it and turned it over to the police. In the government’s sentencing memorandum for one of the men, prosecutors said they “planned to attack substations with powerful rifles that would penetrate the transformers” because they believed it would “cause confusion and unrest” and cost the government millions. “There was even discussion that their plan could succeed in producing a race war and the next Great Depression,” the memo says. All three pleaded guilty to one count of conspiring to provide material support to terrorists; one still awaits sentencing, and the other two are serving five- and seven-year prison terms.\n\nAnother three men were arrested at a Las Vegas Black Lives Matter protest with Molotov cocktails in their car, according to a Department of Justice statement. The government alleges that the men, who claimed to be members of the far-right “Boogaloo” movement, had also plotted to firebomb a substation. Two pled guilty and were sentenced to between four and 20 years, while a third received life in prison.\n\nThe FBI also charged four men in another 2020 plot that involved conspiring to destroy an energy facility, as well as stealing military gear to carry out the attack. Two of them pleaded guilty; the other two pleaded not guilty and are still awaiting trial. Court documents allege that two of the co-conspirators met online in a neo-Nazi forum and recruited others, and the group shared photos of themselves giving the Nazi “Sieg Heil” salute. In a detention hearing for one of the accused, Chris Little, a special agent for the Naval Criminal Investigative Service (NCIS), testified that one of the men had compiled a list of assassination targets associated with the Black Lives Matter movement. Little testified that the person also handwrote a list of intersections in cities across the West, including Boise, Portland, Seattle and San Francisco. Every intersection contained energy infrastructure. \n\nThe men, Little testified, wanted to create an outage because it “diverts the police, causes chaos from the outage itself, causes damage to the equipment, takes a long time to replace and causes an outage of significant length.” They planned to use that chaos “to create a favorable operating environment to conduct an assassination.” In the far-right movement, this twisted logic falls under the banner of an ideology called “accelerationism”: the belief that accelerating the collapse of society will enable white people to take over and rebuild the world they want.",
                "I’m sorry to hear that France was going through the same shit the US did a few years ago. When yallqueda was shooting at transformer stations.",
                "The world is heading towards war.",
                "“It’s not *nice* to have our power out for so long.”\n\nIs it Nice, or is it not nice? Make up your mind!",
                "Another test run. Charles Schwab talked about this in his books"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia launches largest air attack yet on Ukraine",
            "external_url": "https://www.bbc.com/news/articles/cx2rx8kxdm4o",
            "upvotes": 2971,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/77a6/live/f474bf40-3989-11f0-ad10-b91b1b1069c6.jpg",
            "top_comments": [
                "Peace talks are just a stall tactic while they rearm themselves.",
                "Has it been 24 hours yet?",
                "Trump’s “Peace On Day One” promise is looking like his biggest policy failure",
                "Russia sending a message to Trump, “nice phone call the other day. This is our response. We know you are our bitch. We do what we want and we know you won’t do anything about it.”",
                "As long as Putin lives, peace talks are a fantasy.",
                "I thought they were running out of munitions...",
                "This will all be over when Trump tweets “STOP VLAD” again.",
                "I see no end to this mess. What about you? Give me hope please.",
                "Good job Shlump . I guess his talking to Putin really left an impression on him . The clown of the whole world right now",
                "Heartbreaking to see, hoping for strength and safety for everyone affected in Ukraine."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 1070,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Gonna end up dead soon.",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "He decided he didn't want to be there anymore so he left.",
                "I guess he would know how to do it 💁‍♀️",
                "Rape and murder and only 30 years in prison?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 666,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Summer fun is starting.",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Maybe this time thought and prayers will do something",
                "Only 11? How is this news?",
                "be american on memorial day weekend\n\nget shot",
                "My parents are there, unfortunately. I do not care for their hobbies myself."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 2023,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "When I got back into comics in the 00s, one of my favorite Marvel series was X-Factor. It was like the x-files but in the marvel universe. I loved it. I guess it's time for a re-read. RIP Peter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 11855,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "We've seen this movie already. First time was shitty by the way",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Insider trading go brrr.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 19253,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "wow that article was way more horrifying than I expected it to be."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "An Oregon man who quit his job to set sail with his cat arrives to cheering fans in Hawaii",
            "external_url": "https://apnews.com/article/sailing-cat-phoenix-oregon-hawaii-d6dbdaea88e09c9b6d24fba61d8729a3",
            "upvotes": 12237,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "News snippet:\n“HONOLULU (AP) — An Oregon man who quit his job at a tire company and liquidated his retirement savings to set sail for Hawaii with his cat, Phoenix, reached his destination Saturday, welcomed by cheering fans at the end of a weekslong journey that he documented for his mass of followers on social media.\n\nOliver Widger, who also was greeted by Hawaii Gov. Josh Green at the Waikiki Yacht Club on Oahu, acknowledged he was nervous facing the crowd, which included reporters. Widger said he was feeling “really weird” — not seasick, but, “I just feel like I have to, like, hold on to things to not fall over.”\nHe became an online sensation with his story, which followed a diagnosis four years ago with a syndrome that carried a risk of paralysis and made him realize he disliked his managerial job. He quit his job with “no money, no plan” and $10,000 of debt — and the goal of buying a sailboat and sailing around the world. \n\nHe taught himself to sail mostly via YouTube and moved from Portland to the Oregon coast. He spent months refitting the $50,000 boat he bought.\n\nHe set sail for Hawaii with Phoenix in late April, documenting their experiences for his more than 1 million followers on TikTok and 1.7 million followers on Instagram. He said he thinks his story, which made national news, resonated with people. \n“I think a lot of people are, you know, you’re grinding at your job all day long and it doesn’t really matter how much money you make at this point, everybody’s just trying to do enough to get by and that just wears you out,” he said. “It’s just the world’s in a weird place, and I think people have seen that it’s possible to break.",
                "I could not begin to imagine the juxtaposition of being totally solitary (all due respect to Phoenix the cat) for weeks, and then to arrive to a big crowd gathered for just you to socialize. I suppose it’s a different kind of “solitary” when he’s locked into social media, but still has to be night and day. \n\nThe magnitude of accomplishment isn’t the same, but I believe he and Charles Lindbergh could see eye to eye on what that feeling was like. ",
                "I'm bummed the journey is over, but I'm glad I got to see it! It was really cool to watch him pull off his dream in real(ish) time.",
                "To answer the first question on everybody's mind:\n\nYes, the article has a picture of the cat.",
                "I had to scroll to the 4th picture just to see the cat!",
                "Arriving in Hawaii by ship like he did, will likely elicit one of two responses:\n\nEither we welcome you like Monkey D. Luffy... or Captain Cook 😂\n\nRefreshing to see he enjoyed the former!",
                "I followed his journey on IG and it was super entertaining.\n\nThe guy is pretty chill and naturally funny and the cat is cute so it was really cool seeing the trip.\n\nAlso low key worried for the guy half the time but it was cool seeing stuff go wrong and he'd figure out how to fix whatever it was.",
                "It BOGGLES my fckin MIND how people still go out in the deep sea water like that after seeing videos on the internet of catastrophes that have happened out there let alone with there CAT. He got BALLS",
                "Before everyone jumps in their boat with their cat, get a [FAVN test](https://ksvdl.org/laboratories/rabies-laboratory/favn-test/) for Mr. Fluffers because there's a 2 month wait list in Hawaii, and your cat will be in quarantine until it's cleared.",
                "I'm glad he made it.  Wasn't terribly worried, the weather had been nice and he had constant communications.  But still, things happen at sea.\n\nMakes me think of Steve and Alix over in Massachusetts, with their massive multi-year project to build a sail ship called *Arabella* and start taking her around the world.  When she got put in the water for the first time it was a huge deal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Florida man who shot and poisoned dolphins sentenced to 1 month",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-man-shot-poisoned-dolphins-sentenced-1-month-rcna208937",
            "upvotes": 8446,
            "date": "05/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-florida-dolphin-shooting-poison-rc-922p-edf349.jpg",
            "top_comments": [
                ">A Florida man who shot dolphins attracted to baited fishing lines cast from boats he operated was sentenced to 30 days in prison and one year of supervised release.\n\n>Zackery Brandon Barfield, 31, not only shot the bottlenose dolphins but also used poisoned bait after growing frustrated that they were eating from his charter fishing clients, according to prosecutors, who said the crimes happened in 2022 and 2023.\n\n>Prosecutors and federal law enforcement with the National Oceanic and Atmospheric Administration said Barfield shot at five dolphins, killing at least one, and used poisoned bait on dozens more during outings from Panama City.\n\n>“He knew the regulations protecting dolphins, yet he killed them anyway — once in front of children,” federal environmental prosecutor Adam Gustafson said Friday in a statement. Barfield’s attorney in the case did not immediately respond to a request for comment Saturday.\n\n>Barfield opened fire while two elementary school-aged children were on board and, separately, while more than a dozen fishermen were on board boats he operated, prosecutors said.\n\n>He used poisoned bait even more prodigiously, they said.\n\n>\"Barfield fed an estimated 24–70 dolphins poison-laden baitfish on charter trips that he captained,\" NOAA Fisheries said in a separate statement Friday.\n\nHe was mad because the dolphins were doing a better job at catching the fish than his customers were. \n\nIt’s a light sentence considering how long he was doing this and how many dolphins he cruelly killed. He should really lose his boat because he has no business being in the boat charter business after this.",
                "Too light a punishment for that ass.",
                "What a piece of shit. Should be going to prison for a long time, never be allowed to fish ever again, and his company should be seized.",
                "1 month? f**k that, should be years in jail",
                "Florida should at least pretend to care about marine life.",
                "I’m from the area, all of the locals are pissed at the joke of a sentence he received, absolutely no recourse for those poor animals",
                "1 so-called month, for **purposely** murdering dolphins...and he doesn't even lose his boating license or his boat. JFC, the American judicial system is a complete joke.",
                "And he will lose his fishing license in Florida for life right? This is the final part of the judgement, right? He will pay a fine, serve time, and never legally harvest a fish ever again, right?",
                "Is he going to remain in business?\n\nThis is where being a billionaire would be useful. I could open a \"We don't kill dolphins\" charter business right by him, with big, beautiful boats, low prices, and advertised heavily.\n\nI'd consider that a public good and set up a foundation to fund it.",
                "Another great example at how horribly inadequate our laws protecting animals are.\nThis guy is a psychopath and should lose everything.  F this broken system."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Second suspected sabotage in France as power cut hits Nice, affecting 45,000 homes",
            "external_url": "https://www.bbc.com/news/articles/c20xvnge3qno",
            "upvotes": 3610,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/487c/live/42ea3640-395e-11f0-a1b9-9b7594c95a97.jpg",
            "top_comments": [
                "A second major power outage in France within two days has raised serious concerns about potential sabotage.\nAfter a suspected arson attack in Cannes disrupted the film festival, another fire hit a power substation in Nice early Sunday. It cut electricity to 45,000 homes, the airport, and the tram network.\n\nAuthorities found signs of forced entry and vehicle tracks at the scene, suggesting it was no accident. French police have launched an investigation into possible organized sabotage.",
                "Probing for weak points. ",
                "We must start cutting cables in russia as well. Find their weak points and choke them. What are we waiting for? This is already war with them.",
                "I'm not saying it's the Ruzzis, but it was the Ruzzis.",
                "It's 10 pm do you know where your far right domestic terrorists are?",
                "They tried this in the states a little while back and didn't accomplish much because Americans tend to try to shoot everything. I seem to recall several outages where they found bullet holes.\n\n\nDepartment of Energy data suggests suspicious energy grid disruptions are on the rise, especially in the Western U.S., historically a white supremacist stronghold. In reports filed to the DOE, power grid operators identified 200 instances of vandalism, suspicious activity, sabotage or physical attacks in 2023, comprising 58% of all reported incidents. (Other reports cited factors like severe weather, cyberattacks or equipment failures.) That represents a large increase over the last five years. In 2017, just 9.3% of reported disturbances noted suspicious circumstances, a number that rises to 20-to-30% from 2018 to 2021. Over the past decade, roughly half of these attacks happened in the West. \n\nThe FBI made arrests in three different white supremacist plots involving substations, all interrupted in 2020. In one case, three men who met through a neo-Nazi chat room planned to shoot up substations to take down the national energy grid. They were caught only because a man the group was recruiting lost his phone; the person who found it found Nazi propaganda on it and turned it over to the police. In the government’s sentencing memorandum for one of the men, prosecutors said they “planned to attack substations with powerful rifles that would penetrate the transformers” because they believed it would “cause confusion and unrest” and cost the government millions. “There was even discussion that their plan could succeed in producing a race war and the next Great Depression,” the memo says. All three pleaded guilty to one count of conspiring to provide material support to terrorists; one still awaits sentencing, and the other two are serving five- and seven-year prison terms.\n\nAnother three men were arrested at a Las Vegas Black Lives Matter protest with Molotov cocktails in their car, according to a Department of Justice statement. The government alleges that the men, who claimed to be members of the far-right “Boogaloo” movement, had also plotted to firebomb a substation. Two pled guilty and were sentenced to between four and 20 years, while a third received life in prison.\n\nThe FBI also charged four men in another 2020 plot that involved conspiring to destroy an energy facility, as well as stealing military gear to carry out the attack. Two of them pleaded guilty; the other two pleaded not guilty and are still awaiting trial. Court documents allege that two of the co-conspirators met online in a neo-Nazi forum and recruited others, and the group shared photos of themselves giving the Nazi “Sieg Heil” salute. In a detention hearing for one of the accused, Chris Little, a special agent for the Naval Criminal Investigative Service (NCIS), testified that one of the men had compiled a list of assassination targets associated with the Black Lives Matter movement. Little testified that the person also handwrote a list of intersections in cities across the West, including Boise, Portland, Seattle and San Francisco. Every intersection contained energy infrastructure. \n\nThe men, Little testified, wanted to create an outage because it “diverts the police, causes chaos from the outage itself, causes damage to the equipment, takes a long time to replace and causes an outage of significant length.” They planned to use that chaos “to create a favorable operating environment to conduct an assassination.” In the far-right movement, this twisted logic falls under the banner of an ideology called “accelerationism”: the belief that accelerating the collapse of society will enable white people to take over and rebuild the world they want.",
                "I’m sorry to hear that France was going through the same shit the US did a few years ago. When yallqueda was shooting at transformer stations.",
                "The world is heading towards war.",
                "“It’s not *nice* to have our power out for so long.”\n\nIs it Nice, or is it not nice? Make up your mind!",
                "Another test run. Charles Schwab talked about this in his books"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US arrests man for allegedly trying to firebomb embassy in Israel",
            "external_url": "https://www.bbc.com/news/articles/c780n71rr24o",
            "upvotes": 1096,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/09ef/live/e053cbe0-398f-11f0-9622-11e0d330cba3.jpg",
            "top_comments": [
                "I went to college with this guy and am friends with him on Facebook. It was wild watching him go from rabid MAGA to violently anti-Trump. He’s clearly very sick, but also was always very public with his “plans.” Can’t believe he finally made the news",
                "If you look at his socials a few weeks ago he started posting publicly about plans to burn down the embassy—why was he admitted to Israel when they do a very thorough job of checking your socials and anything that could remotely seem like a security issue? He is himself Jewish and eligible for “birthright” citizenship, is that why?\n\nIt is odd because his socials until very recently were extremely pro-Israel and anti-Palestinian—like cheering on the killing of Palestinians, calling the west bank “reclaimed Judea and Samaria”, etc \n\nSuch a 180 shift….\n\nEdit to add: his company is directly partnered with the State of Israel , and the social media pages for his company were as of this month still ardently posting extremely Zionist, everything-is-greater-Israel things (eg claiming Sinai, Golan Heights, Lebanon, West Bank, Gaza, etc) \n\nI’m sorry but this is all extremely sus",
                "A useful idiot is how terrorist view him.",
                "If he's American and German why did they send him to America? Germany has much harsher things they do to people who try to hurt Israelis these days.",
                "He was arrested in Israel for committing a crime within their borders why did they deport him?",
                "Reddit tankies: \"he was just anti-zionist!!\"",
                "Soon to be locked I bet.",
                "It was wrong when Israel bombed the Iranian embassy in Syria last year, and it’s wrong that this random guy tried to bomb this embassy in Israel.  \n\nWe should give both this random guy and Israel the same amount of military aid(zero).",
                "Smells like false flag bullshit to me. Spit on the guard with a backpack full of explosives? Then ran and left the backpack? \n\nSorry not falling for it.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia launches largest air attack yet on Ukraine",
            "external_url": "https://www.bbc.com/news/articles/cx2rx8kxdm4o",
            "upvotes": 2968,
            "date": "05/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/77a6/live/f474bf40-3989-11f0-ad10-b91b1b1069c6.jpg",
            "top_comments": [
                "Peace talks are just a stall tactic while they rearm themselves.",
                "Has it been 24 hours yet?",
                "Trump’s “Peace On Day One” promise is looking like his biggest policy failure",
                "Russia sending a message to Trump, “nice phone call the other day. This is our response. We know you are our bitch. We do what we want and we know you won’t do anything about it.”",
                "As long as Putin lives, peace talks are a fantasy.",
                "I thought they were running out of munitions...",
                "This will all be over when Trump tweets “STOP VLAD” again.",
                "I see no end to this mess. What about you? Give me hope please.",
                "Good job Shlump . I guess his talking to Putin really left an impression on him . The clown of the whole world right now",
                "Heartbreaking to see, hoping for strength and safety for everyone affected in Ukraine."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/26/2025 08:18:04 UTC"
}