{
    "posts": [
        {
            "category": "HOT",
            "title": "Regeneron to buy bankrupt DNA testing firm 23andMe for $256 million",
            "external_url": "https://www.cnn.com/2025/05/19/business/regeneron-23-and-me?utm_medium=social&utm_source=igCNN&utm_content=2025-05-19T12%3A31%3A59",
            "upvotes": 14241,
            "date": "05/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/231207110123-23andme-testing-kit-file.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Delete Your Data From 23andMe\n\nhttps://www.nytimes.com/wirecutter/reviews/wirecutter-show-podcast-20250328-23andme-data-bankrupt/",
                "$256 million/15 million customers = $17.\n\nYour DNA is worth $17.",
                "Can't wait to fight my genetically upgraded evil clone, designed to replace me!!",
                "IMO the biggest miss with 23&Me is them not buying Ancestry.com, etc, to help build a collaborative genealogical chart system families could use and edit, or expanding on it with local family related news and documents available throughout the generations to better piece together familial history and even photos, etc.\n\nAside from selling biological info to ad companies or insurers or other seedy profiteers, I don’t see why they couldn’t have made money from a reduced priced option for current members / entrants to access the “plus” member benefits or used the genetic data and self reports, combined with localized double blind studies ofc, to confirm data trends that could be profitable while also not selling discreet information.\n\nI feel like they just didn’t broaden the definition of what was possible under their company’s umbrella.",
                "I am a former Regeneron employee (retired).  I can say they are not buying the failing business. They are buying the genetic database to use in the development of new monoclonal antibody therapeutic proteins.  There is an arms race to get to good candidates first to stake out patents to prevent competitors access to whole categories of potential therapies. They have lost several lawsuits to others who got there first metaphorically speaking.  They have technology to rapidly test candidates with Velocogene and could theoretically get dozens of billion dollar drugs from this dataset without any patent fights. The money spent is peanuts to its potential value.  While I am not a huge fan of the cost of these therapies , I personally know the tens to hundreds of thousands of man hours that go into developing these drugs, and they can be astonishingly effective.  It’s not popular to say you worked in big pharma but I’m very proud of the work I did there and how it has affected patients, including members of my own extended family.",
                "I never did a DNA test because I always felt it was going to be used for transactional reasons. This is exactly why; Your information is whoever buys it.",
                "I sent my DNA in knowing all the pitfalls (to Ancestry, not 23andMe, but same thing) because I'm adopted and wanted to find my biological family. I actually found them, and now have a solid relationship with my full biological brother, which has been well worth any horrors that might occur from my DNA being in a database. Otherwise, I wouldn't do this.",
                "Ah, good thing it didn’t get sold to an unscrupulous buyer that engages in securities fraud, price fixing, and has ties to the current administration. \n\nOh wait.  \n\nIf you haven’t deleted your data from 23andMe, do it now.",
                "Ok, I guess I need to brace for the downvotes given the current comments here. \n\nHonestly, this is worlds better than an insurance company or some random tech startup with undescribed end goals, guys. This is a legitimate big pharmaceutical company who has a lot of R&D around genetic disease and has made a lot of therapeutic advances. They want the data to develop new therapies, probably ones for genetic based disease. Being the first to do this will make them so much money. That’s their goal here, I think. It’s new massively growing space in R&D. And this much genetic data is research treasure trove for them.\n\nThey are also going to have pre-designed protocols and standards when it comes to handling this data. I know people side eye big pharma (rightfully in most circumstances) but this is a much better outcome than many other situations.\n\nAm I saying don’t delete your data? No. Am I saying this is better than pretty much any other potential buyer? Absolutely.\n\nI also want to add one thing: All the stuff about Trump ties is wild. Pretty much every pharma company (and  many of the academic researchers that Trump is now black listing from NIH funding due to their coronavirus research) got Project Warp Speed funding during the pandemic. Monoclonal antibody treatment was an absolute scientific miracle. So were the other rapid vaccine developments during the pandemic. It saved so many lives.",
                "Regeneron is the biggest company that created the monoclonal antibody treatment that was used as a post-infective treatment for COVID. Trump himself got it when he was infected. \n\nThey were also the recipient of close to half a billion in funding from Trump's Operation Warp Speed, the government-funded race to come up with vaccines and treatments for COVID.\n\nThe CEO and the company were treated quite preferentially by Ron DeSantis during the Biden years. \n\nSo we are talking strong ties to Trump and the GOP. It's not entirely out of the realm of possibility for them to sell the data inappropriately for unethical ends. Like HHS' contemplated autism DB. Thiel's Palantir. DOGE for whatever dystopic reason. ICE for a different dystopia. And of course, insurance companies."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 3052,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "America elected the dumbest idiot in the history of the nation",
                "No need to pretend anymore.",
                "Sure am glad that all those purists who voted \"third party\" because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.",
                "i’m sure the comments will be totally normal here",
                "But Jill Stein said if people voted for her, she'd solve everything?",
                "Remember when pro-Palestinian protestors were calling Joe Biden and Kamala Harris facists before the election? Look where we are now.",
                "Gaza speaking less and less now.\n\nGood job protest voters.",
                "Basically in any conflict if you are the richest most powerful side Trump is with you."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "30-year Treasury yield jumps above 5% after Moody's downgrades U.S. credit rating",
            "external_url": "https://www.cnbc.com/2025/05/19/us-treasury-yields-moodys-downgrades-us-credit-rating.html",
            "upvotes": 5201,
            "date": "05/19/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136194-17455098532025-04-24t154347z_1903305251_rc2e4eazuveh_rtrmadp_0_usa-stocks.jpeg?v=1745598876&w=1920&h=1080",
            "top_comments": [
                "i'm too poor to understand what this means",
                "Markets are down and treasury yields are up. That's a very bad sign.\n\nThe US is getting hit with a \"moron penalty\" from global investors.",
                "And Bessent “doesn’t care.” 🙄 Mother fucker.",
                "I remember when it was an alleged HUGE DEAL when the US rating first dropped in 2011. The big corporate media alarmist reporting was non-stop. All the talking heads were blathering. Everything was just a way bigger deal when Obama was in office for ::reasons:: 😆",
                "Trump doesn’t have the cards, but he went all in on a mind numbingly transparent and idiotic bluff, and he lost. Like with all things Trump, he’s left someone else with the bill (in this case the American taxpayers). He still gets to collect bribes with impunity thanks to the corrupt MAGA party that refuses to hold him accountable. ",
                "Well played Russia. They were never going to defeat US in a military war. Paying for a Russian Asset to bury the US economy 4 feet under though...",
                "We're , we're not even 6 months in. ",
                "Let me guess. Market going back down, it's Biden fault again until they go back up for a day. Then it's Rumps market. Until the downfall again and then it's Biden again. \n\nNothing shows accountability, like lack of accountability. \n\n8647.",
                "Can anyone explain this like they’re talking to a five year old for me? Uh uh uh it’s so I explain it to my 5 year old it’s not for me clearly I understand what this means.",
                "Tax cuts are a very bad idea.  Republicans are like crack addicts.  They will sell out everybody and rationalize their need for their next fix.  They will get high for a while and start over.  More tax cuts.  Rich getting richer.  Middle class getting poorer.  Bankers, CEOs moaning about how it's all the fault of  the debt and those social programs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 3480,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "Another example as to why independent media is important",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "Last night on Last Week Tonight.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "Another brick in the wall against fascism has crumbled.",
                "It's all about the Benjamins. News left the room when it was placed under \"entertainment\" management years ago. Rich people are trying to make more money while pissing on the proletariat.",
                "What a fucking coward. \n\nNever let anyone tell you that journalism is alive in America. That shit was killed long ago and the sycophants who are running media now are all complicit jackasses.",
                "Yeah I canceled Paramount and let them know it was only because they flushed their integrity by capitulating to the dictator."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "70% of the DOJ's Civil Rights Division lawyers are leaving because of Trump's reshaping",
            "external_url": "https://www.npr.org/2025/05/19/g-s1-66906/trump-civil-rights-justice-exodus",
            "upvotes": 2629,
            "date": "05/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7495x4216+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F5b%2Fffb7ca6c4105945ceb2403174df8%2Fgettyimages-2202122201-1.jpg",
            "top_comments": [
                "“Reshaping”\n\nNever knew that was a synonym for “corruption-driven vendetta”.",
                "Great. Now the DOJ is going to be filled with Fox News employees",
                "Trump is in the process of removing all opposition. It couldn't be any more obvious. Everyone should have a red light flashing in their brain.",
                "Shockingly, people who have dedicated their lives to advancing civil rights don't want to be part of an administration hell bent on reversing them.",
                "It’s like Putin is in the white house and he’s just destroying as much as possible",
                "Just as it was intended to",
                "Trump keeps losing in the courts because he is running out of lawyers. \n\nMalevolence tempered by incompetence.",
                "If you were trying to resegregate American society while maintaining an air of plausible deniability about it, your actions wouldn't look that different from Trump's",
                "Children born now are so unimaginably screwed in so many ways",
                "Why do these people keep quitting when we need them to stay and obstruct as much as they can. Pretend to be on the same page and just fuck up your job at every turn. What's the worst they can do to you? Fire you? Seriously stay in your position and just really suck at your job.. as much as you can get away with. Use up their resources, pretend to be working for them and do nothing... fuck them from the inside."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump administration to strip legal protections from 350,000 Venezuelans, potentially exposing them to deportation.",
            "external_url": "https://apnews.com/article/supreme-court-venezuelans-deportation-trump-5589f17e0ecd5d33bfb220e15720f88d",
            "upvotes": 1585,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only one noted dissent is very interesting.",
                "Sad but expected. TPS designation is pretty explicitly under the domain of the executive branch. And this is just letting the former designation expire, simply refusing to extend it. Rather than trying to end the designation prematurely.",
                "*Exile* not deportation.\n\nThese people will not go to Venezuela, they'll be [trafficked to El Salvador, Libya, Rwanda](https://www.nytimes.com/2025/05/14/world/trump-administration-deportees.html)",
                "This is not deportation. This is human trafficking. They will be sold into slavery. Deportation means they get due process and are sent freely back to their country of origin. These are crimes against humanity. The rest of the world should be sanctioning us.",
                "So we're being invaded by gangs from Venezuela, enough so that Trump needed to enact the alien enemies act, but also, Venezuela isn't too dangerous anymore and it's safe to send Venezuelan refugees back to Venezuela? The supreme court doesn't ask questions like this?",
                "Hateful, racist administration that's doing *exactly* what they said they wanted to do.",
                "Just shows the us constitution is just an old piece of paper. ",
                "Hey for those Venezuelan Trumpers  who had TPS family members, I’m gonna play “Yo Voto por Donal Tron” while they get sent home!!!",
                "Donald Trump is an unfathomably evil sociopathic monster who must be tried for crimes against humanity.",
                "Trump is shooting himself in the foot here. Venezuelans typically vote Republican"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 39618,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.\n\nEdit: if you want to help the national weather service, you can look into volunteering to collect weather data through [CoCoRaHS](https://www.weather.gov/ilm/cocorahs).",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Spain orders Airbnb to block nearly 66,000 holiday rental listings over rule violations",
            "external_url": "https://apnews.com/article/airbnb-spain-rental-listing-a91e605f6342db1b169d4f9d1681e9d4",
            "upvotes": 1672,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've been a fan of AIRBnB for a long time, and I like the idea of people being able to rent out a home, their own or another, for a short period of time...\n\nBut it's gotten too commercialized.\n\nSites like these should only be allowing individuals, not businesses, who normally reside in those countries to rent out their primary, or perhaps a secondary residence for short term rentals.\n\nPeople shouldnt have 3+ properties they are renting out short term.  You want to have 3+ properties, long term rentals only for anything above your primary +1.\n\nI still use AIRBnB, but hotel pricing has come a long way in the past few years, where now it's a toss up if I look at Airbnb or hotels when I'm on vacation.  So it isn't even the savings it used to be which drove me to it in the first place.",
                "I was such a big fan of Airbnb, I did everything with it, vacations, just a night out in another city, everything. Then it turned to shit. Now I don't want anything to do with it.",
                "Good.\n\nTourism is a big part of the Spanish economy but it has l been kidnapped by capitalist profiteers who will do everything to earn an extra penny.\n\nThey are squeezing out the liveability of the big city's and making live miserable for both the citizens as wel as the tourists.",
                "It's not enough. To solve the housing crisis you need to ban corporations from buying, owning and renting homes, as well as institute a cap on property ownership (imo no more than 2 properties per person), and heavily tax short term rentals. Just going after AirBnB is like putting a bandaid on an exposed bone ",
                "Hate airBNBs The ruin quiet neighborhoods and are mostly corporate owned",
                "I still dont get why Airbnb hosts charge you a cleaning fee then ask you to run the dishwasher, laundry, take the trash out etc. Haven't used Airbnb for a few years now because of this. You can't charge me a cleaning fee and make me do chores. Its one or the other",
                "We should've done the same here in Portugal. Unfortunately, we are now paying the price of inaction - socialy, financialy, and politicaly.",
                "not one airbnb i’ve stayed in has lived up to its advertisement. and, i’ve never had to clean up take out trash or risk a fee penalty at a hotel before.",
                "Also for anyone using airBNB good luck dealing with their customer support team",
                "So much hate in this thread. The underlying problem is restrictions for building new homes. Banning Airbnb is not going to solve the problem. Tourism is a major industry that creates jobs and brings tax revenue. We always need to strike a balance."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Yellowstone Park officials take action: Grizzly bear euthanized for repeatedly accessing trash",
            "external_url": "https://www.denver7.com/science-and-tech/animals-and-insects/yellowstone-park-officials-take-action-grizzly-bear-euthanized-for-repeatedly-accessing-trash",
            "upvotes": 1649,
            "date": "05/19/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/41176df/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F14%2F88%2F5a56c5f14717869fa31704a1acb5%2F54521718168-6343a39264-k.jpg",
            "top_comments": [
                "R.I.P Yogi, too smart for his own good.",
                ">The bear, weighing approximately 400 pounds, had overturned multiple large, bear-resistant dumpsters and accessed human food and trash at popular locations, including Old Faithful, the Nez Perce Picnic Area, and the Midway Geyser Basin parking lot.\n\n\"There is considerable overlap between the intelligence of the smartest bears and the dumbest tourists.\"\n\n-Yosemite National Park ranger, attributed.",
                "I feel like the trash is the bigger problem than the bear. That was his home. Not ours and not our trash’s.",
                "What about the dirty humans creating the trash.",
                "ITT alot of people who underestimate Grizzly Bears, apparently",
                "So they killed a bear for doing bear shit?",
                "Are the job cuts to park rangers to blame for this? Should the trash not be regularly emptied? Are they unable to empty it as frequently with less rangers? If so, glad to know that even animals are being killed because of this dumb shit.",
                "His crime was loving the garbage too much. ",
                "nature always pays the price for human stupidity,  it's heartbreaking,  wish they had tried to relocate the bear first.",
                "So sad.  Necessary, but so damn sad.  That bear did nothing wrong."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "An inquiry says France’s government covered up Nestle’s illegal treatment of bottled water",
            "external_url": "https://apnews.com/article/france-water-scandal-perrier-senate-investigation-nestle-ec05af578d705a6f06d5df99ae1e85c8",
            "upvotes": 566,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Last year, the Swiss company publicly acknowledged having used treatments on mineral waters and agreed to pay a 2 million euro fine ($2.2 million) to avoid legal action.\n\n>Alexandre Ouizille, the commission’s rapporteur, said the total amount of the fraud has been estimated at over 3 billion euros ($3.38 billion) by France’s agency in charge of fraud control.\n\n$2mil to rake in billions? Yeah, I'd take that deal.",
                "Fuck nestle. Oh wait, big corp? I mean who doesn't love nestle",
                "It's an intense competition, but Nestle is always working hard to be the worst company in the world.",
                "Fuck the gov, Nestlé is evil.",
                "[This doesn’t even crack the Top 10 of “Shittiest things ever done by Nestlé](https://en.m.wikipedia.org/wiki/Controversies_of_Nestlé)",
                "An entire article about their use of banned water treatments, without at any point mentioning what the treatments they were using were, or why they are banned.",
                "I never buy their products!",
                ">illegal treatment of bottled water\n\n\"Please show the court on this bottle where Nestle touched you.\"",
                "But wait. My liberal friends tell me the government will resolve all human inequities! How can France's government do this, unless they themselves are composed also of humans who need to be governed.\n\nI, for one, welcome our new AI overlords."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration to pay $5 million to family of Jan. 6 rioter Ashli Babbitt",
            "external_url": "https://www.cbsnews.com/news/trump-administration-5-million-ashli-babbitt-jan-6-rioter-who-was-killed/",
            "upvotes": 293,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/9ffec37c-c692-4567-94a2-5e37a1afe9eb/thumbnail/1200x630g3/eb119d6ad53eb10ffb3b667fe65772e7/gettyimages-1471239701.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This action is 100% designed to convince fanatics to willfully sacrifice themselves in the future.",
                "No, the American Taxpayers will pay $5M to her family. \n\nAsk yourself if you’re okay with sending money to the family of a domestic terrorist.",
                "That's American taxpayer dollars going to someone who was trying to overthrow our government.  Our country is so fucked.",
                "Oh fuck this. Don't storm a government building then try to climb through a window to get at legislators, or they're gonna shoot you.",
                "You mean Ashli Babbitt the terrorist?",
                "She was a domestic terrorist. Donald trump is a domestic terrorist. MAGA is a domestic terrorist organization.",
                "What a joke. People shouldn’t be given monetary prizes for winning Darwin Awards.",
                "She should have just complied but who am I right?",
                "Fucking horse shit that dumb cow entered a federal building while it was locked down, fucked around and got dead. So she is a hero ? Fuck this entire hypocritical administration.",
                "Murdered.  Pft.  Shot down while committing seditious acts, after being given plenty of warnings.\n\nHer family can be disappointed in her for free."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 3053,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "America elected the dumbest idiot in the history of the nation",
                "No need to pretend anymore.",
                "Sure am glad that all those purists who voted \"third party\" because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.",
                "i’m sure the comments will be totally normal here",
                "But Jill Stein said if people voted for her, she'd solve everything?",
                "Remember when pro-Palestinian protestors were calling Joe Biden and Kamala Harris facists before the election? Look where we are now.",
                "Gaza speaking less and less now.\n\nGood job protest voters.",
                "Basically in any conflict if you are the richest most powerful side Trump is with you."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge strikes down DOGE takeover of the U.S. Institute of Peace",
            "external_url": "https://www.nbcnews.com/politics/doge/judge-strikes-doge-takeover-us-institute-peace-rcna207741",
            "upvotes": 517,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250329-United-States-Institute-of-Peace-ch-1237-ba00c8.jpg",
            "top_comments": [
                "> After members of the DOGE team took over the building with the help of law enforcement. most institute employees were subsequently laid off.\n\nCan we really call them \"law enforcement\" at this point?  \nWhat they were doing wasn't legal.",
                ">The United States Institute of Peace has existed for 40 years on a $50 million annual budget, *but failed to deliver peace*. President Trump is right to reduce failed, useless entities like USIP to their statutory minimum.\n\nUmm... I'm pretty sure that's not how peace works.\n\nIf delivery of peace was ever a possibility on a $50M annual budget the world would be a much better place. Not being 100% successful in an impossible mission doesn't mean their work didn't contribute to peace, or that it wasn't worth the cost.",
                "This isn't going to bring back USIP; what's done is done. The staff have all been fired and the programs shuttered.",
                "As Orange Marmalade has said repeatedly, there are armed, face-masked gangs of criminals roaming our streets, and the present administration is doing nothing about them.  Not sure if THEY are eating the pets, the cats, and the dogs, but I would not put it past them at this point.\n\nStay Safe Americans.  Reducing your suntan(s) for the next few years is probably the smart move here.",
                "So..... when do we start calling these 'law enforcement agents' the Covfefe or Orange Police?",
                "Not gonna lie, I didn’t know there was a US Institute of Peace."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FDA approves Novavax COVID-19 vaccine, but with unusual restrictions on its use",
            "external_url": "https://www.pbs.org/newshour/health/fda-approves-novavax-covid-19-vaccine-but-with-unusual-restrictions-on-its-use",
            "upvotes": 76,
            "date": "05/19/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/05/2022-02-26T000000Z_1777580550_RC2LRS9HXEO6_RTRMADP_3_HEALTH-CORONAVIRUS-VACCINE-NOVAVAX-1024x728.jpg",
            "top_comments": [
                "Being overweight is considered a health risk for COVID 19, so 90% of us will be able to get it at any age 12 and over.",
                "This is just a bunch of blah.\n\nLet's see what insurance companies that want to reduce their health claims (putting their money where their mouth is) come out with.  If they do not protect their bottom line by advocating for treatments that reduce their long-term costs............then.............can you say \"shareholder lawsuits?    \n\nThe golden age of the legal profession is upon us.",
                "I feel like people are going to end up crossing the border to Canada trying to get flu and Covid shots this year.",
                "Sounds like Americans will continue sticking with Pfizer.",
                "So they don't trust mRNA vaccines, but they put severe restrictions on the only traditional covid vaccine??",
                "I can’t get this vaccine just because RFK Jr. says I can’t?",
                "This is what happens when they miss the opportunity with a manufacturing issue during the pandemic. Now the entire business model is not viable",
                "I hesitate to get a vaccine planned during this administration. It wouldn't surprise me if it was just saline \"to own the libs.\"  These are the same people who would eat a shit sandwich just so the people around them had to smell their breath, and vaccines have been one of their major rallying cries."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'Narco Kitten': Cat caught after smuggling drugs into Costa Rican prison",
            "external_url": "https://www.cnn.com/2025/05/19/world/video/cat-smuggle-drug-into-costa-rican-prison-digvid",
            "upvotes": 168,
            "date": "05/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/112280-narcokitten-00-00-27-07-still001.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He will be purrsecuted for a feline-y.",
                "A cat would never narc on anyone.",
                "I can haz methamphetamine",
                "Given 9 life sentences.",
                "Whew. “Attached to its body.” I was afraid they’d sewn it into the animal somehow. ☹️",
                "When a cat catches a felony.",
                "Standard cat behavior, tbh.",
                "Move to the side dog whisperer, we got cat trainer here!",
                "Sentenced to 5 life sentences with a chance of parole after 3.",
                "I'm surprised there isn't a punk band named Narco Kitten"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "An inquiry says France’s government covered up Nestle’s illegal treatment of bottled water",
            "external_url": "https://apnews.com/article/france-water-scandal-perrier-senate-investigation-nestle-ec05af578d705a6f06d5df99ae1e85c8",
            "upvotes": 568,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Last year, the Swiss company publicly acknowledged having used treatments on mineral waters and agreed to pay a 2 million euro fine ($2.2 million) to avoid legal action.\n\n>Alexandre Ouizille, the commission’s rapporteur, said the total amount of the fraud has been estimated at over 3 billion euros ($3.38 billion) by France’s agency in charge of fraud control.\n\n$2mil to rake in billions? Yeah, I'd take that deal.",
                "Fuck nestle. Oh wait, big corp? I mean who doesn't love nestle",
                "It's an intense competition, but Nestle is always working hard to be the worst company in the world.",
                "Fuck the gov, Nestlé is evil.",
                "[This doesn’t even crack the Top 10 of “Shittiest things ever done by Nestlé](https://en.m.wikipedia.org/wiki/Controversies_of_Nestlé)",
                "An entire article about their use of banned water treatments, without at any point mentioning what the treatments they were using were, or why they are banned.",
                "I never buy their products!",
                ">illegal treatment of bottled water\n\n\"Please show the court on this bottle where Nestle touched you.\"",
                "But wait. My liberal friends tell me the government will resolve all human inequities! How can France's government do this, unless they themselves are composed also of humans who need to be governed.\n\nI, for one, welcome our new AI overlords."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump administration to strip legal protections from 350,000 Venezuelans, potentially exposing them to deportation.",
            "external_url": "https://apnews.com/article/supreme-court-venezuelans-deportation-trump-5589f17e0ecd5d33bfb220e15720f88d",
            "upvotes": 1583,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only one noted dissent is very interesting.",
                "Sad but expected. TPS designation is pretty explicitly under the domain of the executive branch. And this is just letting the former designation expire, simply refusing to extend it. Rather than trying to end the designation prematurely.",
                "*Exile* not deportation.\n\nThese people will not go to Venezuela, they'll be [trafficked to El Salvador, Libya, Rwanda](https://www.nytimes.com/2025/05/14/world/trump-administration-deportees.html)",
                "This is not deportation. This is human trafficking. They will be sold into slavery. Deportation means they get due process and are sent freely back to their country of origin. These are crimes against humanity. The rest of the world should be sanctioning us.",
                "So we're being invaded by gangs from Venezuela, enough so that Trump needed to enact the alien enemies act, but also, Venezuela isn't too dangerous anymore and it's safe to send Venezuelan refugees back to Venezuela? The supreme court doesn't ask questions like this?",
                "Hateful, racist administration that's doing *exactly* what they said they wanted to do.",
                "Just shows the us constitution is just an old piece of paper. ",
                "Hey for those Venezuelan Trumpers  who had TPS family members, I’m gonna play “Yo Voto por Donal Tron” while they get sent home!!!",
                "Donald Trump is an unfathomably evil sociopathic monster who must be tried for crimes against humanity.",
                "Trump is shooting himself in the foot here. Venezuelans typically vote Republican"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Nippon Steel to invest $4 billion for new U.S. Steel mill in $14 billion package, document says",
            "external_url": "https://www.reuters.com/business/nippon-steel-invest-14-billion-us-steel-including-4-billion-new-mill-document-2025-05-19/",
            "upvotes": 374,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sure, I've seen this one before.  I'll believe it when they actually start making steel here.  Trump got Foxconn to say they were going to build a $10B factory in Wisconsin during his last term as president and of course that never happened either.  Foxconn basically bought some land, got a big pile of money from Wisconsin,  started building some generic buildings, kept delaying actually doing anything with them, and then finally sold them to Microsoft a couple of years ago.\n\nExact same thing will happen this time.",
                "People say lots of things. They do much less though. Until that mill is shutting out beams it’s all just talk.",
                "Reminds me of the intel plant in ohio",
                "Part of the acquisition plan from april 24",
                "Glorious nippon steel folded over a thousand times?",
                "I honestly don’t know why they want that mill.\n\nIt would take a decade (or more) to bring that plant up to modern standards, if you could manage to get union buy in, which will never happen.\n\nThe union fighting modernization (Joe who makes wagon wheels can’t lose his job) is why it’s in such poor shape to begin with.",
                "Why anyone still wants to deal with or invest in the US at this point is beyond me",
                "The grifting will continue until the economy improves!",
                "Donnie making deals and winning hearts!",
                "Apparently this sub removes all pro-Trump posts, but I think you found the loophole. As long as you post the article and leave Trump's name out of it so he can't get credit, then this sub will accept it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "70% of the DOJ's Civil Rights Division lawyers are leaving because of Trump's reshaping",
            "external_url": "https://www.npr.org/2025/05/19/g-s1-66906/trump-civil-rights-justice-exodus",
            "upvotes": 2632,
            "date": "05/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7495x4216+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F5b%2Fffb7ca6c4105945ceb2403174df8%2Fgettyimages-2202122201-1.jpg",
            "top_comments": [
                "“Reshaping”\n\nNever knew that was a synonym for “corruption-driven vendetta”.",
                "Great. Now the DOJ is going to be filled with Fox News employees",
                "Trump is in the process of removing all opposition. It couldn't be any more obvious. Everyone should have a red light flashing in their brain.",
                "Shockingly, people who have dedicated their lives to advancing civil rights don't want to be part of an administration hell bent on reversing them.",
                "It’s like Putin is in the white house and he’s just destroying as much as possible",
                "Just as it was intended to",
                "Trump keeps losing in the courts because he is running out of lawyers. \n\nMalevolence tempered by incompetence.",
                "If you were trying to resegregate American society while maintaining an air of plausible deniability about it, your actions wouldn't look that different from Trump's",
                "Children born now are so unimaginably screwed in so many ways",
                "Why do these people keep quitting when we need them to stay and obstruct as much as they can. Pretend to be on the same page and just fuck up your job at every turn. What's the worst they can do to you? Fire you? Seriously stay in your position and just really suck at your job.. as much as you can get away with. Use up their resources, pretend to be working for them and do nothing... fuck them from the inside."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 3486,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "Another example as to why independent media is important",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "Last night on Last Week Tonight.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "Another brick in the wall against fascism has crumbled.",
                "It's all about the Benjamins. News left the room when it was placed under \"entertainment\" management years ago. Rich people are trying to make more money while pissing on the proletariat.",
                "What a fucking coward. \n\nNever let anyone tell you that journalism is alive in America. That shit was killed long ago and the sycophants who are running media now are all complicit jackasses.",
                "Yeah I canceled Paramount and let them know it was only because they flushed their integrity by capitulating to the dictator."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "70% of the DOJ's Civil Rights Division lawyers are leaving because of Trump's reshaping",
            "external_url": "https://www.npr.org/2025/05/19/g-s1-66906/trump-civil-rights-justice-exodus",
            "upvotes": 2634,
            "date": "05/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7495x4216+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F5b%2Fffb7ca6c4105945ceb2403174df8%2Fgettyimages-2202122201-1.jpg",
            "top_comments": [
                "“Reshaping”\n\nNever knew that was a synonym for “corruption-driven vendetta”.",
                "Great. Now the DOJ is going to be filled with Fox News employees",
                "Trump is in the process of removing all opposition. It couldn't be any more obvious. Everyone should have a red light flashing in their brain.",
                "Shockingly, people who have dedicated their lives to advancing civil rights don't want to be part of an administration hell bent on reversing them.",
                "It’s like Putin is in the white house and he’s just destroying as much as possible",
                "Just as it was intended to",
                "Trump keeps losing in the courts because he is running out of lawyers. \n\nMalevolence tempered by incompetence.",
                "If you were trying to resegregate American society while maintaining an air of plausible deniability about it, your actions wouldn't look that different from Trump's",
                "Children born now are so unimaginably screwed in so many ways",
                "Why do these people keep quitting when we need them to stay and obstruct as much as they can. Pretend to be on the same page and just fuck up your job at every turn. What's the worst they can do to you? Fire you? Seriously stay in your position and just really suck at your job.. as much as you can get away with. Use up their resources, pretend to be working for them and do nothing... fuck them from the inside."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge strikes down DOGE takeover of the U.S. Institute of Peace",
            "external_url": "https://www.nbcnews.com/politics/doge/judge-strikes-doge-takeover-us-institute-peace-rcna207741",
            "upvotes": 518,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250329-United-States-Institute-of-Peace-ch-1237-ba00c8.jpg",
            "top_comments": [
                "> After members of the DOGE team took over the building with the help of law enforcement. most institute employees were subsequently laid off.\n\nCan we really call them \"law enforcement\" at this point?  \nWhat they were doing wasn't legal.",
                ">The United States Institute of Peace has existed for 40 years on a $50 million annual budget, *but failed to deliver peace*. President Trump is right to reduce failed, useless entities like USIP to their statutory minimum.\n\nUmm... I'm pretty sure that's not how peace works.\n\nIf delivery of peace was ever a possibility on a $50M annual budget the world would be a much better place. Not being 100% successful in an impossible mission doesn't mean their work didn't contribute to peace, or that it wasn't worth the cost.",
                "This isn't going to bring back USIP; what's done is done. The staff have all been fired and the programs shuttered.",
                "As Orange Marmalade has said repeatedly, there are armed, face-masked gangs of criminals roaming our streets, and the present administration is doing nothing about them.  Not sure if THEY are eating the pets, the cats, and the dogs, but I would not put it past them at this point.\n\nStay Safe Americans.  Reducing your suntan(s) for the next few years is probably the smart move here.",
                "So..... when do we start calling these 'law enforcement agents' the Covfefe or Orange Police?",
                "Not gonna lie, I didn’t know there was a US Institute of Peace."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration to pay $5 million to family of Jan. 6 rioter Ashli Babbitt",
            "external_url": "https://www.cbsnews.com/news/trump-administration-5-million-ashli-babbitt-jan-6-rioter-who-was-killed/",
            "upvotes": 289,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/9ffec37c-c692-4567-94a2-5e37a1afe9eb/thumbnail/1200x630g3/eb119d6ad53eb10ffb3b667fe65772e7/gettyimages-1471239701.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This action is 100% designed to convince fanatics to willfully sacrifice themselves in the future.",
                "No, the American Taxpayers will pay $5M to her family. \n\nAsk yourself if you’re okay with sending money to the family of a domestic terrorist.",
                "That's American taxpayer dollars going to someone who was trying to overthrow our government.  Our country is so fucked.",
                "Oh fuck this. Don't storm a government building then try to climb through a window to get at legislators, or they're gonna shoot you.",
                "You mean Ashli Babbitt the terrorist?",
                "She was a domestic terrorist. Donald trump is a domestic terrorist. MAGA is a domestic terrorist organization.",
                "What a joke. People shouldn’t be given monetary prizes for winning Darwin Awards.",
                "She should have just complied but who am I right?",
                "Fucking horse shit that dumb cow entered a federal building while it was locked down, fucked around and got dead. So she is a hero ? Fuck this entire hypocritical administration.",
                "Murdered.  Pft.  Shot down while committing seditious acts, after being given plenty of warnings.\n\nHer family can be disappointed in her for free."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 3056,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "America elected the dumbest idiot in the history of the nation",
                "No need to pretend anymore.",
                "Sure am glad that all those purists who voted \"third party\" because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.",
                "i’m sure the comments will be totally normal here",
                "But Jill Stein said if people voted for her, she'd solve everything?",
                "Remember when pro-Palestinian protestors were calling Joe Biden and Kamala Harris facists before the election? Look where we are now.",
                "Gaza speaking less and less now.\n\nGood job protest voters.",
                "Basically in any conflict if you are the richest most powerful side Trump is with you."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump administration to strip legal protections from 350,000 Venezuelans, potentially exposing them to deportation.",
            "external_url": "https://apnews.com/article/supreme-court-venezuelans-deportation-trump-5589f17e0ecd5d33bfb220e15720f88d",
            "upvotes": 1583,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only one noted dissent is very interesting.",
                "Sad but expected. TPS designation is pretty explicitly under the domain of the executive branch. And this is just letting the former designation expire, simply refusing to extend it. Rather than trying to end the designation prematurely.",
                "*Exile* not deportation.\n\nThese people will not go to Venezuela, they'll be [trafficked to El Salvador, Libya, Rwanda](https://www.nytimes.com/2025/05/14/world/trump-administration-deportees.html)",
                "This is not deportation. This is human trafficking. They will be sold into slavery. Deportation means they get due process and are sent freely back to their country of origin. These are crimes against humanity. The rest of the world should be sanctioning us.",
                "So we're being invaded by gangs from Venezuela, enough so that Trump needed to enact the alien enemies act, but also, Venezuela isn't too dangerous anymore and it's safe to send Venezuelan refugees back to Venezuela? The supreme court doesn't ask questions like this?",
                "Hateful, racist administration that's doing *exactly* what they said they wanted to do.",
                "Just shows the us constitution is just an old piece of paper. ",
                "Hey for those Venezuelan Trumpers  who had TPS family members, I’m gonna play “Yo Voto por Donal Tron” while they get sent home!!!",
                "Donald Trump is an unfathomably evil sociopathic monster who must be tried for crimes against humanity.",
                "Trump is shooting himself in the foot here. Venezuelans typically vote Republican"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "An inquiry says France’s government covered up Nestle’s illegal treatment of bottled water",
            "external_url": "https://apnews.com/article/france-water-scandal-perrier-senate-investigation-nestle-ec05af578d705a6f06d5df99ae1e85c8",
            "upvotes": 569,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Last year, the Swiss company publicly acknowledged having used treatments on mineral waters and agreed to pay a 2 million euro fine ($2.2 million) to avoid legal action.\n\n>Alexandre Ouizille, the commission’s rapporteur, said the total amount of the fraud has been estimated at over 3 billion euros ($3.38 billion) by France’s agency in charge of fraud control.\n\n$2mil to rake in billions? Yeah, I'd take that deal.",
                "Fuck nestle. Oh wait, big corp? I mean who doesn't love nestle",
                "It's an intense competition, but Nestle is always working hard to be the worst company in the world.",
                "Fuck the gov, Nestlé is evil.",
                "[This doesn’t even crack the Top 10 of “Shittiest things ever done by Nestlé](https://en.m.wikipedia.org/wiki/Controversies_of_Nestlé)",
                "An entire article about their use of banned water treatments, without at any point mentioning what the treatments they were using were, or why they are banned.",
                "I never buy their products!",
                ">illegal treatment of bottled water\n\n\"Please show the court on this bottle where Nestle touched you.\"",
                "But wait. My liberal friends tell me the government will resolve all human inequities! How can France's government do this, unless they themselves are composed also of humans who need to be governed.\n\nI, for one, welcome our new AI overlords."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 3485,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "Another example as to why independent media is important",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "Last night on Last Week Tonight.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "Another brick in the wall against fascism has crumbled.",
                "It's all about the Benjamins. News left the room when it was placed under \"entertainment\" management years ago. Rich people are trying to make more money while pissing on the proletariat.",
                "What a fucking coward. \n\nNever let anyone tell you that journalism is alive in America. That shit was killed long ago and the sycophants who are running media now are all complicit jackasses.",
                "Yeah I canceled Paramount and let them know it was only because they flushed their integrity by capitulating to the dictator."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Spain orders Airbnb to block nearly 66,000 holiday rental listings over rule violations",
            "external_url": "https://apnews.com/article/airbnb-spain-rental-listing-a91e605f6342db1b169d4f9d1681e9d4",
            "upvotes": 1675,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've been a fan of AIRBnB for a long time, and I like the idea of people being able to rent out a home, their own or another, for a short period of time...\n\nBut it's gotten too commercialized.\n\nSites like these should only be allowing individuals, not businesses, who normally reside in those countries to rent out their primary, or perhaps a secondary residence for short term rentals.\n\nPeople shouldnt have 3+ properties they are renting out short term.  You want to have 3+ properties, long term rentals only for anything above your primary +1.\n\nI still use AIRBnB, but hotel pricing has come a long way in the past few years, where now it's a toss up if I look at Airbnb or hotels when I'm on vacation.  So it isn't even the savings it used to be which drove me to it in the first place.",
                "I was such a big fan of Airbnb, I did everything with it, vacations, just a night out in another city, everything. Then it turned to shit. Now I don't want anything to do with it.",
                "Good.\n\nTourism is a big part of the Spanish economy but it has l been kidnapped by capitalist profiteers who will do everything to earn an extra penny.\n\nThey are squeezing out the liveability of the big city's and making live miserable for both the citizens as wel as the tourists.",
                "It's not enough. To solve the housing crisis you need to ban corporations from buying, owning and renting homes, as well as institute a cap on property ownership (imo no more than 2 properties per person), and heavily tax short term rentals. Just going after AirBnB is like putting a bandaid on an exposed bone ",
                "Hate airBNBs The ruin quiet neighborhoods and are mostly corporate owned",
                "I still dont get why Airbnb hosts charge you a cleaning fee then ask you to run the dishwasher, laundry, take the trash out etc. Haven't used Airbnb for a few years now because of this. You can't charge me a cleaning fee and make me do chores. Its one or the other",
                "We should've done the same here in Portugal. Unfortunately, we are now paying the price of inaction - socialy, financialy, and politicaly.",
                "not one airbnb i’ve stayed in has lived up to its advertisement. and, i’ve never had to clean up take out trash or risk a fee penalty at a hotel before.",
                "Also for anyone using airBNB good luck dealing with their customer support team",
                "So much hate in this thread. The underlying problem is restrictions for building new homes. Banning Airbnb is not going to solve the problem. Tourism is a major industry that creates jobs and brings tax revenue. We always need to strike a balance."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "30-year Treasury yield jumps above 5% after Moody's downgrades U.S. credit rating",
            "external_url": "https://www.cnbc.com/2025/05/19/us-treasury-yields-moodys-downgrades-us-credit-rating.html",
            "upvotes": 5194,
            "date": "05/19/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136194-17455098532025-04-24t154347z_1903305251_rc2e4eazuveh_rtrmadp_0_usa-stocks.jpeg?v=1745598876&w=1920&h=1080",
            "top_comments": [
                "i'm too poor to understand what this means",
                "Markets are down and treasury yields are up. That's a very bad sign.\n\nThe US is getting hit with a \"moron penalty\" from global investors.",
                "And Bessent “doesn’t care.” 🙄 Mother fucker.",
                "I remember when it was an alleged HUGE DEAL when the US rating first dropped in 2011. The big corporate media alarmist reporting was non-stop. All the talking heads were blathering. Everything was just a way bigger deal when Obama was in office for ::reasons:: 😆",
                "Trump doesn’t have the cards, but he went all in on a mind numbingly transparent and idiotic bluff, and he lost. Like with all things Trump, he’s left someone else with the bill (in this case the American taxpayers). He still gets to collect bribes with impunity thanks to the corrupt MAGA party that refuses to hold him accountable. ",
                "Well played Russia. They were never going to defeat US in a military war. Paying for a Russian Asset to bury the US economy 4 feet under though...",
                "We're , we're not even 6 months in. ",
                "Let me guess. Market going back down, it's Biden fault again until they go back up for a day. Then it's Rumps market. Until the downfall again and then it's Biden again. \n\nNothing shows accountability, like lack of accountability. \n\n8647.",
                "Can anyone explain this like they’re talking to a five year old for me? Uh uh uh it’s so I explain it to my 5 year old it’s not for me clearly I understand what this means.",
                "Tax cuts are a very bad idea.  Republicans are like crack addicts.  They will sell out everybody and rationalize their need for their next fix.  They will get high for a while and start over.  More tax cuts.  Rich getting richer.  Middle class getting poorer.  Bankers, CEOs moaning about how it's all the fault of  the debt and those social programs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Nippon Steel to invest $4 billion for new U.S. Steel mill in $14 billion package, document says",
            "external_url": "https://www.reuters.com/business/nippon-steel-invest-14-billion-us-steel-including-4-billion-new-mill-document-2025-05-19/",
            "upvotes": 378,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sure, I've seen this one before.  I'll believe it when they actually start making steel here.  Trump got Foxconn to say they were going to build a $10B factory in Wisconsin during his last term as president and of course that never happened either.  Foxconn basically bought some land, got a big pile of money from Wisconsin,  started building some generic buildings, kept delaying actually doing anything with them, and then finally sold them to Microsoft a couple of years ago.\n\nExact same thing will happen this time.",
                "People say lots of things. They do much less though. Until that mill is shutting out beams it’s all just talk.",
                "Reminds me of the intel plant in ohio",
                "Part of the acquisition plan from april 24",
                "Glorious nippon steel folded over a thousand times?",
                "I honestly don’t know why they want that mill.\n\nIt would take a decade (or more) to bring that plant up to modern standards, if you could manage to get union buy in, which will never happen.\n\nThe union fighting modernization (Joe who makes wagon wheels can’t lose his job) is why it’s in such poor shape to begin with.",
                "Why anyone still wants to deal with or invest in the US at this point is beyond me",
                "The grifting will continue until the economy improves!",
                "Donnie making deals and winning hearts!",
                "Apparently this sub removes all pro-Trump posts, but I think you found the loophole. As long as you post the article and leave Trump's name out of it so he can't get credit, then this sub will accept it."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/19/2025 20:10:02 UTC"
}