{
    "posts": [
        {
            "category": "HOT",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 16955,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "You don’t have the cards",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg.",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You could ask Canada... oh, wait."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 29570,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3465/live/53f1c740-0287-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "I think we are burying the lede\n\n>Bukele wrote that the detainees were immediately transferred to El Salvador’s Terrorism Confinement Center (Cecot) “for a period of one year”, something that was “renewable” - suggesting they could be held there for longer.\n>“The United States will pay a very low fee for them, but a high one for us,” he added.\n\nWe are paying (a lot it sounds like) for other countries to run our internment camps",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "Wouldn’t the Alien Enemies Act of 1798 require the US to be at war for this to be legal deportations? Does this mean then that Congress gave a declaration of war to both Mexico and Venezuela which is what the constitution requires or is Trump violating the U.S. constitution that he swore to uphold?",
                "How did they come to determine these were “gang members?”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US military: ISIS No.2 leader killed in Iraq | NHK WORLD-JAPAN News",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250316_04/",
            "upvotes": 2477,
            "date": "03/16/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250316_04_1503575_L.jpg",
            "top_comments": [
                "ABU\nBAKAR\nAL BAGDADI\n\nIs dead",
                "Japan: the world's best source for American news. ",
                "New Shane Gillis material incoming.",
                "if they got the #3 guy now, would that just be the #2 guy again? if so, is the #2 guy even dead then?",
                "\"Who doe number 2 work for\"",
                "Is ISIS even a thing now? I thought the entire organisation just got annihilated few years back?",
                "Well some good news today",
                "*US forces carried out the strike in Iraq's Anbar Province in cooperation with the country's intelligence and security personnel.*\n\nOr in cooperation with itself.",
                "ISIS number 3 leader made President of Syria",
                "Please tell me they used a Ninja Bomb, or Flying Ginsu."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 428,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "The one expected deportation that hasn’t happened yet is the Statue of Liberty. ",
                "Exactly what we need when we are lacking pediatricians and primary care doctors",
                "Has anything this administration done so far actually been beneficial for anyone but themselves?",
                "“Brown Medicine” isn’t what they think it is.",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?",
                "There’s a good chance that there is more to this story than what is in the article. This is intended to enrage the reader and sow discord."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 7098,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "If anyone complains we can just claim they're in a gang and deport them. They probably can't find their ID in the wreckage to prove they're citizens anyway.",
                "Thoughts and tariffs <3",
                "A good time to gut NOAA.",
                "[removed]",
                "God is punishing them, amirite trumpers?",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 401,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And soon enough US Honda will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 1343,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "I may be wrong...but wasn't it tuna fisherman and labor questions at the source of the original Chevron ruling by the Supreme Court?",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "Thank goodness these workers are getting the chance to fight back. Full context for this would take way too much time to explain (I've contributed to a 40-page paper on human rights violations in the seafood industry), so here's a very basic summary. The seafood industry is wrought with criminal activity ranging from theft/misrepresentation to forced labor/genuine slavery. Bumble Bee and their parent company, FCF, are some of the biggest abusers of modern-day slavery.\n\nThe common practice is to hire a ship from another country (usually China, Taiwan, or the Phillipines). That ship hires laborers in a country that has lots of cheap labor (usually Indonesia or Cambodia). Once these people are hired and on the ship, the ship goes out to sea for months, if not years. These workers are stuck without any way to contact their homes and no guarantee that their wages are getting to their families. They're forced to work long hours in unsafe and unsanitary conditions with just enough food to keep them alive. I am not exaggerating when I say complaints are often met with a beating or a bullet to the head. After all that, if the ship does finally dock (which is often delayed due to transshipment and is often only happening for repairs or changing flags at ports of convenience), the workers aren't allowed onto shore or they might get [abandoned in a foreign country](https://apnews.com/article/abandoned-seafarers-labor-unpaid-wages-oceans-83ad0a42debbaf67c18373393fcea753).\n\nOn top of all this, going back to the recruiting process, most honest recruitment agencies know about this and do what they can to prevent people from getting enslaved. So, the companies that are doing this are often connected to organized crime or terrorist organizations. Corruption is a major issue in Indonesia, [especially in their seafood industry](https://www.abc.net.au/news/2020-11-27/rolex-watches-seized-as-indonesian-minister-arrested-corruption/12922796). Fighting back against this is extremely risky.\n\nThese workers are extremely brave as they're potentially facing corruption in multiple countries, organized crime, and massive corporations. Going after Bumble Bee will be difficult as the US doesn't have many laws that can be used to make Bumble Bee liable for human rights violations down its supply chain. If we had many laws for this, Nestlé would've been taken down a long time ago. The contents of the article detail the abuse they faced but didn't clarify the nationality of the captain and registry of the ship. I hope the best for these workers.\n\nAlso, I haven't looked into human rights groups addressing the seafood industry in Indonesia, but if you'd like to help, I recommend [Destructive Fishing Watch - Indonesia](https://dfw.or.id/english-page/).They support workers and fisheries in adopting sustainable fishing practices while providing on the ground resources to those caught in human rights abuses. When I worked with them, they were a little more on the environmental side of things, but it looks like they've been successful in expanding their efforts to organize and represent laborers. Their 2024 report outlines some of the success they've had addressing human rights violations as part of their second strategy. Give them some love so they can keep fighting the good fight!",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 913,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "Sailors have been surviving on turtles for centuries.  The islands of the Caribbean were stoping points for ships to stock up on fresh water, and food (turtles).\n\nChristopher Columbus named The Cayman Islands Los Tortugas because of all the sea turtles there.",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "I think I read this book",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "I wonder if he likes turtles in a cuisine sense now.",
                "Perhaps stuffing his face with turtles was his plan all along? I think there was a bit on QI about giant tortoises being extremely delicious.",
                "Saved by the turtle gods.",
                "Meanwhile people tap out of Alone after 2days of no fish. This dude is resilient",
                "its the guy from the turtle soup problem"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 1039,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "How about a wave of strikes on Putins goblins?",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Y'all are mental I'll if you support the Houthis.",
                "Hasabi about to be furious.",
                "He wants a war so he claim even more powers.",
                "Trump the anti war president."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 2900,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "Literally everyone pointed this out when it was happening",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Yea, no shit, and the dumb motherfuckers bought it yet again.",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "Yeah and idiots like Trump and Rowling fell for it or continued to spread this news. Trump we get, he is an asset. People like Rowling and Joe Rogan have personal issues on it and them go crazy when someone pushes it in the news.",
                "No shit. The IOC never entertained any of this anyway."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Iranian general raises prospect of response amid US strikes on Houthis",
            "external_url": "https://abcnews.go.com/International/iranian-general-raises-prospect-response-amid-us-strikes/story?id=119847045&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 14,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c7b8af1-0bce-4726-9779-15725547cd67/trump-main_1742126398911_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Anti War President says the loser lying fascist scumbag MAGA posers.",
                "Someone is not very good at the \"those guys have nothing to do with us\" denial game."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Swiss Government's New Airplane is Bigger than its Hangar, Runway",
            "external_url": "https://luxurylaunches.com/other_stuff/swiss-government-cant-use-new-private-jet-16032025.php",
            "upvotes": 6,
            "date": "03/17/2025",
            "thumbnail": "https://luxurylaunches.com/wp-content/uploads/2025/03/bombardier-global-7500-business-jet.jpg",
            "top_comments": [
                "Sigh. That's airplane building 101. The plane has to fit INSIDE the hangar and be able to take off FROM the runway.",
                "What if they just tried putting the tip in for a second and see how that goes",
                "*while they fly to the Climate Chanhe Summit 2025*",
                "And this is the country watching over trillions of dollars of other people’s money?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 436,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "The one expected deportation that hasn’t happened yet is the Statue of Liberty. ",
                "Exactly what we need when we are lacking pediatricians and primary care doctors",
                "Has anything this administration done so far actually been beneficial for anyone but themselves?",
                "“Brown Medicine” isn’t what they think it is.",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?",
                "There’s a good chance that there is more to this story than what is in the article. This is intended to enrage the reader and sow discord."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 403,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And soon enough US Honda will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "US military: ISIS No.2 leader killed in Iraq | NHK WORLD-JAPAN News",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250316_04/",
            "upvotes": 2479,
            "date": "03/16/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250316_04_1503575_L.jpg",
            "top_comments": [
                "ABU\nBAKAR\nAL BAGDADI\n\nIs dead",
                "Japan: the world's best source for American news. ",
                "New Shane Gillis material incoming.",
                "if they got the #3 guy now, would that just be the #2 guy again? if so, is the #2 guy even dead then?",
                "\"Who doe number 2 work for\"",
                "Is ISIS even a thing now? I thought the entire organisation just got annihilated few years back?",
                "Well some good news today",
                "*US forces carried out the strike in Iraq's Anbar Province in cooperation with the country's intelligence and security personnel.*\n\nOr in cooperation with itself.",
                "ISIS number 3 leader made President of Syria",
                "Please tell me they used a Ninja Bomb, or Flying Ginsu."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "An assailant sets a woman on fire on a tram in eastern Germany and flees",
            "external_url": "https://apnews.com/article/germany-gera-tram-attack-fire-81b7977336dd626016d40aa6240b3db7",
            "upvotes": 302,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you read the article, it clearly states that it was her husband.  This was not a random attack.",
                "Weird article.  It talks about an assailant and then says the police are searching for the victim’s husband and “couldn’t rule out that he is a danger to the public”. The article makes no mention of the husband being with his wife when she was set on fire. \n\nIt’s like a bad AI wrote the article.  Shouldn’t it just say “the husband is a suspect”?",
                "Hard to catch the dude if they don't provide any description.",
                "\\*L'amour toujours intensifies",
                "[deleted]"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 16951,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "You don’t have the cards",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg.",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You could ask Canada... oh, wait."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 919,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "Sailors have been surviving on turtles for centuries.  The islands of the Caribbean were stoping points for ships to stock up on fresh water, and food (turtles).\n\nChristopher Columbus named The Cayman Islands Los Tortugas because of all the sea turtles there.",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "I think I read this book",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "I wonder if he likes turtles in a cuisine sense now.",
                "Perhaps stuffing his face with turtles was his plan all along? I think there was a bit on QI about giant tortoises being extremely delicious.",
                "Saved by the turtle gods.",
                "Meanwhile people tap out of Alone after 2days of no fish. This dude is resilient",
                "its the guy from the turtle soup problem"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 1040,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "How about a wave of strikes on Putins goblins?",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Y'all are mental I'll if you support the Houthis.",
                "Hasabi about to be furious.",
                "He wants a war so he claim even more powers.",
                "Trump the anti war president."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 1348,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "I may be wrong...but wasn't it tuna fisherman and labor questions at the source of the original Chevron ruling by the Supreme Court?",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "Thank goodness these workers are getting the chance to fight back. Full context for this would take way too much time to explain (I've contributed to a 40-page paper on human rights violations in the seafood industry), so here's a very basic summary. The seafood industry is wrought with criminal activity ranging from theft/misrepresentation to forced labor/genuine slavery. Bumble Bee and their parent company, FCF, are some of the biggest abusers of modern-day slavery.\n\nThe common practice is to hire a ship from another country (usually China, Taiwan, or the Phillipines). That ship hires laborers in a country that has lots of cheap labor (usually Indonesia or Cambodia). Once these people are hired and on the ship, the ship goes out to sea for months, if not years. These workers are stuck without any way to contact their homes and no guarantee that their wages are getting to their families. They're forced to work long hours in unsafe and unsanitary conditions with just enough food to keep them alive. I am not exaggerating when I say complaints are often met with a beating or a bullet to the head. After all that, if the ship does finally dock (which is often delayed due to transshipment and is often only happening for repairs or changing flags at ports of convenience), the workers aren't allowed onto shore or they might get [abandoned in a foreign country](https://apnews.com/article/abandoned-seafarers-labor-unpaid-wages-oceans-83ad0a42debbaf67c18373393fcea753).\n\nOn top of all this, going back to the recruiting process, most honest recruitment agencies know about this and do what they can to prevent people from getting enslaved. So, the companies that are doing this are often connected to organized crime or terrorist organizations. Corruption is a major issue in Indonesia, [especially in their seafood industry](https://www.abc.net.au/news/2020-11-27/rolex-watches-seized-as-indonesian-minister-arrested-corruption/12922796). Fighting back against this is extremely risky.\n\nThese workers are extremely brave as they're potentially facing corruption in multiple countries, organized crime, and massive corporations. Going after Bumble Bee will be difficult as the US doesn't have many laws that can be used to make Bumble Bee liable for human rights violations down its supply chain. If we had many laws for this, Nestlé would've been taken down a long time ago. The contents of the article detail the abuse they faced but didn't clarify the nationality of the captain and registry of the ship. I hope the best for these workers.\n\nAlso, I haven't looked into human rights groups addressing the seafood industry in Indonesia, but if you'd like to help, I recommend [Destructive Fishing Watch - Indonesia](https://dfw.or.id/english-page/).They support workers and fisheries in adopting sustainable fishing practices while providing on the ground resources to those caught in human rights abuses. When I worked with them, they were a little more on the environmental side of things, but it looks like they've been successful in expanding their efforts to organize and represent laborers. Their 2024 report outlines some of the success they've had addressing human rights violations as part of their second strategy. Give them some love so they can keep fighting the good fight!",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 402,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And soon enough US Honda will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 440,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "The one expected deportation that hasn’t happened yet is the Statue of Liberty. ",
                "Exactly what we need when we are lacking pediatricians and primary care doctors",
                "Has anything this administration done so far actually been beneficial for anyone but themselves?",
                "“Brown Medicine” isn’t what they think it is.",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?",
                "There’s a good chance that there is more to this story than what is in the article. This is intended to enrage the reader and sow discord."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 16951,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "You don’t have the cards",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg.",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You could ask Canada... oh, wait."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 1344,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "I may be wrong...but wasn't it tuna fisherman and labor questions at the source of the original Chevron ruling by the Supreme Court?",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "Thank goodness these workers are getting the chance to fight back. Full context for this would take way too much time to explain (I've contributed to a 40-page paper on human rights violations in the seafood industry), so here's a very basic summary. The seafood industry is wrought with criminal activity ranging from theft/misrepresentation to forced labor/genuine slavery. Bumble Bee and their parent company, FCF, are some of the biggest abusers of modern-day slavery.\n\nThe common practice is to hire a ship from another country (usually China, Taiwan, or the Phillipines). That ship hires laborers in a country that has lots of cheap labor (usually Indonesia or Cambodia). Once these people are hired and on the ship, the ship goes out to sea for months, if not years. These workers are stuck without any way to contact their homes and no guarantee that their wages are getting to their families. They're forced to work long hours in unsafe and unsanitary conditions with just enough food to keep them alive. I am not exaggerating when I say complaints are often met with a beating or a bullet to the head. After all that, if the ship does finally dock (which is often delayed due to transshipment and is often only happening for repairs or changing flags at ports of convenience), the workers aren't allowed onto shore or they might get [abandoned in a foreign country](https://apnews.com/article/abandoned-seafarers-labor-unpaid-wages-oceans-83ad0a42debbaf67c18373393fcea753).\n\nOn top of all this, going back to the recruiting process, most honest recruitment agencies know about this and do what they can to prevent people from getting enslaved. So, the companies that are doing this are often connected to organized crime or terrorist organizations. Corruption is a major issue in Indonesia, [especially in their seafood industry](https://www.abc.net.au/news/2020-11-27/rolex-watches-seized-as-indonesian-minister-arrested-corruption/12922796). Fighting back against this is extremely risky.\n\nThese workers are extremely brave as they're potentially facing corruption in multiple countries, organized crime, and massive corporations. Going after Bumble Bee will be difficult as the US doesn't have many laws that can be used to make Bumble Bee liable for human rights violations down its supply chain. If we had many laws for this, Nestlé would've been taken down a long time ago. The contents of the article detail the abuse they faced but didn't clarify the nationality of the captain and registry of the ship. I hope the best for these workers.\n\nAlso, I haven't looked into human rights groups addressing the seafood industry in Indonesia, but if you'd like to help, I recommend [Destructive Fishing Watch - Indonesia](https://dfw.or.id/english-page/).They support workers and fisheries in adopting sustainable fishing practices while providing on the ground resources to those caught in human rights abuses. When I worked with them, they were a little more on the environmental side of things, but it looks like they've been successful in expanding their efforts to organize and represent laborers. Their 2024 report outlines some of the success they've had addressing human rights violations as part of their second strategy. Give them some love so they can keep fighting the good fight!",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 916,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "Sailors have been surviving on turtles for centuries.  The islands of the Caribbean were stoping points for ships to stock up on fresh water, and food (turtles).\n\nChristopher Columbus named The Cayman Islands Los Tortugas because of all the sea turtles there.",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "I think I read this book",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "I wonder if he likes turtles in a cuisine sense now.",
                "Perhaps stuffing his face with turtles was his plan all along? I think there was a bit on QI about giant tortoises being extremely delicious.",
                "Saved by the turtle gods.",
                "Meanwhile people tap out of Alone after 2days of no fish. This dude is resilient",
                "its the guy from the turtle soup problem"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "US military: ISIS No.2 leader killed in Iraq | NHK WORLD-JAPAN News",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250316_04/",
            "upvotes": 2482,
            "date": "03/16/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250316_04_1503575_L.jpg",
            "top_comments": [
                "ABU\nBAKAR\nAL BAGDADI\n\nIs dead",
                "Japan: the world's best source for American news. ",
                "New Shane Gillis material incoming.",
                "if they got the #3 guy now, would that just be the #2 guy again? if so, is the #2 guy even dead then?",
                "\"Who doe number 2 work for\"",
                "Is ISIS even a thing now? I thought the entire organisation just got annihilated few years back?",
                "Well some good news today",
                "*US forces carried out the strike in Iraq's Anbar Province in cooperation with the country's intelligence and security personnel.*\n\nOr in cooperation with itself.",
                "ISIS number 3 leader made President of Syria",
                "Please tell me they used a Ninja Bomb, or Flying Ginsu."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "An assailant sets a woman on fire on a tram in eastern Germany and flees",
            "external_url": "https://apnews.com/article/germany-gera-tram-attack-fire-81b7977336dd626016d40aa6240b3db7",
            "upvotes": 303,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you read the article, it clearly states that it was her husband.  This was not a random attack.",
                "Weird article.  It talks about an assailant and then says the police are searching for the victim’s husband and “couldn’t rule out that he is a danger to the public”. The article makes no mention of the husband being with his wife when she was set on fire. \n\nIt’s like a bad AI wrote the article.  Shouldn’t it just say “the husband is a suspect”?",
                "Hard to catch the dude if they don't provide any description.",
                "\\*L'amour toujours intensifies",
                "[deleted]"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 1035,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "How about a wave of strikes on Putins goblins?",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Y'all are mental I'll if you support the Houthis.",
                "Hasabi about to be furious.",
                "He wants a war so he claim even more powers.",
                "Trump the anti war president."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 29571,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3465/live/53f1c740-0287-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "I think we are burying the lede\n\n>Bukele wrote that the detainees were immediately transferred to El Salvador’s Terrorism Confinement Center (Cecot) “for a period of one year”, something that was “renewable” - suggesting they could be held there for longer.\n>“The United States will pay a very low fee for them, but a high one for us,” he added.\n\nWe are paying (a lot it sounds like) for other countries to run our internment camps",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "Wouldn’t the Alien Enemies Act of 1798 require the US to be at war for this to be legal deportations? Does this mean then that Congress gave a declaration of war to both Mexico and Venezuela which is what the constitution requires or is Trump violating the U.S. constitution that he swore to uphold?",
                "How did they come to determine these were “gang members?”"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Ordnance from Syria's 13-year conflict explodes in port city, killing at least 16 people",
            "external_url": "https://apnews.com/article/syria-lattakia-ordnance-explosion-mines-white-helmets-84bdc4b9d11ea38d662829cf3259eb39",
            "upvotes": 355,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately this is going to continue for a long time. Germany still finds unexploded bombs from WW2.",
                "Why were they storing bombs on the ground floor of a 4 story building?"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/17/2025 00:42:04 UTC"
}