{
    "posts": [
        {
            "category": "HOT",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 13553,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump's vendetta against Harvard is deeply disturbing",
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "at this point just start revoking any of trump's crones ivy league diploma starting with JD. it wont do anything, but it would massively hurt their egos.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "NAL but I don't see how singling out a school for a ban like this could possibly be legal.",
                "Trump throwing darts at the board.  Flooding the zone so his funding bill doesn't get extra scrutiny.  There's a provision buried in there limiting the authority of the judicial branch.  Of course, MSM will just focus on Harvard and tariffs.  All part of the plan.",
                "Did Havard reject Baron or something?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 18405,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "Yup this is really life.",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "It is truly unfathomable that key positions in the government are being filled by people who don’t even know the jobs description.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "The hard to believe part is common Maga followers still trusting Trump."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Arizona hiker Hannah Moody's body found off trail day after she was reported missing",
            "external_url": "https://www.cbsnews.com/news/arizona-hiker-hannah-moody-body-found-day-after-reported-missing/",
            "upvotes": 2212,
            "date": "05/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/23/107aed1a-2e93-45c7-8eb8-1c8131429a1f/thumbnail/1200x630/f4a0c770f4fd4f736d45091011844477/hannah-moody-640x360.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "According to Scottsdale police, Moody's body was spotted at about 12:05 p.m. near the Gateway Trailhead of the McDowell Sonoran Preserve in Scottsdale. She was first reported missing at around 7:50 the evening before by friends who got concerned because they hadn't heard from her.",
                "I once took a friend on a hike near Tucson, around this time of year. They showed up with one of those airplane water bottles, maybe 6 ounces of water. People have no clue the risks they take with their lives sometimes.",
                "It gets brutally hot . \n\nWe have people out in 90 to 100+ degree weather, heavily exerting themselves, passing out, not bringing any water let alone enough, and often refuse to seek medical treatment.\nBack at it the next day.\n\nMistakes are made.",
                "Last fall I read \"The Heat Will Kill You First,\" which is mostly about climate change but uses the incredibly sad story of a family that died (dad, mom, baby, and their dog) during a hike on a hot day as an example of what heat does to the human body. It sounds like one of the worst ways to go.\n\nDo not underestimate heat!",
                "A couple of years ago I got really dehydrated working all day outside in July. Cleaned up, went to a party and drank a lot of beer, woke the next morning and chugged a big glass of ice water. This apparently stimulated my Vagus Nerve, and sent me into fibrillation. I ended up in the ER, got to experience a cardioversion procedure. \n\nIt doesn't matter how tough you think you are - don't fuck around with dehydration.",
                "Local news here said she claimed to have 5 gallons of water with her for that hike. Thats over 40 lbs of just water alone, at what point does that actual water weight work against you in this 100+ heat",
                "Sometimes it's the case that they : \nOverestimate their ability to withstand the heat.\nOverestimate their ability to handle the terrain.\n\nAnd in-between these two endpoints, some combination.\n\nUnderappreciation of the elements  and  then perhaps a rather exaggerated belief in their abilities. \nSometimes poor prep. No compass   no cellphone, low charge on cell phone. \n\nMyself, I'm not in great shape anymore and I know that I'm disorganized. I don't hike. I get lost easily.  I'm more likely to die by pulling a box from the shelf in my closet.",
                "May she rest in peace. The stories of hikers who accidentally get lost are so heartbreaking to hear about.",
                "I've lived here since 1997 moved from West Texas when it gets hot that's our winter. I've been saying for years now everybody needs a damn whistle in the heat your voice is going to give out and your mouth is going to go dry pretty quick you can breathe in and out through a whistle sound travels pretty far away. You don't have to be a boy scout to know that this would be an effective way to rescue some of these people who get lost.",
                "I live in the desert and drive a pick up truck.  I always keep an unopened gallon of water in my bed.  We have homeless so it gets \"stolen\" a couple of times a week.  I'll continue doing it because heat kills.  I'll pay the $1.50 to ensure someone gets hydrated and is less likely to die."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Skeletal remains found on New Jersey beaches decades ago identified as captain of doomed 19th-century ship",
            "external_url": "https://www.cbsnews.com/news/investigative-genetic-genealogy-captain-identified-new-jersey-ramapo/",
            "upvotes": 445,
            "date": "05/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/23/67c8e097-cd1c-4d20-930c-9e613023593e/thumbnail/1200x630g2/9d9f0b1813a8a24cfe8a656f87f2f3d2/ship-image001-1.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "129 years at sea. Found by students. Confirmed by DNA. That’s not just science, but that’s storytelling at its finest. \n\nHuge credit to those Ramapo students and NJSP. They gave a name back to someone lost for generations and gave his family something they never thought they’d get: closure.",
                ">Skeletal remains found on New Jersey beaches decades ago have been identified as those of a 19th-century schooner captain, thanks to the investigative efforts of college students. \n\n>The ship, the Oriental, sank in 1844. The schooner was transporting 60 tons of marble from Connecticut to Philadelphia to be used in the construction of Girard College, which still operates today. The ship likely sprung a leak, according to a [news release announcing the identification](https://www.ramapo.edu/news/press-releases/bone-fragments-found-on-new-jersey-beaches-linked-to-19th-century-shipwreck/) of the remains, and sank off the coast of Brigantine Shoal. All five crew members aboard the ship died. \n\n>The skeletal remains, including a skull, were found on a number of South Jersey beaches between 1995 and 2013. The set of remains became known as \"Scattered Man John Doe.\" Police efforts to identify the bones failed. \n\n>In 2023, the New Jersey State Police partnered with Ramapo College's Investigative Genetic Genealogy Center. A sample from the bones was uploaded to genetic genealogy company Intermountain Forensics, which submitted it to DNA matching sites in February 2024. Meanwhile, students at Ramapo used the profile for research.\n\n>They found ancestry matches dating back to the 1600s, including genetic relatives from Connecticut. For the next year, students continued to find ties to Connecticut, and eventually they started looking at shipwrecks off the coast of New Jersey. They came upon two articles about the sinking of the Oriental. One [article](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/image001-1.png) named the crew members aboard at the time of the sinking and [another](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/unnamed.png) detailed the wreck itself. \n\n>\"The storm was so tremendous that no help could be given from the shore,\" said the article, which was published in the Boston Daily Bee in December 1844 and described an account from a Connecticut publication. \n\n>According to the article, one crew member was \"decently buried\" after his \"corpse was thrown on the shore.\" No other bodies were discovered immediately after the sinking. \n\nCreepy story, considering the ship sank in 1844 and remains were found between 1995 and 2013. Great work by the students; they were able to identify the captain and can now give him a proper burial.",
                "19th Century \"Major Tom\" (Captain Tom?) finally made it home.",
                "I wonder if these remains were the ones \"decently buried\"?  Would seem likely that a \"decently buried\" corpse might be buried slightly inland.  Over the years the shoreline probably eroded until the bones became exposed and found by passers-by.  I would think that a simple drowned person in the sea might wash ashore, but being in the intertidal zone is pretty hard on a body and it would have disintegrated and eroded away many decades prior.  Just my guess.",
                "It's good news when you think about it. When you find human bones, better a 19th century sea captain than a murder victim. That's a really cool find!",
                "Timely episode of Ologies this week! It's about shipwrecks. \n\nhttps://pca.st/episode/919e135b-7d30-48c0-aaa5-457b6aedb82d"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russian group 'Qilin' demands ransom by next week, City of Abilene refuses to pay",
            "external_url": "https://ktxs.com/news/local/russian-group-qilin-demands-ransom-by-may-27-city-of-abilene-refuses-to-pay",
            "upvotes": 606,
            "date": "05/23/2025",
            "thumbnail": "https://ktxs.com/resources/media2/16x9/640/986/0x60/90/2bd7d544-d83c-4b9f-8511-73eaa502f6a0-AbileneMunicipalCourt.jpg",
            "top_comments": [
                "Where are Trump's great security experts? Sobering up or on a verbal high note about Biden's failures?",
                "My retirement plan is to accept that my identity will eventually get stolen.",
                "Launch a counter hacking in response and demand ransom too. We will see who outsmarts who. Oh wait, I forgot, all the experts at the FBI have been gutted, oh well,.... there goes any cyber security the US had.",
                "I don't understand how this keeps happening - everyone knows their data is under threat. \n\nMy company is tiny in comparison yet I keep 3 complete data backups, one recent (made monthly), one 365 day old and one a copy of my original clean install from more than a decade ago; if I'm hacked I can tell them to go F themselves.",
                "As long as Trump gets a cut of whatever these Russian hackers take in, he’ll look the other way.",
                "Abilene TX?  You can keep it, Russia. \n\n😉",
                "If I had a gun for every ace I have drawn   \nI could arm a town the size of Abilene   \nDon't you push me, baby, because I'm moanin' low   \nAnd you know I'm only in it for the gold",
                "Turns out hot singles were not in the area, not in the area at all.",
                "\"We'll just going to have to let them have whatever they want so that we don't escalate anything\"\n\n-Orange turd man probably",
                "Most places not run by complete idiots have ransomware insurance for this and it’s a very quick resolution."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Colorado man sues Rockies after being hit in eye by foul ball during MLB game",
            "external_url": "https://www.denver7.com/us-news/colorado-man-sues-rockies-after-being-hit-in-eye-by-foul-ball-during-mlb-game",
            "upvotes": 576,
            "date": "05/23/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/c7f960c/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F21%2Fa1%2Fbc8e992a4fb6a802596fc0ad60e6%2Fap25131615328257.jpg",
            "top_comments": [
                ">The lawsuit also claims that the Rockies' \"longstanding poor performance on the field\" has created an environment where spectators are less engaged with what's happening on the field, according to the Denver Post.\n\nThere's an assumed risk involved when attending sporting events. So this probably won't go very far. But this guy went further and gave us his spicy take on the Rockies.",
                ">Roeckel was reportedly seated in a luxury box at the time of the incident, and did not have to pay for the ticket because he was a guest of the box owner.\n\nYeah, I had a feeling it was not some actual baseball fan.",
                "Isn’t this liability waiver included when you buy a ticket?",
                "“Assumption of risk doctrine” \n\nI like that term: It seems to fit the situation very well.",
                "Jesus bro let’s ruin everything. I know this guy won’t win but it sucks seeing people doing their best to ruin it for everyone else. Next they’ll have a net over the fans and no more foul balls for kids.",
                "The American Dream: find someone to sue.",
                "I hope the judge makes him pay all court and legal fees when the case is kicked out of court.",
                "A real black eye for the legal system if this suit is allowed to move forward.",
                "He should be thanking them that he can no longer see them play after being hit in the eye.",
                "They’re 8-42. Every ball they hit is foul."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration halts Harvard’s ability to enroll international students",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/trump-harvard-international-students.html?unlocked_article_code=1.JE8.gXSX.lbWraJmOPxDs&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 41310,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine being an international student in your last year and having this happen.",
                "[removed]",
                "This also apparently forces *current* international students to transfer, which is absolutely asinine",
                "And what about when the King of Saudi Srabia or the Sheikh of Qatar want to send a son or grandson to Harvard. I have a feeling there will be exceptions",
                "The party of small government and personal freedoms everyone",
                "Is this not fucking insane? This feels like such a step up in intensity.",
                "\"Small government\" strikes again.",
                "\"threatening their money didn't work, taking away their tax exempt status didn't work, so what other piece of absolutely dumbassery can we swing their way?\" 😒",
                "Hopefully the school can get an injunction against this action.  It is purely speech based and there are no grounds for it other than to please the dictator.  These are dark days, and it will only get worse for us.",
                "Worked within admissions for a few years. International students typically pay full ride and often pledge even more, especially at schools of prestige. A large chunk of that pledged money goes towards scholarships for domestic students. \n\nThis will increase rates for American students even more. \n\nAlso, all these bullshit bend the knee moves are killing research and who knows how terrible it could become. Seriously hope that schools outside the states can enhance their bandwidth in research fast because it is a pretty terrible ripple effect"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UK will roll out chemical castration for sex offenders",
            "external_url": "https://www.cnn.com/2025/05/22/europe/uk-chemical-castration-sex-offenders-latam-intl",
            "upvotes": 9736,
            "date": "05/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25134549748675.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "How do they decide who qualifies for this? That part seems vague. Is it based on how many times someone offends, or the type of offense? And who decides that, a judge or some review panel?",
                "The UK really does not have a great history with this policy",
                "And then the definition of \"Sex Offender\" changes.",
                "Just like they did to Alan Turing.",
                "Glad they also figured out how to know with 100% certainty 100% of the time who is guilty. Otherwise this would be barbaric.",
                "Yikes.  I was under the impression that chemical castration did not change recidivism rates at all.  ",
                "When prisons overflow, policy shifts fast. But mandatory chemical castration opens doors we might not be ready to walk through.",
                "I would encourage anyone who supports this to think about how loosely people can define “sex offenders”. Because it will not be long until that definition expands beyond just rapists. \n\nSeeing the current trends in the UK, I could completely see a future where conservatives include trans people presenting as their chosen gender or porn stars or homosexual people in that definition. The government should have no control over something like this, the potential for abuse is fucking enormous.",
                "This is what drove Allen Turing to suicide",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New Stalin monument in Moscow subway stirs debate",
            "external_url": "https://www.cnn.com/2025/05/23/style/joseph-stalin-monument-moscow-metro-intl-scli",
            "upvotes": 296,
            "date": "05/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214572535.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A monument to [Soviet](https://www.cnn.com/2023/02/06/europe/ukraine-famine-survivor-intl) dictator [Joseph Stalin](https://www.cnn.com/style/article/stalin-moscow-architecture) erected in [Moscow’s](https://www.cnn.com/2025/05/06/europe/ukraine-drones-moscow-may-9-xi-intl-hnk) subway is stirring debate, with some Russians welcoming it as a historical tribute, but others saying it’s a mistake to commemorate someone who presided over so much suffering.\n\n>The life-size wall sculpture in Moscow’s Taganskaya metro station depicts Stalin standing on Moscow’s Red Square surrounded by a crowd of Soviet citizens looking at him in admiration, and is a recreation of a monument that was unveiled in the same station in 1950, three years before Stalin died.\n\n>The Moscow metro said that the original monument to Stalin had been “lost” in 1966 when the Taganskaya metro station hosting it had been reconfigured.\n\n>Nearly 700,000 people were executed in Stalin’s 1937-38 Great Terror amid show trials and purges of his real and perceived enemies. Many other Soviet citizens were sent to the gulag, a grim network of prison camps, spread across the world’s largest country.\n\n>The Moscow metro said in a statement that the new version of the monument, which was presented to the public on May 15, was one of its “gifts” to passengers to mark the 90th anniversary of the sprawling, ornate and famously efficient transportation system.\n\n>The work’s original title, “Gratitude of the People to the Leader and Commander,” was dedicated to Stalin’s role in delivering victory for the Soviet Union in World War II, the 80th anniversary of which Russia [marked with pomp this year](https://www.cnn.com/2025/05/09/europe/russia-victory-day-parade-intl-hnk).\n\n>“This man (Stalin), he created a lot,” said Yevgeny Ivanov, a Moscow resident, who had come to look at the new monument on Wednesday. “He has something to be proud of. And it is not for us to tear it down. A man did something - we must respect what he did.”\n\n>Kirill Frolov, another resident of the capital, said he accepted that Stalin’s record was mixed and that you couldn’t call him “good.”\n\nPutin won't mind bringing back the tyrants of the past.",
                "Commemorating the guy who did the purges and killed close to 1 million people. Russia is something else",
                "They keep installing those in Ukraine occupied territories as well. The Russian Soviet Empire idol of gobbunism to mark their territory",
                "This, well.... uh.  A new momunment to Stalin is certainly something that could be done.  Not sure if it's the route I would go.  Especially when Russian politicians are facing a lot of backlash from the populace over the current state of Russia....\n\nMaybe it's a subtle hint from the political types to the common lay-person to get in line, to tow the line?\n\nThis is definitely a decision that could be made... wouldn't call it a smart one though.",
                "It should stir vandalism.",
                "I can use this post to spread some interesting knowledge about early years of Stalin 🙂 Young years the most successful operation that showed his organisational capabilities was robbery of Tiflis Bank 1907, he excelled at extortion, kidnapping, assassination, arson, bank robbery and thuggery. \n\nHis participation in communist movement was mostly due to ”political prisoners” were punished rather lightly than regular criminals. In his 1913 to 1916 Siberian exile as “political” he was living with real political communist Yakov Sverdlov, which he was constantly bullying and scoffing for his “clean look and behaviour” he got the dog and called it “Yashka” to piss off Yakov. His saying about Yakov “This clean spitter is so annoying and all his stupidity of washing dishes is laughable, I am much smarter than he is, I’m putting all my plates under bed and Yashka licking them white clean for me”\n\nYakov eventually moved away in another house,  and Stalin took the 14-year-old girl orphan from that village, abusing her about 2 years until his term ended. But Soviet party members pedofilism is another topic, Russian Olympic gymnasts and Balet schools, Kremlin stuff were well-known suppliers of underaged girls, for e.g. Beria",
                "*”Stirs debate”* \n\nWhat kind of tepid “both sides have equally valid arguments” reporting is this? It’s OK to take a side on this one CNN and call it what it is. \n\n*Stalin’s record was mixed*\n\nWell, an “Açaí Berry & Dog Turds Smoothie” is also mixed, and packed full of vitamins and anti-oxidants. That still doesn’t mean you should still drink it everyday for breakfast.",
                "Sounds like Putin has big plans for the people of Russia.",
                "The guy who genocided Ukrainians? Not at all surprising \n\nVladolf Putler needs to be stopped",
                "I wonder how long it will last"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court insulates Federal Reserve while backing Trump firing of agency leaders",
            "external_url": "https://www.cnbc.com/2025/05/22/supreme-court-federal-reserve-trump.html",
            "upvotes": 6028,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108145983-17473124852025-05-13t090246z_1804573252_rc2py8a5uc89_rtrmadp_0_usa-court-trump-birthright.jpeg?v=1747319909&w=1920&h=1080",
            "top_comments": [
                "Thanks SCOTUS, I guess, for a tortured interpretation of existing case law that carves out a single exception for the Fed, that owes it's uniqueness to **checks notes* Alexander Hamilton.",
                "Another Roberts special, overturn a longstanding principle even though there’s no error to point to but pretend nothings changed since Trump can’t do the very very bad most extreme version of the thing’s",
                "Project 2025 continues.",
                "\"We know he's fucking insane, but only care about our money. So here's some bullshit to justify his not being able to fuck the economy by firing everyone at the Reserve\"",
                "Its really frightening that we can say \"not a catastrophic defeat\" like its the best thing we have to a victory now.  \n\nThe truly frightening thing is how much Donald Trump has learned since his first term.  The first time around he was regarded by people who legitimately thought they could control him as a kind of buffoon.  This time he is positively dangerous.",
                "Ken Burns really needs to do the supreme Court 2 downfall",
                "3 to 6 = ignore the constitution and be corrupt",
                "Can someone ELI5? What does this mean?",
                "When the tables turn and the R's are no longer in control, all of these decisions they celebrate now are going to bite them in the ass",
                "USA is fucked with this ruling even if he can't fire the fed."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Skeletal remains found on New Jersey beaches decades ago identified as captain of doomed 19th-century ship",
            "external_url": "https://www.cbsnews.com/news/investigative-genetic-genealogy-captain-identified-new-jersey-ramapo/",
            "upvotes": 448,
            "date": "05/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/23/67c8e097-cd1c-4d20-930c-9e613023593e/thumbnail/1200x630g2/9d9f0b1813a8a24cfe8a656f87f2f3d2/ship-image001-1.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "129 years at sea. Found by students. Confirmed by DNA. That’s not just science, but that’s storytelling at its finest. \n\nHuge credit to those Ramapo students and NJSP. They gave a name back to someone lost for generations and gave his family something they never thought they’d get: closure.",
                ">Skeletal remains found on New Jersey beaches decades ago have been identified as those of a 19th-century schooner captain, thanks to the investigative efforts of college students. \n\n>The ship, the Oriental, sank in 1844. The schooner was transporting 60 tons of marble from Connecticut to Philadelphia to be used in the construction of Girard College, which still operates today. The ship likely sprung a leak, according to a [news release announcing the identification](https://www.ramapo.edu/news/press-releases/bone-fragments-found-on-new-jersey-beaches-linked-to-19th-century-shipwreck/) of the remains, and sank off the coast of Brigantine Shoal. All five crew members aboard the ship died. \n\n>The skeletal remains, including a skull, were found on a number of South Jersey beaches between 1995 and 2013. The set of remains became known as \"Scattered Man John Doe.\" Police efforts to identify the bones failed. \n\n>In 2023, the New Jersey State Police partnered with Ramapo College's Investigative Genetic Genealogy Center. A sample from the bones was uploaded to genetic genealogy company Intermountain Forensics, which submitted it to DNA matching sites in February 2024. Meanwhile, students at Ramapo used the profile for research.\n\n>They found ancestry matches dating back to the 1600s, including genetic relatives from Connecticut. For the next year, students continued to find ties to Connecticut, and eventually they started looking at shipwrecks off the coast of New Jersey. They came upon two articles about the sinking of the Oriental. One [article](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/image001-1.png) named the crew members aboard at the time of the sinking and [another](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/unnamed.png) detailed the wreck itself. \n\n>\"The storm was so tremendous that no help could be given from the shore,\" said the article, which was published in the Boston Daily Bee in December 1844 and described an account from a Connecticut publication. \n\n>According to the article, one crew member was \"decently buried\" after his \"corpse was thrown on the shore.\" No other bodies were discovered immediately after the sinking. \n\nCreepy story, considering the ship sank in 1844 and remains were found between 1995 and 2013. Great work by the students; they were able to identify the captain and can now give him a proper burial.",
                "19th Century \"Major Tom\" (Captain Tom?) finally made it home.",
                "I wonder if these remains were the ones \"decently buried\"?  Would seem likely that a \"decently buried\" corpse might be buried slightly inland.  Over the years the shoreline probably eroded until the bones became exposed and found by passers-by.  I would think that a simple drowned person in the sea might wash ashore, but being in the intertidal zone is pretty hard on a body and it would have disintegrated and eroded away many decades prior.  Just my guess.",
                "It's good news when you think about it. When you find human bones, better a 19th century sea captain than a murder victim. That's a really cool find!",
                "Timely episode of Ologies this week! It's about shipwrecks. \n\nhttps://pca.st/episode/919e135b-7d30-48c0-aaa5-457b6aedb82d"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New Stalin monument in Moscow subway stirs debate",
            "external_url": "https://www.cnn.com/2025/05/23/style/joseph-stalin-monument-moscow-metro-intl-scli",
            "upvotes": 294,
            "date": "05/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214572535.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A monument to [Soviet](https://www.cnn.com/2023/02/06/europe/ukraine-famine-survivor-intl) dictator [Joseph Stalin](https://www.cnn.com/style/article/stalin-moscow-architecture) erected in [Moscow’s](https://www.cnn.com/2025/05/06/europe/ukraine-drones-moscow-may-9-xi-intl-hnk) subway is stirring debate, with some Russians welcoming it as a historical tribute, but others saying it’s a mistake to commemorate someone who presided over so much suffering.\n\n>The life-size wall sculpture in Moscow’s Taganskaya metro station depicts Stalin standing on Moscow’s Red Square surrounded by a crowd of Soviet citizens looking at him in admiration, and is a recreation of a monument that was unveiled in the same station in 1950, three years before Stalin died.\n\n>The Moscow metro said that the original monument to Stalin had been “lost” in 1966 when the Taganskaya metro station hosting it had been reconfigured.\n\n>Nearly 700,000 people were executed in Stalin’s 1937-38 Great Terror amid show trials and purges of his real and perceived enemies. Many other Soviet citizens were sent to the gulag, a grim network of prison camps, spread across the world’s largest country.\n\n>The Moscow metro said in a statement that the new version of the monument, which was presented to the public on May 15, was one of its “gifts” to passengers to mark the 90th anniversary of the sprawling, ornate and famously efficient transportation system.\n\n>The work’s original title, “Gratitude of the People to the Leader and Commander,” was dedicated to Stalin’s role in delivering victory for the Soviet Union in World War II, the 80th anniversary of which Russia [marked with pomp this year](https://www.cnn.com/2025/05/09/europe/russia-victory-day-parade-intl-hnk).\n\n>“This man (Stalin), he created a lot,” said Yevgeny Ivanov, a Moscow resident, who had come to look at the new monument on Wednesday. “He has something to be proud of. And it is not for us to tear it down. A man did something - we must respect what he did.”\n\n>Kirill Frolov, another resident of the capital, said he accepted that Stalin’s record was mixed and that you couldn’t call him “good.”\n\nPutin won't mind bringing back the tyrants of the past.",
                "Commemorating the guy who did the purges and killed close to 1 million people. Russia is something else",
                "They keep installing those in Ukraine occupied territories as well. The Russian Soviet Empire idol of gobbunism to mark their territory",
                "This, well.... uh.  A new momunment to Stalin is certainly something that could be done.  Not sure if it's the route I would go.  Especially when Russian politicians are facing a lot of backlash from the populace over the current state of Russia....\n\nMaybe it's a subtle hint from the political types to the common lay-person to get in line, to tow the line?\n\nThis is definitely a decision that could be made... wouldn't call it a smart one though.",
                "It should stir vandalism.",
                "I can use this post to spread some interesting knowledge about early years of Stalin 🙂 Young years the most successful operation that showed his organisational capabilities was robbery of Tiflis Bank 1907, he excelled at extortion, kidnapping, assassination, arson, bank robbery and thuggery. \n\nHis participation in communist movement was mostly due to ”political prisoners” were punished rather lightly than regular criminals. In his 1913 to 1916 Siberian exile as “political” he was living with real political communist Yakov Sverdlov, which he was constantly bullying and scoffing for his “clean look and behaviour” he got the dog and called it “Yashka” to piss off Yakov. His saying about Yakov “This clean spitter is so annoying and all his stupidity of washing dishes is laughable, I am much smarter than he is, I’m putting all my plates under bed and Yashka licking them white clean for me”\n\nYakov eventually moved away in another house,  and Stalin took the 14-year-old girl orphan from that village, abusing her about 2 years until his term ended. But Soviet party members pedofilism is another topic, Russian Olympic gymnasts and Balet schools, Kremlin stuff were well-known suppliers of underaged girls, for e.g. Beria",
                "*”Stirs debate”* \n\nWhat kind of tepid “both sides have equally valid arguments” reporting is this? It’s OK to take a side on this one CNN and call it what it is. \n\n*Stalin’s record was mixed*\n\nWell, an “Açaí Berry & Dog Turds Smoothie” is also mixed, and packed full of vitamins and anti-oxidants. That still doesn’t mean you should still drink it everyday for breakfast.",
                "Sounds like Putin has big plans for the people of Russia.",
                "The guy who genocided Ukrainians? Not at all surprising \n\nVladolf Putler needs to be stopped",
                "I wonder how long it will last"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 13564,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump's vendetta against Harvard is deeply disturbing",
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "at this point just start revoking any of trump's crones ivy league diploma starting with JD. it wont do anything, but it would massively hurt their egos.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "NAL but I don't see how singling out a school for a ban like this could possibly be legal.",
                "Trump throwing darts at the board.  Flooding the zone so his funding bill doesn't get extra scrutiny.  There's a provision buried in there limiting the authority of the judicial branch.  Of course, MSM will just focus on Harvard and tariffs.  All part of the plan.",
                "Did Havard reject Baron or something?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russian group 'Qilin' demands ransom by next week, City of Abilene refuses to pay",
            "external_url": "https://ktxs.com/news/local/russian-group-qilin-demands-ransom-by-may-27-city-of-abilene-refuses-to-pay",
            "upvotes": 601,
            "date": "05/23/2025",
            "thumbnail": "https://ktxs.com/resources/media2/16x9/640/986/0x60/90/2bd7d544-d83c-4b9f-8511-73eaa502f6a0-AbileneMunicipalCourt.jpg",
            "top_comments": [
                "Where are Trump's great security experts? Sobering up or on a verbal high note about Biden's failures?",
                "My retirement plan is to accept that my identity will eventually get stolen.",
                "Launch a counter hacking in response and demand ransom too. We will see who outsmarts who. Oh wait, I forgot, all the experts at the FBI have been gutted, oh well,.... there goes any cyber security the US had.",
                "I don't understand how this keeps happening - everyone knows their data is under threat. \n\nMy company is tiny in comparison yet I keep 3 complete data backups, one recent (made monthly), one 365 day old and one a copy of my original clean install from more than a decade ago; if I'm hacked I can tell them to go F themselves.",
                "As long as Trump gets a cut of whatever these Russian hackers take in, he’ll look the other way.",
                "Abilene TX?  You can keep it, Russia. \n\n😉",
                "If I had a gun for every ace I have drawn   \nI could arm a town the size of Abilene   \nDon't you push me, baby, because I'm moanin' low   \nAnd you know I'm only in it for the gold",
                "Turns out hot singles were not in the area, not in the area at all.",
                "\"We'll just going to have to let them have whatever they want so that we don't escalate anything\"\n\n-Orange turd man probably",
                "Most places not run by complete idiots have ransomware insurance for this and it’s a very quick resolution."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Colorado man sues Rockies after being hit in eye by foul ball during MLB game",
            "external_url": "https://www.denver7.com/us-news/colorado-man-sues-rockies-after-being-hit-in-eye-by-foul-ball-during-mlb-game",
            "upvotes": 570,
            "date": "05/23/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/c7f960c/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F21%2Fa1%2Fbc8e992a4fb6a802596fc0ad60e6%2Fap25131615328257.jpg",
            "top_comments": [
                ">The lawsuit also claims that the Rockies' \"longstanding poor performance on the field\" has created an environment where spectators are less engaged with what's happening on the field, according to the Denver Post.\n\nThere's an assumed risk involved when attending sporting events. So this probably won't go very far. But this guy went further and gave us his spicy take on the Rockies.",
                ">Roeckel was reportedly seated in a luxury box at the time of the incident, and did not have to pay for the ticket because he was a guest of the box owner.\n\nYeah, I had a feeling it was not some actual baseball fan.",
                "Isn’t this liability waiver included when you buy a ticket?",
                "“Assumption of risk doctrine” \n\nI like that term: It seems to fit the situation very well.",
                "Jesus bro let’s ruin everything. I know this guy won’t win but it sucks seeing people doing their best to ruin it for everyone else. Next they’ll have a net over the fans and no more foul balls for kids.",
                "The American Dream: find someone to sue.",
                "I hope the judge makes him pay all court and legal fees when the case is kicked out of court.",
                "A real black eye for the legal system if this suit is allowed to move forward.",
                "He should be thanking them that he can no longer see them play after being hit in the eye.",
                "They’re 8-42. Every ball they hit is foul."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Arizona hiker Hannah Moody's body found off trail day after she was reported missing",
            "external_url": "https://www.cbsnews.com/news/arizona-hiker-hannah-moody-body-found-day-after-reported-missing/",
            "upvotes": 2219,
            "date": "05/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/23/107aed1a-2e93-45c7-8eb8-1c8131429a1f/thumbnail/1200x630/f4a0c770f4fd4f736d45091011844477/hannah-moody-640x360.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "According to Scottsdale police, Moody's body was spotted at about 12:05 p.m. near the Gateway Trailhead of the McDowell Sonoran Preserve in Scottsdale. She was first reported missing at around 7:50 the evening before by friends who got concerned because they hadn't heard from her.",
                "I once took a friend on a hike near Tucson, around this time of year. They showed up with one of those airplane water bottles, maybe 6 ounces of water. People have no clue the risks they take with their lives sometimes.",
                "It gets brutally hot . \n\nWe have people out in 90 to 100+ degree weather, heavily exerting themselves, passing out, not bringing any water let alone enough, and often refuse to seek medical treatment.\nBack at it the next day.\n\nMistakes are made.",
                "Last fall I read \"The Heat Will Kill You First,\" which is mostly about climate change but uses the incredibly sad story of a family that died (dad, mom, baby, and their dog) during a hike on a hot day as an example of what heat does to the human body. It sounds like one of the worst ways to go.\n\nDo not underestimate heat!",
                "A couple of years ago I got really dehydrated working all day outside in July. Cleaned up, went to a party and drank a lot of beer, woke the next morning and chugged a big glass of ice water. This apparently stimulated my Vagus Nerve, and sent me into fibrillation. I ended up in the ER, got to experience a cardioversion procedure. \n\nIt doesn't matter how tough you think you are - don't fuck around with dehydration.",
                "Local news here said she claimed to have 5 gallons of water with her for that hike. Thats over 40 lbs of just water alone, at what point does that actual water weight work against you in this 100+ heat",
                "Sometimes it's the case that they : \nOverestimate their ability to withstand the heat.\nOverestimate their ability to handle the terrain.\n\nAnd in-between these two endpoints, some combination.\n\nUnderappreciation of the elements  and  then perhaps a rather exaggerated belief in their abilities. \nSometimes poor prep. No compass   no cellphone, low charge on cell phone. \n\nMyself, I'm not in great shape anymore and I know that I'm disorganized. I don't hike. I get lost easily.  I'm more likely to die by pulling a box from the shelf in my closet.",
                "May she rest in peace. The stories of hikers who accidentally get lost are so heartbreaking to hear about.",
                "I've lived here since 1997 moved from West Texas when it gets hot that's our winter. I've been saying for years now everybody needs a damn whistle in the heat your voice is going to give out and your mouth is going to go dry pretty quick you can breathe in and out through a whistle sound travels pretty far away. You don't have to be a boy scout to know that this would be an effective way to rescue some of these people who get lost.",
                "I live in the desert and drive a pick up truck.  I always keep an unopened gallon of water in my bed.  We have homeless so it gets \"stolen\" a couple of times a week.  I'll continue doing it because heat kills.  I'll pay the $1.50 to ensure someone gets hydrated and is less likely to die."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man in Norway wakes to find huge container ship in garden",
            "external_url": "https://www.bbc.com/news/articles/cy8nk279ydyo",
            "upvotes": 850,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b7f6/live/21ea2650-379a-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "*Your Temu order has arrived.*",
                "The 135m-ship (443ft) missed Johan Helberg's house by metres at about 05:00 local time (03:00 GMT) on Thursday.\n\nMr Helberg was only alerted to the commotion by his panicked neighbour who had watched the ship as it headed straight for shore, in Byneset, near Trondheim.",
                "Man, i want to have his sleep. I wake up, when a Fly is in the room...",
                "The most Nordic man to ever exist.\n\nOnly a Scandinavian could react like this",
                "Surely they can track where it came from using the barcode.\n\nThey have those on ships so they can scandinavian.",
                "Can’t park there mate.",
                "What a beautiful place to live.",
                "\"I didn't order that garden ornament\".\n\n\nI hope the front doesn't fall off.",
                "Amazon delivers anything these days",
                "I thought surely there must be a mistake in the headline and it was meant to be 'shipping container' not 'container ship'. Nope."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 18408,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "Yup this is really life.",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "It is truly unfathomable that key positions in the government are being filled by people who don’t even know the jobs description.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "The hard to believe part is common Maga followers still trusting Trump."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court insulates Federal Reserve while backing Trump firing of agency leaders",
            "external_url": "https://www.cnbc.com/2025/05/22/supreme-court-federal-reserve-trump.html",
            "upvotes": 6031,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108145983-17473124852025-05-13t090246z_1804573252_rc2py8a5uc89_rtrmadp_0_usa-court-trump-birthright.jpeg?v=1747319909&w=1920&h=1080",
            "top_comments": [
                "Thanks SCOTUS, I guess, for a tortured interpretation of existing case law that carves out a single exception for the Fed, that owes it's uniqueness to **checks notes* Alexander Hamilton.",
                "Another Roberts special, overturn a longstanding principle even though there’s no error to point to but pretend nothings changed since Trump can’t do the very very bad most extreme version of the thing’s",
                "Project 2025 continues.",
                "\"We know he's fucking insane, but only care about our money. So here's some bullshit to justify his not being able to fuck the economy by firing everyone at the Reserve\"",
                "Its really frightening that we can say \"not a catastrophic defeat\" like its the best thing we have to a victory now.  \n\nThe truly frightening thing is how much Donald Trump has learned since his first term.  The first time around he was regarded by people who legitimately thought they could control him as a kind of buffoon.  This time he is positively dangerous.",
                "Ken Burns really needs to do the supreme Court 2 downfall",
                "3 to 6 = ignore the constitution and be corrupt",
                "Can someone ELI5? What does this mean?",
                "When the tables turn and the R's are no longer in control, all of these decisions they celebrate now are going to bite them in the ass",
                "USA is fucked with this ruling even if he can't fire the fed."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK will roll out chemical castration for sex offenders",
            "external_url": "https://www.cnn.com/2025/05/22/europe/uk-chemical-castration-sex-offenders-latam-intl",
            "upvotes": 9725,
            "date": "05/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25134549748675.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "How do they decide who qualifies for this? That part seems vague. Is it based on how many times someone offends, or the type of offense? And who decides that, a judge or some review panel?",
                "The UK really does not have a great history with this policy",
                "And then the definition of \"Sex Offender\" changes.",
                "Just like they did to Alan Turing.",
                "Glad they also figured out how to know with 100% certainty 100% of the time who is guilty. Otherwise this would be barbaric.",
                "Yikes.  I was under the impression that chemical castration did not change recidivism rates at all.  ",
                "When prisons overflow, policy shifts fast. But mandatory chemical castration opens doors we might not be ready to walk through.",
                "I would encourage anyone who supports this to think about how loosely people can define “sex offenders”. Because it will not be long until that definition expands beyond just rapists. \n\nSeeing the current trends in the UK, I could completely see a future where conservatives include trans people presenting as their chosen gender or porn stars or homosexual people in that definition. The government should have no control over something like this, the potential for abuse is fucking enormous.",
                "This is what drove Allen Turing to suicide",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Skeletal remains found on New Jersey beaches decades ago identified as captain of doomed 19th-century ship",
            "external_url": "https://www.cbsnews.com/news/investigative-genetic-genealogy-captain-identified-new-jersey-ramapo/",
            "upvotes": 442,
            "date": "05/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/23/67c8e097-cd1c-4d20-930c-9e613023593e/thumbnail/1200x630g2/9d9f0b1813a8a24cfe8a656f87f2f3d2/ship-image001-1.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "129 years at sea. Found by students. Confirmed by DNA. That’s not just science, but that’s storytelling at its finest. \n\nHuge credit to those Ramapo students and NJSP. They gave a name back to someone lost for generations and gave his family something they never thought they’d get: closure.",
                ">Skeletal remains found on New Jersey beaches decades ago have been identified as those of a 19th-century schooner captain, thanks to the investigative efforts of college students. \n\n>The ship, the Oriental, sank in 1844. The schooner was transporting 60 tons of marble from Connecticut to Philadelphia to be used in the construction of Girard College, which still operates today. The ship likely sprung a leak, according to a [news release announcing the identification](https://www.ramapo.edu/news/press-releases/bone-fragments-found-on-new-jersey-beaches-linked-to-19th-century-shipwreck/) of the remains, and sank off the coast of Brigantine Shoal. All five crew members aboard the ship died. \n\n>The skeletal remains, including a skull, were found on a number of South Jersey beaches between 1995 and 2013. The set of remains became known as \"Scattered Man John Doe.\" Police efforts to identify the bones failed. \n\n>In 2023, the New Jersey State Police partnered with Ramapo College's Investigative Genetic Genealogy Center. A sample from the bones was uploaded to genetic genealogy company Intermountain Forensics, which submitted it to DNA matching sites in February 2024. Meanwhile, students at Ramapo used the profile for research.\n\n>They found ancestry matches dating back to the 1600s, including genetic relatives from Connecticut. For the next year, students continued to find ties to Connecticut, and eventually they started looking at shipwrecks off the coast of New Jersey. They came upon two articles about the sinking of the Oriental. One [article](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/image001-1.png) named the crew members aboard at the time of the sinking and [another](https://www.ramapo.edu/news/wp-content/uploads/sites/118/2025/05/unnamed.png) detailed the wreck itself. \n\n>\"The storm was so tremendous that no help could be given from the shore,\" said the article, which was published in the Boston Daily Bee in December 1844 and described an account from a Connecticut publication. \n\n>According to the article, one crew member was \"decently buried\" after his \"corpse was thrown on the shore.\" No other bodies were discovered immediately after the sinking. \n\nCreepy story, considering the ship sank in 1844 and remains were found between 1995 and 2013. Great work by the students; they were able to identify the captain and can now give him a proper burial.",
                "19th Century \"Major Tom\" (Captain Tom?) finally made it home.",
                "I wonder if these remains were the ones \"decently buried\"?  Would seem likely that a \"decently buried\" corpse might be buried slightly inland.  Over the years the shoreline probably eroded until the bones became exposed and found by passers-by.  I would think that a simple drowned person in the sea might wash ashore, but being in the intertidal zone is pretty hard on a body and it would have disintegrated and eroded away many decades prior.  Just my guess.",
                "It's good news when you think about it. When you find human bones, better a 19th century sea captain than a murder victim. That's a really cool find!",
                "Timely episode of Ologies this week! It's about shipwrecks. \n\nhttps://pca.st/episode/919e135b-7d30-48c0-aaa5-457b6aedb82d"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 13563,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump's vendetta against Harvard is deeply disturbing",
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "at this point just start revoking any of trump's crones ivy league diploma starting with JD. it wont do anything, but it would massively hurt their egos.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "NAL but I don't see how singling out a school for a ban like this could possibly be legal.",
                "Trump throwing darts at the board.  Flooding the zone so his funding bill doesn't get extra scrutiny.  There's a provision buried in there limiting the authority of the judicial branch.  Of course, MSM will just focus on Harvard and tariffs.  All part of the plan.",
                "Did Havard reject Baron or something?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New Stalin monument in Moscow subway stirs debate",
            "external_url": "https://www.cnn.com/2025/05/23/style/joseph-stalin-monument-moscow-metro-intl-scli",
            "upvotes": 294,
            "date": "05/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214572535.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A monument to [Soviet](https://www.cnn.com/2023/02/06/europe/ukraine-famine-survivor-intl) dictator [Joseph Stalin](https://www.cnn.com/style/article/stalin-moscow-architecture) erected in [Moscow’s](https://www.cnn.com/2025/05/06/europe/ukraine-drones-moscow-may-9-xi-intl-hnk) subway is stirring debate, with some Russians welcoming it as a historical tribute, but others saying it’s a mistake to commemorate someone who presided over so much suffering.\n\n>The life-size wall sculpture in Moscow’s Taganskaya metro station depicts Stalin standing on Moscow’s Red Square surrounded by a crowd of Soviet citizens looking at him in admiration, and is a recreation of a monument that was unveiled in the same station in 1950, three years before Stalin died.\n\n>The Moscow metro said that the original monument to Stalin had been “lost” in 1966 when the Taganskaya metro station hosting it had been reconfigured.\n\n>Nearly 700,000 people were executed in Stalin’s 1937-38 Great Terror amid show trials and purges of his real and perceived enemies. Many other Soviet citizens were sent to the gulag, a grim network of prison camps, spread across the world’s largest country.\n\n>The Moscow metro said in a statement that the new version of the monument, which was presented to the public on May 15, was one of its “gifts” to passengers to mark the 90th anniversary of the sprawling, ornate and famously efficient transportation system.\n\n>The work’s original title, “Gratitude of the People to the Leader and Commander,” was dedicated to Stalin’s role in delivering victory for the Soviet Union in World War II, the 80th anniversary of which Russia [marked with pomp this year](https://www.cnn.com/2025/05/09/europe/russia-victory-day-parade-intl-hnk).\n\n>“This man (Stalin), he created a lot,” said Yevgeny Ivanov, a Moscow resident, who had come to look at the new monument on Wednesday. “He has something to be proud of. And it is not for us to tear it down. A man did something - we must respect what he did.”\n\n>Kirill Frolov, another resident of the capital, said he accepted that Stalin’s record was mixed and that you couldn’t call him “good.”\n\nPutin won't mind bringing back the tyrants of the past.",
                "Commemorating the guy who did the purges and killed close to 1 million people. Russia is something else",
                "They keep installing those in Ukraine occupied territories as well. The Russian Soviet Empire idol of gobbunism to mark their territory",
                "This, well.... uh.  A new momunment to Stalin is certainly something that could be done.  Not sure if it's the route I would go.  Especially when Russian politicians are facing a lot of backlash from the populace over the current state of Russia....\n\nMaybe it's a subtle hint from the political types to the common lay-person to get in line, to tow the line?\n\nThis is definitely a decision that could be made... wouldn't call it a smart one though.",
                "It should stir vandalism.",
                "I can use this post to spread some interesting knowledge about early years of Stalin 🙂 Young years the most successful operation that showed his organisational capabilities was robbery of Tiflis Bank 1907, he excelled at extortion, kidnapping, assassination, arson, bank robbery and thuggery. \n\nHis participation in communist movement was mostly due to ”political prisoners” were punished rather lightly than regular criminals. In his 1913 to 1916 Siberian exile as “political” he was living with real political communist Yakov Sverdlov, which he was constantly bullying and scoffing for his “clean look and behaviour” he got the dog and called it “Yashka” to piss off Yakov. His saying about Yakov “This clean spitter is so annoying and all his stupidity of washing dishes is laughable, I am much smarter than he is, I’m putting all my plates under bed and Yashka licking them white clean for me”\n\nYakov eventually moved away in another house,  and Stalin took the 14-year-old girl orphan from that village, abusing her about 2 years until his term ended. But Soviet party members pedofilism is another topic, Russian Olympic gymnasts and Balet schools, Kremlin stuff were well-known suppliers of underaged girls, for e.g. Beria",
                "*”Stirs debate”* \n\nWhat kind of tepid “both sides have equally valid arguments” reporting is this? It’s OK to take a side on this one CNN and call it what it is. \n\n*Stalin’s record was mixed*\n\nWell, an “Açaí Berry & Dog Turds Smoothie” is also mixed, and packed full of vitamins and anti-oxidants. That still doesn’t mean you should still drink it everyday for breakfast.",
                "Sounds like Putin has big plans for the people of Russia.",
                "The guy who genocided Ukrainians? Not at all surprising \n\nVladolf Putler needs to be stopped",
                "I wonder how long it will last"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russian group 'Qilin' demands ransom by next week, City of Abilene refuses to pay",
            "external_url": "https://ktxs.com/news/local/russian-group-qilin-demands-ransom-by-may-27-city-of-abilene-refuses-to-pay",
            "upvotes": 597,
            "date": "05/23/2025",
            "thumbnail": "https://ktxs.com/resources/media2/16x9/640/986/0x60/90/2bd7d544-d83c-4b9f-8511-73eaa502f6a0-AbileneMunicipalCourt.jpg",
            "top_comments": [
                "Where are Trump's great security experts? Sobering up or on a verbal high note about Biden's failures?",
                "My retirement plan is to accept that my identity will eventually get stolen.",
                "Launch a counter hacking in response and demand ransom too. We will see who outsmarts who. Oh wait, I forgot, all the experts at the FBI have been gutted, oh well,.... there goes any cyber security the US had.",
                "I don't understand how this keeps happening - everyone knows their data is under threat. \n\nMy company is tiny in comparison yet I keep 3 complete data backups, one recent (made monthly), one 365 day old and one a copy of my original clean install from more than a decade ago; if I'm hacked I can tell them to go F themselves.",
                "As long as Trump gets a cut of whatever these Russian hackers take in, he’ll look the other way.",
                "Abilene TX?  You can keep it, Russia. \n\n😉",
                "If I had a gun for every ace I have drawn   \nI could arm a town the size of Abilene   \nDon't you push me, baby, because I'm moanin' low   \nAnd you know I'm only in it for the gold",
                "Turns out hot singles were not in the area, not in the area at all.",
                "\"We'll just going to have to let them have whatever they want so that we don't escalate anything\"\n\n-Orange turd man probably",
                "Most places not run by complete idiots have ransomware insurance for this and it’s a very quick resolution."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Arizona hiker Hannah Moody's body found off trail day after she was reported missing",
            "external_url": "https://www.cbsnews.com/news/arizona-hiker-hannah-moody-body-found-day-after-reported-missing/",
            "upvotes": 2215,
            "date": "05/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/23/107aed1a-2e93-45c7-8eb8-1c8131429a1f/thumbnail/1200x630/f4a0c770f4fd4f736d45091011844477/hannah-moody-640x360.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "According to Scottsdale police, Moody's body was spotted at about 12:05 p.m. near the Gateway Trailhead of the McDowell Sonoran Preserve in Scottsdale. She was first reported missing at around 7:50 the evening before by friends who got concerned because they hadn't heard from her.",
                "I once took a friend on a hike near Tucson, around this time of year. They showed up with one of those airplane water bottles, maybe 6 ounces of water. People have no clue the risks they take with their lives sometimes.",
                "It gets brutally hot . \n\nWe have people out in 90 to 100+ degree weather, heavily exerting themselves, passing out, not bringing any water let alone enough, and often refuse to seek medical treatment.\nBack at it the next day.\n\nMistakes are made.",
                "Last fall I read \"The Heat Will Kill You First,\" which is mostly about climate change but uses the incredibly sad story of a family that died (dad, mom, baby, and their dog) during a hike on a hot day as an example of what heat does to the human body. It sounds like one of the worst ways to go.\n\nDo not underestimate heat!",
                "A couple of years ago I got really dehydrated working all day outside in July. Cleaned up, went to a party and drank a lot of beer, woke the next morning and chugged a big glass of ice water. This apparently stimulated my Vagus Nerve, and sent me into fibrillation. I ended up in the ER, got to experience a cardioversion procedure. \n\nIt doesn't matter how tough you think you are - don't fuck around with dehydration.",
                "Local news here said she claimed to have 5 gallons of water with her for that hike. Thats over 40 lbs of just water alone, at what point does that actual water weight work against you in this 100+ heat",
                "Sometimes it's the case that they : \nOverestimate their ability to withstand the heat.\nOverestimate their ability to handle the terrain.\n\nAnd in-between these two endpoints, some combination.\n\nUnderappreciation of the elements  and  then perhaps a rather exaggerated belief in their abilities. \nSometimes poor prep. No compass   no cellphone, low charge on cell phone. \n\nMyself, I'm not in great shape anymore and I know that I'm disorganized. I don't hike. I get lost easily.  I'm more likely to die by pulling a box from the shelf in my closet.",
                "May she rest in peace. The stories of hikers who accidentally get lost are so heartbreaking to hear about.",
                "I've lived here since 1997 moved from West Texas when it gets hot that's our winter. I've been saying for years now everybody needs a damn whistle in the heat your voice is going to give out and your mouth is going to go dry pretty quick you can breathe in and out through a whistle sound travels pretty far away. You don't have to be a boy scout to know that this would be an effective way to rescue some of these people who get lost.",
                "I live in the desert and drive a pick up truck.  I always keep an unopened gallon of water in my bed.  We have homeless so it gets \"stolen\" a couple of times a week.  I'll continue doing it because heat kills.  I'll pay the $1.50 to ensure someone gets hydrated and is less likely to die."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Colorado man sues Rockies after being hit in eye by foul ball during MLB game",
            "external_url": "https://www.denver7.com/us-news/colorado-man-sues-rockies-after-being-hit-in-eye-by-foul-ball-during-mlb-game",
            "upvotes": 570,
            "date": "05/23/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/c7f960c/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F21%2Fa1%2Fbc8e992a4fb6a802596fc0ad60e6%2Fap25131615328257.jpg",
            "top_comments": [
                ">The lawsuit also claims that the Rockies' \"longstanding poor performance on the field\" has created an environment where spectators are less engaged with what's happening on the field, according to the Denver Post.\n\nThere's an assumed risk involved when attending sporting events. So this probably won't go very far. But this guy went further and gave us his spicy take on the Rockies.",
                ">Roeckel was reportedly seated in a luxury box at the time of the incident, and did not have to pay for the ticket because he was a guest of the box owner.\n\nYeah, I had a feeling it was not some actual baseball fan.",
                "Isn’t this liability waiver included when you buy a ticket?",
                "“Assumption of risk doctrine” \n\nI like that term: It seems to fit the situation very well.",
                "Jesus bro let’s ruin everything. I know this guy won’t win but it sucks seeing people doing their best to ruin it for everyone else. Next they’ll have a net over the fans and no more foul balls for kids.",
                "The American Dream: find someone to sue.",
                "I hope the judge makes him pay all court and legal fees when the case is kicked out of court.",
                "A real black eye for the legal system if this suit is allowed to move forward.",
                "He should be thanking them that he can no longer see them play after being hit in the eye.",
                "They’re 8-42. Every ball they hit is foul."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man in Norway wakes to find huge container ship in garden",
            "external_url": "https://www.bbc.com/news/articles/cy8nk279ydyo",
            "upvotes": 851,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b7f6/live/21ea2650-379a-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "*Your Temu order has arrived.*",
                "The 135m-ship (443ft) missed Johan Helberg's house by metres at about 05:00 local time (03:00 GMT) on Thursday.\n\nMr Helberg was only alerted to the commotion by his panicked neighbour who had watched the ship as it headed straight for shore, in Byneset, near Trondheim.",
                "Man, i want to have his sleep. I wake up, when a Fly is in the room...",
                "The most Nordic man to ever exist.\n\nOnly a Scandinavian could react like this",
                "Surely they can track where it came from using the barcode.\n\nThey have those on ships so they can scandinavian.",
                "Can’t park there mate.",
                "What a beautiful place to live.",
                "\"I didn't order that garden ornament\".\n\n\nI hope the front doesn't fall off.",
                "Amazon delivers anything these days",
                "I thought surely there must be a mistake in the headline and it was meant to be 'shipping container' not 'container ship'. Nope."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 18414,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "Yup this is really life.",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "It is truly unfathomable that key positions in the government are being filled by people who don’t even know the jobs description.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "The hard to believe part is common Maga followers still trusting Trump."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration halts Harvard’s ability to enroll international students",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/trump-harvard-international-students.html?unlocked_article_code=1.JE8.gXSX.lbWraJmOPxDs&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 41309,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine being an international student in your last year and having this happen.",
                "[removed]",
                "This also apparently forces *current* international students to transfer, which is absolutely asinine",
                "And what about when the King of Saudi Srabia or the Sheikh of Qatar want to send a son or grandson to Harvard. I have a feeling there will be exceptions",
                "The party of small government and personal freedoms everyone",
                "Is this not fucking insane? This feels like such a step up in intensity.",
                "\"Small government\" strikes again.",
                "\"threatening their money didn't work, taking away their tax exempt status didn't work, so what other piece of absolutely dumbassery can we swing their way?\" 😒",
                "Hopefully the school can get an injunction against this action.  It is purely speech based and there are no grounds for it other than to please the dictator.  These are dark days, and it will only get worse for us.",
                "Worked within admissions for a few years. International students typically pay full ride and often pledge even more, especially at schools of prestige. A large chunk of that pledged money goes towards scholarships for domestic students. \n\nThis will increase rates for American students even more. \n\nAlso, all these bullshit bend the knee moves are killing research and who knows how terrible it could become. Seriously hope that schools outside the states can enhance their bandwidth in research fast because it is a pretty terrible ripple effect"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UK will roll out chemical castration for sex offenders",
            "external_url": "https://www.cnn.com/2025/05/22/europe/uk-chemical-castration-sex-offenders-latam-intl",
            "upvotes": 9723,
            "date": "05/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25134549748675.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "How do they decide who qualifies for this? That part seems vague. Is it based on how many times someone offends, or the type of offense? And who decides that, a judge or some review panel?",
                "The UK really does not have a great history with this policy",
                "And then the definition of \"Sex Offender\" changes.",
                "Just like they did to Alan Turing.",
                "Glad they also figured out how to know with 100% certainty 100% of the time who is guilty. Otherwise this would be barbaric.",
                "Yikes.  I was under the impression that chemical castration did not change recidivism rates at all.  ",
                "When prisons overflow, policy shifts fast. But mandatory chemical castration opens doors we might not be ready to walk through.",
                "I would encourage anyone who supports this to think about how loosely people can define “sex offenders”. Because it will not be long until that definition expands beyond just rapists. \n\nSeeing the current trends in the UK, I could completely see a future where conservatives include trans people presenting as their chosen gender or porn stars or homosexual people in that definition. The government should have no control over something like this, the potential for abuse is fucking enormous.",
                "This is what drove Allen Turing to suicide",
                "[removed]"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/23/2025 16:10:28 UTC"
}