{
    "posts": [
        {
            "category": "HOT",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 6398,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military about how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it.",
                "Good riddance. But who will be appointed to replace him. The bottom of the current barrel is deep."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Samsung CEO Han Jong-Hee dies at 63",
            "external_url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "upvotes": 5849,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192184336.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "My brother works at Samsung Electronics in Korea and posted this morning on our family group chat. He said the guy apparently collapsed at his daughter's wedding after drinking heavily. He was a known heavy drinker within the Samsung circle. He would mix beer with hard liquor and one-shot those despite health concerns.",
                "Another article gives slightly more information on cause. \n\n>  South Korean tech giant Samsung Electronics said on Tuesday that its co-chief executive officer Han Jong-hee has died from cardiac arrest. Han was 63.",
                "This is samsung electronics, a subsidiary. The wider group is controlled by Lee Jae-Yong (the family)",
                "To quote Pusha T “ask Steve Jobs, wealth don’t buy health.”",
                "Absolutely no information in the article except that he died - interesting\n\n63 is young…was he sick?",
                "Somebody gonna get Mikoshi online now",
                "Huh, didn't even know he was sick.",
                "Samsung rotates their CEOs every couple of years. They'll just move on",
                "Yep, this is the drop dead zone for men. ",
                "It is being reported that he died from cardiac arrest while having a heart attack at the age of 63."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 30837,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/606d/live/c3f6b5c0-0929-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[removed]",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Jesus fucking Christ. The ineptitude is rampant",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Anyone have odds that the administration tries to blame the journalist?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 14002,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Arrested? It’s a fucking kidnapping",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "How are we not sanctioning these scumbags? This is insane.",
                "This is HORRIFYING and needs to be on the front page of every news source. Not that everything up til this point hasn’t been horrifying— but the Hollywood element here means this story has the potential to really stick. Please comment and share and talk about this.",
                "I hate when people call them just “settlers”. \n\nThey’re terrorists. They have been purposely terrorizing people and stealing land for decades, thus they are settler terrorists. There is no other way to describe these people.",
                "\"But do you condemn Hamas?\""
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "China's electric carmaker BYD sales beat Elon Musk's Tesla",
            "external_url": "https://www.bbc.com/news/articles/cd65d583qvzo",
            "upvotes": 1656,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e30f/live/7bf619c0-0913-11f0-ac88-ab5a5b6fb862.jpg",
            "top_comments": [
                "BYD is everywhere in Australia. Anecdotally I have thought it outnumbers Tesla for some time just based on how many I see around",
                "Leaving aside the Tesla stuff, what is going on with American (and Western) manufacturing that Chinese companies are able to beat the pants off them? If these BYD vehicles were pieces of shit that would be one thing, but they're actually pretty comparable at a fraction of the price. Even when labor costs are equal they're doing very well in comparison. And it's not just cars.",
                "Meanwhile, Canadian tariffs of 100% mean you can't purchase them here. Would purchase one day one if they allowed them here.",
                "Wish they were in the states but we'll... There's obviously reasons they're not. They have some really cool innovations too.",
                "Its more than just BYD, we're about to see just how far behind all of our automotive manufacturers are compared to some of these Chinese companies.\n\nWe think of China as this third word country without innovation. Capitalism only works when the market is free and incentives for competition. That's been stifled or manipulated in so many ways in the US.",
                "BYDs are really reliable.  The coworkers I've had (I'm in China) who own one have been very satisfied with them.  I've ridden in a few.  The ride is smooth and they're an attractive car inside and out.",
                "The major issue is exactly that. They are very good vehicles for substantially less money. With some crazy interiors and lots of cool tech. They suspect that if we start importing them, a very large employment sector will be decimated.\n\nEdit: missing words",
                "China is extending their lead in EV technology and at a lower cost.  Tesla is no longer state of art.",
                "Tesla is done. It won't ever recover now even if Elon is no longer involved.",
                "Most Chinese stuff isn't banned because if security risks, but because it would DESTROY shitty companies like Tesla.\n\nFor example, BYD unveiled a $15 000 hybrid with about 1300 miles in range between a full tank of gas and a full battery. \n\nWhat's Tesla's range again and at what price?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 4097,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "Did the FBI just become mall cops?",
                "They should launch a task force to look into the crimes committed by musk and the missing money in teslas balance sheet",
                "And suddenly it’s ok to weaponize them when your side controls the weapon…",
                "FBI once feared now turned into rent-a-cops. beyond pathetic",
                "[removed]",
                "Gotta protect the Oligarchs companies but don’t worry about massive breaches of National Security.",
                "“If you touch my boyfriend’s car you’re gonna regret it hugely!” Donald Trump",
                "Geeze!  How is this not \"swampy\" on the part of the u.s. government?",
                "Ah, diverting the FBI to a new task that's not about any texts, huh?\n\n\"This is not a national security threat. *This* is!\"",
                "Where’s DOGE? \n\nTalk about wasting tax payor dollars"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Mass federal worker firings could pose significant security risk for U.S., experts warn",
            "external_url": "https://www.cbsnews.com/news/mass-federal-worker-firings-us-security-risk/",
            "upvotes": 684,
            "date": "03/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/10/23/965fb03d-e5cb-427a-9225-0d678fab87c6/thumbnail/1200x630/79f6b21fedfc88bd95651874a4d62dd2/ap23296700516174.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "As the article says, all those employees with sensitive government information are a big and enticing target to be informants since being an informant could be appealing if your mortgage is overdue.",
                "That's the entire point: to destabilize us as a nation. It's what happens when you elect a foreign asset to the highest office in the US.",
                "No fucking shit, Sherlock.",
                "Some of the hirings aren’t proving so helpful, either.",
                "Don't worry we got Hegseth and crew doing a bang up job with or without them.",
                "Bro, the mass firings are a symptom of compromised security.\n\nUS government security has been threatened, assaulted, and brutally beaten. The firings are the blood.",
                "In other news, water is wet, the sky is blue, and my unending existential dread shows no signs of dimminishing. Back to you Cotton.",
                "If anyone is receiving military action plans please reply STOP.",
                "'We're not weakening the country right as Russia is at it's most desperate an aggressive, just look over there at ... national security leaks instead or something else shocking instead'",
                "Are you saying our frat house administration might be compromised after they shared war plans through fucking SIGNAL? I am shocked"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Austin Tesla dealership bomb investigation; suspicious devices found",
            "external_url": "https://www.fox7austin.com/news/austin-tesla-dealership-bomb-investigation-suspicious-devices-found",
            "upvotes": 2685,
            "date": "03/24/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/03/1280/720/tesla-showroom-incident-ktbceme001_11_05_23.mpg_ktbca579_132.mpg_.11_06_01_22.still001.jpg?ve=1&tl=1",
            "top_comments": [
                "Like Tesla dealerships aren't covered in cameras?",
                "Since this is Texas, I'm going to assume Ken Paxton paid to set this up.",
                "Looks like the reichstag fire will be at a Tesla dealership this time.",
                "This reminds me of the time Trump said, \"He who saves his country does not violate any law.\"",
                "That’s just a Roman Firework.",
                "Are they sure the people weren't just tourists looking at the showroom?",
                "The peacefulness is getting ramped up again",
                "Those aren't bombs, they're just Cybertrucks. I understand why someone might confuse the two",
                "I'm honestly just waiting to hear what the excuses on this site will morph into when someone actually gets hurt.",
                "Bombing Tesla dealerships isn’t exactly smart. You’re potentially hurting innocent people. \n\nAll this does is help paint the left as terroristic lunatics"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 15202,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Ma'am, he'll need that to live.",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "It’s like they have a quota to kill and maim folks",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child.",
                "So many of these crazy stories come from United Airlines"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 5217,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "Bumble Bee is really dreadful. Their CEO was sentenced to prison awhile back. And I know a worker was killed in one of their canning facilities. https://www.justice.gov/archives/opa/pr/former-bumble-bee-ceo-sentenced-prison-fixing-prices-canned-tuna",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "Is there anything, at all, anywhere, that isn't awful?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Mass federal worker firings could pose significant security risk for U.S., experts warn",
            "external_url": "https://www.cbsnews.com/news/mass-federal-worker-firings-us-security-risk/",
            "upvotes": 684,
            "date": "03/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/10/23/965fb03d-e5cb-427a-9225-0d678fab87c6/thumbnail/1200x630/79f6b21fedfc88bd95651874a4d62dd2/ap23296700516174.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "As the article says, all those employees with sensitive government information are a big and enticing target to be informants since being an informant could be appealing if your mortgage is overdue.",
                "That's the entire point: to destabilize us as a nation. It's what happens when you elect a foreign asset to the highest office in the US.",
                "No fucking shit, Sherlock.",
                "Some of the hirings aren’t proving so helpful, either.",
                "Don't worry we got Hegseth and crew doing a bang up job with or without them.",
                "Bro, the mass firings are a symptom of compromised security.\n\nUS government security has been threatened, assaulted, and brutally beaten. The firings are the blood.",
                "In other news, water is wet, the sky is blue, and my unending existential dread shows no signs of dimminishing. Back to you Cotton.",
                "If anyone is receiving military action plans please reply STOP.",
                "'We're not weakening the country right as Russia is at it's most desperate an aggressive, just look over there at ... national security leaks instead or something else shocking instead'",
                "Are you saying our frat house administration might be compromised after they shared war plans through fucking SIGNAL? I am shocked"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "China's electric carmaker BYD sales beat Elon Musk's Tesla",
            "external_url": "https://www.bbc.com/news/articles/cd65d583qvzo",
            "upvotes": 1654,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e30f/live/7bf619c0-0913-11f0-ac88-ab5a5b6fb862.jpg",
            "top_comments": [
                "BYD is everywhere in Australia. Anecdotally I have thought it outnumbers Tesla for some time just based on how many I see around",
                "Leaving aside the Tesla stuff, what is going on with American (and Western) manufacturing that Chinese companies are able to beat the pants off them? If these BYD vehicles were pieces of shit that would be one thing, but they're actually pretty comparable at a fraction of the price. Even when labor costs are equal they're doing very well in comparison. And it's not just cars.",
                "Meanwhile, Canadian tariffs of 100% mean you can't purchase them here. Would purchase one day one if they allowed them here.",
                "Wish they were in the states but we'll... There's obviously reasons they're not. They have some really cool innovations too.",
                "Its more than just BYD, we're about to see just how far behind all of our automotive manufacturers are compared to some of these Chinese companies.\n\nWe think of China as this third word country without innovation. Capitalism only works when the market is free and incentives for competition. That's been stifled or manipulated in so many ways in the US.",
                "BYDs are really reliable.  The coworkers I've had (I'm in China) who own one have been very satisfied with them.  I've ridden in a few.  The ride is smooth and they're an attractive car inside and out.",
                "The major issue is exactly that. They are very good vehicles for substantially less money. With some crazy interiors and lots of cool tech. They suspect that if we start importing them, a very large employment sector will be decimated.\n\nEdit: missing words",
                "China is extending their lead in EV technology and at a lower cost.  Tesla is no longer state of art.",
                "Tesla is done. It won't ever recover now even if Elon is no longer involved.",
                "Most Chinese stuff isn't banned because if security risks, but because it would DESTROY shitty companies like Tesla.\n\nFor example, BYD unveiled a $15 000 hybrid with about 1300 miles in range between a full tank of gas and a full battery. \n\nWhat's Tesla's range again and at what price?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 6386,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military about how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it.",
                "Good riddance. But who will be appointed to replace him. The bottom of the current barrel is deep."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "World’s first case of bird flu in sheep detected in England",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/bird-flu-detected-sheep-first-time-england-world-risk-public",
            "upvotes": 459,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6bae7f4ef0c46d553c1e4535131d87ee1edc6b69/0_124_5212_3128/master/5212.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3d679075330b452aa6e611c6e424327f",
            "top_comments": [
                "Well this is certainly ba-ah-ah-ad news.",
                "This is in fact a very bad thing.",
                "We should check in on England in 28 days huh?",
                "Someone better warn the Welsh.",
                "Is the sheep gonna be ok",
                "It’s really only a matter of time before we get hit with something bad. 😬",
                "That's Scotland and Wales done for, then.",
                "New Zealand very nervous right now",
                "Time to burn my sheepskin seat covers?",
                "Wouldn't that make it... sheep flu then?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Samsung CEO Han Jong-Hee dies at 63",
            "external_url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "upvotes": 5841,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192184336.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "My brother works at Samsung Electronics in Korea and posted this morning on our family group chat. He said the guy apparently collapsed at his daughter's wedding after drinking heavily. He was a known heavy drinker within the Samsung circle. He would mix beer with hard liquor and one-shot those despite health concerns.",
                "Another article gives slightly more information on cause. \n\n>  South Korean tech giant Samsung Electronics said on Tuesday that its co-chief executive officer Han Jong-hee has died from cardiac arrest. Han was 63.",
                "This is samsung electronics, a subsidiary. The wider group is controlled by Lee Jae-Yong (the family)",
                "To quote Pusha T “ask Steve Jobs, wealth don’t buy health.”",
                "Absolutely no information in the article except that he died - interesting\n\n63 is young…was he sick?",
                "Somebody gonna get Mikoshi online now",
                "Huh, didn't even know he was sick.",
                "Samsung rotates their CEOs every couple of years. They'll just move on",
                "Yep, this is the drop dead zone for men. ",
                "It is being reported that he died from cardiac arrest while having a heart attack at the age of 63."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Card skimmers are popping up in the Pittsburgh area more often. Here's how police say you can spot them.",
            "external_url": "https://www.cbsnews.com/pittsburgh/news/how-to-spot-credit-card-skimmers/",
            "upvotes": 398,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/24/1daaf482-4e51-4568-98a0-552ced6ea7f7/thumbnail/1200x630/16c28e848505dce4eddad106eca3d2a1/kdka-west-mifflin-credit-card-skimmer.png?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Stop using your debit card, a credit card offers far more insulation. If you use a debit card, do not store large amounts of your money in the same account attached to the debit card. Use tap to pay whenever you can. Try to set up your issuer to text you every purchase. ",
                "After my credit card data was stolen last month and I was frauded out of over $1000, I've been much more careful about how and where I use it. It wasn't even because of the skimmers described in this article. Fortunately, the bank sorted it all out. ",
                "#Card Skimmers on the Rise in Pittsburgh as Police Urge Shoppers to ‘Tug, Tap and Track’\n\nIt takes seconds to fill up your tank or grab a snack from the local shop, but that quick stop could cost you dearly if a credit card skimmer is lurking nearby. In the Pittsburgh area, these sneaky devices are showing up more and more, blending in so perfectly with the real machines that even the sharpest eyes might miss them.\n\nCriminals are getting bolder, popping skimmers onto cash machines and card readers at petrol stations and convenience stores with the kind of ease that would make a magician jealous. One such case in West Mifflin, just outside Pittsburgh, has police scratching their heads and combing through hours of CCTV in the hope of catching whoever planted a skimmer at a 7-Eleven on Camp Hollow Road. The image of the dodgy device soon did the rounds on social media, raising eyebrows and awareness in equal measure.\n\nPolice Chief Gregory McCulloch says it is often ordinary people who sound the alarm. A customer might notice something that doesn’t feel quite right with a card reader or later spot an unfamiliar charge on their statement. From there, it becomes a painstaking job for detectives, especially since many of the culprits are not local. These crooks often use Bluetooth to gather the stolen data, never even setting foot inside the shop again. They just park nearby and collect the loot wirelessly.\n\nThe FBI reckons these skimming scams cost banks and consumers over a billion dollars a year, and part of the problem is how difficult they are to spot. According to Chief McCulloch, your hands are your best defence. Forget looking, it is all about feeling. If something seems loose or out of place, give it a good tug. In one case, a suspicious shopper did just that and the fake device came right off. Simple as that.\n\nThese skimmers are clever little things. They slide over the existing card slot and have a tiny computer chip inside that grabs all your information the moment you swipe. Just like that, your bank details are in the hands of someone who has no business knowing them.\n\nMcCulloch recommends remembering three little words: tug, tap and track. Tug at the card reader before you use it. Tap to pay whenever you can, since using contactless helps you steer clear of dodgy readers altogether. And track your bank statements like a hawk. The sooner you spot a charge you didn’t make, the better your chances of shutting it down before the damage piles up.\n\nAs technology gets smarter, so do the criminals. But a bit of caution, a quick check, and a habit of keeping an eye on your accounts can go a long way. Because while these skimmers might be hard to see, the trouble they cause is crystal clear.",
                "Dam did this happen to be in those shitty ads you find at the bottom of gamerank articles?",
                "Glad i pay with cash still",
                "The benefit of always being broke with bills. \n\n“Got paid today, aaaaand it’s gone.”",
                "Glad I spent my life savings just earlier today at the pump.",
                "Why do people still swipe credit cards at all? \n\n\nWe went over this 10 years ago.",
                "Every gas station has an app now, no need to swipe anymore.",
                "Now I want to go around to all the gas stations & collect all the skimmers…I wonder if I could sell them on FBM… ;)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "New fire maps increase hazard zones in L.A. and Southern California by 3.5 million acres",
            "external_url": "https://www.latimes.com/environment/story/2025-03-24/new-fire-hazard-maps-for-los-angeles-and-southern-california",
            "upvotes": 444,
            "date": "03/24/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/139de81/2147483647/strip/true/crop/5121x2689+0+363/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F07%2F80%2Ffb1802b640ed8c471a53c98d6f9a%2F1499583-me-protest-altadena-golf-course-jja-045.jpg",
            "top_comments": [
                "This will have real consequences...\n\n>>The hazard severity zone maps are referenced in more than 50 sections of California law. They require homeowners in “high” and “very high” hazard zones to follow fire-safe building codes for new construction — including installing multi-pane windows that are less likely to break in extreme heat and covering vents and other openings to prevent embers from entering the house. Homeowners in the “very high” zones must maintain defensible space around their properties and disclose the “very high” status when they put their houses up for sale",
                "My house is just barely outside of the \"high fire risk\" zone. This time. But if there is another one like the Eaton Fire, I don't think I will be so lucky.",
                "Where is the map?  Forget the LA Times article.",
                "I get really annoyed by headlines like this. The map didn't increase the hazard zone. The hazard zone is there whether the map exists or not. This is documenting that hazard and bettering planning with better information",
                "There goes my insurance",
                "Oh...Thank God. I thought y'all were on fire again. Be safe out there, regardless."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 4095,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "Did the FBI just become mall cops?",
                "They should launch a task force to look into the crimes committed by musk and the missing money in teslas balance sheet",
                "And suddenly it’s ok to weaponize them when your side controls the weapon…",
                "FBI once feared now turned into rent-a-cops. beyond pathetic",
                "[removed]",
                "Gotta protect the Oligarchs companies but don’t worry about massive breaches of National Security.",
                "“If you touch my boyfriend’s car you’re gonna regret it hugely!” Donald Trump",
                "Geeze!  How is this not \"swampy\" on the part of the u.s. government?",
                "Ah, diverting the FBI to a new task that's not about any texts, huh?\n\n\"This is not a national security threat. *This* is!\"",
                "Where’s DOGE? \n\nTalk about wasting tax payor dollars"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 14003,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Arrested? It’s a fucking kidnapping",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "How are we not sanctioning these scumbags? This is insane.",
                "This is HORRIFYING and needs to be on the front page of every news source. Not that everything up til this point hasn’t been horrifying— but the Hollywood element here means this story has the potential to really stick. Please comment and share and talk about this.",
                "I hate when people call them just “settlers”. \n\nThey’re terrorists. They have been purposely terrorizing people and stealing land for decades, thus they are settler terrorists. There is no other way to describe these people.",
                "\"But do you condemn Hamas?\""
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 30842,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/606d/live/c3f6b5c0-0929-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[removed]",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Jesus fucking Christ. The ineptitude is rampant",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Anyone have odds that the administration tries to blame the journalist?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Mass federal worker firings could pose significant security risk for U.S., experts warn",
            "external_url": "https://www.cbsnews.com/news/mass-federal-worker-firings-us-security-risk/",
            "upvotes": 679,
            "date": "03/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/10/23/965fb03d-e5cb-427a-9225-0d678fab87c6/thumbnail/1200x630/79f6b21fedfc88bd95651874a4d62dd2/ap23296700516174.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "As the article says, all those employees with sensitive government information are a big and enticing target to be informants since being an informant could be appealing if your mortgage is overdue.",
                "That's the entire point: to destabilize us as a nation. It's what happens when you elect a foreign asset to the highest office in the US.",
                "No fucking shit, Sherlock.",
                "Some of the hirings aren’t proving so helpful, either.",
                "Don't worry we got Hegseth and crew doing a bang up job with or without them.",
                "Bro, the mass firings are a symptom of compromised security.\n\nUS government security has been threatened, assaulted, and brutally beaten. The firings are the blood.",
                "In other news, water is wet, the sky is blue, and my unending existential dread shows no signs of dimminishing. Back to you Cotton.",
                "If anyone is receiving military action plans please reply STOP.",
                "'We're not weakening the country right as Russia is at it's most desperate an aggressive, just look over there at ... national security leaks instead or something else shocking instead'",
                "Are you saying our frat house administration might be compromised after they shared war plans through fucking SIGNAL? I am shocked"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "China's electric carmaker BYD sales beat Elon Musk's Tesla",
            "external_url": "https://www.bbc.com/news/articles/cd65d583qvzo",
            "upvotes": 1653,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e30f/live/7bf619c0-0913-11f0-ac88-ab5a5b6fb862.jpg",
            "top_comments": [
                "BYD is everywhere in Australia. Anecdotally I have thought it outnumbers Tesla for some time just based on how many I see around",
                "Leaving aside the Tesla stuff, what is going on with American (and Western) manufacturing that Chinese companies are able to beat the pants off them? If these BYD vehicles were pieces of shit that would be one thing, but they're actually pretty comparable at a fraction of the price. Even when labor costs are equal they're doing very well in comparison. And it's not just cars.",
                "Meanwhile, Canadian tariffs of 100% mean you can't purchase them here. Would purchase one day one if they allowed them here.",
                "Wish they were in the states but we'll... There's obviously reasons they're not. They have some really cool innovations too.",
                "Its more than just BYD, we're about to see just how far behind all of our automotive manufacturers are compared to some of these Chinese companies.\n\nWe think of China as this third word country without innovation. Capitalism only works when the market is free and incentives for competition. That's been stifled or manipulated in so many ways in the US.",
                "BYDs are really reliable.  The coworkers I've had (I'm in China) who own one have been very satisfied with them.  I've ridden in a few.  The ride is smooth and they're an attractive car inside and out.",
                "The major issue is exactly that. They are very good vehicles for substantially less money. With some crazy interiors and lots of cool tech. They suspect that if we start importing them, a very large employment sector will be decimated.\n\nEdit: missing words",
                "China is extending their lead in EV technology and at a lower cost.  Tesla is no longer state of art.",
                "Tesla is done. It won't ever recover now even if Elon is no longer involved.",
                "Most Chinese stuff isn't banned because if security risks, but because it would DESTROY shitty companies like Tesla.\n\nFor example, BYD unveiled a $15 000 hybrid with about 1300 miles in range between a full tank of gas and a full battery. \n\nWhat's Tesla's range again and at what price?"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 6402,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military about how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it.",
                "Good riddance. But who will be appointed to replace him. The bottom of the current barrel is deep."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "World’s first case of bird flu in sheep detected in England",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/bird-flu-detected-sheep-first-time-england-world-risk-public",
            "upvotes": 462,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6bae7f4ef0c46d553c1e4535131d87ee1edc6b69/0_124_5212_3128/master/5212.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3d679075330b452aa6e611c6e424327f",
            "top_comments": [
                "Well this is certainly ba-ah-ah-ad news.",
                "This is in fact a very bad thing.",
                "We should check in on England in 28 days huh?",
                "Someone better warn the Welsh.",
                "Is the sheep gonna be ok",
                "It’s really only a matter of time before we get hit with something bad. 😬",
                "That's Scotland and Wales done for, then.",
                "New Zealand very nervous right now",
                "Time to burn my sheepskin seat covers?",
                "Wouldn't that make it... sheep flu then?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Samsung CEO Han Jong-Hee dies at 63",
            "external_url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "upvotes": 5845,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192184336.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "My brother works at Samsung Electronics in Korea and posted this morning on our family group chat. He said the guy apparently collapsed at his daughter's wedding after drinking heavily. He was a known heavy drinker within the Samsung circle. He would mix beer with hard liquor and one-shot those despite health concerns.",
                "Another article gives slightly more information on cause. \n\n>  South Korean tech giant Samsung Electronics said on Tuesday that its co-chief executive officer Han Jong-hee has died from cardiac arrest. Han was 63.",
                "This is samsung electronics, a subsidiary. The wider group is controlled by Lee Jae-Yong (the family)",
                "To quote Pusha T “ask Steve Jobs, wealth don’t buy health.”",
                "Absolutely no information in the article except that he died - interesting\n\n63 is young…was he sick?",
                "Somebody gonna get Mikoshi online now",
                "Huh, didn't even know he was sick.",
                "Samsung rotates their CEOs every couple of years. They'll just move on",
                "Yep, this is the drop dead zone for men. ",
                "It is being reported that he died from cardiac arrest while having a heart attack at the age of 63."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 4105,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "Did the FBI just become mall cops?",
                "They should launch a task force to look into the crimes committed by musk and the missing money in teslas balance sheet",
                "And suddenly it’s ok to weaponize them when your side controls the weapon…",
                "FBI once feared now turned into rent-a-cops. beyond pathetic",
                "[removed]",
                "Gotta protect the Oligarchs companies but don’t worry about massive breaches of National Security.",
                "“If you touch my boyfriend’s car you’re gonna regret it hugely!” Donald Trump",
                "Geeze!  How is this not \"swampy\" on the part of the u.s. government?",
                "Ah, diverting the FBI to a new task that's not about any texts, huh?\n\n\"This is not a national security threat. *This* is!\"",
                "Where’s DOGE? \n\nTalk about wasting tax payor dollars"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 14017,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Arrested? It’s a fucking kidnapping",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "How are we not sanctioning these scumbags? This is insane.",
                "This is HORRIFYING and needs to be on the front page of every news source. Not that everything up til this point hasn’t been horrifying— but the Hollywood element here means this story has the potential to really stick. Please comment and share and talk about this.",
                "I hate when people call them just “settlers”. \n\nThey’re terrorists. They have been purposely terrorizing people and stealing land for decades, thus they are settler terrorists. There is no other way to describe these people.",
                "\"But do you condemn Hamas?\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "New fire maps increase hazard zones in L.A. and Southern California by 3.5 million acres",
            "external_url": "https://www.latimes.com/environment/story/2025-03-24/new-fire-hazard-maps-for-los-angeles-and-southern-california",
            "upvotes": 450,
            "date": "03/24/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/139de81/2147483647/strip/true/crop/5121x2689+0+363/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F07%2F80%2Ffb1802b640ed8c471a53c98d6f9a%2F1499583-me-protest-altadena-golf-course-jja-045.jpg",
            "top_comments": [
                "This will have real consequences...\n\n>>The hazard severity zone maps are referenced in more than 50 sections of California law. They require homeowners in “high” and “very high” hazard zones to follow fire-safe building codes for new construction — including installing multi-pane windows that are less likely to break in extreme heat and covering vents and other openings to prevent embers from entering the house. Homeowners in the “very high” zones must maintain defensible space around their properties and disclose the “very high” status when they put their houses up for sale",
                "My house is just barely outside of the \"high fire risk\" zone. This time. But if there is another one like the Eaton Fire, I don't think I will be so lucky.",
                "Where is the map?  Forget the LA Times article.",
                "I get really annoyed by headlines like this. The map didn't increase the hazard zone. The hazard zone is there whether the map exists or not. This is documenting that hazard and bettering planning with better information",
                "There goes my insurance",
                "Oh...Thank God. I thought y'all were on fire again. Be safe out there, regardless."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Card skimmers are popping up in the Pittsburgh area more often. Here's how police say you can spot them.",
            "external_url": "https://www.cbsnews.com/pittsburgh/news/how-to-spot-credit-card-skimmers/",
            "upvotes": 402,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/24/1daaf482-4e51-4568-98a0-552ced6ea7f7/thumbnail/1200x630/16c28e848505dce4eddad106eca3d2a1/kdka-west-mifflin-credit-card-skimmer.png?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Stop using your debit card, a credit card offers far more insulation. If you use a debit card, do not store large amounts of your money in the same account attached to the debit card. Use tap to pay whenever you can. Try to set up your issuer to text you every purchase. ",
                "After my credit card data was stolen last month and I was frauded out of over $1000, I've been much more careful about how and where I use it. It wasn't even because of the skimmers described in this article. Fortunately, the bank sorted it all out. ",
                "#Card Skimmers on the Rise in Pittsburgh as Police Urge Shoppers to ‘Tug, Tap and Track’\n\nIt takes seconds to fill up your tank or grab a snack from the local shop, but that quick stop could cost you dearly if a credit card skimmer is lurking nearby. In the Pittsburgh area, these sneaky devices are showing up more and more, blending in so perfectly with the real machines that even the sharpest eyes might miss them.\n\nCriminals are getting bolder, popping skimmers onto cash machines and card readers at petrol stations and convenience stores with the kind of ease that would make a magician jealous. One such case in West Mifflin, just outside Pittsburgh, has police scratching their heads and combing through hours of CCTV in the hope of catching whoever planted a skimmer at a 7-Eleven on Camp Hollow Road. The image of the dodgy device soon did the rounds on social media, raising eyebrows and awareness in equal measure.\n\nPolice Chief Gregory McCulloch says it is often ordinary people who sound the alarm. A customer might notice something that doesn’t feel quite right with a card reader or later spot an unfamiliar charge on their statement. From there, it becomes a painstaking job for detectives, especially since many of the culprits are not local. These crooks often use Bluetooth to gather the stolen data, never even setting foot inside the shop again. They just park nearby and collect the loot wirelessly.\n\nThe FBI reckons these skimming scams cost banks and consumers over a billion dollars a year, and part of the problem is how difficult they are to spot. According to Chief McCulloch, your hands are your best defence. Forget looking, it is all about feeling. If something seems loose or out of place, give it a good tug. In one case, a suspicious shopper did just that and the fake device came right off. Simple as that.\n\nThese skimmers are clever little things. They slide over the existing card slot and have a tiny computer chip inside that grabs all your information the moment you swipe. Just like that, your bank details are in the hands of someone who has no business knowing them.\n\nMcCulloch recommends remembering three little words: tug, tap and track. Tug at the card reader before you use it. Tap to pay whenever you can, since using contactless helps you steer clear of dodgy readers altogether. And track your bank statements like a hawk. The sooner you spot a charge you didn’t make, the better your chances of shutting it down before the damage piles up.\n\nAs technology gets smarter, so do the criminals. But a bit of caution, a quick check, and a habit of keeping an eye on your accounts can go a long way. Because while these skimmers might be hard to see, the trouble they cause is crystal clear.",
                "Dam did this happen to be in those shitty ads you find at the bottom of gamerank articles?",
                "Glad i pay with cash still",
                "The benefit of always being broke with bills. \n\n“Got paid today, aaaaand it’s gone.”",
                "Glad I spent my life savings just earlier today at the pump.",
                "Why do people still swipe credit cards at all? \n\n\nWe went over this 10 years ago.",
                "Every gas station has an app now, no need to swipe anymore.",
                "Now I want to go around to all the gas stations & collect all the skimmers…I wonder if I could sell them on FBM… ;)"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 30836,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/606d/live/c3f6b5c0-0929-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[removed]",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Jesus fucking Christ. The ineptitude is rampant",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Anyone have odds that the administration tries to blame the journalist?"
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "03/25/2025 08:11:59 UTC"
}