{
    "posts": [
        {
            "category": "HOT",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 8903,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "The discrimination towards younger patients is honestly sad",
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too.",
                "A woman I loved with all my heart died from breast cancer at 26, in the US, after extensive care. \n\nFUCK CANCER and FUCK ANY GOVERNMENT THAT DEPRIORITIZES DEFEATING IT.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "My sister-in-law was diagnosed with an aggressive form of breast cancer in her 30's after discovering a lump. She's fought bravely for 7 years but it came back even more aggressive. Women that young do get it and any concern that they may have taken seriously.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "There was a girl in my hometown who was diagnosed with breast cancer at age 10"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 19507,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "Very sad story the cop wasn't even involved",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 4479,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "We should've rejected voting in Trump a second time...",
                "The cartel is embedded in a large swath of Mexican society. They employ a lot of people too. Waging war against them is like fighting a civil war. Mexico is kind of a failed state because of this. I just can’t believe America loves their hard drugs so much to keep this going for so long. How do you unwind this?",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Remember kids, vampires can’t enter your house without an invitation."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Another round of auto tariffs just went into effect. They could change the industry forever | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/03/business/auto-parts-tariffs",
            "upvotes": 2128,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2148007829.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They could, or they could be lifted tomorrow. Or doubled.\n\nWho the fuck knows.",
                "We are speed running the end of America as a global superpower, and it’s honestly stunning to witness.",
                "*But even with that refund, the added cost of tariffs could still come to an average of about $4,000 per vehicle, according to estimates derived from a CNN analysis of government trade data*\n\nThe tariff on on car parts starts today.... the effect arrive in a few months. Plan ahead. I'm hanging on to what I've got.",
                "People will now hold on to their reliable vehicles as long as possible now that price of both new and old will head up North.",
                "I’m so goddamn tired of the world, industry, whatever, changing forever literally every damned day. We’re in uncharted waters. Every single day that passes literally changes this country forever.",
                "Funny that 2 months ago I was looking at buying a new car. Now, fuck that. I work in the auto industry and I’m not giving them a dime. I’ll drive my shitbox",
                "I had a feeling my stocks were doing too well",
                "Making America Poor Again.",
                "Yep making living in urban areas with public transit more attractive combined with business demanding people come back to the office at least in a hybrid model. Cuts making suburban and rural life much harder (hospitals, businesses, farms, etc.). Elections have consequences.",
                "I saw the writing on the wall and got a new car 2 months ago. My coworker went in Friday."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 4566,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "Do you think Warren is eligible for social security?",
                "I bet he grows his hair out and starts doing yoga. ",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Have fun at Margaritaville",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "Never bounced back after being passed over for the Dunder Mifflin job"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 2393,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "In classic Reddit fashion, nobody read the article. Dude is being institutionalized until he can stand trial, and they said at that point he would (if it never happens… he’s dead in a hospital). Both sides agreed. So basically he’s in “bonus sentence” territory at best at this point. You have to be an absolute ghoul to think a Bureau of Prisons hospitalization is somehow a five star resort.\n\nSome people also saying he’s “suspiciously” and “suddenly” got Alzheimer’s, TBI and dementia. Those following the trial know that’s not a thing, and Alzheimer’s isn’t the kind of thing you just kinda walk with a limp and get diagnosed with agreement from all parties. Four different doctors and the prosecution agreed. “But why just as he’s charged?” Because it’s his lawyers that noticed he wasn’t replying coherently and referred him.\n\nEdit: so many comments about “but he won’t face charges” as if he gives a fuck and is in any position to understand them. I’m sure a custodial clarification against an effective corpse will make the victims families feel awesome.",
                "100% predator. He got off easy. Fucker.",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "Couldn’t have happened to a more deserving predator",
                "A guy tried to hurt my teen, and was caught and arrested. He spent many months in jail so drugged up he didn’t move once during hearings. Finally was sent to a medical facility for psych meds, but they were never able to prove he was competent to face trial.  SO THEY RELEASED HIM. He’s been arrested at least three times since. He tried to kill women, unknown to him, at least twice before. He’s loose in Seattle now.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 2601,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "Why didn’t he want the case to go to trial?",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "What in the actual fuck",
                "Sometimes, we don’t need logic. Some people are psychopaths in the clinical sense, lacking empathy, remorse, and other qualities. Many functional psychopaths exist, but we don’t realise this because they’re very good at hiding their true nature. Some don’t resist their nature, leading to such stories."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 2165,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "Upvote for the source calling the Gulf by it's proper name.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "Oh thank God it's not in the Gulf of America",
                "Oh, so when there’s a spill it’s Mexico’s gulf?"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "HOT",
            "title": "Warren Buffett shocks shareholders by announcing his intention to retire at the end of the year",
            "external_url": "https://apnews.com/article/warren-buffett-berkshire-hathaway-shareholders-annual-meeting-a421061233f99859673fb131ce020d4d",
            "upvotes": 689,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How shocking could it be, he’s 94 and rich. My ass would have been outta there decades ago.",
                "People should be more shocked if a 94 old person announces he’ll continue to work.",
                "He's 94 for the love of pete. I wouldn't be shocked if he passed away. 94 and sharp as heck",
                "Instead of shock, shareholders should count their blessings that Oracle of Omaha stayed on as chair as long as he has at age 94.  \n\nHope he maintain his mental acuity and mobility as he finally will have time to relax.",
                "I hope there's not some sorta underlying health issue he's retiring for, 94 is so young!",
                "Dude getting out before the shit hits the fan.",
                "End of an era. Happy retirement.",
                "94 year old \"shocks\" investors by announcing his retirement.",
                "If they were shocked, they must've not been paying attention. I work for a Berkshire company, we knew this was coming and it wasn't a secret.",
                "Retire, in this economy? I hope he saved up enough."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 7555,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "He will be broke in 5 years. Impulse control is not the best.",
                "When keeping it real goes wrong.",
                "Shocking. He looked like such a responsible guy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 73,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "White House suggests “really high” traffic lights.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "5.3-magnitude earthquake rattles rural southeastern New Mexico, West Texas",
            "external_url": "https://www.cbsnews.com/news/5-3-magnitude-earthquake-rattles-rural-southeastern-new-mexico-west-texas/",
            "upvotes": 53,
            "date": "05/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/04/94fa4567-f863-416f-a3a9-5014ae1df706/thumbnail/1200x630/4a5a80dda74ee3bd16a835d0a8970139/screenshot-2025-05-03-195502.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Where's that new \"spaceport\" being built again?",
                "Is this one of those “fracking earthquakes” like the ones in Oklahoma?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Warren Buffett shocks shareholders by announcing his intention to retire at the end of the year",
            "external_url": "https://apnews.com/article/warren-buffett-berkshire-hathaway-shareholders-annual-meeting-a421061233f99859673fb131ce020d4d",
            "upvotes": 686,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How shocking could it be, he’s 94 and rich. My ass would have been outta there decades ago.",
                "People should be more shocked if a 94 old person announces he’ll continue to work.",
                "He's 94 for the love of pete. I wouldn't be shocked if he passed away. 94 and sharp as heck",
                "Instead of shock, shareholders should count their blessings that Oracle of Omaha stayed on as chair as long as he has at age 94.  \n\nHope he maintain his mental acuity and mobility as he finally will have time to relax.",
                "I hope there's not some sorta underlying health issue he's retiring for, 94 is so young!",
                "Dude getting out before the shit hits the fan.",
                "End of an era. Happy retirement.",
                "94 year old \"shocks\" investors by announcing his retirement.",
                "If they were shocked, they must've not been paying attention. I work for a Berkshire company, we knew this was coming and it wasn't a secret.",
                "Retire, in this economy? I hope he saved up enough."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 8882,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "The discrimination towards younger patients is honestly sad",
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too.",
                "A woman I loved with all my heart died from breast cancer at 26, in the US, after extensive care. \n\nFUCK CANCER and FUCK ANY GOVERNMENT THAT DEPRIORITIZES DEFEATING IT.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "My sister-in-law was diagnosed with an aggressive form of breast cancer in her 30's after discovering a lump. She's fought bravely for 7 years but it came back even more aggressive. Women that young do get it and any concern that they may have taken seriously.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "There was a girl in my hometown who was diagnosed with breast cancer at age 10"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Police disband pro-Palestinian camp at Swarthmore College and arrest nine activists",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/swarthmore-students-suspended-pro-palestinian-camp",
            "upvotes": 521,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ae4221eee0ba99b7ee7d1c111f708ecdd824f799/0_324_4928_2956/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8433db484b76ed138b892ffd3db706f3",
            "top_comments": [
                "*The sweep of Swarthmore College’s encampment came after a total of nine Swarthmore College students – eight current and one former – were given notices of their interim suspension beginning on Thursday for erecting the encampment earlier in the week*\n\nThis comes later in the article which initially says or implies that the encampment was composed almost entirely of outsiders. The old divide and conquer tactic which make it look like Outsiders are the rousing up trouble on our campus and leading a few of our students down a dangerous path.",
                "> Swarthmore College is one of 60 schools under investigation for what the Trump administration considers antisemitic harassment on campus.\n\nSo, just another attack on the 1st amendment by the free speech absolutists.",
                "Freedom of speech - as long as it doesn't conflict with the official stance.",
                "Just typical American genocidal Nazism conducted by the state.",
                "The school’s administrators invited the cops in to crack down:\n\n> “With rising concerns about safety and security on campus, a continued and growing presence of individuals unaffiliated with the college, warnings from outside law enforcement agencies and no signs that protestors were willing to engage in conversation that would bring the encampment to an end,” [Predident Valerie] Smith said, “I felt we had no choice but to seek outside assistance from local law enforcement.”\n\n“Engage with conversation that would bring the encampment to and end” is a funny way of twisting words. I wonder how much was dialogue and how much was ultimatum. And I cannot imagine the students were interested in leaving until the admin divested from Israel. ",
                "Oh my god fuck all these rich kids and all their rich friends. Americans need affordable healthcare and a living wage. Genocide sucks, but they sure seemed fine with it happening in the Congo, Darfur and Myanmar without this protest crap before Oct 7. \n\nThey could use their rich kid clout and guilt to help the poor and oppressed in the US, stop their incessant murder by gun violence and drugs, but they don't. They wear kafiyahs, chant about martyrdom, and waste everyone's time.",
                "How quickly and easily the rank and file join the crusade of fascism",
                "Freedom of speech  - as long as it agrees with our official dyanve.",
                "The 1st Amendment is clear \"Thou shall not oppose or question any genocide Israel commits\"",
                "Let me guess... pro-Palestine but not anti-Hamas. That combination seems to be particularly rare in these protests."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Another round of auto tariffs just went into effect. They could change the industry forever | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/03/business/auto-parts-tariffs",
            "upvotes": 2124,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2148007829.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They could, or they could be lifted tomorrow. Or doubled.\n\nWho the fuck knows.",
                "We are speed running the end of America as a global superpower, and it’s honestly stunning to witness.",
                "*But even with that refund, the added cost of tariffs could still come to an average of about $4,000 per vehicle, according to estimates derived from a CNN analysis of government trade data*\n\nThe tariff on on car parts starts today.... the effect arrive in a few months. Plan ahead. I'm hanging on to what I've got.",
                "People will now hold on to their reliable vehicles as long as possible now that price of both new and old will head up North.",
                "I’m so goddamn tired of the world, industry, whatever, changing forever literally every damned day. We’re in uncharted waters. Every single day that passes literally changes this country forever.",
                "Funny that 2 months ago I was looking at buying a new car. Now, fuck that. I work in the auto industry and I’m not giving them a dime. I’ll drive my shitbox",
                "I had a feeling my stocks were doing too well",
                "Making America Poor Again.",
                "Yep making living in urban areas with public transit more attractive combined with business demanding people come back to the office at least in a hybrid model. Cuts making suburban and rural life much harder (hospitals, businesses, farms, etc.). Elections have consequences.",
                "I saw the writing on the wall and got a new car 2 months ago. My coworker went in Friday."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 2392,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "In classic Reddit fashion, nobody read the article. Dude is being institutionalized until he can stand trial, and they said at that point he would (if it never happens… he’s dead in a hospital). Both sides agreed. So basically he’s in “bonus sentence” territory at best at this point. You have to be an absolute ghoul to think a Bureau of Prisons hospitalization is somehow a five star resort.\n\nSome people also saying he’s “suspiciously” and “suddenly” got Alzheimer’s, TBI and dementia. Those following the trial know that’s not a thing, and Alzheimer’s isn’t the kind of thing you just kinda walk with a limp and get diagnosed with agreement from all parties. Four different doctors and the prosecution agreed. “But why just as he’s charged?” Because it’s his lawyers that noticed he wasn’t replying coherently and referred him.\n\nEdit: so many comments about “but he won’t face charges” as if he gives a fuck and is in any position to understand them. I’m sure a custodial clarification against an effective corpse will make the victims families feel awesome.",
                "100% predator. He got off easy. Fucker.",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "Couldn’t have happened to a more deserving predator",
                "A guy tried to hurt my teen, and was caught and arrested. He spent many months in jail so drugged up he didn’t move once during hearings. Finally was sent to a medical facility for psych meds, but they were never able to prove he was competent to face trial.  SO THEY RELEASED HIM. He’s been arrested at least three times since. He tried to kill women, unknown to him, at least twice before. He’s loose in Seattle now.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 2166,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "Upvote for the source calling the Gulf by it's proper name.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "Oh thank God it's not in the Gulf of America",
                "Oh, so when there’s a spill it’s Mexico’s gulf?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 4478,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "We should've rejected voting in Trump a second time...",
                "The cartel is embedded in a large swath of Mexican society. They employ a lot of people too. Waging war against them is like fighting a civil war. Mexico is kind of a failed state because of this. I just can’t believe America loves their hard drugs so much to keep this going for so long. How do you unwind this?",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Remember kids, vampires can’t enter your house without an invitation."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 2601,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "Why didn’t he want the case to go to trial?",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "What in the actual fuck",
                "Sometimes, we don’t need logic. Some people are psychopaths in the clinical sense, lacking empathy, remorse, and other qualities. Many functional psychopaths exist, but we don’t realise this because they’re very good at hiding their true nature. Some don’t resist their nature, leading to such stories."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 8880,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "The discrimination towards younger patients is honestly sad",
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too.",
                "A woman I loved with all my heart died from breast cancer at 26, in the US, after extensive care. \n\nFUCK CANCER and FUCK ANY GOVERNMENT THAT DEPRIORITIZES DEFEATING IT.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "My sister-in-law was diagnosed with an aggressive form of breast cancer in her 30's after discovering a lump. She's fought bravely for 7 years but it came back even more aggressive. Women that young do get it and any concern that they may have taken seriously.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "There was a girl in my hometown who was diagnosed with breast cancer at age 10"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Police disband pro-Palestinian camp at Swarthmore College and arrest nine activists",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/swarthmore-students-suspended-pro-palestinian-camp",
            "upvotes": 520,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ae4221eee0ba99b7ee7d1c111f708ecdd824f799/0_324_4928_2956/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8433db484b76ed138b892ffd3db706f3",
            "top_comments": [
                "*The sweep of Swarthmore College’s encampment came after a total of nine Swarthmore College students – eight current and one former – were given notices of their interim suspension beginning on Thursday for erecting the encampment earlier in the week*\n\nThis comes later in the article which initially says or implies that the encampment was composed almost entirely of outsiders. The old divide and conquer tactic which make it look like Outsiders are the rousing up trouble on our campus and leading a few of our students down a dangerous path.",
                "> Swarthmore College is one of 60 schools under investigation for what the Trump administration considers antisemitic harassment on campus.\n\nSo, just another attack on the 1st amendment by the free speech absolutists.",
                "Freedom of speech - as long as it doesn't conflict with the official stance.",
                "Just typical American genocidal Nazism conducted by the state.",
                "The school’s administrators invited the cops in to crack down:\n\n> “With rising concerns about safety and security on campus, a continued and growing presence of individuals unaffiliated with the college, warnings from outside law enforcement agencies and no signs that protestors were willing to engage in conversation that would bring the encampment to an end,” [Predident Valerie] Smith said, “I felt we had no choice but to seek outside assistance from local law enforcement.”\n\n“Engage with conversation that would bring the encampment to and end” is a funny way of twisting words. I wonder how much was dialogue and how much was ultimatum. And I cannot imagine the students were interested in leaving until the admin divested from Israel. ",
                "Oh my god fuck all these rich kids and all their rich friends. Americans need affordable healthcare and a living wage. Genocide sucks, but they sure seemed fine with it happening in the Congo, Darfur and Myanmar without this protest crap before Oct 7. \n\nThey could use their rich kid clout and guilt to help the poor and oppressed in the US, stop their incessant murder by gun violence and drugs, but they don't. They wear kafiyahs, chant about martyrdom, and waste everyone's time.",
                "How quickly and easily the rank and file join the crusade of fascism",
                "Freedom of speech  - as long as it agrees with our official dyanve.",
                "The 1st Amendment is clear \"Thou shall not oppose or question any genocide Israel commits\"",
                "Let me guess... pro-Palestine but not anti-Hamas. That combination seems to be particularly rare in these protests."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Warren Buffett shocks shareholders by announcing his intention to retire at the end of the year",
            "external_url": "https://apnews.com/article/warren-buffett-berkshire-hathaway-shareholders-annual-meeting-a421061233f99859673fb131ce020d4d",
            "upvotes": 689,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How shocking could it be, he’s 94 and rich. My ass would have been outta there decades ago.",
                "People should be more shocked if a 94 old person announces he’ll continue to work.",
                "He's 94 for the love of pete. I wouldn't be shocked if he passed away. 94 and sharp as heck",
                "Instead of shock, shareholders should count their blessings that Oracle of Omaha stayed on as chair as long as he has at age 94.  \n\nHope he maintain his mental acuity and mobility as he finally will have time to relax.",
                "I hope there's not some sorta underlying health issue he's retiring for, 94 is so young!",
                "Dude getting out before the shit hits the fan.",
                "End of an era. Happy retirement.",
                "94 year old \"shocks\" investors by announcing his retirement.",
                "If they were shocked, they must've not been paying attention. I work for a Berkshire company, we knew this was coming and it wasn't a secret.",
                "Retire, in this economy? I hope he saved up enough."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 4485,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "We should've rejected voting in Trump a second time...",
                "The cartel is embedded in a large swath of Mexican society. They employ a lot of people too. Waging war against them is like fighting a civil war. Mexico is kind of a failed state because of this. I just can’t believe America loves their hard drugs so much to keep this going for so long. How do you unwind this?",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Remember kids, vampires can’t enter your house without an invitation."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "Another round of auto tariffs just went into effect. They could change the industry forever | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/03/business/auto-parts-tariffs",
            "upvotes": 2132,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2148007829.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They could, or they could be lifted tomorrow. Or doubled.\n\nWho the fuck knows.",
                "We are speed running the end of America as a global superpower, and it’s honestly stunning to witness.",
                "*But even with that refund, the added cost of tariffs could still come to an average of about $4,000 per vehicle, according to estimates derived from a CNN analysis of government trade data*\n\nThe tariff on on car parts starts today.... the effect arrive in a few months. Plan ahead. I'm hanging on to what I've got.",
                "People will now hold on to their reliable vehicles as long as possible now that price of both new and old will head up North.",
                "I’m so goddamn tired of the world, industry, whatever, changing forever literally every damned day. We’re in uncharted waters. Every single day that passes literally changes this country forever.",
                "Funny that 2 months ago I was looking at buying a new car. Now, fuck that. I work in the auto industry and I’m not giving them a dime. I’ll drive my shitbox",
                "I had a feeling my stocks were doing too well",
                "Making America Poor Again.",
                "Yep making living in urban areas with public transit more attractive combined with business demanding people come back to the office at least in a hybrid model. Cuts making suburban and rural life much harder (hospitals, businesses, farms, etc.). Elections have consequences.",
                "I saw the writing on the wall and got a new car 2 months ago. My coworker went in Friday."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 2164,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "Upvote for the source calling the Gulf by it's proper name.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "Oh thank God it's not in the Gulf of America",
                "Oh, so when there’s a spill it’s Mexico’s gulf?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "United Airlines cancels flights at Newark Airport as FAA blames equipment, staffing shortages for delays",
            "external_url": "https://www.cbsnews.com/newyork/news/newark-airport-delays-friday-faa/",
            "upvotes": 1196,
            "date": "05/03/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/02/cf242c0b-56be-4462-9b97-5abb078d5ef9/thumbnail/1200x630/d27b43cfe183512bd0eb554436150dda/westbrook-530am-vo-newa-wcbsdrqq-hi-res-still-00-00-5901.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Gee, FAA, however did that happen?",
                "uh.... i have a united flight out of newark tomorrow....",
                "I’m sure Sean from The Real World is on the case.",
                "I'm sure DOGE will have no problem tracking down all the qualified people they fired. It's only what... Half the air traffic controllers in the country? Easy peasy.",
                "Those traffic controllers should be paid more. That's a job with incredible amounts of responsibility and pressure.",
                "What do you mean nothing works after we fired the people who do the work??",
                "So this is when Elon Musk jumps in, makes a ton of money, and exercises private control over another piece of the public interest",
                "Maybe we should put a different \"MTV's Real World\" alum in charge of all the air traffic in the US- Puck's probably free... 🤔",
                "Is it even safe to fly while Trump is President?",
                "I thought Trump removed all the DEI hires so everything was supposed to run like shit through a goose. Is that nit what is happening?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 2390,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "In classic Reddit fashion, nobody read the article. Dude is being institutionalized until he can stand trial, and they said at that point he would (if it never happens… he’s dead in a hospital). Both sides agreed. So basically he’s in “bonus sentence” territory at best at this point. You have to be an absolute ghoul to think a Bureau of Prisons hospitalization is somehow a five star resort.\n\nSome people also saying he’s “suspiciously” and “suddenly” got Alzheimer’s, TBI and dementia. Those following the trial know that’s not a thing, and Alzheimer’s isn’t the kind of thing you just kinda walk with a limp and get diagnosed with agreement from all parties. Four different doctors and the prosecution agreed. “But why just as he’s charged?” Because it’s his lawyers that noticed he wasn’t replying coherently and referred him.\n\nEdit: so many comments about “but he won’t face charges” as if he gives a fuck and is in any position to understand them. I’m sure a custodial clarification against an effective corpse will make the victims families feel awesome.",
                "100% predator. He got off easy. Fucker.",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "Couldn’t have happened to a more deserving predator",
                "A guy tried to hurt my teen, and was caught and arrested. He spent many months in jail so drugged up he didn’t move once during hearings. Finally was sent to a medical facility for psych meds, but they were never able to prove he was competent to face trial.  SO THEY RELEASED HIM. He’s been arrested at least three times since. He tried to kill women, unknown to him, at least twice before. He’s loose in Seattle now.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 4563,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "Do you think Warren is eligible for social security?",
                "I bet he grows his hair out and starts doing yoga. ",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Have fun at Margaritaville",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "Never bounced back after being passed over for the Dunder Mifflin job"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 2602,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "Why didn’t he want the case to go to trial?",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "What in the actual fuck",
                "Sometimes, we don’t need logic. Some people are psychopaths in the clinical sense, lacking empathy, remorse, and other qualities. Many functional psychopaths exist, but we don’t realise this because they’re very good at hiding their true nature. Some don’t resist their nature, leading to such stories."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "05/04/2025 04:12:59 UTC"
}