{
    "posts": [
        {
            "category": "HOT",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 6820,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-17t053951z-404741052-rc2ajea3jlfl-rtrmadp-3-usa-weather-st-louis.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "I stayed in Tipton on Reelfoot lake last night. Directly east of St Louis. It was wild. Massive trees falling, debris smacking the house that sounded like hail. No sirens went off but I doubt there are at a national park. I’m not surprised so many were injured. I was just waiting for one the huge trees to fall and crush us",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "I live in St. Louis and got hit by tornado back in March. Now this one. I can’t f-ing wait to leave this place next year",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Chinese ‘kill switches’ found hidden in US solar farms",
            "external_url": "https://www.thetimes.com/us/news-today/article/china-solar-panels-kill-switch-vptfnbx7v",
            "upvotes": 2291,
            "date": "05/17/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2F7b525f28-1624-4374-950a-63068c7204d3.jpg?crop=5175%2C2911%2C0%2C270&resize=1200",
            "top_comments": [
                "Oh boy, this means that our government will starting our own infrastructure projects right? \n\n\n... right?",
                "They probably installed control devices in every technology we bought from them.",
                "It’s not like the solar panels are connected to the internet, right\n\nEdited for obligatory /s",
                "Cause China built the panels for cheaper, capitalism bought them. You get what you paid for.",
                "Let's move manufacturing to China - Republicans in 1970s.\n\nChina bad! - Republicans 2016-current.",
                "This just highlights how short sighted the current administration’s energy policies are. We need to incentivize American companies to manufacture components needed for renewable energy, otherwise, we will be dependent on someone else.",
                "Sounds like they accepted all cookies before being allowed to browse the solar panels",
                "China is flooding the world with cheap Mini-PCs and people are loving them for their homelabs…",
                "I used to work for a company that did engineering for power plants of all kinds. Every single piece of equipment we used was heavily scrutinized and our computers were insanely locked down, no Chinese equipment, for exactly this reason. I have to wonder what the point is if the infrastructure itself is going to be bought from China anyway",
                "This is so idiotic when you think about it.\n\nA Chinese kill switch for US solar = China hits the kill switch, the solar panels stop absorbing the suns energy, and the owner of the property no longer gets a minimised bill from the solar panels and sun, and instead gets a bill to pay towards their *checks notes* energy company? That's American? \n\nSo American electricity companies benefit? From the Chinese kill switch?\n\nColor me shocked."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Gaza ceasefire talks resume as Israeli assault kills hundreds in 72 hours",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-strikes-kill-least-58-palestinians-overnight-2025-05-17/",
            "upvotes": 797,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "With Israel being blindly supported by the party of \"Pro Life\" and any pushback or criticism being labeled as \"antisemitism\"... the new McCarthyism.",
                "We’ll see a ceasefire when there are no longer any Palestinians left to shoot at.",
                "There is no ceasefire coming. Netanyahu’s plan was to fund Hamas and then provoke it with killing civillians over many years, so it eventually would strike back and he can conquer Palestinian lands. See for yourselves:\n\nNetanyahu in a 2019 press conference: “Anyone who wants to thwart the establishment of a Palestinian state has to support bolstering Hamas and transferring money to Hamas ... This is part of our strategy – to isolate the Palestinians in Gaza from the Palestinians in the West Bank”\n\nFormer Prime Minister Ehud Olmert: “In the last 15 years, Israel did everything to downgrade the Palestinian Authority and to boost Hamas,” he previously told POLITICO. “Gaza was on the brink of collapse because they had no resources, they had no money, and the PA refused to give Hamas any money. Bibi saved them. Bibi made a deal with Qatar and they started to move millions and millions of dollars to Gaza.”\n\nGershon Hacohen, former commander of the 7th Armored Brigade and an associate of Benjamin Netanyahu, said in 2019 in an interview: “Netanyahu’s strategy is to prevent the option of two states, so he is turning Hamas into his closest partner. Openly Hamas is an enemy. Covertly, it’s an ally.",
                "Israel won’t stop until every Palestinian is dead. It’s so fucked up. Monsters every single one of them.",
                "Israel: \"Why won't Palestinians let us end this needless violence already?!\"",
                "These are war crimes, assassinations in plain daylight for everyone to see.\n\nIt is intentional.\n\nIt's a flex, an unbounded exercise of power and violence.\n\nIt's the destruction of Palestine and the millions who belong to that land. By starvation, disease, amputation of limbs and of humanity.\n\nIt will be remembered, it will be engraved in kids schoolbooks.\n\nEveryone will know what happened for 100 years.\n\nEveryone will remember the silence and complicity of those who had the power to stop it.",
                "Why didn't they just create Israel in Germany instead after WW2.",
                "Is Israel is tryinf to pare down the transportation costs on their planned forced relocation to Libya?",
                "For how long this genocide has been going on, and how small of an area Gaza is. How are there still any Palestinians left at this point?",
                "Don told Hamas that if they gave up their one American hostage he'd end the offensive.  Guess they didn't know anything about him, and his penchant for ignoring deals he makes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 36948,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                "Jesus….Alito and Thomas are human garbage",
                "> “Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS,” Trump wrote. “This is a bad and dangerous day for America!”\n\nTrump continues to rage against the existence of the Constitution itself.\n\nThe Constitution does not bind the conduct of individuals. It's a non-exhaustive enumeration of individual rights, which proscribe *the government* from certain actions. Even if you, Dear Leader, really, really want to.\n\nObviously. Dumbass.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "*“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a* [*post*](https://truthsocial.com/@realDonaldTrump/114519567610751944) *on Truth Social.*\n\nTrump trying to Intimidate the court.\n\n*Trump on Friday morning* [*vented frustration*](https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html) *toward the high court,* [*writing*](https://truthsocial.com/@realDonaldTrump/114517773720445162) *that it “IS BEING PLAYED BY THE RADICAL LEFT LOSERS” whose “ONLY HOPE IS THE INTIMIDATION OF THE COURT.”*\n\nTrump claiming the other side is trying to intimidate the court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 15388,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "Donald Trump is doing to America what he did to his casinos.",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either.",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 3551,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "Maga Christian nationalists ask themselves, what would Jesus do, then do the opposite.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "So. Much. Waste. What a disaster DOGE and donald are",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 6473,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She’s the same one that had the sling after the handshake…",
                "IF she can go after this person, why aren't they going after Noem for threatening standing congress members & judges?",
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "Amazing how fast they move when it's them being threatened.",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "[removed]",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "my fellow trans folks: don’t threaten to assassinate people.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 483,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "Where’s ace ventura when you need him?",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…",
                "Has anyone asked RFK jr about it? He does this kind of stuff!",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "***RFK has entered the chat***",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Boeing crash victims’ families say Justice Department set to drop criminal case, decry decision as ‘morally repugnant’",
            "external_url": "https://www.cnn.com/2025/05/16/business/boeing-justice-drop-criminal-case-morally-repugnant",
            "upvotes": 4247,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1247998567-20250516162540038.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> will instead reach a non-criminal settlement with the company. The new settlement will include an additional $444.5 million into a crash victims’ fund that would be divided evenly per crash victim.\n\nYes a slap on the wrist. Take half of their profits after paying the employees. Fine each of the executive team half of their wages. Cancel half of their thank you contracts. Make it hurt so much that they will never do it again.",
                "*\"This is morally repugnant. It is a slap on the wrist. And it feels like a bribe,\" said Sanjiv Singh, an attorney who represents 16 victims in the 2018 crash of a Lion Air Boeing 737 Max.*\n\nIn 2018 and 2019 there were 346 people killed in two Boeing crashes.",
                "Who wants to bet someone at DOJ bought a bunch of Boeing stock recently?",
                "I think people need to start asking themselves, party aside, why we support a system that is so focused on corporate interests over citizen interests.",
                "What a coincidence this happened after Qatar bought all those plans from Boeing too. I’m sure those two things are not related. /s",
                "Repugnant and very Trumpy.",
                "It’s the DOJ. Expecting anything than corruption at this point is intentionally naive",
                "This is so on brand for republicans",
                "it's almost like we shouldn't elect criminals that have no regard to how our government functions",
                "Well yeah. It’s the bribe administration. Justice isn’t a concern. Only what you can pay the admin."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 20788,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "[Kristi Noem has had 20 speeding tickets, three stop-sign violations, two seat-belt violations and a citation for driving with no driver’s license. She has also been issued six court notices for failure to appear and two arrest warrants.](https://thehill.com/blogs/blog-briefing-room/news/169901-s-d-gop-candidate-cited-for-numerous-traffic-violations/)",
                "Didn't Trump and MAGA say he was going after gang members and criminals, yet all we see are stories about students or children getting arrested? Makes ya think that maybe they were lying all along.",
                "Revoked over…a 3-year old traffic stop. Wow."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Chinese ‘kill switches’ found hidden in US solar farms",
            "external_url": "https://www.thetimes.com/us/news-today/article/china-solar-panels-kill-switch-vptfnbx7v",
            "upvotes": 2337,
            "date": "05/17/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2F7b525f28-1624-4374-950a-63068c7204d3.jpg?crop=5175%2C2911%2C0%2C270&resize=1200",
            "top_comments": [
                "Oh boy, this means that our government will starting our own infrastructure projects right? \n\n\n... right?",
                "They probably installed control devices in every technology we bought from them.",
                "It’s not like the solar panels are connected to the internet, right\n\nEdited for obligatory /s",
                "Cause China built the panels for cheaper, capitalism bought them. You get what you paid for.",
                "Let's move manufacturing to China - Republicans in 1970s.\n\nChina bad! - Republicans 2016-current.",
                "This just highlights how short sighted the current administration’s energy policies are. We need to incentivize American companies to manufacture components needed for renewable energy, otherwise, we will be dependent on someone else.",
                "Sounds like they accepted all cookies before being allowed to browse the solar panels",
                "China is flooding the world with cheap Mini-PCs and people are loving them for their homelabs…",
                "I used to work for a company that did engineering for power plants of all kinds. Every single piece of equipment we used was heavily scrutinized and our computers were insanely locked down, no Chinese equipment, for exactly this reason. I have to wonder what the point is if the infrastructure itself is going to be bought from China anyway",
                "This is so idiotic when you think about it.\n\nA Chinese kill switch for US solar = China hits the kill switch, the solar panels stop absorbing the suns energy, and the owner of the property no longer gets a minimised bill from the solar panels and sun, and instead gets a bill to pay towards their *checks notes* energy company? That's American? \n\nSo American electricity companies benefit? From the Chinese kill switch?\n\nColor me shocked."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Severe weather, including possible tornado, leaves at least 14 dead in Kentucky; 7 dead in Missouri",
            "external_url": "https://apnews.com/article/tornado-weather-thunderstorms-great-lakes-22395202a65b0c37cc06c541ea772172",
            "upvotes": 66,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump will blame Biden.",
                "hey red states - do you remember when Biden and Obama would call your governor after a disaster and let them know WHATEVER THEY NEEDED WOULD BE GIVEN ASAP\n\nalmost like peoples lives mattered more than politics\n\ni cant imagine if a Dem made a red state governor grovel\n\nmaga cult is pure trash\n\nfuck the gop\n\nfuck the billionaires\n\nfuck trump",
                "No worries, FEMA will be along in a...\n\nWait...what?",
                "Who would have thought that reducing the nws work staff would have no detrimental effects. Warnings have been coming out later than they should, and  not as severe as they should be also. There were a few storms last night that should have had either PDS tags or even tornado emergency, mainly the one that went thru London, KY which had a massive debris signature on radar.",
                "If only worsening storms and climate had been predicted 25 years ago…",
                "You might look at that picture and want to say hey, look how woke God is getting on Missouri.  \n\nBut no, it's a black neighborhood.   God won't help us until we help ourselves.",
                "Cutting overnight NWS staff and gutting FEMA sure were great ideas.",
                "I hope they have the day they voted for. 🤗",
                "damn… my area in michigan has had two tornadoes and four super severe storms in the last three years and miraculously zero deaths. it’s terrible to see so many deaths, i wonder if it was just shitty luck, poor decision-making,  or an infrastructure thing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Gaza ceasefire talks resume as Israeli assault kills hundreds in 72 hours",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-strikes-kill-least-58-palestinians-overnight-2025-05-17/",
            "upvotes": 800,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "With Israel being blindly supported by the party of \"Pro Life\" and any pushback or criticism being labeled as \"antisemitism\"... the new McCarthyism.",
                "We’ll see a ceasefire when there are no longer any Palestinians left to shoot at.",
                "There is no ceasefire coming. Netanyahu’s plan was to fund Hamas and then provoke it with killing civillians over many years, so it eventually would strike back and he can conquer Palestinian lands. See for yourselves:\n\nNetanyahu in a 2019 press conference: “Anyone who wants to thwart the establishment of a Palestinian state has to support bolstering Hamas and transferring money to Hamas ... This is part of our strategy – to isolate the Palestinians in Gaza from the Palestinians in the West Bank”\n\nFormer Prime Minister Ehud Olmert: “In the last 15 years, Israel did everything to downgrade the Palestinian Authority and to boost Hamas,” he previously told POLITICO. “Gaza was on the brink of collapse because they had no resources, they had no money, and the PA refused to give Hamas any money. Bibi saved them. Bibi made a deal with Qatar and they started to move millions and millions of dollars to Gaza.”\n\nGershon Hacohen, former commander of the 7th Armored Brigade and an associate of Benjamin Netanyahu, said in 2019 in an interview: “Netanyahu’s strategy is to prevent the option of two states, so he is turning Hamas into his closest partner. Openly Hamas is an enemy. Covertly, it’s an ally.",
                "Israel won’t stop until every Palestinian is dead. It’s so fucked up. Monsters every single one of them.",
                "Israel: \"Why won't Palestinians let us end this needless violence already?!\"",
                "These are war crimes, assassinations in plain daylight for everyone to see.\n\nIt is intentional.\n\nIt's a flex, an unbounded exercise of power and violence.\n\nIt's the destruction of Palestine and the millions who belong to that land. By starvation, disease, amputation of limbs and of humanity.\n\nIt will be remembered, it will be engraved in kids schoolbooks.\n\nEveryone will know what happened for 100 years.\n\nEveryone will remember the silence and complicity of those who had the power to stop it.",
                "Why didn't they just create Israel in Germany instead after WW2.",
                "Is Israel is tryinf to pare down the transportation costs on their planned forced relocation to Libya?",
                "For how long this genocide has been going on, and how small of an area Gaza is. How are there still any Palestinians left at this point?",
                "Don told Hamas that if they gave up their one American hostage he'd end the offensive.  Guess they didn't know anything about him, and his penchant for ignoring deals he makes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 6832,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-17t053951z-404741052-rc2ajea3jlfl-rtrmadp-3-usa-weather-st-louis.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "I stayed in Tipton on Reelfoot lake last night. Directly east of St Louis. It was wild. Massive trees falling, debris smacking the house that sounded like hail. No sirens went off but I doubt there are at a national park. I’m not surprised so many were injured. I was just waiting for one the huge trees to fall and crush us",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "I live in St. Louis and got hit by tornado back in March. Now this one. I can’t f-ing wait to leave this place next year",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 489,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "Where’s ace ventura when you need him?",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…",
                "Has anyone asked RFK jr about it? He does this kind of stuff!",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "***RFK has entered the chat***",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Gunman pleads guilty to murder of bank teller Monica Leech during 1997 robbery in Thousand Oaks",
            "external_url": "https://abc7.com/post/kevin-ray-james-pleads-guilty-murder-bank-teller-monica-leech-during-1997-robbery-thousand-oaks/16441601/",
            "upvotes": 262,
            "date": "05/17/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16441475_051625-kabc-4pm-monica-leech-vid.jpg?w=1600",
            "top_comments": [
                "Monica was a relative of mine. The effect this murder had on the family can't be understated. It doesnt bring her back, but Im glad there's justice",
                "I remember this but never realized no one was charged.  Crazy",
                "While it’s awful that this monster got to walk free for so long, I’m glad justice caught up to him.",
                "I was wondering why it took so long. Turns out the evidence was very recently obtained.\n\n>The case remained cold for more than 20 years until new forensic evidence and investigative leads identified James as one of the suspects. On March 13, 2023, he was charged with Leech's murder."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mother gets six years for Elkton townhouse fire that killed daughter, 10",
            "external_url": "https://www.cecildaily.com/news/mother-gets-six-years-for-elkton-townhouse-fire-that-killed-daughter-10/article_647550f6-966a-4fec-9f56-fab39f2a6afe.html",
            "upvotes": 599,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/cecildaily.com/content/tncms/assets/v3/editorial/d/db/ddbf8970-e4b3-42ad-a37e-95f201dcd39f/6824a54dc02fb.image.jpg?crop=770%2C404%2C0%2C279",
            "top_comments": [
                "She created a hoarding situation, including pet hoarding, and overloaded electrical outlets. She created a dangerous situation and placed her daughter into it and now her girl is dead. It’s beyond negligence. I know it’s an accident and my heart goes out to the mom, but she is not blameless. It’s akin to driving drunk and getting your kid killed; you didn’t mean to do it, but you recklessly disregarded safety and now somebody is dead. Just tragic.",
                "Once again, though nobody’s also talking about the fact that this child and her two siblings should’ve been taken by social services, the school repeatedly reported that she was dirty and smelled like animal feces, and was being extremely neglected. One visit to the house would’ve shown that it’s not livable conditions for children. Social service has failed these kids as well.",
                "It’s so sad to read that she had no friends at school, also due to the hoarding situation and hygiene. Her mother neglected her so badly, she kept this kid from having a happy, normal life.  And then she dies horribly too? I am heartbroken for this little girl. \nThe mother absolutely  deserves to be in prison. Don’t even get me started on the animal neglect.\n💜 Kyleigh 💐 🕊️",
                "I live a few miles from where this happened. The neighbors townhouse was also heavily damaged from the fire. There was a go fund me for her.",
                "Call me a POS for taking away from the girl's death or whatever but I find it disturbing that none of these articles comment on the outcome of all of the pets in the home.\n\nThey had **35** cats and dogs.  5 days prior to the fire, animal control took 18 of them.  How many of them were in crates or locked away while the adults of the house made their way to safety?",
                "Ahh Elkton. I have fond childhood memories of the Blue Beacon Truck Wash.",
                "*\"This is the exact definition of a difficult case. You have the tragic loss of a young person and there is zero intention for this to happen. It’s the nature of the charge.” (Judge Davis to the mother)*\n\nA terrible situation--35 pets in the house plus hoarding. But 6 years for involuntary manslaughter from a Judge that understands the mother's plight seems high.",
                "There is absolutely no mention of a father being held responsible for this as well. Was this child immaculately conceived?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 4 dead after tornado and severe storm batters St. Louis, mayor says",
            "external_url": "https://www.thestar.com/news/world/united-states/at-least-4-dead-after-tornado-and-severe-storm-batters-st-louis-mayor-says/article_94311dad-37e9-502b-bbdc-0633b37f4a3c.html",
            "upvotes": 589,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/c/28/c288a2cc-ed8e-5297-bcc0-abc33d3e87d2/682753d03ea3b.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Things are pretty bad. The tornado hit smack in the middle of the city and the wrecked havoc up through the north side which is an area already struggling.",
                "Title changed: At least 7 people dead and widespread damage left in the wake of severe Midwest storms \n\nJust in case the mod checks the title.",
                "*The storms were part of a severe weather system that spawned tornadoes in Wisconsin, downed trees, left thousands without power in the Great Lakes region and brought a punishing heat wave to Texas.*\n\nA weather system that includes every imaginable form of nasty weather.",
                "I'm down in Cape Girardeau/Sikeston and I saw a bunch of mobile homes near I-55 that got torn up driving home from work today. Also got some pretty nasty hail but luckily we weren't hit directly. From the sounds of it STL got the worst. Just awful.",
                "It’s going to be interesting if they need any help from FEMA. I wish them the best, we never (almost) see damaging tornadoes in my neck of the woods.",
                "Did anyone NOT get alerts on their phones this time? I did not. In Baltimore",
                "It looked like a warzone when I was driving home.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "JSO activists spared jail after Heathrow glue plot",
            "external_url": "https://www.bbc.co.uk/news/articles/cgmjyk2z2y8o",
            "upvotes": 58,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/635a/live/340635b0-3275-11f0-bde1-b36cab78830c.png",
            "top_comments": [
                "what kind of idiots will think that shutting off runways and stranding lots of travelers will help their cause?",
                "airports and museums are the wrong places for ppl to do this shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 3554,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "Maga Christian nationalists ask themselves, what would Jesus do, then do the opposite.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "So. Much. Waste. What a disaster DOGE and donald are",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Chinese ‘kill switches’ found hidden in US solar farms",
            "external_url": "https://www.thetimes.com/us/news-today/article/china-solar-panels-kill-switch-vptfnbx7v",
            "upvotes": 2343,
            "date": "05/17/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2F7b525f28-1624-4374-950a-63068c7204d3.jpg?crop=5175%2C2911%2C0%2C270&resize=1200",
            "top_comments": [
                "Oh boy, this means that our government will starting our own infrastructure projects right? \n\n\n... right?",
                "They probably installed control devices in every technology we bought from them.",
                "It’s not like the solar panels are connected to the internet, right\n\nEdited for obligatory /s",
                "Cause China built the panels for cheaper, capitalism bought them. You get what you paid for.",
                "Let's move manufacturing to China - Republicans in 1970s.\n\nChina bad! - Republicans 2016-current.",
                "This just highlights how short sighted the current administration’s energy policies are. We need to incentivize American companies to manufacture components needed for renewable energy, otherwise, we will be dependent on someone else.",
                "Sounds like they accepted all cookies before being allowed to browse the solar panels",
                "China is flooding the world with cheap Mini-PCs and people are loving them for their homelabs…",
                "I used to work for a company that did engineering for power plants of all kinds. Every single piece of equipment we used was heavily scrutinized and our computers were insanely locked down, no Chinese equipment, for exactly this reason. I have to wonder what the point is if the infrastructure itself is going to be bought from China anyway",
                "This is so idiotic when you think about it.\n\nA Chinese kill switch for US solar = China hits the kill switch, the solar panels stop absorbing the suns energy, and the owner of the property no longer gets a minimised bill from the solar panels and sun, and instead gets a bill to pay towards their *checks notes* energy company? That's American? \n\nSo American electricity companies benefit? From the Chinese kill switch?\n\nColor me shocked."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Gaza ceasefire talks resume as Israeli assault kills hundreds in 72 hours",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-strikes-kill-least-58-palestinians-overnight-2025-05-17/",
            "upvotes": 800,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "With Israel being blindly supported by the party of \"Pro Life\" and any pushback or criticism being labeled as \"antisemitism\"... the new McCarthyism.",
                "We’ll see a ceasefire when there are no longer any Palestinians left to shoot at.",
                "There is no ceasefire coming. Netanyahu’s plan was to fund Hamas and then provoke it with killing civillians over many years, so it eventually would strike back and he can conquer Palestinian lands. See for yourselves:\n\nNetanyahu in a 2019 press conference: “Anyone who wants to thwart the establishment of a Palestinian state has to support bolstering Hamas and transferring money to Hamas ... This is part of our strategy – to isolate the Palestinians in Gaza from the Palestinians in the West Bank”\n\nFormer Prime Minister Ehud Olmert: “In the last 15 years, Israel did everything to downgrade the Palestinian Authority and to boost Hamas,” he previously told POLITICO. “Gaza was on the brink of collapse because they had no resources, they had no money, and the PA refused to give Hamas any money. Bibi saved them. Bibi made a deal with Qatar and they started to move millions and millions of dollars to Gaza.”\n\nGershon Hacohen, former commander of the 7th Armored Brigade and an associate of Benjamin Netanyahu, said in 2019 in an interview: “Netanyahu’s strategy is to prevent the option of two states, so he is turning Hamas into his closest partner. Openly Hamas is an enemy. Covertly, it’s an ally.",
                "Israel won’t stop until every Palestinian is dead. It’s so fucked up. Monsters every single one of them.",
                "Israel: \"Why won't Palestinians let us end this needless violence already?!\"",
                "These are war crimes, assassinations in plain daylight for everyone to see.\n\nIt is intentional.\n\nIt's a flex, an unbounded exercise of power and violence.\n\nIt's the destruction of Palestine and the millions who belong to that land. By starvation, disease, amputation of limbs and of humanity.\n\nIt will be remembered, it will be engraved in kids schoolbooks.\n\nEveryone will know what happened for 100 years.\n\nEveryone will remember the silence and complicity of those who had the power to stop it.",
                "Why didn't they just create Israel in Germany instead after WW2.",
                "Is Israel is tryinf to pare down the transportation costs on their planned forced relocation to Libya?",
                "For how long this genocide has been going on, and how small of an area Gaza is. How are there still any Palestinians left at this point?",
                "Don told Hamas that if they gave up their one American hostage he'd end the offensive.  Guess they didn't know anything about him, and his penchant for ignoring deals he makes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 6827,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-17t053951z-404741052-rc2ajea3jlfl-rtrmadp-3-usa-weather-st-louis.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.",
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "I stayed in Tipton on Reelfoot lake last night. Directly east of St Louis. It was wild. Massive trees falling, debris smacking the house that sounded like hail. No sirens went off but I doubt there are at a national park. I’m not surprised so many were injured. I was just waiting for one the huge trees to fall and crush us",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "I live in St. Louis and got hit by tornado back in March. Now this one. I can’t f-ing wait to leave this place next year",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 483,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "Where’s ace ventura when you need him?",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…",
                "Has anyone asked RFK jr about it? He does this kind of stuff!",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "***RFK has entered the chat***",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 36959,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                "Jesus….Alito and Thomas are human garbage",
                "> “Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS,” Trump wrote. “This is a bad and dangerous day for America!”\n\nTrump continues to rage against the existence of the Constitution itself.\n\nThe Constitution does not bind the conduct of individuals. It's a non-exhaustive enumeration of individual rights, which proscribe *the government* from certain actions. Even if you, Dear Leader, really, really want to.\n\nObviously. Dumbass.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "*“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a* [*post*](https://truthsocial.com/@realDonaldTrump/114519567610751944) *on Truth Social.*\n\nTrump trying to Intimidate the court.\n\n*Trump on Friday morning* [*vented frustration*](https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html) *toward the high court,* [*writing*](https://truthsocial.com/@realDonaldTrump/114517773720445162) *that it “IS BEING PLAYED BY THE RADICAL LEFT LOSERS” whose “ONLY HOPE IS THE INTIMIDATION OF THE COURT.”*\n\nTrump claiming the other side is trying to intimidate the court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 15391,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "Donald Trump is doing to America what he did to his casinos.",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either.",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 3551,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "Maga Christian nationalists ask themselves, what would Jesus do, then do the opposite.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "So. Much. Waste. What a disaster DOGE and donald are",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 6481,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She’s the same one that had the sling after the handshake…",
                "IF she can go after this person, why aren't they going after Noem for threatening standing congress members & judges?",
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "Amazing how fast they move when it's them being threatened.",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "[removed]",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "my fellow trans folks: don’t threaten to assassinate people.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Boeing crash victims’ families say Justice Department set to drop criminal case, decry decision as ‘morally repugnant’",
            "external_url": "https://www.cnn.com/2025/05/16/business/boeing-justice-drop-criminal-case-morally-repugnant",
            "upvotes": 4244,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1247998567-20250516162540038.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> will instead reach a non-criminal settlement with the company. The new settlement will include an additional $444.5 million into a crash victims’ fund that would be divided evenly per crash victim.\n\nYes a slap on the wrist. Take half of their profits after paying the employees. Fine each of the executive team half of their wages. Cancel half of their thank you contracts. Make it hurt so much that they will never do it again.",
                "*\"This is morally repugnant. It is a slap on the wrist. And it feels like a bribe,\" said Sanjiv Singh, an attorney who represents 16 victims in the 2018 crash of a Lion Air Boeing 737 Max.*\n\nIn 2018 and 2019 there were 346 people killed in two Boeing crashes.",
                "Who wants to bet someone at DOJ bought a bunch of Boeing stock recently?",
                "I think people need to start asking themselves, party aside, why we support a system that is so focused on corporate interests over citizen interests.",
                "What a coincidence this happened after Qatar bought all those plans from Boeing too. I’m sure those two things are not related. /s",
                "Repugnant and very Trumpy.",
                "It’s the DOJ. Expecting anything than corruption at this point is intentionally naive",
                "This is so on brand for republicans",
                "it's almost like we shouldn't elect criminals that have no regard to how our government functions",
                "Well yeah. It’s the bribe administration. Justice isn’t a concern. Only what you can pay the admin."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 20791,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "[Kristi Noem has had 20 speeding tickets, three stop-sign violations, two seat-belt violations and a citation for driving with no driver’s license. She has also been issued six court notices for failure to appear and two arrest warrants.](https://thehill.com/blogs/blog-briefing-room/news/169901-s-d-gop-candidate-cited-for-numerous-traffic-violations/)",
                "Didn't Trump and MAGA say he was going after gang members and criminals, yet all we see are stories about students or children getting arrested? Makes ya think that maybe they were lying all along.",
                "Revoked over…a 3-year old traffic stop. Wow."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/17/2025 16:09:41 UTC"
}