{
    "posts": [
        {
            "category": "HOT",
            "title": "Japan bus driver with 3 decades of service loses $84,000 pension after he was caught stealing $7",
            "external_url": "https://www.cbsnews.com/news/japan-bus-driver-loses-pension-for-stealing-7-dollars/",
            "upvotes": 3663,
            "date": "04/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/18/b958a561-2831-4cb5-8035-ce58469db518/thumbnail/1200x630/413cc3e4c195185d2b8eaec5d3fafe61/gettyimages-2147869596.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "> The driver had been reprimanded several times during his career over various incidents, according to the ruling.\n\nI think the $7 worth of fare stolen was what they could prove in court with evidence. There may have been far more discrepancies in terms of number of passengers versus fare collected but for some reason won’t disclose it, because otherwise this does seem extraordinarily excessive for someone that had been driving with them for that long, even for Japan.",
                "Imagine if they did this to cops",
                "Is it 84K in total or annually?\n\nSeems very low for 30 years of work.",
                "That's how much he was caught stealing, how much was stolen before it was identified?",
                "This was the first time he was CAUGHT, not necessarily the first time he stole.",
                "Maybe $14 stolen before,  crime unsolved",
                "its only 7$, but its still stealing and who knows how many times he hasnt gotten caught.",
                "Hey atleast he lose his pension with his own power,\nSome people are losing that amount in their retirement by another man’s actions",
                "Japan is much different than the U.S and many other western nations. They don't put up with thieves and have little to 0-tolerance for crimes that fall under the \"ethically bad or immoral\" category.\n\nThis is the same country where you can have your suit coat fall off and pass our drunk in the streets. And instead of waking up to all your shit stolen, somebody will place your coat over you to keep you warm. Being a general good human is cultural for the Japanese.",
                "Cut bro some slack. Times are tough. Jesus."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Austin Metcalf's father escorted out of Karmelo Anthony's family news conference after unexpected appearance",
            "external_url": "https://www.cbsnews.com/texas/news/austin-metcalfs-father-escorted-out-karmelo-anthonys-family-news-conference/",
            "upvotes": 1696,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/17/6d8cd1eb-c9b9-41e5-ad50-215fcff451d3/thumbnail/1200x630/78e26ed903475263be7846dd82823cf6/toc-04172025-karmelo-anthony-family-presser-11-24-0519-1.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Not gonna lie, this is a bad article.\n\nYou can't just drop an initialism ike \"NGAN\" without writing it out once, that's just common knowledge.",
                "For a second I thought this was in reference to retired NBA player Carmelo Anthony and got extremely confused",
                "When I saw the news conference, I thought it was the family of the victim speaking. Then I went online to find out what happened to him and uh, they're the family of the killer? The family of the victim is being treated like the family of the killer and the killer's family treated like the victim...it's bizarre.",
                "The discourse surrounding this murder is just insane. I'm not sure where these opposing narratives are coming from, but the kid took a knife to a track meet and stabbed someone in the heart....I don't think much else matters.",
                "Why are they even having a press conference?  Their kid murdered someone, I'd be hiding in shame",
                "They make it sound like the killer was the victim. Jfc.",
                "How is a grieving father showing up at the press conference of the parents of his son's accused killer both \"disrespectful\" and \"inappropriate\"?  How is it trespassing?  I'm appalled that the man was asked to leave.",
                "That minister is a tool.",
                "> Minister Dominique Alexander \n\nUh, I don't think they want to associate with that guy...  \nhttps://nypost.com/2025/04/18/us-news/activist-minister-aiding-accused-teen-killer-karmelo-anthony-has-his-own-lengthy-rap-sheet-report/",
                "So he got asked to leave but didn't stab anyone? Crazy. "
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 40312,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "It's a relief there's proof of life",
                "What happened with the reporting yesterday that Van Hollen was denied access? Was he first denied then allowed?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "San Diego City Council bans landlords from 'price fixing' with algorithms",
            "external_url": "https://www.kpbs.org/news/living/2025/04/15/san-diego-city-council-bans-landlords-from-price-fixing-with-algorithms",
            "upvotes": 853,
            "date": "04/18/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/e89525e/2147483647/strip/true/crop/5678x2981+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fba%2Fdc%2F9117f2ff4ca08e6f8efb325a3fd0%2Fimg-4479.jpg",
            "top_comments": [
                "I wonder how you enforce the ban. We tell employees they're not allowed to use AI with work-related files but we also know they still upload our proprietary data.",
                ">Once the ordinance goes into effect, tenants will have the right to sue their landlords for violations.\n\nThis sounds like a good plan on paper but how do the tenants know a banned algorithm is being used?",
                "Rents up 36% in 6 years in SD County.    Just think about that for a sec",
                "They'll just do it the way they used to before AI - on the golf course, at the country club, at the strip club, etc.",
                "So proving this is going to be a nightmare.  Any person using AI or any algorithm for this is just doing what they could, and likely were doing, before.  These algorithms merely pull from publicly available data so that means that a person can find that data if they know where to look, and these guys are not exactly hiding prices. That means you have to assume they are finding it via an algorithm instead of manually and good luck proving that and even if you can prove it, its still the same result just with a few more hours of labor.",
                "\"The ordinance does not apply to algorithms that rely on public information, such as advertisements or listings on websites like Zillow or apartments.com.\"\n\nThere we go. Just scrap zillow and run a similar algorithm. Not that you can enforce anything. You can always ask an employee to decide the rental price, but let him look at the output the old algorithm and make sure he add some randomness to it.",
                "How about they relax zoning and allow people to build density, addressing the supply issue?   We've allowed NIMBYs to block density and supply so they can monetize scarcity.   It's not just the \"algorithms.\"  It's the supply.  \n\nEven for those who will say \"It's not necessarily supply--I see *tons* of housing going up and...\" the problem is supply there too.  They never mention where they're talking about, or the vacancy rate for this unnamed place where they've decided there is \"plenty\" of housing.",
                "Considering California has a rent cap I imagine it’ll go the same way it has been ie. if new year = raise by maximum allowed. Don’t really need an algorithm for it",
                "Is searching for similar units on Zillow an \"algorithm\"?  As a landlord, every time blue government tries to help renters they end up driving us out of the market. Then supply goes down and rent goes up.",
                "Landlords used to do this same thing pre-AI by calling around to all local competitors weekly and getting their prices (with the caveat that the other communities probably wouldn’t answer the phone, would say they didn’t share that information, or would give incorrect information). This AI generated software was created in part to reduce the manpower needed to call and/or send out their employees to mystery shop other communities. By banning it, I can see where companies will need additional staffing to keep up with pricing trends (obviously going backwards from the AI technology that every other industry is going to), and will likely have to raise rates more to compensate for those extra salaries. So I guess it’s 6 of one, a half dozen of the other. (Most apartment communities are generally understaffed anyway, so having the existing employees add more work to their already full plates would create losses in other areas, such as actually being in the office to tour prospective renters to get them to rent, instead of being out shopping other communities.) They could employ mystery shop companies, but those can cost over $100 per shop, which again would lead to increased rates for renters to cover the additional fees. I’m not sure if I see much of a long term win here, but I guess we’ll find out."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US will 'move on' from Ukraine peace talks in days if no progress soon",
            "external_url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
            "upvotes": 1899,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d807/live/b67a7f40-1c2e-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Mister \"I'll end the war in Ukraine on Day One\" is giving up on ending the war in Ukraine",
                "After they categorically gave up every single piece of leverage they had to force Russia into a long lasting and fair peace settlement this should surprise absolutely nobody.\n\nThey want to normalize relations with Russia, war in Ukraine or not. They just wanted to keep up this charade for long enough that they could eventually blame everyone else for why the negotiations are \"failing\".",
                "I cAn EnD tHe WaR iN a DaY",
                "Diplomacy is hard, ruling by executive order is so much easier, what a bunch of light weights!",
                "Trump promised to end the war in 24h. The President of the US cannot be trusted anymore.",
                "Wasn’t he going to end the war in one day? Lies, lies, and more lies from the Russian-controlled US government.",
                "Honestly tired of these \"deadlines\". Either commit to helping Ukraine or don't. All this back and forth just gives Russia more time to dig in while Ukraine loses people everyday.",
                "We've tried nothing and we're all out of ideas.",
                "Donald:”I’m bored, leaving things a mess and moving on to the next thing to spend 5 seconds on!”.",
                "Grab your coat on the way out."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen from Georgia released from jail after arrest under Florida’s new anti-immigration law",
            "external_url": "https://www.jacksonprogress-argus.com/plus/u-s-citizen-from-georgia-released-from-jail-after-arrest-under-florida-s-new-anti/article_d069906f-c2bb-5e33-841f-d9d30bd6df2a.html",
            "upvotes": 4027,
            "date": "04/18/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg?resize=600%2C339",
            "top_comments": [
                "> Lopez-Gomez will have to return to the Leon County Courthouse on May 6. He was charged under a recently passed law that a federal judge has temporarily barred the state from enforcing, further calling into question the validity of his arrest, the charge, and detention.\n\nEven though a judge already said he's an American citizen, they still expect him to return to the courthouse at a later date. These charges shouldn't even have happened. The law they're trying to enforce was barred by another judge for the time being. The only thing they should be doing is apologizing to this man, but that isn't going to happen.",
                "\"We don't mind immigration if you do it the right way\" \n\n-GOP in 2024\n\n\"We think sending people to camps in El Salvador is funny\" \n\n-GOP in 2025",
                "Thank goodness. Shouldn't have even come to this.",
                "Welp not going to Florida, ever. This should be a sign for any person from any state out side of Florida to practically forget that it exists. The sooner it sinks into the sea the better.",
                "How's that freedom going......",
                "I see how the cowardly police department was too ashamed to talk to the press. Fascists!",
                "Florida is gonna have zero visitors from other states at this rate.",
                "I'm shocked but thrilled; I was sure he'd end up in El Salvador before that 48 hour hold was up.",
                "Pretty sure part of the point of that whole civil war we did was to say states can't just do things that are the fed's job.",
                "Good thing this shit went viral cause Florida was ready to disappear him under their made up law that is not a law.  Fuck You Ron and the Florida GOP."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 18729,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "how fitting today UNH drops 22%",
                "This is going to be a shitshow.",
                "Is it normal for this stuff to be federal in the US?",
                "The headline makes it sound like CEO killing is its own separate and worse version of regular murder.",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "More punishment than any school shooter has ever got. Shoot one ceo and Trump and his cronies care - shoot up a school and you’ll get three hots and a cot forever. ",
                "You know who else was indicted on federal charges?\n\nThe current president."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 8039,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Yes, America is failing its citizens to allow for corporate greed",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts according to reuters [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "89 cases they know about.  There are undoubtedly hundreds if not thousands of cases not reported.  I’ve been poisoned multiple times, and never once reach the level of statistic.",
                "When Trump was elected the first time people said “We survived Obama, you’ll survive Trump”. Trump shut down the global CDC network, lied about COVID, and 1.2million Americans died. \n\n\nIt’s happening again.",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 24573,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Poison themselves to own the libs.",
                "This is going to kill people. \n\nGuaranteed.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "Oh good I was hoping I would get worms in 2025",
                "Ummm… do republicans not eat food?",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Wtf are my taxes even for anymore?",
                "Upton Sinclair is rolling in his grave.",
                "I knew it would end up with me growing my food. Fuck. I hate mowing my yard. How am I going to maintain a garden? lol"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 14258,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "Hey look it’s the thing everyone said he wouldn’t do. Wonder how the Latinos for Trump are feeling right now.",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?",
                "Anyone ok with this is complicit in the fascist takeover of the United States.  Republicans - your time to be on the right side of history is quickly running out."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "San Diego City Council bans landlords from 'price fixing' with algorithms",
            "external_url": "https://www.kpbs.org/news/living/2025/04/15/san-diego-city-council-bans-landlords-from-price-fixing-with-algorithms",
            "upvotes": 851,
            "date": "04/18/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/e89525e/2147483647/strip/true/crop/5678x2981+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fba%2Fdc%2F9117f2ff4ca08e6f8efb325a3fd0%2Fimg-4479.jpg",
            "top_comments": [
                "I wonder how you enforce the ban. We tell employees they're not allowed to use AI with work-related files but we also know they still upload our proprietary data.",
                ">Once the ordinance goes into effect, tenants will have the right to sue their landlords for violations.\n\nThis sounds like a good plan on paper but how do the tenants know a banned algorithm is being used?",
                "Rents up 36% in 6 years in SD County.    Just think about that for a sec",
                "They'll just do it the way they used to before AI - on the golf course, at the country club, at the strip club, etc.",
                "So proving this is going to be a nightmare.  Any person using AI or any algorithm for this is just doing what they could, and likely were doing, before.  These algorithms merely pull from publicly available data so that means that a person can find that data if they know where to look, and these guys are not exactly hiding prices. That means you have to assume they are finding it via an algorithm instead of manually and good luck proving that and even if you can prove it, its still the same result just with a few more hours of labor.",
                "\"The ordinance does not apply to algorithms that rely on public information, such as advertisements or listings on websites like Zillow or apartments.com.\"\n\nThere we go. Just scrap zillow and run a similar algorithm. Not that you can enforce anything. You can always ask an employee to decide the rental price, but let him look at the output the old algorithm and make sure he add some randomness to it.",
                "How about they relax zoning and allow people to build density, addressing the supply issue?   We've allowed NIMBYs to block density and supply so they can monetize scarcity.   It's not just the \"algorithms.\"  It's the supply.  \n\nEven for those who will say \"It's not necessarily supply--I see *tons* of housing going up and...\" the problem is supply there too.  They never mention where they're talking about, or the vacancy rate for this unnamed place where they've decided there is \"plenty\" of housing.",
                "Considering California has a rent cap I imagine it’ll go the same way it has been ie. if new year = raise by maximum allowed. Don’t really need an algorithm for it",
                "Is searching for similar units on Zillow an \"algorithm\"?  As a landlord, every time blue government tries to help renters they end up driving us out of the market. Then supply goes down and rent goes up.",
                "Landlords used to do this same thing pre-AI by calling around to all local competitors weekly and getting their prices (with the caveat that the other communities probably wouldn’t answer the phone, would say they didn’t share that information, or would give incorrect information). This AI generated software was created in part to reduce the manpower needed to call and/or send out their employees to mystery shop other communities. By banning it, I can see where companies will need additional staffing to keep up with pricing trends (obviously going backwards from the AI technology that every other industry is going to), and will likely have to raise rates more to compensate for those extra salaries. So I guess it’s 6 of one, a half dozen of the other. (Most apartment communities are generally understaffed anyway, so having the existing employees add more work to their already full plates would create losses in other areas, such as actually being in the office to tour prospective renters to get them to rent, instead of being out shopping other communities.) They could employ mystery shop companies, but those can cost over $100 per shop, which again would lead to increased rates for renters to cover the additional fees. I’m not sure if I see much of a long term win here, but I guess we’ll find out."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Austin Metcalf's father escorted out of Karmelo Anthony's family news conference after unexpected appearance",
            "external_url": "https://www.cbsnews.com/texas/news/austin-metcalfs-father-escorted-out-karmelo-anthonys-family-news-conference/",
            "upvotes": 1700,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/17/6d8cd1eb-c9b9-41e5-ad50-215fcff451d3/thumbnail/1200x630/78e26ed903475263be7846dd82823cf6/toc-04172025-karmelo-anthony-family-presser-11-24-0519-1.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Not gonna lie, this is a bad article.\n\nYou can't just drop an initialism ike \"NGAN\" without writing it out once, that's just common knowledge.",
                "For a second I thought this was in reference to retired NBA player Carmelo Anthony and got extremely confused",
                "When I saw the news conference, I thought it was the family of the victim speaking. Then I went online to find out what happened to him and uh, they're the family of the killer? The family of the victim is being treated like the family of the killer and the killer's family treated like the victim...it's bizarre.",
                "The discourse surrounding this murder is just insane. I'm not sure where these opposing narratives are coming from, but the kid took a knife to a track meet and stabbed someone in the heart....I don't think much else matters.",
                "Why are they even having a press conference?  Their kid murdered someone, I'd be hiding in shame",
                "They make it sound like the killer was the victim. Jfc.",
                "How is a grieving father showing up at the press conference of the parents of his son's accused killer both \"disrespectful\" and \"inappropriate\"?  How is it trespassing?  I'm appalled that the man was asked to leave.",
                "That minister is a tool.",
                "> Minister Dominique Alexander \n\nUh, I don't think they want to associate with that guy...  \nhttps://nypost.com/2025/04/18/us-news/activist-minister-aiding-accused-teen-killer-karmelo-anthony-has-his-own-lengthy-rap-sheet-report/",
                "So he got asked to leave but didn't stab anyone? Crazy. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Japan bus driver with 3 decades of service loses $84,000 pension after he was caught stealing $7",
            "external_url": "https://www.cbsnews.com/news/japan-bus-driver-loses-pension-for-stealing-7-dollars/",
            "upvotes": 3650,
            "date": "04/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/18/b958a561-2831-4cb5-8035-ce58469db518/thumbnail/1200x630/413cc3e4c195185d2b8eaec5d3fafe61/gettyimages-2147869596.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "> The driver had been reprimanded several times during his career over various incidents, according to the ruling.\n\nI think the $7 worth of fare stolen was what they could prove in court with evidence. There may have been far more discrepancies in terms of number of passengers versus fare collected but for some reason won’t disclose it, because otherwise this does seem extraordinarily excessive for someone that had been driving with them for that long, even for Japan.",
                "Imagine if they did this to cops",
                "Is it 84K in total or annually?\n\nSeems very low for 30 years of work.",
                "That's how much he was caught stealing, how much was stolen before it was identified?",
                "This was the first time he was CAUGHT, not necessarily the first time he stole.",
                "Maybe $14 stolen before,  crime unsolved",
                "its only 7$, but its still stealing and who knows how many times he hasnt gotten caught.",
                "Hey atleast he lose his pension with his own power,\nSome people are losing that amount in their retirement by another man’s actions",
                "Japan is much different than the U.S and many other western nations. They don't put up with thieves and have little to 0-tolerance for crimes that fall under the \"ethically bad or immoral\" category.\n\nThis is the same country where you can have your suit coat fall off and pass our drunk in the streets. And instead of waking up to all your shit stolen, somebody will place your coat over you to keep you warm. Being a general good human is cultural for the Japanese.",
                "Cut bro some slack. Times are tough. Jesus."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "US will 'move on' from Ukraine peace talks in days if no progress soon",
            "external_url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
            "upvotes": 1902,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d807/live/b67a7f40-1c2e-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Mister \"I'll end the war in Ukraine on Day One\" is giving up on ending the war in Ukraine",
                "After they categorically gave up every single piece of leverage they had to force Russia into a long lasting and fair peace settlement this should surprise absolutely nobody.\n\nThey want to normalize relations with Russia, war in Ukraine or not. They just wanted to keep up this charade for long enough that they could eventually blame everyone else for why the negotiations are \"failing\".",
                "I cAn EnD tHe WaR iN a DaY",
                "Diplomacy is hard, ruling by executive order is so much easier, what a bunch of light weights!",
                "Trump promised to end the war in 24h. The President of the US cannot be trusted anymore.",
                "Wasn’t he going to end the war in one day? Lies, lies, and more lies from the Russian-controlled US government.",
                "Honestly tired of these \"deadlines\". Either commit to helping Ukraine or don't. All this back and forth just gives Russia more time to dig in while Ukraine loses people everyday.",
                "We've tried nothing and we're all out of ideas.",
                "Donald:”I’m bored, leaving things a mess and moving on to the next thing to spend 5 seconds on!”.",
                "Grab your coat on the way out."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen from Georgia released from jail after arrest under Florida’s new anti-immigration law",
            "external_url": "https://www.jacksonprogress-argus.com/plus/u-s-citizen-from-georgia-released-from-jail-after-arrest-under-florida-s-new-anti/article_d069906f-c2bb-5e33-841f-d9d30bd6df2a.html",
            "upvotes": 4028,
            "date": "04/18/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg?resize=600%2C339",
            "top_comments": [
                "> Lopez-Gomez will have to return to the Leon County Courthouse on May 6. He was charged under a recently passed law that a federal judge has temporarily barred the state from enforcing, further calling into question the validity of his arrest, the charge, and detention.\n\nEven though a judge already said he's an American citizen, they still expect him to return to the courthouse at a later date. These charges shouldn't even have happened. The law they're trying to enforce was barred by another judge for the time being. The only thing they should be doing is apologizing to this man, but that isn't going to happen.",
                "\"We don't mind immigration if you do it the right way\" \n\n-GOP in 2024\n\n\"We think sending people to camps in El Salvador is funny\" \n\n-GOP in 2025",
                "Thank goodness. Shouldn't have even come to this.",
                "Welp not going to Florida, ever. This should be a sign for any person from any state out side of Florida to practically forget that it exists. The sooner it sinks into the sea the better.",
                "How's that freedom going......",
                "I see how the cowardly police department was too ashamed to talk to the press. Fascists!",
                "Florida is gonna have zero visitors from other states at this rate.",
                "I'm shocked but thrilled; I was sure he'd end up in El Salvador before that 48 hour hold was up.",
                "Pretty sure part of the point of that whole civil war we did was to say states can't just do things that are the fed's job.",
                "Good thing this shit went viral cause Florida was ready to disappear him under their made up law that is not a law.  Fuck You Ron and the Florida GOP."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Trump administration announces fees on Chinese ships docking at U.S. ports",
            "external_url": "https://www.cnbc.com/2025/04/17/trump-administration-announces-fees-on-chinese-ships-docking-at-us-ports.html",
            "upvotes": 1446,
            "date": "04/18/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108132371-1744750747440-gettyimages-2210460440-jr_11302_2mfwszjy.jpeg?v=1744750835&w=1920&h=1080",
            "top_comments": [
                "Wait. So they want to charge a fee where every time a Chinese BUILT ship comes into a US port we tax it? Not even a who owns it fee, but simply where the ship was built even if it’s owned by a US company. \n\nYeah, that’s going to go over well. Where the fuck do we even do commercial shipbuilding anymore? This is just going to make prices go up even more because it’s now a tax on shipping that’s going to be passed on to consumers.",
                "Trump’s just mad at China because they were able to build a wall. A Great Wall",
                "Every second it just gets dumber.  Impeach this guy please. ",
                "He is doing everything he can to tank the US dollar.",
                "I work in this industry. most vessels nowadays are manufactured in China. the USA does not have enough vessels to satisfy their supply needs, this will kill much of the north american shipping industry dead in the water.",
                "Basically, Trump wants world economy to fail. He will then say or retract the imposed tarrif and such rules to bo claim he saved the economy. Creat a problem to seam like fixing it.",
                "It's not even 3 months yet. There are 1350+ more days of tariff rules changing. ",
                "Here comes the empty shelves and skyrocketing prices!",
                "Does anyone in the Whitehouse have a basic understanding of economics or international trade? Are they wanting to start a war with China without any provocation? Is this new tax because Xi won't answer the phone? The USA economy is going to be in ruins before anything is done to stop the madness.",
                "USA has become a hostile nation to be avoided in all ways trade and tourism . \n\nThe fallout of this dumbfuckery will last for decades ."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 40318,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "It's a relief there's proof of life",
                "What happened with the reporting yesterday that Van Hollen was denied access? Was he first denied then allowed?"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 8035,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Yes, America is failing its citizens to allow for corporate greed",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts according to reuters [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "89 cases they know about.  There are undoubtedly hundreds if not thousands of cases not reported.  I’ve been poisoned multiple times, and never once reach the level of statistic.",
                "When Trump was elected the first time people said “We survived Obama, you’ll survive Trump”. Trump shut down the global CDC network, lied about COVID, and 1.2million Americans died. \n\n\nIt’s happening again.",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 3313,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "“The alleged shooter was a long-standing member of the sheriff’s office’s youth advisory council, the sheriff said.\n\n“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.””",
                "Mom should be held culpable.",
                "The real story is that he is maga.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "WAIT this is the perfect moment. Time to prove you’re deporting the bad Americans",
                "I saw a MAGA person trying to claim that his mother must have been a DEI hire as she was “too short and overweight” and trying to use the shooting as an excuse to call for a purge of women from the police",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "I just read somewhere that some students at FSU are Parkland massacre survivors as well. That is INSANE. America is broken beyond repair"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "American citizen hijacks small plane in Belize, 3 injured",
            "external_url": "https://abcnews.go.com/International/american-citizen-hijacks-small-plane-belize-3-injured/story?id=120916154",
            "upvotes": 437,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26df2c2b-0032-4b7f-b673-0cafd853ce3c/belize-plane-04-ht-jt-250417_1744916656230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Filibusters (in the original sense) coming back into fashion?? \n\n> ... a mercenary who travelled illegally in an organized group **from the United States to a country in Central America** or the Spanish West Indies in the mid-19th century seeking economic and political benefits through **armed force.**\n\nhttps://en.wiktionary.org/wiki/filibuster#Noun",
                "\"hijacked a small plane at knifepoint \"\n\n\"The hijacker was fatally shot in the chest by a passenger who had a licensed firearm\"\n\nWell, that is what happen when you bring a knife to a gun fight. A rare case when the day is saved by the good guy with a gun.",
                "Reminds me of this book I read that talked about how common skyjacking was in 70s. There’s just something about wanting a plane to fly you to a third world country when you jump off the deep end.",
                "I have flown as a passenger on that flight four times. I have passed through their security, how did the good guy’s gun get in the cabin?",
                "Not sending their best.",
                "Holy shit, the rare instance where good guy with gun saves the day.",
                "US airlines have become so unsafe under Trump’s FAA that terrorists have to go to other countries just to hijack a plane.",
                "When the United States sends its people, they're not sending their best. They're sending people that have lots of problems, and they're bringing those problems with us. They're bringing drugs. They're bringing crime. They're plane hijackers. And some, I assume, are good people.",
                "All these years, all these decades and we finally did it, we finally found the good guy with a gun. ",
                "Deport him to an American prison camp. /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "San Diego City Council bans landlords from 'price fixing' with algorithms",
            "external_url": "https://www.kpbs.org/news/living/2025/04/15/san-diego-city-council-bans-landlords-from-price-fixing-with-algorithms",
            "upvotes": 851,
            "date": "04/18/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/e89525e/2147483647/strip/true/crop/5678x2981+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fba%2Fdc%2F9117f2ff4ca08e6f8efb325a3fd0%2Fimg-4479.jpg",
            "top_comments": [
                "I wonder how you enforce the ban. We tell employees they're not allowed to use AI with work-related files but we also know they still upload our proprietary data.",
                ">Once the ordinance goes into effect, tenants will have the right to sue their landlords for violations.\n\nThis sounds like a good plan on paper but how do the tenants know a banned algorithm is being used?",
                "Rents up 36% in 6 years in SD County.    Just think about that for a sec",
                "They'll just do it the way they used to before AI - on the golf course, at the country club, at the strip club, etc.",
                "So proving this is going to be a nightmare.  Any person using AI or any algorithm for this is just doing what they could, and likely were doing, before.  These algorithms merely pull from publicly available data so that means that a person can find that data if they know where to look, and these guys are not exactly hiding prices. That means you have to assume they are finding it via an algorithm instead of manually and good luck proving that and even if you can prove it, its still the same result just with a few more hours of labor.",
                "\"The ordinance does not apply to algorithms that rely on public information, such as advertisements or listings on websites like Zillow or apartments.com.\"\n\nThere we go. Just scrap zillow and run a similar algorithm. Not that you can enforce anything. You can always ask an employee to decide the rental price, but let him look at the output the old algorithm and make sure he add some randomness to it.",
                "How about they relax zoning and allow people to build density, addressing the supply issue?   We've allowed NIMBYs to block density and supply so they can monetize scarcity.   It's not just the \"algorithms.\"  It's the supply.  \n\nEven for those who will say \"It's not necessarily supply--I see *tons* of housing going up and...\" the problem is supply there too.  They never mention where they're talking about, or the vacancy rate for this unnamed place where they've decided there is \"plenty\" of housing.",
                "Considering California has a rent cap I imagine it’ll go the same way it has been ie. if new year = raise by maximum allowed. Don’t really need an algorithm for it",
                "Is searching for similar units on Zillow an \"algorithm\"?  As a landlord, every time blue government tries to help renters they end up driving us out of the market. Then supply goes down and rent goes up.",
                "Landlords used to do this same thing pre-AI by calling around to all local competitors weekly and getting their prices (with the caveat that the other communities probably wouldn’t answer the phone, would say they didn’t share that information, or would give incorrect information). This AI generated software was created in part to reduce the manpower needed to call and/or send out their employees to mystery shop other communities. By banning it, I can see where companies will need additional staffing to keep up with pricing trends (obviously going backwards from the AI technology that every other industry is going to), and will likely have to raise rates more to compensate for those extra salaries. So I guess it’s 6 of one, a half dozen of the other. (Most apartment communities are generally understaffed anyway, so having the existing employees add more work to their already full plates would create losses in other areas, such as actually being in the office to tour prospective renters to get them to rent, instead of being out shopping other communities.) They could employ mystery shop companies, but those can cost over $100 per shop, which again would lead to increased rates for renters to cover the additional fees. I’m not sure if I see much of a long term win here, but I guess we’ll find out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Japan bus driver with 3 decades of service loses $84,000 pension after he was caught stealing $7",
            "external_url": "https://www.cbsnews.com/news/japan-bus-driver-loses-pension-for-stealing-7-dollars/",
            "upvotes": 3658,
            "date": "04/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/18/b958a561-2831-4cb5-8035-ce58469db518/thumbnail/1200x630/413cc3e4c195185d2b8eaec5d3fafe61/gettyimages-2147869596.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "> The driver had been reprimanded several times during his career over various incidents, according to the ruling.\n\nI think the $7 worth of fare stolen was what they could prove in court with evidence. There may have been far more discrepancies in terms of number of passengers versus fare collected but for some reason won’t disclose it, because otherwise this does seem extraordinarily excessive for someone that had been driving with them for that long, even for Japan.",
                "Imagine if they did this to cops",
                "Is it 84K in total or annually?\n\nSeems very low for 30 years of work.",
                "That's how much he was caught stealing, how much was stolen before it was identified?",
                "This was the first time he was CAUGHT, not necessarily the first time he stole.",
                "Maybe $14 stolen before,  crime unsolved",
                "its only 7$, but its still stealing and who knows how many times he hasnt gotten caught.",
                "Hey atleast he lose his pension with his own power,\nSome people are losing that amount in their retirement by another man’s actions",
                "Japan is much different than the U.S and many other western nations. They don't put up with thieves and have little to 0-tolerance for crimes that fall under the \"ethically bad or immoral\" category.\n\nThis is the same country where you can have your suit coat fall off and pass our drunk in the streets. And instead of waking up to all your shit stolen, somebody will place your coat over you to keep you warm. Being a general good human is cultural for the Japanese.",
                "Cut bro some slack. Times are tough. Jesus."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Austin Metcalf's father escorted out of Karmelo Anthony's family news conference after unexpected appearance",
            "external_url": "https://www.cbsnews.com/texas/news/austin-metcalfs-father-escorted-out-karmelo-anthonys-family-news-conference/",
            "upvotes": 1699,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/17/6d8cd1eb-c9b9-41e5-ad50-215fcff451d3/thumbnail/1200x630/78e26ed903475263be7846dd82823cf6/toc-04172025-karmelo-anthony-family-presser-11-24-0519-1.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Not gonna lie, this is a bad article.\n\nYou can't just drop an initialism ike \"NGAN\" without writing it out once, that's just common knowledge.",
                "For a second I thought this was in reference to retired NBA player Carmelo Anthony and got extremely confused",
                "When I saw the news conference, I thought it was the family of the victim speaking. Then I went online to find out what happened to him and uh, they're the family of the killer? The family of the victim is being treated like the family of the killer and the killer's family treated like the victim...it's bizarre.",
                "The discourse surrounding this murder is just insane. I'm not sure where these opposing narratives are coming from, but the kid took a knife to a track meet and stabbed someone in the heart....I don't think much else matters.",
                "Why are they even having a press conference?  Their kid murdered someone, I'd be hiding in shame",
                "They make it sound like the killer was the victim. Jfc.",
                "How is a grieving father showing up at the press conference of the parents of his son's accused killer both \"disrespectful\" and \"inappropriate\"?  How is it trespassing?  I'm appalled that the man was asked to leave.",
                "That minister is a tool.",
                "> Minister Dominique Alexander \n\nUh, I don't think they want to associate with that guy...  \nhttps://nypost.com/2025/04/18/us-news/activist-minister-aiding-accused-teen-killer-karmelo-anthony-has-his-own-lengthy-rap-sheet-report/",
                "So he got asked to leave but didn't stab anyone? Crazy. "
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US will 'move on' from Ukraine peace talks in days if no progress soon",
            "external_url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
            "upvotes": 1902,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d807/live/b67a7f40-1c2e-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Mister \"I'll end the war in Ukraine on Day One\" is giving up on ending the war in Ukraine",
                "After they categorically gave up every single piece of leverage they had to force Russia into a long lasting and fair peace settlement this should surprise absolutely nobody.\n\nThey want to normalize relations with Russia, war in Ukraine or not. They just wanted to keep up this charade for long enough that they could eventually blame everyone else for why the negotiations are \"failing\".",
                "I cAn EnD tHe WaR iN a DaY",
                "Diplomacy is hard, ruling by executive order is so much easier, what a bunch of light weights!",
                "Trump promised to end the war in 24h. The President of the US cannot be trusted anymore.",
                "Wasn’t he going to end the war in one day? Lies, lies, and more lies from the Russian-controlled US government.",
                "Honestly tired of these \"deadlines\". Either commit to helping Ukraine or don't. All this back and forth just gives Russia more time to dig in while Ukraine loses people everyday.",
                "We've tried nothing and we're all out of ideas.",
                "Donald:”I’m bored, leaving things a mess and moving on to the next thing to spend 5 seconds on!”.",
                "Grab your coat on the way out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen from Georgia released from jail after arrest under Florida’s new anti-immigration law",
            "external_url": "https://www.jacksonprogress-argus.com/plus/u-s-citizen-from-georgia-released-from-jail-after-arrest-under-florida-s-new-anti/article_d069906f-c2bb-5e33-841f-d9d30bd6df2a.html",
            "upvotes": 4031,
            "date": "04/18/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg?resize=600%2C339",
            "top_comments": [
                "> Lopez-Gomez will have to return to the Leon County Courthouse on May 6. He was charged under a recently passed law that a federal judge has temporarily barred the state from enforcing, further calling into question the validity of his arrest, the charge, and detention.\n\nEven though a judge already said he's an American citizen, they still expect him to return to the courthouse at a later date. These charges shouldn't even have happened. The law they're trying to enforce was barred by another judge for the time being. The only thing they should be doing is apologizing to this man, but that isn't going to happen.",
                "\"We don't mind immigration if you do it the right way\" \n\n-GOP in 2024\n\n\"We think sending people to camps in El Salvador is funny\" \n\n-GOP in 2025",
                "Thank goodness. Shouldn't have even come to this.",
                "Welp not going to Florida, ever. This should be a sign for any person from any state out side of Florida to practically forget that it exists. The sooner it sinks into the sea the better.",
                "How's that freedom going......",
                "I see how the cowardly police department was too ashamed to talk to the press. Fascists!",
                "Florida is gonna have zero visitors from other states at this rate.",
                "I'm shocked but thrilled; I was sure he'd end up in El Salvador before that 48 hour hold was up.",
                "Pretty sure part of the point of that whole civil war we did was to say states can't just do things that are the fed's job.",
                "Good thing this shit went viral cause Florida was ready to disappear him under their made up law that is not a law.  Fuck You Ron and the Florida GOP."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 40313,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "It's a relief there's proof of life",
                "What happened with the reporting yesterday that Van Hollen was denied access? Was he first denied then allowed?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 8043,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Yes, America is failing its citizens to allow for corporate greed",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts according to reuters [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "89 cases they know about.  There are undoubtedly hundreds if not thousands of cases not reported.  I’ve been poisoned multiple times, and never once reach the level of statistic.",
                "When Trump was elected the first time people said “We survived Obama, you’ll survive Trump”. Trump shut down the global CDC network, lied about COVID, and 1.2million Americans died. \n\n\nIt’s happening again.",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 24570,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Poison themselves to own the libs.",
                "This is going to kill people. \n\nGuaranteed.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "Oh good I was hoping I would get worms in 2025",
                "Ummm… do republicans not eat food?",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Wtf are my taxes even for anymore?",
                "Upton Sinclair is rolling in his grave.",
                "I knew it would end up with me growing my food. Fuck. I hate mowing my yard. How am I going to maintain a garden? lol"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 14258,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "Hey look it’s the thing everyone said he wouldn’t do. Wonder how the Latinos for Trump are feeling right now.",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?",
                "Anyone ok with this is complicit in the fascist takeover of the United States.  Republicans - your time to be on the right side of history is quickly running out."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 5547,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                ">The suspect in the FSU shooting espoused white supremacist views and was removed from a political club, the group's president, Reid Seybold, said.\n\n>Seybold said he was part of a club with the suspect at Tallahassee State College, where they both attended before transferring to FSU. He was president of a club called \"political round table,\" where the suspect was asked not to return after repeated issues with the suspect's rhetoric.\n\n>\"Basically our only rule was no Nazis — colloquially speaking — and he espoused so much white supremacist rhetoric, and far-right rhetoric as well, to the point where we had to exercise that role,\" Seybold said.\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Someone somewhere is blaming Biden",
                "Well at least we're rounding up immigrants to stop this nonsense."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "04/18/2025 16:10:19 UTC"
}