{
    "posts": [
        {
            "category": "HOT",
            "title": "Chief Justice Roberts pauses deadline for return of Maryland man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/supreme-court-trump-deportation-salvador-maryland-40136c5aa844b6c12ba20ee67ab4df9a",
            "upvotes": 11585,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“The Executive branch may not seize individuals from the streets, deposit them in foreign prisons in violation of court orders, and then invoke the separation of powers to insulate its unlawful actions from judicial scrutiny,”\n\nWho can disagree with this?",
                "UPDATES: \n\n[Chief Justice John Roberts temporarily lifts order requiring Trump administration to un-deport Dilmar Abrego Garcia from a prison in El Salvador by midnight tonight.](https://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/)\nhttps://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/\n\n[Abrego Garcia filed a response already:](https://www.supremecourt.gov/DocketPDF/24/24A949/354927/20250407153131040_2025.04.07%20Respondents%20Opp%20to%20App%20to%20Vacate.pdf)\n\nThe Supreme Court docket doesn't show timestamps, but this was filed around the same time as Chief Justice Roberts' order (which requested a response by tomorrow).",
                "Even if the SC rules against the Trump admin, the fact that they're treating this blatantly illegal and immoral act as the status quo which must stand in the interim is in itself absolutely monstrous.",
                ">But he is no longer in U.S. custody and the government has no way to get him back, the administration argued.\n\nIf this full ordeal passes Supreme Court muster, the Musk/Trump administration can effectively *'memory hole'* anyone. Oopsies we accidentally misplaced [a journalist](https://www.theguardian.com/us-news/2025/apr/07/markwayne-mullin-journalists-violence-comments). Sorry, we accidentally deported a [sitting congresswoman](https://www.axios.com/2025/02/11/ilhan-omar-deport-brandon-gill-fundraisng). It starts here with this.",
                "It would be one thing if we merely deported him where he got off the plane in his home country and we said ‘good luck’. But we took him directly to a notorious prison.",
                "Then, how are they *ever* supposed to come back? Were they sentenced to life in a foreign prison with no due process? Because, let's be clear about what happened; they were not deported. They were imprisoned.",
                "Time for federal courts to start sanctioning and holding DOJ/agency lawyers in contempt. They say they cannot demand someone be returned, but they themselves can spend a night or two in jail to consider it.",
                "**April 19th is the next national day of protest**. Channel the anger into something useful and find a protest near you [here](https://www.fiftyfifty.one) or start one of your own.",
                "Roberts is now complicit in the extrajudicial kidnapping of a man.",
                "This is the death of ALL civil rights. If the courts can't order his return they can't order yours."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now",
            "external_url": "https://edition.cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump/index.html",
            "upvotes": 3949,
            "date": "04/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21484239-3434220-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The unsigned decision in the case, the most closely watched emergency appeal pending at the Supreme Court, lets Trump invoke the 1798 law to speed removals while litigation over the act’s use plays out in lower courts. The court stressed that people deported going forward should receive notice they are subject to the act and an opportunity to have their removal reviewed.\n\nThis strikes me as SCOTUS knowing it won't stand up, but wanting to give the administration more time to mass deport people until the cases play out in the lower courts and actually require a final decision from them. It's the same thing they did with the presidential immunity case. Delay enough that the damage is done by the time they make a decision.\n\n\n> The court’s three liberal justices dissented from the decision, and Justice Amy Coney Barrett, a member of the court’s conservative wing, partially dissented.\n\nAmy Coney Barrett being the dark horse. I know it's only a partial dissent, but of the conservative justices, she's seemed the most likely to not go blindly along.",
                "OFC they are. They are Trump puppets.",
                "Oh, is this the same Supreme Court that gave Trump broad immunity from prosecution for illegal acts he committed during his time as President?",
                "This order is going to immediately be abused despite everyone knowing what’s going to happen.  The Supreme Court just shit its pants and leaving us with the mess.  If you look like someone who could be deported. you might want to start carrying information that proves your citizenship, but let’s be real it probably won’t matter to ice.  You can be damn sure that trump and his band of dip ships will do everything in their power to make sure any errors that result in people being harmed won’t be fixed.",
                "The Supreme Court is allowing Trump to break the law and seize unconstitutional power. How dare they disgrace our nation.",
                "\"Supreme Court Anoints Trump Emperor With Power to Arrest and Deport Anyone Without Recourse\"\n\nftfy",
                "\"The only thing necessary for the triumph of evil is for good men to do nothing\" - Edmund Burke. It is not over, far from it. Cowardice of the bureaucracy is not capitulation of the people.",
                "So wait, SCOTUS knows that trump deported at least one legal us citizen with no due process, refuses to bring them home, and says \"yea you can keep doing this, no notes you good\"\n\nBruh, if i screwed up this hard at my job id probably get arrested",
                "I honestly don’t know what’s left to do. I feel so incredibly powerless. Congress is filled with cowards, and that’s it. I’m so tired of witnessing shit after shit in my lifetime.",
                "This should remove any doubt to anyone who thought the Supreme Court would be worth a damn."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 16700,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "Is he making comedy illegal on X?",
                "What happened to “legalize comedy”?",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "Freedom of speech? More like parody of freedom.",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?",
                "thought there was war against comedy mr elon ?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Sailor killed in Pearl Harbor attack finally ID'd 84 years later, bringing closure to family",
            "external_url": "https://www.nbcnews.com/news/us-news/sailor-killed-pearl-harbor-attack-finally-idd-84-years-later-bringing-rcna199986",
            "upvotes": 4976,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-Neil-D-Frye-ew-1128a-c15aa1.jpg",
            "top_comments": [
                "“My mom used to say she loved to people watch,” McCrimmon told WHRO. “She would go anywhere she could get a chance to go to a little town and just watch all the men go by to see if she could see Neil.” \n\nthat’s so heartbreaking omg\n\nit’s a shame that only his youngest sister is left and not a couple more of his siblings, but I’m glad there was at least one of them left to see this. Rip",
                "I'm glad his family will finally get some closure. It's insane to think about the scale of death and tragedy of WW2. 80 years later, the DPAA is still IDing unknown remains on an almost daily basis. Theyve made a lot of progress lately with remains from Pearl Harbor and Japanese POW camps.",
                "Just in time for the current admiration to erase his name from history.",
                "Still had a baby face. RIP",
                "He was so young. That's sad",
                "Rest easy brother. We have the watch.",
                "Im so glad he got to come home.",
                "Glad to read some uplifting news today, even if bittersweet. \n\n  \nSadly, the Trump Administration will try to erase him.",
                "Fair winds and following seas Sailor!",
                "Look at that face. We had children saving the world, only for one doddering, diaper-filling old coward to dismantle it."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Family of Texas teen accused in fatal stabbing raises over $150K",
            "external_url": "https://www.lmtonline.com/news/article/texas-teen-stabbing-fundraiser-20262648.php",
            "upvotes": 4300,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately, the only winners are the lawyers' bank accounts",
                "Wait a minute. The stabbers name is actually Karmelo Anthony?? GTFOH!",
                "He better hope they get a good lawyer with all that money because he sounds guilty as fuck.",
                "I want to know who is donating to this and why??",
                "I been in track and I’ve been to track as a spectator um. Never needed to kill anyone with a knife",
                "Who brings a knife to a track meet? Sorry, but that I don't get. Both families are devastated. Period.",
                "Bottom line:  Stabbing someone to death is not an appropriate reaction to getting pushed.",
                "All you 'stand your ground' jackasses are beyond dumb. He was in another schools tent, was told to leave, reached into his bag and basically said make me then stabbed the kid that tried to make him. This isn't standing your ground. This is being a piece of shit that brought a knife to a track meet looking for trouble. Fuck him, and fuck anyone that's defending him.",
                "Cant say much about this case, but if someone is bothering you, you dont fucking stab them to death. Pretty common sense. \"Dont bring a knife to a fist fight\" They coulda just thrown hands and been done with it.",
                "Wild there are people in this thread defending the stabber. You people are nuts."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Villanova Student Demands Man Who Recorded Her Sexual Assault Not Walk at Graduation",
            "external_url": "https://www.phillymag.com/news/2025/04/07/juan-eguiguren-villanova-sexual-assault/",
            "upvotes": 2270,
            "date": "04/07/2025",
            "thumbnail": "https://cdn10.phillymag.com/wp-content/uploads/sites/3/2024/08/villanova-rape-sexual-assault-lawsuit-social.jpg",
            "top_comments": [
                "It's insane to me that this guy was never charged with a crime. It's also insane to me that the actual rapist got a plea bargain with zero prison time.\n\nThis isn't a \"he said, she said\" sort of case, there's *actual fucking video of the guy raping an unconscious woman*. There's zero question regarding whether it happened or whether it was consensual. It did and it wasn't. This is an open-and-shut case. Everyone involved should have been charged and very quickly convicted, and all three of them should be sitting in a prison cell at this very moment.",
                "So he not only filmed the assault in her dorm, the rapist and the cameraman removed her unconscious body and dumped her in a bathroom on the ground floor of the dorm..\n\n\nUmmm what the fuck? Why aren't they both rotting in prison?",
                "We, as a society, should not and cannot allow people like this to just walk away. This young woman’s life will never be the same because of what these assholes did to her. And Villanova should be fucking ashamed of themselves already, notwithstanding possibly allowing this guy to walk at graduation. This is a complete failure by the school administration and the so called “justice system” in the US. Women’s rights, and voices, are being taken away every fucking day and I cannot believe there are not more men standing up about this. I have a mother, a wife, a sister, and a niece. Every time I read something like this it pisses me off that some sexual assaulter/rapist just gets to proceed with their lives while the woman is expected to maintain her silence. It’s infuriating, depressing, and sickening all at once. \n\nEdit: I just wrote an email to the Villanova administration imploring them to not allow this rapist to walk at commencement in front of his victim. That would set a tremendously awful precedent. ",
                "> I do have a feeling that this repulsive little man is going to walk across the stage with the rest of us. They’ll read his name. They’ll hand him his diploma. And then he gets to just forget about all this. She’ll never forget.\n\nWe need to start tattooing foreheads or something else permanent, because this is a good point.\n\nThis assault will likely be foundational for the victim, something that shapes the way she lives the rest of her life.\n\nThis guy who recorded and helped dumped her body, along with a third guy who helped \"move her head around\", didn't even get charged with a crime. And the guy who did the actual assaulting didn't even get any jail time.\n\nThey just get to walk away.",
                "name 'em, shame 'em\n\nFuck Juan Eguiguren of Villanova University and Andrew Polun of Towson University for helping and recording the rape of an unconscious woman.\n\nand the biggest fuck you to ELIJAH KATZENELL for raping her. None of these men went to jail for what they did. Disgusting.",
                "Why are any of these rapist still in School much less graduating. They should be in jail.",
                "If they don’t have the moral courage to expel the kid after he recorded and basically participated in a sexual assault, I doubt they’ll suddenly grow it to prevent him from walking at graduation.",
                "The fact that Villanova allowed him to finish his education there is damning.  That's an easy expulsion in my view.  Of COURSE he shouldn't be allowed to walk at the ceremony.",
                "If Villanova does allow Eguiguren to participate in graduation, Edelstein writes that this “would defy basic logic and would be yet another public offense to moral decency concerning victims/survivors of sexual assault… If Villanova bends once more to the wants of an individual who videotaped a rape and moved the body of an unconscious and unsuspecting rape victim, the institution will once again be protecting the wrong student. Respectfully, I cannot fathom that this is where Villanova wishes to draw a line in the sand, and plant its school flag, in favor of an admitted videographer of a rape in Villanova’s dormitory.”",
                "To all the men who wonder why women are afraid of men andwhy they are afraid to report being raped by a man to authorities because the blame is hers and then he is allowed not only to walk free but to be able to walk the stage for graduation is disgusting.\n\nIf I were your friend; I would have a giant sign saying Joe Smith is a rapist as he walked the stage. By the time they drag me out, the message is clear. Everyone will have their camera in hand - I would have one those obnoxious air horns to be sure it becomes part of the graduation memories."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 7341,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "She should be in jail.",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "He wasn’t sycophant enough..",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Mother and three kids released by Ice after protests from US ‘border czar’s’ hometown | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/07/sackets-harbor-ice-immigration-tom-homan",
            "upvotes": 1468,
            "date": "04/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/257cde6e752b5297ba7fd4645be1555e4869146e/634_523_2953_1772/master/2953.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d30f115b543de1981ef00f13c3c0ed3c",
            "top_comments": [
                "The thing that gets me is how many Americans think this can’t happen to them.",
                "According to ICE, they do everything by the book. The problem is, the book appears to be Mein Kampf.",
                "Never stop fighting. Never.",
                "Imagine what kind of piece of shit you must be to work for ICE.  Absolute trash.",
                "Fuck yeah. When we fight, we win.",
                "I was really worried about those poor kids. So glad they've been released.",
                "Dead serious question — when did the term ‘border czar’ become a thing? I’ve only become aware of it this past election",
                "Next protests need to be a little closer to home for these rats.  Surround the Fox news Bldg in NYC.  Fill this scumbags hometown with people and peacefully beseige his home…why should his family be immune to his depredations?",
                "Protestors need to stay camped out at that POS's house on a constant basis. Terrorizing good families is just not okay. We can't allow it to be normalized.",
                "Nothing will change until a judge locks up Homan and Howoman for kidnapping."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Microsoft terminates jobs of engineers who protested use of AI products by Israel’s military",
            "external_url": "https://www.nbcnews.com/tech/tech-news/microsoft-terminates-jobs-engineers-protested-use-ai-products-israels-rcna200130",
            "upvotes": 1022,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-france-microsoft-building-2016-ac-721p-48fd45.jpg",
            "top_comments": [
                "Those 2 actually have a backbone. Hope they get picked up by a better company",
                "Unethical policies are a prerequisite for becoming a billion dollar corporation",
                "AIPAC has America in a strangle hold",
                "The headline is correct but also misleading.  Both engineers interrupted the 50th anniversary speeches from Microsoft CEOs to protest.  The first engineer insulted her department CEO and her company.   The second one apparently did the same thing.  Both then fired off executive email carpet bombs.  You will absolutely be canned for doing that.",
                "Unfortunately, I am not entirely surprised by this move.",
                "Every company does things that employees may find unethical. Philip Morris's products have contributed to the deaths of untold millions over the decades and people still work there.",
                "If Ibtihal or Vaniya are on Reddit, they should post the names of their direct upstream leadership. Let's document who is part of the chain responsible for these firings, or other layoffs. The only way we will all survive this is if we work together, and document as much as we can.\n\nIn this case, [Mustafa Suleyman](https://en.wikipedia.org/wiki/Mustafa_Suleyman) was the person being called out, that ultimately resulted in the firing of Ibtihal. And Vaniya spoke out while [Satya](https://en.wikipedia.org/wiki/Satya_Nadella) was speaking, sending a follow up email afterward.\n\nMicrosoft is complicit in the death of many children, women, and other people in Palestine. Where else have they contributed to the death of others?",
                "Unsurprising employees don’t usually get to dictate what companies can do especially regarding multi million dollar deals. \n\nAt the same time the software engineer job market is so saturated that they’ll fill these job posts almost immediately if they wanted to.",
                "Sure is looking more and more like Benji is the puppet master fucking with global lives right now.",
                "United States of AIPAC."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 40166,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "This needs to end. Where is congress? They should be putting the brakes on this president.Nearly everything he does is illegal."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Dozens of free measles vaccine clinics close in Texas as federal funding is cut",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-dallas-vaccines-hhs-funding-cuts-rcna199144",
            "upvotes": 31,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250326-measles-vaccine-se-336p-1bc8b4.jpg",
            "top_comments": [
                "The amount of destruction that’s happened to critical programs under the current administration is abhorrent. We really didn’t learn anything from the last pandemic I guess",
                "Republicans love killing children",
                "That can't be true. Secretary Roadkill totally said vaccines are best way to fight the measles."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 224,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "US is transforming into an authoritarian regime right before our eyes.",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "*For the 38-year-old civil rights and criminal defense attorney, it was a daunting experience that he says highlights a troubling phenomenon that's occurring across the United States: Lawyers are getting targeted for handling issues the administration of President Donald Trump disagrees with.*\n\nAnd is there a cause more just than that of the Palestinians?",
                "No. Every American of color with a unique name will be stopped. Whites won't be stopped."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Microsoft terminates jobs of engineers who protested use of AI products by Israel’s military",
            "external_url": "https://www.nbcnews.com/tech/tech-news/microsoft-terminates-jobs-engineers-protested-use-ai-products-israels-rcna200130",
            "upvotes": 1020,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-france-microsoft-building-2016-ac-721p-48fd45.jpg",
            "top_comments": [
                "Those 2 actually have a backbone. Hope they get picked up by a better company",
                "Unethical policies are a prerequisite for becoming a billion dollar corporation",
                "AIPAC has America in a strangle hold",
                "The headline is correct but also misleading.  Both engineers interrupted the 50th anniversary speeches from Microsoft CEOs to protest.  The first engineer insulted her department CEO and her company.   The second one apparently did the same thing.  Both then fired off executive email carpet bombs.  You will absolutely be canned for doing that.",
                "Unfortunately, I am not entirely surprised by this move.",
                "Every company does things that employees may find unethical. Philip Morris's products have contributed to the deaths of untold millions over the decades and people still work there.",
                "If Ibtihal or Vaniya are on Reddit, they should post the names of their direct upstream leadership. Let's document who is part of the chain responsible for these firings, or other layoffs. The only way we will all survive this is if we work together, and document as much as we can.\n\nIn this case, [Mustafa Suleyman](https://en.wikipedia.org/wiki/Mustafa_Suleyman) was the person being called out, that ultimately resulted in the firing of Ibtihal. And Vaniya spoke out while [Satya](https://en.wikipedia.org/wiki/Satya_Nadella) was speaking, sending a follow up email afterward.\n\nMicrosoft is complicit in the death of many children, women, and other people in Palestine. Where else have they contributed to the death of others?",
                "Unsurprising employees don’t usually get to dictate what companies can do especially regarding multi million dollar deals. \n\nAt the same time the software engineer job market is so saturated that they’ll fill these job posts almost immediately if they wanted to.",
                "Sure is looking more and more like Benji is the puppet master fucking with global lives right now.",
                "United States of AIPAC."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now",
            "external_url": "https://edition.cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump/index.html",
            "upvotes": 3941,
            "date": "04/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21484239-3434220-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The unsigned decision in the case, the most closely watched emergency appeal pending at the Supreme Court, lets Trump invoke the 1798 law to speed removals while litigation over the act’s use plays out in lower courts. The court stressed that people deported going forward should receive notice they are subject to the act and an opportunity to have their removal reviewed.\n\nThis strikes me as SCOTUS knowing it won't stand up, but wanting to give the administration more time to mass deport people until the cases play out in the lower courts and actually require a final decision from them. It's the same thing they did with the presidential immunity case. Delay enough that the damage is done by the time they make a decision.\n\n\n> The court’s three liberal justices dissented from the decision, and Justice Amy Coney Barrett, a member of the court’s conservative wing, partially dissented.\n\nAmy Coney Barrett being the dark horse. I know it's only a partial dissent, but of the conservative justices, she's seemed the most likely to not go blindly along.",
                "OFC they are. They are Trump puppets.",
                "Oh, is this the same Supreme Court that gave Trump broad immunity from prosecution for illegal acts he committed during his time as President?",
                "This order is going to immediately be abused despite everyone knowing what’s going to happen.  The Supreme Court just shit its pants and leaving us with the mess.  If you look like someone who could be deported. you might want to start carrying information that proves your citizenship, but let’s be real it probably won’t matter to ice.  You can be damn sure that trump and his band of dip ships will do everything in their power to make sure any errors that result in people being harmed won’t be fixed.",
                "The Supreme Court is allowing Trump to break the law and seize unconstitutional power. How dare they disgrace our nation.",
                "\"Supreme Court Anoints Trump Emperor With Power to Arrest and Deport Anyone Without Recourse\"\n\nftfy",
                "\"The only thing necessary for the triumph of evil is for good men to do nothing\" - Edmund Burke. It is not over, far from it. Cowardice of the bureaucracy is not capitulation of the people.",
                "So wait, SCOTUS knows that trump deported at least one legal us citizen with no due process, refuses to bring them home, and says \"yea you can keep doing this, no notes you good\"\n\nBruh, if i screwed up this hard at my job id probably get arrested",
                "I honestly don’t know what’s left to do. I feel so incredibly powerless. Congress is filled with cowards, and that’s it. I’m so tired of witnessing shit after shit in my lifetime.",
                "This should remove any doubt to anyone who thought the Supreme Court would be worth a damn."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Mother and three kids released by Ice after protests from US ‘border czar’s’ hometown | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/07/sackets-harbor-ice-immigration-tom-homan",
            "upvotes": 1468,
            "date": "04/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/257cde6e752b5297ba7fd4645be1555e4869146e/634_523_2953_1772/master/2953.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d30f115b543de1981ef00f13c3c0ed3c",
            "top_comments": [
                "The thing that gets me is how many Americans think this can’t happen to them.",
                "According to ICE, they do everything by the book. The problem is, the book appears to be Mein Kampf.",
                "Never stop fighting. Never.",
                "Imagine what kind of piece of shit you must be to work for ICE.  Absolute trash.",
                "Fuck yeah. When we fight, we win.",
                "I was really worried about those poor kids. So glad they've been released.",
                "Dead serious question — when did the term ‘border czar’ become a thing? I’ve only become aware of it this past election",
                "Next protests need to be a little closer to home for these rats.  Surround the Fox news Bldg in NYC.  Fill this scumbags hometown with people and peacefully beseige his home…why should his family be immune to his depredations?",
                "Protestors need to stay camped out at that POS's house on a constant basis. Terrorizing good families is just not okay. We can't allow it to be normalized.",
                "Nothing will change until a judge locks up Homan and Howoman for kidnapping."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Dire wolf revived through biotech company's de-extinction process",
            "external_url": "https://abcnews.go.com/US/dire-wolf-revived-biotech-companys-de-extinction-process/story?id=120558562",
            "upvotes": 238,
            "date": "04/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d105faea-05e3-49d9-b2b1-8cf994d5b950/wolf-1-ht-er-250407_1744043085429_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Dire wolves were in their own genus, these are genetically modified grey wolves.",
                ">The youngest one is named Khalesi after a character from the fantasy show \"Game of Thrones,\" in which dire wolves play a major role\n\nHouse Stark taking new Ls in 2025.",
                "They're not dire wolves. Theyre standard gray wolves that have had some genetics altered to look like a dire wolf.",
                "Newscientist says grey wolf has 2.4 billion pairs of (\"genes\"edit) which the company should be releasing soon. 0.5% difference from grey wolf means 12 million genomes are different, and they brought it back by just changing 20.\n\ncool but not the same as bringing back.",
                "This is false, stop spamming this article. They aren’t back",
                "Bring back the velociraptors!",
                "Their website is all about getting paid subscribers, showing off their investors, and looks over information.  Looks like a scam doing as little as they have to to get investment dollars.\n\nI'm not saying they aren't doing anything at all, just that they are choosing flash over substance or science.\n\nPlus, Khaleesi for a white dire wolf? Really?\n\nEdit: From their website:  \"In 2014, I asked my friend Elon Musk who he knew who was poised to make profound changes in the field of genomics, and he said: George Church.\", so an investor, whose quote this is from, found the geneticist for the company by asking Elon Musk?  Why would you do that?  I'd ask someone with actual work or knowledge in the field if I was serious about it.  I'd ask Elon if I wanted to know who was famous among investors and rich asshats.",
                "It's a wolf, except it's dire.",
                "Not convinced this is a good idea.",
                "***Insert Jeff Goldblum gif here***"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Pocatello Police shoot autistic teenager while responding to domestic call",
            "external_url": "https://www.kmvt.com/2025/04/07/pocatello-police-shoot-autistic-teenager-while-responding-domestic-call/?outputType=amp",
            "upvotes": 908,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Neighbors said they called the police to help the family de-escalate the situation.\n\nPeople continually say they want police to de-escalate situations like this, but police don't get trained in de-escalation. Over and over again, cities and agencies avoid de-escalation training.\n\nInstead they get [Warrior Training](https://slate.com/news-and-politics/2020/08/warrior-cop-class-dave-grossman-killology.html), where they are trained to treat every situation as a life-and-death situation and everywhere they go they should be watching for threats no matter what the situation is. Thus, every potential threat makes them fear for their life and every potential threat should be met with violence.",
                ">Police officers responded to a physical disturbance at a property in Pocatello at 5:25 p.m. on Saturday, according to a press release from the Pocatello Police Department. Police said it was reported that the boy lying on the ground was “intoxicated and in possession of a knife.\"\n\n>Police shot Victor Perez, 17, shortly after arriving at the scene when Perez stood up from the ground. The boy’s family told our sister station, Local News 8, that officers shot him nine times.The family told Local News 8 that Perez had behavioral incidents in the past due to his condition. Neighbors said they called the police to help the family de-escalate the situation.\n\nShooting a 17 year old kid who has a knife 9 times...\n\n>“He was not going after police,” said Ana Vazquez, Perez’s aunt. “He (has an) impairment. He can barely walk.”\n\nThis makes it even more stupid. \n\n>Perez is currently being treated at Portneuf Medical Center, according to Local News 8. The medical staff had to cut off the boy’s leg, and he remains in critical condition.\n\nPoor kid. Even if he is lucky enough to survive, he will have to live with one of his legs gone.",
                "Sooner or later people are going to figure out calling the police is almost always a bad idea.",
                "> Neighbors said they called the police to help the family de-escalate the situation.\n\nDon't call the police on anyone you aren't trying to get shot.",
                "Autistic kid with a physical impairment shot nine times by police.\n\nSeems..... exactly like what America represents.",
                "It is 2025. Who the hell is still calling the police and expecting \"de-escalation\"?",
                "If a guy with a knife on the ground is dangerous, what do you call 5 cops wielding firearms and screaming?\n\nIf police fear for their lives because of a knife and use lethal force, shouldn't i be able to use lethal force on a police officer drawing their weapon on me?",
                "I'm starting to cringe when I read that family called the police to \"de-escalate the situation.\" That's like saying you three gasoline on the fire to put it out. The police do not de-escalate. Even when they don't immediately go Medieval, they're just going to get more and more insistent until they're wrestling you to handcuff you.",
                "Don't call the police on anyone you aren't willing to kill. Simple as that. \n\nIf you call the police on someone you're admitting you want an armed response team to come take care of them. \n\nIf you call the police on someone that's mentally disabled and they die because of it you killed them with the call.",
                "And that's why you never call the cops for deescalation. \n\nI know the neighbors meant well but jfc, have you not read the news in decades? Don't fucking call cops when someone is dealing with a mental health crisis unless and until you know they really are a danger to someone else and are willing to accept that they may die."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Gene-edited 'Peter Pan' cane toad that never grows up created to eat its siblings, control invasive species",
            "external_url": "https://www.abc.net.au/news/science/2025-04-08/cane-toad-created-that-never-grows-up-and-eats-its-siblings/105100286",
            "upvotes": 311,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tinkered with, it was *right* there...",
                "This is great and will in no way end in us being conquered and enslaved by an immortal super tadpole; a Frog Emperor of Mankind if you will.",
                "Nothing could go wrong here, correct?",
                "*\"\"I promise it will work* ***this*** *time.\"\"* \\-scientists before introducing another species to australia",
                "The better version of jurassic park. Instead of using frog dna to create 300 ft human destroyers, we just make a bunch of funky frogs",
                "I mean, what's the worst that could happ...\n\nAll Glory to the Hynotoad!",
                "This combined with the dire wolves in Dallas could really take care of the deer population",
                "I don’t remember Peter eating the Lost Boys.",
                "# Ah sweet. Man-made horrors beyond my comprehension",
                "\"Your scientists were so preoccupied with whether or not they could, they didn't stop to think if they should.\""
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Villanova Student Demands Man Who Recorded Her Sexual Assault Not Walk at Graduation",
            "external_url": "https://www.phillymag.com/news/2025/04/07/juan-eguiguren-villanova-sexual-assault/",
            "upvotes": 2269,
            "date": "04/07/2025",
            "thumbnail": "https://cdn10.phillymag.com/wp-content/uploads/sites/3/2024/08/villanova-rape-sexual-assault-lawsuit-social.jpg",
            "top_comments": [
                "It's insane to me that this guy was never charged with a crime. It's also insane to me that the actual rapist got a plea bargain with zero prison time.\n\nThis isn't a \"he said, she said\" sort of case, there's *actual fucking video of the guy raping an unconscious woman*. There's zero question regarding whether it happened or whether it was consensual. It did and it wasn't. This is an open-and-shut case. Everyone involved should have been charged and very quickly convicted, and all three of them should be sitting in a prison cell at this very moment.",
                "So he not only filmed the assault in her dorm, the rapist and the cameraman removed her unconscious body and dumped her in a bathroom on the ground floor of the dorm..\n\n\nUmmm what the fuck? Why aren't they both rotting in prison?",
                "We, as a society, should not and cannot allow people like this to just walk away. This young woman’s life will never be the same because of what these assholes did to her. And Villanova should be fucking ashamed of themselves already, notwithstanding possibly allowing this guy to walk at graduation. This is a complete failure by the school administration and the so called “justice system” in the US. Women’s rights, and voices, are being taken away every fucking day and I cannot believe there are not more men standing up about this. I have a mother, a wife, a sister, and a niece. Every time I read something like this it pisses me off that some sexual assaulter/rapist just gets to proceed with their lives while the woman is expected to maintain her silence. It’s infuriating, depressing, and sickening all at once. \n\nEdit: I just wrote an email to the Villanova administration imploring them to not allow this rapist to walk at commencement in front of his victim. That would set a tremendously awful precedent. ",
                "> I do have a feeling that this repulsive little man is going to walk across the stage with the rest of us. They’ll read his name. They’ll hand him his diploma. And then he gets to just forget about all this. She’ll never forget.\n\nWe need to start tattooing foreheads or something else permanent, because this is a good point.\n\nThis assault will likely be foundational for the victim, something that shapes the way she lives the rest of her life.\n\nThis guy who recorded and helped dumped her body, along with a third guy who helped \"move her head around\", didn't even get charged with a crime. And the guy who did the actual assaulting didn't even get any jail time.\n\nThey just get to walk away.",
                "name 'em, shame 'em\n\nFuck Juan Eguiguren of Villanova University and Andrew Polun of Towson University for helping and recording the rape of an unconscious woman.\n\nand the biggest fuck you to ELIJAH KATZENELL for raping her. None of these men went to jail for what they did. Disgusting.",
                "Why are any of these rapist still in School much less graduating. They should be in jail.",
                "If they don’t have the moral courage to expel the kid after he recorded and basically participated in a sexual assault, I doubt they’ll suddenly grow it to prevent him from walking at graduation.",
                "The fact that Villanova allowed him to finish his education there is damning.  That's an easy expulsion in my view.  Of COURSE he shouldn't be allowed to walk at the ceremony.",
                "If Villanova does allow Eguiguren to participate in graduation, Edelstein writes that this “would defy basic logic and would be yet another public offense to moral decency concerning victims/survivors of sexual assault… If Villanova bends once more to the wants of an individual who videotaped a rape and moved the body of an unconscious and unsuspecting rape victim, the institution will once again be protecting the wrong student. Respectfully, I cannot fathom that this is where Villanova wishes to draw a line in the sand, and plant its school flag, in favor of an admitted videographer of a rape in Villanova’s dormitory.”",
                "To all the men who wonder why women are afraid of men andwhy they are afraid to report being raped by a man to authorities because the blame is hers and then he is allowed not only to walk free but to be able to walk the stage for graduation is disgusting.\n\nIf I were your friend; I would have a giant sign saying Joe Smith is a rapist as he walked the stage. By the time they drag me out, the message is clear. Everyone will have their camera in hand - I would have one those obnoxious air horns to be sure it becomes part of the graduation memories."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Significant flooding continues to wreak havoc across Kentucky, Tennessee",
            "external_url": "https://www.lpm.org/news/2025-04-07/significant-flooding-continues-to-wreak-havoc-across-kentucky-tennessee",
            "upvotes": 461,
            "date": "04/07/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/fd9bf73/2147483647/strip/true/crop/1620x851+0+115/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2F15%2F1e2e84bc4a418ee75e0828b65854%2Fimg-1743.jpg",
            "top_comments": [
                "KY Gov. Beshear was in this article, but what about TN Gov. Lee?\n\nKentucky was hit harder by this storm, but at least from this article it sounds like people there are hopeful for a quick recovery.",
                " Clearly haven't been raking their rivers properly",
                "More rain coming in 24 hours than the normal amount in 4 months.  A “100 year flood” predicted for several US states.  And FEMA is ready to help… not.  The agency has been shredded by Trump/DOGE.  So to all storm victims, good luck.  You are on your own.",
                "Man. It would be nice if we had a strong federal government that could help its citizens",
                "Well. \n\n\nAt least they'll have lots of their own bourbon to take a bit of the pain away. \n\n\nNobody outside the US is buying that stuff anymore.",
                "This is god punishing them for not supporting LGBTQ+, electing the Antichrist and making enemies with his actual followers. Its clear, god hates Evangelism.",
                "Why is FEMA assisting them?\n\nShouldn’t those states be able to deal with their own problems without being dependent on the federal government to rescue them?\n\nThis seems counter to everything republicans who support Trump stand for.",
                "I suppose this is a good reminder that a bad day can always get worse.",
                "God’s wrath for following the antichrist. Sorry folks ",
                "Wouldn’t it be nice right about now if trump and musk haven’t cut FEMA’s budget?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Microsoft terminates jobs of engineers who protested use of AI products by Israel’s military",
            "external_url": "https://www.nbcnews.com/tech/tech-news/microsoft-terminates-jobs-engineers-protested-use-ai-products-israels-rcna200130",
            "upvotes": 1026,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-france-microsoft-building-2016-ac-721p-48fd45.jpg",
            "top_comments": [
                "Those 2 actually have a backbone. Hope they get picked up by a better company",
                "Unethical policies are a prerequisite for becoming a billion dollar corporation",
                "AIPAC has America in a strangle hold",
                "The headline is correct but also misleading.  Both engineers interrupted the 50th anniversary speeches from Microsoft CEOs to protest.  The first engineer insulted her department CEO and her company.   The second one apparently did the same thing.  Both then fired off executive email carpet bombs.  You will absolutely be canned for doing that.",
                "Unfortunately, I am not entirely surprised by this move.",
                "Every company does things that employees may find unethical. Philip Morris's products have contributed to the deaths of untold millions over the decades and people still work there.",
                "If Ibtihal or Vaniya are on Reddit, they should post the names of their direct upstream leadership. Let's document who is part of the chain responsible for these firings, or other layoffs. The only way we will all survive this is if we work together, and document as much as we can.\n\nIn this case, [Mustafa Suleyman](https://en.wikipedia.org/wiki/Mustafa_Suleyman) was the person being called out, that ultimately resulted in the firing of Ibtihal. And Vaniya spoke out while [Satya](https://en.wikipedia.org/wiki/Satya_Nadella) was speaking, sending a follow up email afterward.\n\nMicrosoft is complicit in the death of many children, women, and other people in Palestine. Where else have they contributed to the death of others?",
                "Unsurprising employees don’t usually get to dictate what companies can do especially regarding multi million dollar deals. \n\nAt the same time the software engineer job market is so saturated that they’ll fill these job posts almost immediately if they wanted to.",
                "Sure is looking more and more like Benji is the puppet master fucking with global lives right now.",
                "United States of AIPAC."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Mother and three kids released by Ice after protests from US ‘border czar’s’ hometown | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/07/sackets-harbor-ice-immigration-tom-homan",
            "upvotes": 1466,
            "date": "04/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/257cde6e752b5297ba7fd4645be1555e4869146e/634_523_2953_1772/master/2953.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d30f115b543de1981ef00f13c3c0ed3c",
            "top_comments": [
                "The thing that gets me is how many Americans think this can’t happen to them.",
                "According to ICE, they do everything by the book. The problem is, the book appears to be Mein Kampf.",
                "Never stop fighting. Never.",
                "Imagine what kind of piece of shit you must be to work for ICE.  Absolute trash.",
                "Fuck yeah. When we fight, we win.",
                "I was really worried about those poor kids. So glad they've been released.",
                "Dead serious question — when did the term ‘border czar’ become a thing? I’ve only become aware of it this past election",
                "Next protests need to be a little closer to home for these rats.  Surround the Fox news Bldg in NYC.  Fill this scumbags hometown with people and peacefully beseige his home…why should his family be immune to his depredations?",
                "Protestors need to stay camped out at that POS's house on a constant basis. Terrorizing good families is just not okay. We can't allow it to be normalized.",
                "Nothing will change until a judge locks up Homan and Howoman for kidnapping."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 217,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "US is transforming into an authoritarian regime right before our eyes.",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "*For the 38-year-old civil rights and criminal defense attorney, it was a daunting experience that he says highlights a troubling phenomenon that's occurring across the United States: Lawyers are getting targeted for handling issues the administration of President Donald Trump disagrees with.*\n\nAnd is there a cause more just than that of the Palestinians?",
                "No. Every American of color with a unique name will be stopped. Whites won't be stopped."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now",
            "external_url": "https://edition.cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump/index.html",
            "upvotes": 3944,
            "date": "04/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21484239-3434220-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The unsigned decision in the case, the most closely watched emergency appeal pending at the Supreme Court, lets Trump invoke the 1798 law to speed removals while litigation over the act’s use plays out in lower courts. The court stressed that people deported going forward should receive notice they are subject to the act and an opportunity to have their removal reviewed.\n\nThis strikes me as SCOTUS knowing it won't stand up, but wanting to give the administration more time to mass deport people until the cases play out in the lower courts and actually require a final decision from them. It's the same thing they did with the presidential immunity case. Delay enough that the damage is done by the time they make a decision.\n\n\n> The court’s three liberal justices dissented from the decision, and Justice Amy Coney Barrett, a member of the court’s conservative wing, partially dissented.\n\nAmy Coney Barrett being the dark horse. I know it's only a partial dissent, but of the conservative justices, she's seemed the most likely to not go blindly along.",
                "OFC they are. They are Trump puppets.",
                "Oh, is this the same Supreme Court that gave Trump broad immunity from prosecution for illegal acts he committed during his time as President?",
                "This order is going to immediately be abused despite everyone knowing what’s going to happen.  The Supreme Court just shit its pants and leaving us with the mess.  If you look like someone who could be deported. you might want to start carrying information that proves your citizenship, but let’s be real it probably won’t matter to ice.  You can be damn sure that trump and his band of dip ships will do everything in their power to make sure any errors that result in people being harmed won’t be fixed.",
                "The Supreme Court is allowing Trump to break the law and seize unconstitutional power. How dare they disgrace our nation.",
                "\"Supreme Court Anoints Trump Emperor With Power to Arrest and Deport Anyone Without Recourse\"\n\nftfy",
                "\"The only thing necessary for the triumph of evil is for good men to do nothing\" - Edmund Burke. It is not over, far from it. Cowardice of the bureaucracy is not capitulation of the people.",
                "So wait, SCOTUS knows that trump deported at least one legal us citizen with no due process, refuses to bring them home, and says \"yea you can keep doing this, no notes you good\"\n\nBruh, if i screwed up this hard at my job id probably get arrested",
                "I honestly don’t know what’s left to do. I feel so incredibly powerless. Congress is filled with cowards, and that’s it. I’m so tired of witnessing shit after shit in my lifetime.",
                "This should remove any doubt to anyone who thought the Supreme Court would be worth a damn."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Villanova Student Demands Man Who Recorded Her Sexual Assault Not Walk at Graduation",
            "external_url": "https://www.phillymag.com/news/2025/04/07/juan-eguiguren-villanova-sexual-assault/",
            "upvotes": 2263,
            "date": "04/07/2025",
            "thumbnail": "https://cdn10.phillymag.com/wp-content/uploads/sites/3/2024/08/villanova-rape-sexual-assault-lawsuit-social.jpg",
            "top_comments": [
                "It's insane to me that this guy was never charged with a crime. It's also insane to me that the actual rapist got a plea bargain with zero prison time.\n\nThis isn't a \"he said, she said\" sort of case, there's *actual fucking video of the guy raping an unconscious woman*. There's zero question regarding whether it happened or whether it was consensual. It did and it wasn't. This is an open-and-shut case. Everyone involved should have been charged and very quickly convicted, and all three of them should be sitting in a prison cell at this very moment.",
                "So he not only filmed the assault in her dorm, the rapist and the cameraman removed her unconscious body and dumped her in a bathroom on the ground floor of the dorm..\n\n\nUmmm what the fuck? Why aren't they both rotting in prison?",
                "We, as a society, should not and cannot allow people like this to just walk away. This young woman’s life will never be the same because of what these assholes did to her. And Villanova should be fucking ashamed of themselves already, notwithstanding possibly allowing this guy to walk at graduation. This is a complete failure by the school administration and the so called “justice system” in the US. Women’s rights, and voices, are being taken away every fucking day and I cannot believe there are not more men standing up about this. I have a mother, a wife, a sister, and a niece. Every time I read something like this it pisses me off that some sexual assaulter/rapist just gets to proceed with their lives while the woman is expected to maintain her silence. It’s infuriating, depressing, and sickening all at once. \n\nEdit: I just wrote an email to the Villanova administration imploring them to not allow this rapist to walk at commencement in front of his victim. That would set a tremendously awful precedent. ",
                "> I do have a feeling that this repulsive little man is going to walk across the stage with the rest of us. They’ll read his name. They’ll hand him his diploma. And then he gets to just forget about all this. She’ll never forget.\n\nWe need to start tattooing foreheads or something else permanent, because this is a good point.\n\nThis assault will likely be foundational for the victim, something that shapes the way she lives the rest of her life.\n\nThis guy who recorded and helped dumped her body, along with a third guy who helped \"move her head around\", didn't even get charged with a crime. And the guy who did the actual assaulting didn't even get any jail time.\n\nThey just get to walk away.",
                "name 'em, shame 'em\n\nFuck Juan Eguiguren of Villanova University and Andrew Polun of Towson University for helping and recording the rape of an unconscious woman.\n\nand the biggest fuck you to ELIJAH KATZENELL for raping her. None of these men went to jail for what they did. Disgusting.",
                "Why are any of these rapist still in School much less graduating. They should be in jail.",
                "If they don’t have the moral courage to expel the kid after he recorded and basically participated in a sexual assault, I doubt they’ll suddenly grow it to prevent him from walking at graduation.",
                "The fact that Villanova allowed him to finish his education there is damning.  That's an easy expulsion in my view.  Of COURSE he shouldn't be allowed to walk at the ceremony.",
                "If Villanova does allow Eguiguren to participate in graduation, Edelstein writes that this “would defy basic logic and would be yet another public offense to moral decency concerning victims/survivors of sexual assault… If Villanova bends once more to the wants of an individual who videotaped a rape and moved the body of an unconscious and unsuspecting rape victim, the institution will once again be protecting the wrong student. Respectfully, I cannot fathom that this is where Villanova wishes to draw a line in the sand, and plant its school flag, in favor of an admitted videographer of a rape in Villanova’s dormitory.”",
                "To all the men who wonder why women are afraid of men andwhy they are afraid to report being raped by a man to authorities because the blame is hers and then he is allowed not only to walk free but to be able to walk the stage for graduation is disgusting.\n\nIf I were your friend; I would have a giant sign saying Joe Smith is a rapist as he walked the stage. By the time they drag me out, the message is clear. Everyone will have their camera in hand - I would have one those obnoxious air horns to be sure it becomes part of the graduation memories."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Sailor killed in Pearl Harbor attack finally ID'd 84 years later, bringing closure to family",
            "external_url": "https://www.nbcnews.com/news/us-news/sailor-killed-pearl-harbor-attack-finally-idd-84-years-later-bringing-rcna199986",
            "upvotes": 4978,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-Neil-D-Frye-ew-1128a-c15aa1.jpg",
            "top_comments": [
                "“My mom used to say she loved to people watch,” McCrimmon told WHRO. “She would go anywhere she could get a chance to go to a little town and just watch all the men go by to see if she could see Neil.” \n\nthat’s so heartbreaking omg\n\nit’s a shame that only his youngest sister is left and not a couple more of his siblings, but I’m glad there was at least one of them left to see this. Rip",
                "I'm glad his family will finally get some closure. It's insane to think about the scale of death and tragedy of WW2. 80 years later, the DPAA is still IDing unknown remains on an almost daily basis. Theyve made a lot of progress lately with remains from Pearl Harbor and Japanese POW camps.",
                "Just in time for the current admiration to erase his name from history.",
                "Still had a baby face. RIP",
                "He was so young. That's sad",
                "Rest easy brother. We have the watch.",
                "Im so glad he got to come home.",
                "Glad to read some uplifting news today, even if bittersweet. \n\n  \nSadly, the Trump Administration will try to erase him.",
                "Fair winds and following seas Sailor!",
                "Look at that face. We had children saving the world, only for one doddering, diaper-filling old coward to dismantle it."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Chief Justice Roberts pauses deadline for return of Maryland man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/supreme-court-trump-deportation-salvador-maryland-40136c5aa844b6c12ba20ee67ab4df9a",
            "upvotes": 11577,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“The Executive branch may not seize individuals from the streets, deposit them in foreign prisons in violation of court orders, and then invoke the separation of powers to insulate its unlawful actions from judicial scrutiny,”\n\nWho can disagree with this?",
                "UPDATES: \n\n[Chief Justice John Roberts temporarily lifts order requiring Trump administration to un-deport Dilmar Abrego Garcia from a prison in El Salvador by midnight tonight.](https://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/)\nhttps://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/\n\n[Abrego Garcia filed a response already:](https://www.supremecourt.gov/DocketPDF/24/24A949/354927/20250407153131040_2025.04.07%20Respondents%20Opp%20to%20App%20to%20Vacate.pdf)\n\nThe Supreme Court docket doesn't show timestamps, but this was filed around the same time as Chief Justice Roberts' order (which requested a response by tomorrow).",
                "Even if the SC rules against the Trump admin, the fact that they're treating this blatantly illegal and immoral act as the status quo which must stand in the interim is in itself absolutely monstrous.",
                ">But he is no longer in U.S. custody and the government has no way to get him back, the administration argued.\n\nIf this full ordeal passes Supreme Court muster, the Musk/Trump administration can effectively *'memory hole'* anyone. Oopsies we accidentally misplaced [a journalist](https://www.theguardian.com/us-news/2025/apr/07/markwayne-mullin-journalists-violence-comments). Sorry, we accidentally deported a [sitting congresswoman](https://www.axios.com/2025/02/11/ilhan-omar-deport-brandon-gill-fundraisng). It starts here with this.",
                "It would be one thing if we merely deported him where he got off the plane in his home country and we said ‘good luck’. But we took him directly to a notorious prison.",
                "Then, how are they *ever* supposed to come back? Were they sentenced to life in a foreign prison with no due process? Because, let's be clear about what happened; they were not deported. They were imprisoned.",
                "Time for federal courts to start sanctioning and holding DOJ/agency lawyers in contempt. They say they cannot demand someone be returned, but they themselves can spend a night or two in jail to consider it.",
                "**April 19th is the next national day of protest**. Channel the anger into something useful and find a protest near you [here](https://www.fiftyfifty.one) or start one of your own.",
                "Roberts is now complicit in the extrajudicial kidnapping of a man.",
                "This is the death of ALL civil rights. If the courts can't order his return they can't order yours."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Pocatello Police shoot autistic teenager while responding to domestic call",
            "external_url": "https://www.kmvt.com/2025/04/07/pocatello-police-shoot-autistic-teenager-while-responding-domestic-call/?outputType=amp",
            "upvotes": 909,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Neighbors said they called the police to help the family de-escalate the situation.\n\nPeople continually say they want police to de-escalate situations like this, but police don't get trained in de-escalation. Over and over again, cities and agencies avoid de-escalation training.\n\nInstead they get [Warrior Training](https://slate.com/news-and-politics/2020/08/warrior-cop-class-dave-grossman-killology.html), where they are trained to treat every situation as a life-and-death situation and everywhere they go they should be watching for threats no matter what the situation is. Thus, every potential threat makes them fear for their life and every potential threat should be met with violence.",
                ">Police officers responded to a physical disturbance at a property in Pocatello at 5:25 p.m. on Saturday, according to a press release from the Pocatello Police Department. Police said it was reported that the boy lying on the ground was “intoxicated and in possession of a knife.\"\n\n>Police shot Victor Perez, 17, shortly after arriving at the scene when Perez stood up from the ground. The boy’s family told our sister station, Local News 8, that officers shot him nine times.The family told Local News 8 that Perez had behavioral incidents in the past due to his condition. Neighbors said they called the police to help the family de-escalate the situation.\n\nShooting a 17 year old kid who has a knife 9 times...\n\n>“He was not going after police,” said Ana Vazquez, Perez’s aunt. “He (has an) impairment. He can barely walk.”\n\nThis makes it even more stupid. \n\n>Perez is currently being treated at Portneuf Medical Center, according to Local News 8. The medical staff had to cut off the boy’s leg, and he remains in critical condition.\n\nPoor kid. Even if he is lucky enough to survive, he will have to live with one of his legs gone.",
                "Sooner or later people are going to figure out calling the police is almost always a bad idea.",
                "> Neighbors said they called the police to help the family de-escalate the situation.\n\nDon't call the police on anyone you aren't trying to get shot.",
                "Autistic kid with a physical impairment shot nine times by police.\n\nSeems..... exactly like what America represents.",
                "It is 2025. Who the hell is still calling the police and expecting \"de-escalation\"?",
                "If a guy with a knife on the ground is dangerous, what do you call 5 cops wielding firearms and screaming?\n\nIf police fear for their lives because of a knife and use lethal force, shouldn't i be able to use lethal force on a police officer drawing their weapon on me?",
                "I'm starting to cringe when I read that family called the police to \"de-escalate the situation.\" That's like saying you three gasoline on the fire to put it out. The police do not de-escalate. Even when they don't immediately go Medieval, they're just going to get more and more insistent until they're wrestling you to handcuff you.",
                "Don't call the police on anyone you aren't willing to kill. Simple as that. \n\nIf you call the police on someone you're admitting you want an armed response team to come take care of them. \n\nIf you call the police on someone that's mentally disabled and they die because of it you killed them with the call.",
                "And that's why you never call the cops for deescalation. \n\nI know the neighbors meant well but jfc, have you not read the news in decades? Don't fucking call cops when someone is dealing with a mental health crisis unless and until you know they really are a danger to someone else and are willing to accept that they may die."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Gene-edited 'Peter Pan' cane toad that never grows up created to eat its siblings, control invasive species",
            "external_url": "https://www.abc.net.au/news/science/2025-04-08/cane-toad-created-that-never-grows-up-and-eats-its-siblings/105100286",
            "upvotes": 315,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tinkered with, it was *right* there...",
                "This is great and will in no way end in us being conquered and enslaved by an immortal super tadpole; a Frog Emperor of Mankind if you will.",
                "Nothing could go wrong here, correct?",
                "*\"\"I promise it will work* ***this*** *time.\"\"* \\-scientists before introducing another species to australia",
                "The better version of jurassic park. Instead of using frog dna to create 300 ft human destroyers, we just make a bunch of funky frogs",
                "I mean, what's the worst that could happ...\n\nAll Glory to the Hynotoad!",
                "This combined with the dire wolves in Dallas could really take care of the deer population",
                "I don’t remember Peter eating the Lost Boys.",
                "# Ah sweet. Man-made horrors beyond my comprehension",
                "\"Your scientists were so preoccupied with whether or not they could, they didn't stop to think if they should.\""
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Trump administration ends some USAID contracts providing lifesaving aid, officials say",
            "external_url": "https://apnews.com/article/usaid-trump-humanitarian-aid-1167e0f64dde9ab6cafa0d5e0b812710",
            "upvotes": 944,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The newly terminated contracts were among about 900 surviving programs that Secretary of State Marco Rubio had notified Congress he intended to preserve, the USAID official said.\n\nThese idiots couldn't coordinate their way out of a well lit tunnel with exit signs.",
                "The US response to the Thailand/Myanmar quakes was... something.  Instead of providing hundreds of personnel to deal with rescue and immediate needs, we sent 3.  That were laid off mid-mission.",
                "Their acceptance that humanitarian aid are part of a liberal agenda is ok with me. \n\nOwn it republicans, you guys are evil.",
                "He’s going to need that money for his golf game tomorrow.",
                "Be nice if the title stopped after the first 3 words",
                "And these food aids were being bought by the government from American farmers that voted red 🤷🏾‍♂️",
                "Trump litmus test: Does it benefit the ultra rich?\n\nThat is how to define the whole GOP platform, use religious fanaticism to distract and attract voters, then enact laws a greedy immoral CEO would want.  Eliminate any laws or regulations that a greedy immoral CEO would dislike. That perfectly describes everything they are doing.",
                "Food for Lebanon, Jordan, and Syria.  I feel bad for Jordan, but maybe that is intended for Syrian refugees.  Those countries should be getting food from Iran, Russia, and other fellow Arab states?  Or Europe?",
                "Like usual, Republicans again showing they’re not pro life.",
                "Can't vote against them if you're dead!"
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "04/08/2025 00:40:48 UTC"
}