{
    "posts": [
        {
            "category": "HOT",
            "title": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers",
            "external_url": "https://www.theguardian.com/us-news/2025/may/21/unitedhealth-nursing-homes-payments-hospital-transfers?CMP=oth_b-aplnews_d-1",
            "upvotes": 22483,
            "date": "05/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6cfea175f2c210fdf7f1b2e96df3618135210fa1/0_0_3000_2400/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=477cefc705ba471cf3c3e308933a0cbd",
            "top_comments": [
                "Not shocking the UNH is actively trying to reduce quality of care because they are a company whose sole motivation is to optimize for profit.",
                "That CEO killed a lot more than one person.",
                "Every day is one day closer to this shit stain of a company going down in flames. Hopefully.",
                "Prison. This act had to result in deaths.",
                "But he’s a father! They were surprised by the public’s reaction to the CEOs death but this will unlikely get the same coverage despite being way worse than the murder of one man. Torture and suffering orchestrated for share holders is the real crime here.",
                "This is just downright evil:\n\n> Two current and three former UnitedHealth nurse practitioners told the Guardian that UnitedHealth managers pressed nurse practitioners to persuade Medicare Advantage members to change their “code status” to DNR even when patients had clearly expressed a desire that all available treatments be used to keep them alive.\n\nDNR and DNI are great and everyone should be given the opportunity to register that preference. But it is critical that people choose freely and without pressure or bias from medical staff and that their true wishes are what is reflected in their chart. Otherwise it invites murder via withdrawal of lifesaving medical care.",
                "The fine they are going to pay will surely be a deterrent in the future. Surely.\n\n/s",
                "Is anyone going to do anything about it? Of course not. Punishment is for the poors.",
                "To those united nurse employees who spoke out and brought light to this: thank you. Your bravery could have helped save hundreds of lives.",
                "Healthcare for profit should be illegal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 9207,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "Upon hearing the news, Democratic leadership began feverishly drawing up plans to install him into a higher position in leadership.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "I guess that's one way for Democrats to finally usher in the new generation of representatives.",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 1153,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "What backward country was this in?\n\nOh.",
                "Microbiologist here: OH GOD",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "Shakira wasn’t the only thing going viral that night.",
                "Sometimes I feel like I’m the only aware person in the world and I’m being watched in a simulation"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US judge says deportations to South Sudan likely violate court order",
            "external_url": "https://www.reuters.com/world/immigrant-rights-advocates-claim-us-violated-court-order-by-deporting-migrants-2025-05-20/",
            "upvotes": 19260,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sick and tired of judges stating that their orders are being violated and doing nothing more than politely asking for more information. \n\nLock someone up for contempt or STFU already",
                "Until there are consequences, Trump will continue violating the law at his pleasure.\n\n\nAnd there will be no consequences.",
                "Always “likely” or “alleged” or “potentially”.  Right up until the end",
                "We need to come up with a new term for this.\n\nWhen I read \"deport,\" I think of a person being returned to their home country so they can resume their old life... not sent into the middle of a civil war 7000 miles away from anyone they know.",
                "*The US government's travel advisory states \"do not travel to South Sudan due to crime, kidnapping, and armed conflict\".*\n\nOf those immigrants send there, none are from S. Sudan, so obviously this is some illegal retribution.",
                "“The court has no army”",
                "\"The President of the United States is illegally deporting people to a dangerous country with an active travel advisory issued directly from the US State Department due to possibility of armed conflict and civil unrest\"\n\nFixed that for you, fucking idiots at Reuters.",
                "When I read the headline I thought they were deporting people from South Sudan back to their country - but no! That would be bad enough if they're refugees, but the US government is actually deporting immigrants *from completely different countries* to one of the most war-torn, dangerous places in the world.\n\nThe cruelty is the point.",
                "Why the fuck is it always “likely” and “possibly” and “potentially” when this guy does something? Fucking journos.",
                "And so what? Not like anyone is going to do anything about it"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "24-year-old man arrested after posing as 16-year-old high school student: Police",
            "external_url": "https://abcnews.go.com/US/24-year-man-arrested-after-posing-16-year/story?id=122004305",
            "upvotes": 876,
            "date": "05/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/73597d59-db44-4d88-b8a1-89d18d9e2aba/labrador-anthony-woodcountysheriff-mf-20250520_1747771876392_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Kind of pathetic that the 24 year old has to play on the jv team. Couldnt even make the varsity roster.",
                ">He also told the school that he was a victim of human trafficking, police said.\n\nHe got setup with a caring family that helps real kids in his exact situation and went to high school like it was no big deal. \n\n>Then on May 14, the Melfreds were contacted by a woman, Evelyn Camacho, who stated that Labrador was \"actually a 24-year-old and he was the father of her child,\" police said. Camacho sent the Melfreds a picture of Labrador's driver's license with a birthdate of March 27, 2001, along with Facebook pictures of her with Labrador and a small child, police said.\n\nThat's despicable. Aside from the fraud, he ran from his baby.",
                "Well that was a wild read.",
                "But Channing Tatum and Jonah hill are allowed to do it?",
                "It's legal when Hollywood does it. Jeez double standards /s",
                "Fun fact, the movie Fast Times At Ridgemont High was based on a book written by an author who did this and then wrote a book based on his experiences.",
                "This is just the plot of Never Been Kissed",
                "How do you do, fellow kids?",
                "Get him a show on the WB.",
                "They just busted 3 kids in a trench coat walking around that school yesterday."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "19-year-old accused of largest child data breach in U.S. agrees to plead guilty to federal charges",
            "external_url": "https://www.nbcnews.com/tech/security/alleged-hacker-largest-breach-us-childrens-data-agrees-plead-guilty-rcna207963",
            "upvotes": 1013,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250520-powerschool-mn-1135-c9c57a.jpg",
            "top_comments": [
                "Focusing on the '19 year-old' part in the headline made it sound like this was a bumbling teen who accidentally gained access to data and inadvertently held onto it. \n\nThis person tried out a stolen username and password on a digital school system's site and got in. It could have ended there, but they proceeded to use this access to download over 60 million childrens' personal data, including names, addresses, and SSNs. Then extorted the company for millions to 'delete' the data. Then after the company sadly paid the ransom, they found out that the data had been distributed to others.\n\nIt's textbook cybercrime and he probably took the plea so he wouldn't get *annihilated* in court. His sentence will be less than a decade, which isn't unreasonable considering the damage.",
                "You wanna tell me why an account with access to 60 million SSNs doesn't have 2FA?",
                "So with one pass word and user name he was able to access all the data for 60 million children? Sounds like they need to rework that entire system",
                "Agrees to work for DOGE as part of plea deal.",
                "My child uses PowerSchool, it’s quite popular and some school systems have their socials on it, mine didn’t, but it was just dumb luck.",
                "State of TX does not care about database breach, it is using this company in its run-up to Vouchers.   parents should be made aware of this, many won't care about this...now.",
                "PowerSchool said in a statement May 7. “We sincerely regret these developments — it pains us that our customers are being threatened and re-victimized by bad actors.”\n\n\nAs if they are magically not responsible for their own data security... \n\n\nThe ease and simplicity of the hack are breathtaking. The hacker logged in with an employee's credentials.\n\n\nIt could have been prevented by something as simple and straightforward and common as two-factor auth. \n\n\nHow much do you want to bet 2FA was suggested, but got shot down to save a few bucks?",
                "Our next head of DOGE!",
                "Plot twist, the hacker went under the handle “Zero_Cool”",
                "i thought 19 was an adult, now its Largest child. /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US must keep control of migrants sent to South Sudan in case removals were unlawful, judge rules",
            "external_url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-300e8c704402e2cb3c920d251b7fa876",
            "upvotes": 5061,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Or what?\n\nThere aren't consequences for their actions.  We hear big talk, but no action.  This administration is testing the waters and currently, not a damn thing is happening.",
                "They're just going to ignore this ruling, again.",
                "Hmmm when was the last time any of these rulings were followed or enforced. They're just words now.",
                "Imagine living your life like back in August just chilling and now you’re in South Sudan because of an election",
                "Sudan WTF is going on? Our country is lost.",
                "Our country is being run by amoral idiots.",
                "“If unlawful” are you fucking kidding me? They were ordered NOT to do this. It IS unlawful. Once again, the judicial branch just kind of shrugs at ignoring court orders because they can’t fathom the idea that people just ignore judges and laws now…",
                "Pretty sure that is human trafficking which is already unlawful.\n\nSo... Good job judge?",
                "I'm sorry but WTF am I reading here?",
                "In case removals were unlawful? Removing any migrant to a third-party nation is unlawful."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 586,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                "Firehose of fascist evil. Every fucking day.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "what is the breaking point for the american people",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "KKKaren making sure she protects her klan.",
                "I didn’t expect to police to discontinue being bastards under this administration anyway."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Reddit bans an anti-natalist group after Palm Springs explosion",
            "external_url": "https://www.nbcnews.com/tech/internet/reddit-bans-anti-natalists-palm-springs-explosion-rcna207677",
            "upvotes": 4974,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-palm-springs-fertility-clinic-ew-1108a-96a0f2.jpg",
            "top_comments": [
                "First time hearing of this sub.",
                ">On Monday, a Reddit spokesperson confirmed to NBC News that it had banned the r/Efilism subreddit after the explosion, which killed the suspect and injured four other people. Other anti-natalist subreddits remain on the platform.\n\nIf there's one thing Reddit wants to avoid, it's to be a staging platform for violence.",
                "I used to like lurking in that sub from time to time to remind myself what _bad_ weird looks like.",
                "I’ve never heard of anti natalists. I assume they’re the opposite of the “pro birth” crowd?",
                "Read up on efilism : [https://ia804500.us.archive.org/5/items/antinatalist-community-letter-1/Antinatalist%20Community%20Letter%20%281%29.pdf](https://ia804500.us.archive.org/5/items/antinatalist-community-letter-1/Antinatalist%20Community%20Letter%20%281%29.pdf)\n\nthere seems to be a split between the antinatalist community (wants population to decrease) and Efilist community (wants to violently kill humans and animals). So this person was likely in the Efilist community - something I hadn't heard about until reading up on this event.\n\nI had stumbled across natalist and antinatalist communities on reddit and both seem a bit crazy, but efilism is downright a terrorist movement",
                "reddit did something about extremists? BULLSHIT",
                "Reddit can created a shit ton of domestic terrorist this year",
                "Another shit storm fueled by the internet. My buddy says religion is the best and worst thing to ever happen to humanity. It initially brought people together and allowed them to do things that otherwise wouldn't have been possible. But it also brought them together and allowed them to create absolute horrors as well.\n\nThe internet might as well be religion 2.0",
                "If that is the case, they need to go back to any coverage of True Detective Season 1 and much of Rust's dialogue, because Pizzolato lifted his philosophy from Thomas Ligotti in his [*The Conspiracy Against the Human Race*](https://en.wikipedia.org/wiki/The_Conspiracy_Against_the_Human_Race).",
                "How about some more bans for the subs of people supporting exile to South Sudan?\n\n\nOh, silly me for even asking."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 427,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Conservatives are weirdly obsessed with genitals and what people do in private.\n\nBunch of fucking sickos.",
                "let's go out of our way to disenfranchise the most loyal members of our country who volunteer to serve....\n\nman we are go so far backwards so quickly",
                "“The Army considered a person's sex to be \"unchanging during a person's life,\" it said, echoing a February 26 Pentagon memo.”",
                "\"A good use of money\" say the conservatives."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US singer Chris Brown granted bail by UK court ahead of his world tour",
            "external_url": "https://www.abc.net.au/news/2025-05-21/us-singer-chris-brown-granted-bail-by-uk-court/105321194",
            "upvotes": 9,
            "date": "05/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/68e979f58b33b0ae3997834e2e45aeb4?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                ">US singer Chris Brown has been granted bail by a UK court, clearing the way for his world tour to begin next month.\n\n>Brown has been charged with allegedly inflicting grievous bodily harm on music producer Abraham Diaw with a tequila bottle in a London nightclub in 2023.\n\n>The 36-year-old has not yet been asked to enter a plea to the charge.\n\nHe paid £5M ($6.7M) to get out on bail in case anyone was wondering how much the world tour needed to make.",
                "When you're a star, they let you do it.",
                "Is Tyler the Creator still someone they won't even let enter the country or did that ban get lifted? Seems... interesting to ban someone over words in songs while being softer than grandfather cocks on someone who's acted violently for years.",
                "Totally makes sense for a repeat violent offender with the means to flee."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 427,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Conservatives are weirdly obsessed with genitals and what people do in private.\n\nBunch of fucking sickos.",
                "let's go out of our way to disenfranchise the most loyal members of our country who volunteer to serve....\n\nman we are go so far backwards so quickly",
                "“The Army considered a person's sex to be \"unchanging during a person's life,\" it said, echoing a February 26 Pentagon memo.”",
                "\"A good use of money\" say the conservatives."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 582,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                "Firehose of fascist evil. Every fucking day.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "what is the breaking point for the american people",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "KKKaren making sure she protects her klan.",
                "I didn’t expect to police to discontinue being bastards under this administration anyway."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 1147,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "What backward country was this in?\n\nOh.",
                "Microbiologist here: OH GOD",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "Shakira wasn’t the only thing going viral that night.",
                "Sometimes I feel like I’m the only aware person in the world and I’m being watched in a simulation"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US must keep control of migrants sent to South Sudan in case judge orders them back",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-5-21-2025",
            "upvotes": 189,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Spoiler: They did not",
                "Trump will 100% defy this order just like he has with all the others. At this point he's basically untouchable and he knows it.",
                "Best we can do is….NOT - Trump administration",
                "Uh huh. Good luck with that.",
                "Yeah, that's not going to happen. They were trafficked.",
                "Who are they trying to fool???? It’s a one way ticket.",
                "Or what? What are they gonna do if they don’t?",
                "LOL, have the courts not figured out that they have ceded ALL of their power?  The Judicial Branch is dead.  The Legislative Branch is on its last legs.  Republicans are not going to do anything about any of it, and Democrats are spineless pussies who can't even unify behind action."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A Philippines island defying Beijing in the South China Sea",
            "external_url": "https://www.bbc.com/news/articles/cdxkkvw8r4no",
            "upvotes": 64,
            "date": "05/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/88f4/live/cf2c39f0-3585-11f0-aedf-518c5a57e6bb.png",
            "top_comments": [
                "« Toute la mer de Chine méridionale est contrôlée par Pékin… Toute ? Non ! Une petite île peuplée d’irréductibles Philippins résiste encore et toujours à l’envahisseur ! »",
                "Imagine Beijing turn it into a whorehouse like America turned Angles city into one."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "24-year-old man arrested after posing as 16-year-old high school student: Police",
            "external_url": "https://abcnews.go.com/US/24-year-man-arrested-after-posing-16-year/story?id=122004305",
            "upvotes": 878,
            "date": "05/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/73597d59-db44-4d88-b8a1-89d18d9e2aba/labrador-anthony-woodcountysheriff-mf-20250520_1747771876392_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Kind of pathetic that the 24 year old has to play on the jv team. Couldnt even make the varsity roster.",
                ">He also told the school that he was a victim of human trafficking, police said.\n\nHe got setup with a caring family that helps real kids in his exact situation and went to high school like it was no big deal. \n\n>Then on May 14, the Melfreds were contacted by a woman, Evelyn Camacho, who stated that Labrador was \"actually a 24-year-old and he was the father of her child,\" police said. Camacho sent the Melfreds a picture of Labrador's driver's license with a birthdate of March 27, 2001, along with Facebook pictures of her with Labrador and a small child, police said.\n\nThat's despicable. Aside from the fraud, he ran from his baby.",
                "Well that was a wild read.",
                "But Channing Tatum and Jonah hill are allowed to do it?",
                "It's legal when Hollywood does it. Jeez double standards /s",
                "Fun fact, the movie Fast Times At Ridgemont High was based on a book written by an author who did this and then wrote a book based on his experiences.",
                "This is just the plot of Never Been Kissed",
                "How do you do, fellow kids?",
                "Get him a show on the WB.",
                "They just busted 3 kids in a trench coat walking around that school yesterday."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Canada discusses joining US Golden Dome missile defence programme",
            "external_url": "https://www.bbc.com/news/articles/cy4ee9jmk17o",
            "upvotes": 109,
            "date": "05/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eba0/live/bc8db7e0-363b-11f0-a37a-396a0d1059f3.jpg",
            "top_comments": [
                "Canada, the golden dome is a disaster of an investment.",
                "Regan tried this dumb shit in 1983. It was a giant fraud. Trump tried to restart it in 2019, more fraud. Trump says, we don't need nukes anymore because Russia is our friend. Trump now needs a missile defense dome, but not nukes? What a fucking crock of shit. This will end up being a giant fraud where Trump's friends get giant contracts and deliver nothing. They're robbing us blind.",
                "We are already part of NORAD. I'm sure these two programs will be connected.",
                "It would be nice if the US stopped acting like an enemy country before we agree to make shared military investments with them.",
                "Talks are normal. Trusting trump to follow the contract as negotiated is not. If they control the dome and accidentally turns it off when putin says so is a possibility.",
                "Only way I would be on board is if Trump has to STFU as part of the deal. And not just about Canada, about everything.",
                "I'm so happy we'll FINALLY be able to live our lives without the constant missile attacks here in the U.S.",
                "\"Canadians gave the prime minister a strong mandate to negotiate a comprehensive new security and economic relationship with the United States,\" said Audrey Champoux, a spokesperson for Carney.",
                "Canada will invest in NORAD as part of this thing.",
                "Don’t. Dont do it. You’re dealing with an evil, grifting conman who knows no bottom. If Canada decides to participate in this, they’ll deserve how badly they’ll get screwed."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 9207,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "Upon hearing the news, Democratic leadership began feverishly drawing up plans to install him into a higher position in leadership.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "I guess that's one way for Democrats to finally usher in the new generation of representatives.",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Family mourns boy killed by Israeli strike as he searched for bread",
            "external_url": "https://www.nbcnews.com/world/israel/israel-gaza-war-hamas-aid-warning-united-nations-starvation-famine-rcna208159",
            "upvotes": 690,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Ashraf-Mahmoud-death-RS-2dab85.jpg",
            "top_comments": [
                "All for bread. Such a shame. Poor little guy. RIP",
                "how soon until the thread is locked?",
                "And yet, some genocide apologist will somehow make this about Hamas. Fucking freaks.",
                "[removed]",
                "They will be claiming that he was out to scout their innocent diaper force and plant bombs. Sad times we live in.",
                "We need to keep the boycott on these Israel companies. This is so horrible.",
                "There was a gun in the bread and a Hamas member in the milk jug. It’s justified.",
                "But it's a war!!! Isn't Isreal able to defend itself!!! You believe the hamas propaganda?!?!?!? DO YOU EVEN CONDEMN OCT 7TH!!!!!!!!!! \n \ndid I miss any?",
                "[removed]",
                "There should be law against this kind of thing…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 585,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                "Firehose of fascist evil. Every fucking day.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "what is the breaking point for the american people",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "KKKaren making sure she protects her klan.",
                "I didn’t expect to police to discontinue being bastards under this administration anyway."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 1154,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "What backward country was this in?\n\nOh.",
                "Microbiologist here: OH GOD",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "Shakira wasn’t the only thing going viral that night.",
                "Sometimes I feel like I’m the only aware person in the world and I’m being watched in a simulation"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Family mourns boy killed by Israeli strike as he searched for bread",
            "external_url": "https://www.nbcnews.com/world/israel/israel-gaza-war-hamas-aid-warning-united-nations-starvation-famine-rcna208159",
            "upvotes": 688,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Ashraf-Mahmoud-death-RS-2dab85.jpg",
            "top_comments": [
                "All for bread. Such a shame. Poor little guy. RIP",
                "how soon until the thread is locked?",
                "And yet, some genocide apologist will somehow make this about Hamas. Fucking freaks.",
                "[removed]",
                "They will be claiming that he was out to scout their innocent diaper force and plant bombs. Sad times we live in.",
                "We need to keep the boycott on these Israel companies. This is so horrible.",
                "There was a gun in the bread and a Hamas member in the milk jug. It’s justified.",
                "But it's a war!!! Isn't Isreal able to defend itself!!! You believe the hamas propaganda?!?!?!? DO YOU EVEN CONDEMN OCT 7TH!!!!!!!!!! \n \ndid I miss any?",
                "[removed]",
                "There should be law against this kind of thing…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 435,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Conservatives are weirdly obsessed with genitals and what people do in private.\n\nBunch of fucking sickos.",
                "let's go out of our way to disenfranchise the most loyal members of our country who volunteer to serve....\n\nman we are go so far backwards so quickly",
                "“The Army considered a person's sex to be \"unchanging during a person's life,\" it said, echoing a February 26 Pentagon memo.”",
                "\"A good use of money\" say the conservatives."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "24-year-old man arrested after posing as 16-year-old high school student: Police",
            "external_url": "https://abcnews.go.com/US/24-year-man-arrested-after-posing-16-year/story?id=122004305",
            "upvotes": 878,
            "date": "05/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/73597d59-db44-4d88-b8a1-89d18d9e2aba/labrador-anthony-woodcountysheriff-mf-20250520_1747771876392_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Kind of pathetic that the 24 year old has to play on the jv team. Couldnt even make the varsity roster.",
                ">He also told the school that he was a victim of human trafficking, police said.\n\nHe got setup with a caring family that helps real kids in his exact situation and went to high school like it was no big deal. \n\n>Then on May 14, the Melfreds were contacted by a woman, Evelyn Camacho, who stated that Labrador was \"actually a 24-year-old and he was the father of her child,\" police said. Camacho sent the Melfreds a picture of Labrador's driver's license with a birthdate of March 27, 2001, along with Facebook pictures of her with Labrador and a small child, police said.\n\nThat's despicable. Aside from the fraud, he ran from his baby.",
                "Well that was a wild read.",
                "But Channing Tatum and Jonah hill are allowed to do it?",
                "It's legal when Hollywood does it. Jeez double standards /s",
                "Fun fact, the movie Fast Times At Ridgemont High was based on a book written by an author who did this and then wrote a book based on his experiences.",
                "This is just the plot of Never Been Kissed",
                "How do you do, fellow kids?",
                "Get him a show on the WB.",
                "They just busted 3 kids in a trench coat walking around that school yesterday."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 9207,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "Upon hearing the news, Democratic leadership began feverishly drawing up plans to install him into a higher position in leadership.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "I guess that's one way for Democrats to finally usher in the new generation of representatives.",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers",
            "external_url": "https://www.theguardian.com/us-news/2025/may/21/unitedhealth-nursing-homes-payments-hospital-transfers?CMP=oth_b-aplnews_d-1",
            "upvotes": 22493,
            "date": "05/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6cfea175f2c210fdf7f1b2e96df3618135210fa1/0_0_3000_2400/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=477cefc705ba471cf3c3e308933a0cbd",
            "top_comments": [
                "Not shocking the UNH is actively trying to reduce quality of care because they are a company whose sole motivation is to optimize for profit.",
                "That CEO killed a lot more than one person.",
                "Every day is one day closer to this shit stain of a company going down in flames. Hopefully.",
                "Prison. This act had to result in deaths.",
                "But he’s a father! They were surprised by the public’s reaction to the CEOs death but this will unlikely get the same coverage despite being way worse than the murder of one man. Torture and suffering orchestrated for share holders is the real crime here.",
                "This is just downright evil:\n\n> Two current and three former UnitedHealth nurse practitioners told the Guardian that UnitedHealth managers pressed nurse practitioners to persuade Medicare Advantage members to change their “code status” to DNR even when patients had clearly expressed a desire that all available treatments be used to keep them alive.\n\nDNR and DNI are great and everyone should be given the opportunity to register that preference. But it is critical that people choose freely and without pressure or bias from medical staff and that their true wishes are what is reflected in their chart. Otherwise it invites murder via withdrawal of lifesaving medical care.",
                "The fine they are going to pay will surely be a deterrent in the future. Surely.\n\n/s",
                "Is anyone going to do anything about it? Of course not. Punishment is for the poors.",
                "To those united nurse employees who spoke out and brought light to this: thank you. Your bravery could have helped save hundreds of lives.",
                "Healthcare for profit should be illegal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "19-year-old accused of largest child data breach in U.S. agrees to plead guilty to federal charges",
            "external_url": "https://www.nbcnews.com/tech/security/alleged-hacker-largest-breach-us-childrens-data-agrees-plead-guilty-rcna207963",
            "upvotes": 1023,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250520-powerschool-mn-1135-c9c57a.jpg",
            "top_comments": [
                "Focusing on the '19 year-old' part in the headline made it sound like this was a bumbling teen who accidentally gained access to data and inadvertently held onto it. \n\nThis person tried out a stolen username and password on a digital school system's site and got in. It could have ended there, but they proceeded to use this access to download over 60 million childrens' personal data, including names, addresses, and SSNs. Then extorted the company for millions to 'delete' the data. Then after the company sadly paid the ransom, they found out that the data had been distributed to others.\n\nIt's textbook cybercrime and he probably took the plea so he wouldn't get *annihilated* in court. His sentence will be less than a decade, which isn't unreasonable considering the damage.",
                "You wanna tell me why an account with access to 60 million SSNs doesn't have 2FA?",
                "So with one pass word and user name he was able to access all the data for 60 million children? Sounds like they need to rework that entire system",
                "Agrees to work for DOGE as part of plea deal.",
                "My child uses PowerSchool, it’s quite popular and some school systems have their socials on it, mine didn’t, but it was just dumb luck.",
                "State of TX does not care about database breach, it is using this company in its run-up to Vouchers.   parents should be made aware of this, many won't care about this...now.",
                "PowerSchool said in a statement May 7. “We sincerely regret these developments — it pains us that our customers are being threatened and re-victimized by bad actors.”\n\n\nAs if they are magically not responsible for their own data security... \n\n\nThe ease and simplicity of the hack are breathtaking. The hacker logged in with an employee's credentials.\n\n\nIt could have been prevented by something as simple and straightforward and common as two-factor auth. \n\n\nHow much do you want to bet 2FA was suggested, but got shot down to save a few bucks?",
                "Our next head of DOGE!",
                "Plot twist, the hacker went under the handle “Zero_Cool”",
                "i thought 19 was an adult, now its Largest child. /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "DOJ opens investigation into Andrew Cuomo over pandemic testimony to Congress",
            "external_url": "https://www.cbsnews.com/news/doj-opens-investigation-andrew-cuomo-pandemic-testimony-congress/?ftag=CNM-00-10aac3a",
            "upvotes": 1574,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/26471b9b-4386-4e13-b5c6-117d12f25ddc/thumbnail/1200x630/1662b0b9eace9050377dedd3b785eeec/cbsn-fusion-new-poll-andrew-cuomo-big-lead-new-york-city-democratic-mayoral-primary-thumbnail.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "How many more of these “investigations” are we going to get?",
                "Yep this is what they are worried about instead of the US credit rating and the tanking of the economy.",
                "Of all the legitimate things to investigate Andrew Cuomo for and they're going with the pandemic? Good grief.",
                "Pam Bondi is a corrupt piece of trash.",
                "good news is it wont take long because they have already decided what they will find. thus saving the taxpayers money.",
                "On the one hand, this seems obviously like a political hit job on Cuomo that would favor Trump's lackey Eric Adams. On the other hand, Cuomo does seem like a sleazebag.",
                "Trump 2024: The Petty Little Bitch Revenge Tour\n\nHey DoJ, how about an investigation into the [hundreds of thousands of dead Americans](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) that resulted from trump's first desecration of the white house?",
                "So I guess we will see a lot more investigations into Republicans for lying to Congress?\n\nWe have so much evidence on CSPAN.",
                "Right far more important we address this burning issue totally not the 400 million dollar plane.",
                "Hows the investigation into finding the J6 pipe bomber coming along? Are they on top of that one? Ah, I forgot that’s now officially an innocent day of love and peace that the FBI is completely responsible for any misdeeds that may have occurred. Never mind, it slipped my mind. Divert the resources elsewhere."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US judge says deportations to South Sudan likely violate court order",
            "external_url": "https://www.reuters.com/world/immigrant-rights-advocates-claim-us-violated-court-order-by-deporting-migrants-2025-05-20/",
            "upvotes": 19254,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sick and tired of judges stating that their orders are being violated and doing nothing more than politely asking for more information. \n\nLock someone up for contempt or STFU already",
                "Until there are consequences, Trump will continue violating the law at his pleasure.\n\n\nAnd there will be no consequences.",
                "Always “likely” or “alleged” or “potentially”.  Right up until the end",
                "We need to come up with a new term for this.\n\nWhen I read \"deport,\" I think of a person being returned to their home country so they can resume their old life... not sent into the middle of a civil war 7000 miles away from anyone they know.",
                "*The US government's travel advisory states \"do not travel to South Sudan due to crime, kidnapping, and armed conflict\".*\n\nOf those immigrants send there, none are from S. Sudan, so obviously this is some illegal retribution.",
                "“The court has no army”",
                "\"The President of the United States is illegally deporting people to a dangerous country with an active travel advisory issued directly from the US State Department due to possibility of armed conflict and civil unrest\"\n\nFixed that for you, fucking idiots at Reuters.",
                "When I read the headline I thought they were deporting people from South Sudan back to their country - but no! That would be bad enough if they're refugees, but the US government is actually deporting immigrants *from completely different countries* to one of the most war-torn, dangerous places in the world.\n\nThe cruelty is the point.",
                "Why the fuck is it always “likely” and “possibly” and “potentially” when this guy does something? Fucking journos.",
                "And so what? Not like anyone is going to do anything about it"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/21/2025 16:11:19 UTC"
}