{
    "posts": [
        {
            "category": "HOT",
            "title": "President of El Salvador says he won't return mistakenly deported man to U.S.",
            "external_url": "https://www.nbcnews.com/news/rcna201136",
            "upvotes": 18389,
            "date": "04/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250414-trump-bukele-vl-1156a-ae43d5.jpg",
            "top_comments": [
                "This is a fucking problem.",
                "There are really only a few logical conclusions to draw here. Either:\n\n1. Trump told him to say this to subvert the decision of the courts\n2. He is dead\n3. They dont actually know where he is since record keeping is suspect at best\n\nRegardless, the complete lack of due process here should be extremely concerning to every citizen in the Country, regardless of if they were born in the US or not.",
                "So kidnapping it is then.",
                "So let me get this straight. These people committed no crimes. They were illegally detained and removed from the country against their will. And they're being held in a foreign prison indefinitely with no due process.\nAnd yet they still frame it as deportation and not kidnapping & human trafficking",
                "Visit the US*\n\n*we cannot guarantee you won’t be deported to a prison in El Salvador by mistake.",
                "[ Removed by Reddit ]",
                "I have a growing suspicion the deported man is no longer living...",
                "Imagine some suburban white, Christian MAGA mother of two getting mistakenly deported to one of the world’s worst prisons that violated a court order and Biden not only refused to bring her home, but invited the dictator where the prison was located to the Oval Office and, smiling, shook his hand as the dictator announced he won’t return her.\n\nThere would be an immediate and justifiable impeachment and tens of millions protesting in the streets. There isn’t a single democrat or “liberal” that would support Biden doing this—not one. \n\nThis is Nazi-style fascism, the end of the constitution and rule of law, and the single incident that will be looked back upon by future high schoolers studying US history as the moment the rot of bigotry finally won. \n\nAmerican conservatives are confirming their moral bankruptcy. I will never trust, associate with, or help any of them ever again. Good riddance, diseased leaches.",
                "This is ghastly and immoral. Our country is glad handing and FUNDING a dictator and CNN is writing puff pieces about it.",
                "The baseline for Democrats in 2026 and 2028 should putting these sociopaths on trial and in boxes at ADX Florence the rest of their lives. I want a live stream of every single perp walk. \n\nSet an example or else we’re doing this again in 2032."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Fears over extremism in US military as soldier revealed as neo-Nazi TikTok follower",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/us-military-extremism-the-base",
            "upvotes": 32760,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/06022cc5a489574a13f2c0d9f524b425e88a8fef/0_51_1500_900/master/1500.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=af364b4fcd4b4a90b875795a970167cf",
            "top_comments": [
                "\"But in February, the DoD issued a memo halting a major counter-extremism initiative rooting out white nationalists and far-right influences among servicemen, citing that it was not in line with Donald Trump’s executive orders.\" \nBig yikes",
                "For the last time, he’s not a soldier, he’s secretary of defense.",
                "For the party that complains about being called Nazis, republicans sure have a lot of Nazis.",
                "My experience in the military is it made people more tolerant as it was the first time people mingled with different backgrounds. \n\nThat said, when your job is to protect/kill, you can't be surprised when your governments sanctioned killers got a few screws loose and turn to poisonous warrior-coded ideologies. \n\nNot sure what the answer is, but when your whole being is demonizing and finding faults in certain areas/culture so you can look at terrorism in a shrewd lens, you eventually demonize the population.",
                "I’m more worried about them in the white house",
                "As a euro nobody, let me tell you : this kind of idiot exists in every first world armed forces. To varying degrees. The issue is really how organized and dedicated to their cause they are.",
                "[removed]",
                "Ive seen a lot of people express hope that the military will step up when Trump eventually crosses a line with regards to annexation.\n\nStuff like this should reinforce that is unlikely to happen",
                "Meanwhile Joe Kent is awaiting senate confirmation. Look him up. How does one expect right wing extremism to be tamped down when white christian nationalists are in charge of major intelligence and defense institutions",
                "I'm sure the same people crying about Woke and chamas and all the rest of the talking mouth pieces are going to come out with some really strong statements for the Trump Administration and force them to purge the US military of Nazis, like they are purging it of 'woke ideology' - Right?!?! Because we know how they feel about terrorist sympathizers and college students, so they should feel even more strongly about actual fucking Nazis plotting against the US government hoping for a race war."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "4 Months Into the Year, Chicago Set to Exhaust $82M Annual Budget for Police Misconduct Settlements",
            "external_url": "https://news.wttw.com/2025/04/14/chicago-set-exhaust-annual-budget-police-misconduct-settlements",
            "upvotes": 6587,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely bonkers to me that we haven’t forced police unions to maintain misconduct insurance. Doctors and lawyers have to have malpractice insurance. Why the fuck should taxpayers have to bear the cost of vindicating their rights? And how to we expect to incentivize less misconduct if the actors don’t bear the cost of bad apples?",
                "The fact that there is an annual budget for that in the first place.",
                "End qualified immunity, make officers carry their own liability insurance. You know just like nurses, doctors and other \"professionals\". Always remember this is not $ that falls from the sky, these are YOUR tax paid $$'s.",
                "This is why every other country in the world trains their police force for more than 6 months before giving them a badge and a gun and letting them go play cowboys",
                "Guess they should tap in to the police pension fund right?",
                "Private insurance and make becoming a police officer a substantially more involved process. Like a 4 year degree.",
                "The fix for this is to have each police officer required to carry an insurance against it.  Calculate what the median insurance cost is for all the officers on the force, give everyone a raise to include that amount and let nature takes it course. \n\n\nGood officers will have lower premiums and effectively get a raise out of the deal. \n\n\nBad officers will quickly work themselves out of a job as they are literally uninsurable without using half their pay or more.  ",
                "That’s insane. \n\nAnd it’s all tax payers money, paying for these things. It should come from the cops only. Either their “union” or they need to lay people off by using their own, SET budget for the year. ",
                "Make the cops carry their own misconduct insurance like we do for Medical professionals. If a cop is too expensive to insure because they constant abuse their authority and harm citizens, said cop shouldn’t have a job enforcing the law. ",
                "I guess that means no more misconduct is allowed."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US sees biggest drop in Australian visitors since Covid as travellers avoid Trump’s America",
            "external_url": "https://www.theguardian.com/australia-news/2025/apr/15/us-sees-biggest-drop-in-australian-visitors-since-covid-as-travellers-avoid-trumps-america",
            "upvotes": 1740,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32eb6410fc03cf6fbe66f73498734b5e15bbcbce/0_0_5150_3091/master/5150.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a710af17fcfae470b219b576ff0e3974",
            "top_comments": [
                "why risk being deported to a El Salvador prison for life?",
                "Twice a year, I attend an international conference for engineers. It's always held in the U.S. and attendance can sometimes be as high as 50,000 people. Our last conference was an absolute ghost town. Id be surprised if we cracked 8000 people. We had to cancel committee meetings due to lack of attendance. Literally, not a single Canadian attended that I'm aware of. And I'm used to running into many.",
                "Just imagine going to visit a new country, tasting the food, and ending up in a prison in El Salvador, without due process. The land of freedom, yeah...",
                "> In March 2025 we saw a 7% decline compared to this time last year.\n\nIf you think things are bad, just wait. 93% of Australians still thought it was a good idea to visit the US. We won’t really see the repercussions of many of Trumps changes, especially economic, for at least another quarter. I have a feeling things are going to get worse. Much worse.",
                "Sorry America but your president is a cunt.",
                "First Canada, next EU now Australia. Tourists from Russia or Belarus will be the only ones to visit.",
                "If not dictatorship, why dictatorship shaped?",
                "Good. Stay away. When the fucking White House press secretary says that Trump is exploring if it’s legal to deport US citizens to foreign prisons then it’s lunacy for a non-citizen to step foot in the US. You’re literally risking your own life.",
                "Sorry not gonna take the chance of one douche govt worker putting me in detention for 2 weeks \"because he can\".\n\nGlad to see I wasn't the only one thinking this way.",
                "Killing the tourism industry deader than COVID is great again in America made MAGA manifest."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "China, Vietnam sign deals as Xi visits Hanoi amid US tariff tensions",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinas-xi-meet-vietnam-leaders-kick-off-southeast-asia-tour-amid-us-tariffs-2025-04-14/",
            "upvotes": 3482,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy crap trump is uniting the world....",
                "Good job, dumbass. You drove one of the best alternatives to China into China's arms.",
                "Liberation day was for the world, not the Americans 😂",
                "That's the art of the deal,, if donny don't want to play nice,, he's out of the game.",
                "Trump said Vietnam was begging please sir please sir. He is just full of shit.",
                "This is actually hilarious",
                "It’s so funny watching Trump suck so much that he is turning long time geopolitical rivals like Vietnam and China together. Masterful gambit sir.",
                "This is actually hilarious. Vietnam and China hate each other, and Vietnamese-Americans are the largest Asian group that supports Trump",
                "One potential China Sea /Taiwan war ally gone.        \nThanks Trump.",
                "Please, stop Mr. Trump, I can’t handle all this winning"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 1034,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744306173&w=1920&h=1080",
            "top_comments": [
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "We are a service economy and Trump wants you and your children back in the mines.",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "Good - honestly if he isn't going to announce the end of income taxes, he can fuck right off with his tariffs. He didn't learn in term 1 and got bad advice from unqualified people in term 2. Time to resign in disgrace.",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "Buy millions in Trump Crypto to get relief. Learn from the big boys",
                "Well, they do have legal standing, so it might matter",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "A preliminary 5.2-magnitude earthquake strikes near San Diego",
            "external_url": "https://www.cbsnews.com/losangeles/news/earthquake-strikes-near-san-diego/",
            "upvotes": 1305,
            "date": "04/14/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/14/ae9e409c-ca0e-4f45-b2f7-42f90049a97a/thumbnail/1200x630/647b04c226f65b5d25cb94176944166f/image.png?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "I got a “Drop, cover, hold on. Protect Yourself” alert seconds before and I thought it was a joke. Haven’t felt a shake like that in a while!",
                "I was on a work call and had to awkwardly say “heeeey sorry to interrupt you but I’m in the middle of an earthquake rn, brb”. Also my alert came the second it stopped.",
                "Biggest one I've felt since I moved here in 2003.  \n\nThe alert system worked great. My phone went off and I had just enough time to dive for a doorway",
                "Lived here for 38 years, was one of the strongest I've felt. I have had the MyShake app on my phone for years and never got an alert until today. Phone dinged maybe 5 seconds before the office starting shaking.",
                "So does preliminary mean they’re expecting another one?",
                "Hey we felt it across the border! \n\n@Mexicali, Baja",
                "It was interesting how quickly it was revised from a 6.7 to a 5.1 and now a 5.2. I was looking at the USGS map and it kept changing.",
                "It was a nice little shake here by Coachella.",
                "Trump hasn't fired the seismograph monitors yet?",
                "I was on Coronado. It was pretty mild here, like someone slightly nudged my chair. Love to hear about how it was in actual San Diego."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Cody Balmer was \"harboring hatred\" toward Shapiro before setting fire at Governor's Residence, documents say",
            "external_url": "https://www.cbsnews.com/philadelphia/news/cody-balmer-governors-residence-fire-josh-shapiro-harrisburg/",
            "upvotes": 1759,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/13/a35e635d-1a6b-4478-a65d-dce499693915/thumbnail/1200x630/72eef0eac0b2ba0def67ecf4f2bbb49e/shapiro1.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "What’s with the hammer attack thing? Nancy Pelosi’s husband was also attacked with a hammer",
                "I would imagine most people who set fire to someone's house and plan to assault them with a hammer probably harbor hatred for them.",
                "So I had heard that he intended to use a hammer to bludgeon the governor. I didn't realize it was a *sledgehammer*, as stated in the article. Gruesome shit.",
                "These stories should talk more about which 'influencers' encouraged him to do this.",
                "Where's the president condemning this as terrorism?  \n\nOh, right.  It's not a tesla dealership, but a political rival.  I'm sure he condones it.",
                "I mean, fire bombing is rarely an act of love. Despite what my ex told the judge.",
                "Attacking a Jewish governor during Passover, yet the administration has been eerily quiet about “antisemitism” regarding this event. Interesting given they’re actively arguing they must deport people who organize anti-Israel protests because it’s “antisemitic”.",
                "So here's the question I wish was asked after all of these homegrown terrorism cases:\n\nWho radicized him? And what are we going to do to prevent more from becoming hopelessly radicalized into committing acts of violence?",
                "That's a rough looking 38...",
                "Of course he was but the real question is Why? What did the Governer do to make him so angry he thought his only recourse was assault and burning down his house."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge dismisses charge against North Dakota man accused of impersonating ICE officer",
            "external_url": "https://apnews.com/article/north-dakota-williston-immigration-customs-enforcement-f59feb8e84ff39636cc85dfe2cc49bad",
            "upvotes": 680,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well that's freaking weird",
                "Dismissed likely because it made the police involved in the case look like actual fucking idiots. \n\nTLDR: police arrest a man, they tell him \"ice is coming to pick you up\". Man calls his friend and says \"hey pretend you're ice and come get me\". \n\n*That actually worked.jpeg*",
                "If you didn't read the article, your gut reaction would be this is good old boys taking care of each other. But it was actually a buddy of the prisoner pretending to be ICE  to get him released (and it worked). I wonder if they dropped the charges because a) they quickly got the prisoner back, so no harm done and b) it makes the prison officials look like idiots. We can put you on trial but then we need to publicly unwind how the prisoner was released to some random dude who simply said he was ICE.",
                "I'm assuming that the absolute stupidity of the the real process for this happening is informing this decision. Can't have people having potential vectors to pull anyone out of jail by wearing an ICE uniform.",
                "Dude thought fast, and had a true bro willing to risk it.",
                "Did he actually impersonate an ICE officer tho? Or did he just show up and say “I’m here to pick up so-and-so”, and they just let him go because the cops knew ICE was coming? I could see that as a reason to dismiss it.",
                "This might be funny if it weren't so sad.  ICE is so dodgy-acting that anyone can impersonate them for any reason - malicious or prank.",
                "say what you want but that’s a true friend right there. none of my friends would ever try to impersonate an officer to break me out of custody.",
                "No explanation given for dismissing charges against a person who impersonated an ICE agent in order to break a prisoner out of jail. This is completely fucked.",
                "Somebody's read Robin Hood, Little John did this exact thing to get Robin Hood out of jail"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Menendez brothers' aunt hospitalized after DA shares graphic photos in court: 'We are devastated'",
            "external_url": "https://abcnews.go.com/US/menendez-brothers-aunt-hospitalized-after-da-shares-graphic/story?id=120782064",
            "upvotes": 1074,
            "date": "04/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d30f3f98-a280-432f-8c7d-c05a7b00d053/terry-baralt-abc-jef-250414_1744637652867_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "She is 85 years old and battling cancer. I mean it could be that too",
                ">The family said the graphic display violated Marsy's Law -- California's bill of rights for victims -- specifically noting it states that a victim is entitled \"to be treated with fairness and respect\" and be \"free from intimidation, harassment, and abuse.\"\n\nShe's a victim because her sister died. But she's there to support the accused. Did she never see the evidence in the 30 years before hand?",
                "I mean... it's an investigation into whether or not they should be let out of prison after brutally murdering their parents. Whether or not you believe they should be released or not, you have to expect to see or hear some really intense things in that courtroom. \n\nAlso, the woman is battling cancer. I am sure that has nothing to do with her hospitalization. Absolutely nothing to do with it at all. /s",
                ">Over 20 of their relatives are pushing for their release, arguing they endured horrific abuse, have admitted guilt and apologized, and have used their decades in custody to help others.\n\nSerious question here.  Who have they helped?",
                "Hochman ran on a \"tough on crime\" platform as the DA candidate and has made the Menendez case his cornerstone.",
                "Why would you attend a hearing on whether two murderers are ready for release and not expect an audit of their crimes, even if you believe they are ready? Obviously the other lawyer wants to show that the crimes were so serious, they shouldn't get an early release. I sympathize with old ladies with cancer, but she made the decision to walk into the courtroom, which of course isn't an \"ambush.\"",
                "This is strange because on a normal basis, family members are warned of graphic nature of photos beforehand and are given the choice to step out during that time.  So I am assuming she chose to stay inside the courtroom",
                "I watched the trial. Every minute. They got what they deserved. Not one family member came out about the abuse until 30 years later? No",
                "[ Removed by Reddit ]",
                "Is it odd that so many people knew about the alleged abuse, but it took murder of both parents to bring that detail out for the brothers' defense, not back when they could have been helped?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US sees biggest drop in Australian visitors since Covid as travellers avoid Trump’s America",
            "external_url": "https://www.theguardian.com/australia-news/2025/apr/15/us-sees-biggest-drop-in-australian-visitors-since-covid-as-travellers-avoid-trumps-america",
            "upvotes": 1712,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32eb6410fc03cf6fbe66f73498734b5e15bbcbce/0_0_5150_3091/master/5150.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a710af17fcfae470b219b576ff0e3974",
            "top_comments": [
                "why risk being deported to a El Salvador prison for life?",
                "Twice a year, I attend an international conference for engineers. It's always held in the U.S. and attendance can sometimes be as high as 50,000 people. Our last conference was an absolute ghost town. Id be surprised if we cracked 8000 people. We had to cancel committee meetings due to lack of attendance. Literally, not a single Canadian attended that I'm aware of. And I'm used to running into many.",
                "Just imagine going to visit a new country, tasting the food, and ending up in a prison in El Salvador, without due process. The land of freedom, yeah...",
                "> In March 2025 we saw a 7% decline compared to this time last year.\n\nIf you think things are bad, just wait. 93% of Australians still thought it was a good idea to visit the US. We won’t really see the repercussions of many of Trumps changes, especially economic, for at least another quarter. I have a feeling things are going to get worse. Much worse.",
                "Sorry America but your president is a cunt.",
                "First Canada, next EU now Australia. Tourists from Russia or Belarus will be the only ones to visit.",
                "If not dictatorship, why dictatorship shaped?",
                "Good. Stay away. When the fucking White House press secretary says that Trump is exploring if it’s legal to deport US citizens to foreign prisons then it’s lunacy for a non-citizen to step foot in the US. You’re literally risking your own life.",
                "Sorry not gonna take the chance of one douche govt worker putting me in detention for 2 weeks \"because he can\".\n\nGlad to see I wasn't the only one thinking this way.",
                "Killing the tourism industry deader than COVID is great again in America made MAGA manifest."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Despite a court order, White House bars AP from Oval Office event",
            "external_url": "https://apnews.com/article/trump-ap-press-freedom-court-gulf-caffd32aa8ec6b04a50b8c5277d7c9cb",
            "upvotes": 149,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FoxNews better be yelling and screaming that the Musk/Trump administration is doing this. \n\nPepperidge Farms remembers: [White House attempted to shut out Fox News reporter](https://www.rcfp.org/white-house-attempted-shut-out-fox-news-reporter/)",
                "The trump regime is refusing to follow the rule of law or the constitution. Trumps own personally stacked supreme court has ruled against his actions, and he won't even follow their orders. Trump is a full blown dictator and should face the penalty for treason against the US and its citizens.",
                "It's starting to look like judges don't hold any real power.",
                "Looks like today was the big \"The courts no longer matter\" coming out party.\n\nIirc the report on martial law drops this Sunday so stay tuned for that announcement.",
                "Who could have seen this coming? The pettiest man to ever live being petty? Never!",
                "Dear Other news Agencies: see what you do now is ALL of you boycott until the AP is allowed back in. Just to make sure you understand that. ",
                "Time for all democrats and Republicans to halt all business in the Congress. ALL BUSINESS. \nOr say hello to your favorite  DIK-tator",
                "When do the contempt hearings start?",
                "Curious how this is enforced? Like what would happen if an AP reporter just showed up",
                "or what? just like every other ruling and case against Trump/musk there is no enforcement action if they don't comply. could you imagine you're average citizen ignoring a judges order? \n\n\nwe would be found in contempt and be jailed for several days or until we complied but Trump knows that can't/ wont happen so the order means nothing"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "The United States Army has been stationed at the US-Mexico border.",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-14-2025#00000196-35c6-db04-adbe-f5d75e020000",
            "upvotes": 117,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Last time I saw such an headline was when Russia was stationning their troops on the Ukrainian border, some years ago. :/ Don't let this happen.",
                "This is a live thread that makes this story hard to find. Is this the correct title: \n\n>JUST IN: Army to control land along US-Mexico border as part of a base, which could let troops detain migrants, AP sources say\n\nI didn't see a detailed story with it.",
                "I don't see an article just the headline.",
                "Many will die but this is a sacrifice Trump is willing to make",
                "\"Just going after the \"cartels\" which happen to be held up in the Mexican capital... lead by the Mexican president... so she had a one way ticket to El Salvador....",
                "Interested what the farmers and ranchers have to say when the army absolutely destroys their land for this stunt.",
                ">WASHINGTON (AP) — A long sliver of federal land along the U.S.-Mexico border that President Donald Trump is turning over to the Department of Defense would be controlled by the Army as part of a base, which could allow troops to detain any trespassers, including migrants, U.S. officials told The Associated Press.\n\n>The transfer of that border zone to military control — and making it part of an Army installation — is an attempt by the Trump administration to get around a federal law that prohibits U.S. troops from being used in domestic law enforcement on American soil.\n\n>But if the troops are providing security for land that is part of an Army base, they can perform that function. However, at least one presidential powers expert said the move is likely to be challenged in the courts.\n\n>The officials said the issue is still under review in the Pentagon, but even as any legal review goes on, the administration’s intent is to have troops detain migrants at the border.\n\n>The corridor, known as the Roosevelt Reservation, is a 60-foot-wide federal buffer zone that ribbons along the border from New Mexico to California, except where it encounters tribal or privately owned land. It had been run by the Interior Department until Trump directed control be transferred to the Defense Department in a [presidential memo](https://www.whitehouse.gov/presidential-actions/2025/04/military-mission-for-sealing-the-southern-border-of-the-united-states-and-repelling-invasions/) released Friday night.\n\n>For the next 45 days, the Defense Department will test taking control of a section of the Roosevelt Reservation in New Mexico, east of Fort Huachuca, which is an Army installation in Arizona, one of the U.S. officials said. During that period, the Army will put up additional fencing and signs warning people not to trespass.\n\n>People not authorized to be in that area could be arrested by the Army’s security forces, the officials said, who spoke on condition of anonymity to provide details not yet made public.\n\n>Any migrants in the country illegally who are detained by military personnel on those lands would be turned over to local civilian law enforcement agencies, the officials said.\n\n>It was not clear if the added land would require the military to deploy additional forces to the border. There are about 7,100 active duty troops under federal control currently assigned to the border and about 4,600 National Guard troops under state control.\n\n>Troops are prohibited from conducting civilian law enforcement on U.S. soil under the Posse Comitatus Act. An exception known as the military purpose doctrine allows it in some cases — but would not apply here and would likely be challenged in the courts, said Elizabeth Goitein, an expert on presidential emergency powers at the Brennan Center for Justice.\n\n>That’s because even though troops would be on land designated as an Army installation, they would have to prove that their primary mission there was not to conduct border security and law enforcement — and the whole point of Trump’s order transferring the Roosevelt Reservation to the military’s control is to secure the border, she said.\n\n>The military purpose doctrine “only applies if the law enforcement aspect is incidental,” Goitein said. “Does this (area) have a military purpose that has nothing to do with enforcing customs and security at the border?”\n\nRoosevelt declared the entire reservation during his presidency for the express purposes of keeping the strip of land \"free from obstruction as a protection against the smuggling of goods between the United States and Mexico,\" so Trump setting up a military base there is driving headlong into a court battle. \n\n[https://apnews.com/article/border-trump-roosevelt-military-immigration-85974188a51593351eed70ad26291888](https://apnews.com/article/border-trump-roosevelt-military-immigration-85974188a51593351eed70ad26291888)",
                "Man Boystown would have been a blast in the 70’s",
                "I thought the military was sent to the southern border a couple of months ago to help the Border Patrol?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 1050,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744306173&w=1920&h=1080",
            "top_comments": [
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "We are a service economy and Trump wants you and your children back in the mines.",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "Good - honestly if he isn't going to announce the end of income taxes, he can fuck right off with his tariffs. He didn't learn in term 1 and got bad advice from unqualified people in term 2. Time to resign in disgrace.",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "Buy millions in Trump Crypto to get relief. Learn from the big boys",
                "Well, they do have legal standing, so it might matter",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Months after CEO's killing, a reported intruder is arrested near UnitedHealthcare headquarters",
            "external_url": "https://apnews.com/article/united-health-care-intruder-arrest-minnesta-e65560d6e340677e001ab041f557904e",
            "upvotes": 392,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Damn that’s the most clickbait shit I’ve ever seen. It’s two sentences about the “intruder” who was arrested outside of the campus and it doesn’t even say what he was arrested for. Then it’s like 5 paragraphs replaying the old story. Since this news story is shit. I’ll guess it was someone trying to get their claim coverage and they called the cops on them.",
                "Huh. I teach at a school in a low-income area and lots of Special Ed students. Last week we had an intruder on campus. I don’t remember the AP doing a story on it though.",
                "I've got a new mole hill in my yard, maybe the AP could find a way to make that newsworthy.",
                "was his name bigballz and sent with a thumb drive by a guy leon or something?",
                "Holy fuck deploy the army to protect these angels."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Judge dismisses charge against North Dakota man accused of impersonating ICE officer",
            "external_url": "https://apnews.com/article/north-dakota-williston-immigration-customs-enforcement-f59feb8e84ff39636cc85dfe2cc49bad",
            "upvotes": 682,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well that's freaking weird",
                "Dismissed likely because it made the police involved in the case look like actual fucking idiots. \n\nTLDR: police arrest a man, they tell him \"ice is coming to pick you up\". Man calls his friend and says \"hey pretend you're ice and come get me\". \n\n*That actually worked.jpeg*",
                "If you didn't read the article, your gut reaction would be this is good old boys taking care of each other. But it was actually a buddy of the prisoner pretending to be ICE  to get him released (and it worked). I wonder if they dropped the charges because a) they quickly got the prisoner back, so no harm done and b) it makes the prison officials look like idiots. We can put you on trial but then we need to publicly unwind how the prisoner was released to some random dude who simply said he was ICE.",
                "I'm assuming that the absolute stupidity of the the real process for this happening is informing this decision. Can't have people having potential vectors to pull anyone out of jail by wearing an ICE uniform.",
                "Dude thought fast, and had a true bro willing to risk it.",
                "Did he actually impersonate an ICE officer tho? Or did he just show up and say “I’m here to pick up so-and-so”, and they just let him go because the cops knew ICE was coming? I could see that as a reason to dismiss it.",
                "This might be funny if it weren't so sad.  ICE is so dodgy-acting that anyone can impersonate them for any reason - malicious or prank.",
                "say what you want but that’s a true friend right there. none of my friends would ever try to impersonate an officer to break me out of custody.",
                "No explanation given for dismissing charges against a person who impersonated an ICE agent in order to break a prisoner out of jail. This is completely fucked.",
                "Somebody's read Robin Hood, Little John did this exact thing to get Robin Hood out of jail"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "President of El Salvador says he won't return mistakenly deported man to U.S.",
            "external_url": "https://www.nbcnews.com/news/rcna201136",
            "upvotes": 18367,
            "date": "04/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250414-trump-bukele-vl-1156a-ae43d5.jpg",
            "top_comments": [
                "This is a fucking problem.",
                "There are really only a few logical conclusions to draw here. Either:\n\n1. Trump told him to say this to subvert the decision of the courts\n2. He is dead\n3. They dont actually know where he is since record keeping is suspect at best\n\nRegardless, the complete lack of due process here should be extremely concerning to every citizen in the Country, regardless of if they were born in the US or not.",
                "So kidnapping it is then.",
                "So let me get this straight. These people committed no crimes. They were illegally detained and removed from the country against their will. And they're being held in a foreign prison indefinitely with no due process.\nAnd yet they still frame it as deportation and not kidnapping & human trafficking",
                "Visit the US*\n\n*we cannot guarantee you won’t be deported to a prison in El Salvador by mistake.",
                "[ Removed by Reddit ]",
                "I have a growing suspicion the deported man is no longer living...",
                "Imagine some suburban white, Christian MAGA mother of two getting mistakenly deported to one of the world’s worst prisons that violated a court order and Biden not only refused to bring her home, but invited the dictator where the prison was located to the Oval Office and, smiling, shook his hand as the dictator announced he won’t return her.\n\nThere would be an immediate and justifiable impeachment and tens of millions protesting in the streets. There isn’t a single democrat or “liberal” that would support Biden doing this—not one. \n\nThis is Nazi-style fascism, the end of the constitution and rule of law, and the single incident that will be looked back upon by future high schoolers studying US history as the moment the rot of bigotry finally won. \n\nAmerican conservatives are confirming their moral bankruptcy. I will never trust, associate with, or help any of them ever again. Good riddance, diseased leaches.",
                "This is ghastly and immoral. Our country is glad handing and FUNDING a dictator and CNN is writing puff pieces about it.",
                "The baseline for Democrats in 2026 and 2028 should putting these sociopaths on trial and in boxes at ADX Florence the rest of their lives. I want a live stream of every single perp walk. \n\nSet an example or else we’re doing this again in 2032."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Ex-officer pleads guilty in 150 mph DUI crash that killed UC Riverside student and his parents",
            "external_url": "https://www.sbsun.com/2025/04/11/ex-lapd-officer-pleads-guilty-in-2017-triple-fatal-drunken-driving-crash/",
            "upvotes": 288,
            "date": "04/14/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2024/08/generic-body-found-police-crime-scene-03.webp?w=1024&h=576",
            "top_comments": [
                ">Edgar Verduzco, 34, an off-duty LAPD officer at the time, was driving 150 miles per hour and under the influence of alcohol when he collided with two cars on the 605 freeway.\n\nEven if the victims were traveling at 70 mph in the same direction the difference in speed is so high that it would be like being parked and someone hits you when they're going 80 mph. I hope that guy goes to jail for the rest of his life.",
                "150mph is insane... I guess I didn't even realize a camaro could go that fast, but that's probably because I'm a sensible human being that's never even considered driving anything that fast.",
                "They say ex-officer like he retired or something. He was actively employed by the police department at the time. News publications need to stop doing this.",
                "And he’ll get 25 yrs in prison for it. Three dead people.",
                "Might be a bad take here but its worth discussing.. should those that serve i.e. medical field professionals, firefighters, police officers, corrections officers ect. get harsher punishment than those who didn't take oaths because they are supposed to know better? I mean sure the average person should still know better than to do stupid things that get others killed, but it seems different when you take a position of responsibility and are supposed to be the best of us. let the discussion begin!",
                "It was on the 605 freeway.\n\nI remember folks were going 100+mph on the local roads next to UCR.\n\nRside can be nuts."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "A preliminary 5.2-magnitude earthquake strikes near San Diego",
            "external_url": "https://www.cbsnews.com/losangeles/news/earthquake-strikes-near-san-diego/",
            "upvotes": 1306,
            "date": "04/14/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/14/ae9e409c-ca0e-4f45-b2f7-42f90049a97a/thumbnail/1200x630/647b04c226f65b5d25cb94176944166f/image.png?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "I got a “Drop, cover, hold on. Protect Yourself” alert seconds before and I thought it was a joke. Haven’t felt a shake like that in a while!",
                "I was on a work call and had to awkwardly say “heeeey sorry to interrupt you but I’m in the middle of an earthquake rn, brb”. Also my alert came the second it stopped.",
                "Biggest one I've felt since I moved here in 2003.  \n\nThe alert system worked great. My phone went off and I had just enough time to dive for a doorway",
                "Lived here for 38 years, was one of the strongest I've felt. I have had the MyShake app on my phone for years and never got an alert until today. Phone dinged maybe 5 seconds before the office starting shaking.",
                "So does preliminary mean they’re expecting another one?",
                "Hey we felt it across the border! \n\n@Mexicali, Baja",
                "It was interesting how quickly it was revised from a 6.7 to a 5.1 and now a 5.2. I was looking at the USGS map and it kept changing.",
                "It was a nice little shake here by Coachella.",
                "Trump hasn't fired the seismograph monitors yet?",
                "I was on Coronado. It was pretty mild here, like someone slightly nudged my chair. Love to hear about how it was in actual San Diego."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "British Steel: Government 'confident' Scunthorpe furnaces can be kept firing",
            "external_url": "https://www.bbc.com/news/articles/c807p2xjj8zo",
            "upvotes": 126,
            "date": "04/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d6cd/live/a5408010-18cf-11f0-a84c-b3e2fb64328f.jpg",
            "top_comments": [
                "So this is an actual scunthorpe problem",
                "Would this potentially be an opportunity to build a nuclear powered foundry?\n\nUpdate from using coke to cleaner fuel.\n\nI'm not sure what buying the plant from the Chinese firm would look like, and I hesitate to suggest 'nationalizing' it but if the company that bought it did so in bad faith with the intent to close it that's grounds to start the discussion.",
                "> The site produces the majority of rail tracks used by Network Rail. The company said it does not expect \"any impact on the continued delivery of reliable rail services\" as it built up a stockpile of steel in anticipation of the plant's possible closure.\n\n> On Sunday, Business Secretary Jonathan Reynolds said it \"became clear\" to the government that Jingye was intent on closing down the blast furnaces no matter the financial support offered, prompting it to recall Parliament to pass the emergency law wresting control of the site from its owner.\n\nWow, didn't even offer to buy the company, just voted to steal it. That's a very public step backwards in commercial ownership rights. (Edit) I know the government offered half a billion pounds but when they knew the current owner was going to close, they voted to take it instead of upping their offer to a buyout price."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 1034,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744306173&w=1920&h=1080",
            "top_comments": [
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "We are a service economy and Trump wants you and your children back in the mines.",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "Good - honestly if he isn't going to announce the end of income taxes, he can fuck right off with his tariffs. He didn't learn in term 1 and got bad advice from unqualified people in term 2. Time to resign in disgrace.",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "Buy millions in Trump Crypto to get relief. Learn from the big boys",
                "Well, they do have legal standing, so it might matter",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US sees biggest drop in Australian visitors since Covid as travellers avoid Trump’s America",
            "external_url": "https://www.theguardian.com/australia-news/2025/apr/15/us-sees-biggest-drop-in-australian-visitors-since-covid-as-travellers-avoid-trumps-america",
            "upvotes": 1733,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32eb6410fc03cf6fbe66f73498734b5e15bbcbce/0_0_5150_3091/master/5150.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a710af17fcfae470b219b576ff0e3974",
            "top_comments": [
                "why risk being deported to a El Salvador prison for life?",
                "Twice a year, I attend an international conference for engineers. It's always held in the U.S. and attendance can sometimes be as high as 50,000 people. Our last conference was an absolute ghost town. Id be surprised if we cracked 8000 people. We had to cancel committee meetings due to lack of attendance. Literally, not a single Canadian attended that I'm aware of. And I'm used to running into many.",
                "Just imagine going to visit a new country, tasting the food, and ending up in a prison in El Salvador, without due process. The land of freedom, yeah...",
                "> In March 2025 we saw a 7% decline compared to this time last year.\n\nIf you think things are bad, just wait. 93% of Australians still thought it was a good idea to visit the US. We won’t really see the repercussions of many of Trumps changes, especially economic, for at least another quarter. I have a feeling things are going to get worse. Much worse.",
                "Sorry America but your president is a cunt.",
                "First Canada, next EU now Australia. Tourists from Russia or Belarus will be the only ones to visit.",
                "If not dictatorship, why dictatorship shaped?",
                "Good. Stay away. When the fucking White House press secretary says that Trump is exploring if it’s legal to deport US citizens to foreign prisons then it’s lunacy for a non-citizen to step foot in the US. You’re literally risking your own life.",
                "Sorry not gonna take the chance of one douche govt worker putting me in detention for 2 weeks \"because he can\".\n\nGlad to see I wasn't the only one thinking this way.",
                "Killing the tourism industry deader than COVID is great again in America made MAGA manifest."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Judge dismisses charge against North Dakota man accused of impersonating ICE officer",
            "external_url": "https://apnews.com/article/north-dakota-williston-immigration-customs-enforcement-f59feb8e84ff39636cc85dfe2cc49bad",
            "upvotes": 678,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well that's freaking weird",
                "Dismissed likely because it made the police involved in the case look like actual fucking idiots. \n\nTLDR: police arrest a man, they tell him \"ice is coming to pick you up\". Man calls his friend and says \"hey pretend you're ice and come get me\". \n\n*That actually worked.jpeg*",
                "If you didn't read the article, your gut reaction would be this is good old boys taking care of each other. But it was actually a buddy of the prisoner pretending to be ICE  to get him released (and it worked). I wonder if they dropped the charges because a) they quickly got the prisoner back, so no harm done and b) it makes the prison officials look like idiots. We can put you on trial but then we need to publicly unwind how the prisoner was released to some random dude who simply said he was ICE.",
                "I'm assuming that the absolute stupidity of the the real process for this happening is informing this decision. Can't have people having potential vectors to pull anyone out of jail by wearing an ICE uniform.",
                "Dude thought fast, and had a true bro willing to risk it.",
                "Did he actually impersonate an ICE officer tho? Or did he just show up and say “I’m here to pick up so-and-so”, and they just let him go because the cops knew ICE was coming? I could see that as a reason to dismiss it.",
                "This might be funny if it weren't so sad.  ICE is so dodgy-acting that anyone can impersonate them for any reason - malicious or prank.",
                "say what you want but that’s a true friend right there. none of my friends would ever try to impersonate an officer to break me out of custody.",
                "No explanation given for dismissing charges against a person who impersonated an ICE agent in order to break a prisoner out of jail. This is completely fucked.",
                "Somebody's read Robin Hood, Little John did this exact thing to get Robin Hood out of jail"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Months after CEO's killing, a reported intruder is arrested near UnitedHealthcare headquarters",
            "external_url": "https://apnews.com/article/united-health-care-intruder-arrest-minnesta-e65560d6e340677e001ab041f557904e",
            "upvotes": 390,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Damn that’s the most clickbait shit I’ve ever seen. It’s two sentences about the “intruder” who was arrested outside of the campus and it doesn’t even say what he was arrested for. Then it’s like 5 paragraphs replaying the old story. Since this news story is shit. I’ll guess it was someone trying to get their claim coverage and they called the cops on them.",
                "Huh. I teach at a school in a low-income area and lots of Special Ed students. Last week we had an intruder on campus. I don’t remember the AP doing a story on it though.",
                "I've got a new mole hill in my yard, maybe the AP could find a way to make that newsworthy.",
                "was his name bigballz and sent with a thumb drive by a guy leon or something?",
                "Holy fuck deploy the army to protect these angels."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Ex-officer pleads guilty in 150 mph DUI crash that killed UC Riverside student and his parents",
            "external_url": "https://www.sbsun.com/2025/04/11/ex-lapd-officer-pleads-guilty-in-2017-triple-fatal-drunken-driving-crash/",
            "upvotes": 288,
            "date": "04/14/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2024/08/generic-body-found-police-crime-scene-03.webp?w=1024&h=576",
            "top_comments": [
                ">Edgar Verduzco, 34, an off-duty LAPD officer at the time, was driving 150 miles per hour and under the influence of alcohol when he collided with two cars on the 605 freeway.\n\nEven if the victims were traveling at 70 mph in the same direction the difference in speed is so high that it would be like being parked and someone hits you when they're going 80 mph. I hope that guy goes to jail for the rest of his life.",
                "150mph is insane... I guess I didn't even realize a camaro could go that fast, but that's probably because I'm a sensible human being that's never even considered driving anything that fast.",
                "They say ex-officer like he retired or something. He was actively employed by the police department at the time. News publications need to stop doing this.",
                "And he’ll get 25 yrs in prison for it. Three dead people.",
                "Might be a bad take here but its worth discussing.. should those that serve i.e. medical field professionals, firefighters, police officers, corrections officers ect. get harsher punishment than those who didn't take oaths because they are supposed to know better? I mean sure the average person should still know better than to do stupid things that get others killed, but it seems different when you take a position of responsibility and are supposed to be the best of us. let the discussion begin!",
                "It was on the 605 freeway.\n\nI remember folks were going 100+mph on the local roads next to UCR.\n\nRside can be nuts."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "President of El Salvador says he won't return mistakenly deported man to U.S.",
            "external_url": "https://www.nbcnews.com/news/rcna201136",
            "upvotes": 18374,
            "date": "04/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250414-trump-bukele-vl-1156a-ae43d5.jpg",
            "top_comments": [
                "This is a fucking problem.",
                "There are really only a few logical conclusions to draw here. Either:\n\n1. Trump told him to say this to subvert the decision of the courts\n2. He is dead\n3. They dont actually know where he is since record keeping is suspect at best\n\nRegardless, the complete lack of due process here should be extremely concerning to every citizen in the Country, regardless of if they were born in the US or not.",
                "So kidnapping it is then.",
                "So let me get this straight. These people committed no crimes. They were illegally detained and removed from the country against their will. And they're being held in a foreign prison indefinitely with no due process.\nAnd yet they still frame it as deportation and not kidnapping & human trafficking",
                "Visit the US*\n\n*we cannot guarantee you won’t be deported to a prison in El Salvador by mistake.",
                "[ Removed by Reddit ]",
                "I have a growing suspicion the deported man is no longer living...",
                "Imagine some suburban white, Christian MAGA mother of two getting mistakenly deported to one of the world’s worst prisons that violated a court order and Biden not only refused to bring her home, but invited the dictator where the prison was located to the Oval Office and, smiling, shook his hand as the dictator announced he won’t return her.\n\nThere would be an immediate and justifiable impeachment and tens of millions protesting in the streets. There isn’t a single democrat or “liberal” that would support Biden doing this—not one. \n\nThis is Nazi-style fascism, the end of the constitution and rule of law, and the single incident that will be looked back upon by future high schoolers studying US history as the moment the rot of bigotry finally won. \n\nAmerican conservatives are confirming their moral bankruptcy. I will never trust, associate with, or help any of them ever again. Good riddance, diseased leaches.",
                "This is ghastly and immoral. Our country is glad handing and FUNDING a dictator and CNN is writing puff pieces about it.",
                "The baseline for Democrats in 2026 and 2028 should putting these sociopaths on trial and in boxes at ADX Florence the rest of their lives. I want a live stream of every single perp walk. \n\nSet an example or else we’re doing this again in 2032."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "4 Months Into the Year, Chicago Set to Exhaust $82M Annual Budget for Police Misconduct Settlements",
            "external_url": "https://news.wttw.com/2025/04/14/chicago-set-exhaust-annual-budget-police-misconduct-settlements",
            "upvotes": 6582,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely bonkers to me that we haven’t forced police unions to maintain misconduct insurance. Doctors and lawyers have to have malpractice insurance. Why the fuck should taxpayers have to bear the cost of vindicating their rights? And how to we expect to incentivize less misconduct if the actors don’t bear the cost of bad apples?",
                "The fact that there is an annual budget for that in the first place.",
                "End qualified immunity, make officers carry their own liability insurance. You know just like nurses, doctors and other \"professionals\". Always remember this is not $ that falls from the sky, these are YOUR tax paid $$'s.",
                "This is why every other country in the world trains their police force for more than 6 months before giving them a badge and a gun and letting them go play cowboys",
                "Guess they should tap in to the police pension fund right?",
                "Private insurance and make becoming a police officer a substantially more involved process. Like a 4 year degree.",
                "The fix for this is to have each police officer required to carry an insurance against it.  Calculate what the median insurance cost is for all the officers on the force, give everyone a raise to include that amount and let nature takes it course. \n\n\nGood officers will have lower premiums and effectively get a raise out of the deal. \n\n\nBad officers will quickly work themselves out of a job as they are literally uninsurable without using half their pay or more.  ",
                "That’s insane. \n\nAnd it’s all tax payers money, paying for these things. It should come from the cops only. Either their “union” or they need to lay people off by using their own, SET budget for the year. ",
                "Make the cops carry their own misconduct insurance like we do for Medical professionals. If a cop is too expensive to insure because they constant abuse their authority and harm citizens, said cop shouldn’t have a job enforcing the law. ",
                "I guess that means no more misconduct is allowed."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "China, Vietnam sign deals as Xi visits Hanoi amid US tariff tensions",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinas-xi-meet-vietnam-leaders-kick-off-southeast-asia-tour-amid-us-tariffs-2025-04-14/",
            "upvotes": 3481,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy crap trump is uniting the world....",
                "Good job, dumbass. You drove one of the best alternatives to China into China's arms.",
                "Liberation day was for the world, not the Americans 😂",
                "That's the art of the deal,, if donny don't want to play nice,, he's out of the game.",
                "Trump said Vietnam was begging please sir please sir. He is just full of shit.",
                "This is actually hilarious",
                "It’s so funny watching Trump suck so much that he is turning long time geopolitical rivals like Vietnam and China together. Masterful gambit sir.",
                "This is actually hilarious. Vietnam and China hate each other, and Vietnamese-Americans are the largest Asian group that supports Trump",
                "One potential China Sea /Taiwan war ally gone.        \nThanks Trump.",
                "Please, stop Mr. Trump, I can’t handle all this winning"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Cody Balmer was \"harboring hatred\" toward Shapiro before setting fire at Governor's Residence, documents say",
            "external_url": "https://www.cbsnews.com/philadelphia/news/cody-balmer-governors-residence-fire-josh-shapiro-harrisburg/",
            "upvotes": 1755,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/13/a35e635d-1a6b-4478-a65d-dce499693915/thumbnail/1200x630/72eef0eac0b2ba0def67ecf4f2bbb49e/shapiro1.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "What’s with the hammer attack thing? Nancy Pelosi’s husband was also attacked with a hammer",
                "I would imagine most people who set fire to someone's house and plan to assault them with a hammer probably harbor hatred for them.",
                "So I had heard that he intended to use a hammer to bludgeon the governor. I didn't realize it was a *sledgehammer*, as stated in the article. Gruesome shit.",
                "These stories should talk more about which 'influencers' encouraged him to do this.",
                "Where's the president condemning this as terrorism?  \n\nOh, right.  It's not a tesla dealership, but a political rival.  I'm sure he condones it.",
                "I mean, fire bombing is rarely an act of love. Despite what my ex told the judge.",
                "Attacking a Jewish governor during Passover, yet the administration has been eerily quiet about “antisemitism” regarding this event. Interesting given they’re actively arguing they must deport people who organize anti-Israel protests because it’s “antisemitic”.",
                "So here's the question I wish was asked after all of these homegrown terrorism cases:\n\nWho radicized him? And what are we going to do to prevent more from becoming hopelessly radicalized into committing acts of violence?",
                "That's a rough looking 38...",
                "Of course he was but the real question is Why? What did the Governer do to make him so angry he thought his only recourse was assault and burning down his house."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A preliminary 5.2-magnitude earthquake strikes near San Diego",
            "external_url": "https://www.cbsnews.com/losangeles/news/earthquake-strikes-near-san-diego/",
            "upvotes": 1304,
            "date": "04/14/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/14/ae9e409c-ca0e-4f45-b2f7-42f90049a97a/thumbnail/1200x630/647b04c226f65b5d25cb94176944166f/image.png?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "I got a “Drop, cover, hold on. Protect Yourself” alert seconds before and I thought it was a joke. Haven’t felt a shake like that in a while!",
                "I was on a work call and had to awkwardly say “heeeey sorry to interrupt you but I’m in the middle of an earthquake rn, brb”. Also my alert came the second it stopped.",
                "Biggest one I've felt since I moved here in 2003.  \n\nThe alert system worked great. My phone went off and I had just enough time to dive for a doorway",
                "Lived here for 38 years, was one of the strongest I've felt. I have had the MyShake app on my phone for years and never got an alert until today. Phone dinged maybe 5 seconds before the office starting shaking.",
                "So does preliminary mean they’re expecting another one?",
                "Hey we felt it across the border! \n\n@Mexicali, Baja",
                "It was interesting how quickly it was revised from a 6.7 to a 5.1 and now a 5.2. I was looking at the USGS map and it kept changing.",
                "It was a nice little shake here by Coachella.",
                "Trump hasn't fired the seismograph monitors yet?",
                "I was on Coronado. It was pretty mild here, like someone slightly nudged my chair. Love to hear about how it was in actual San Diego."
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "04/14/2025 20:10:01 UTC"
}