{
    "posts": [
        {
            "category": "HOT",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 16771,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "A government so small it can take your land and rights on a whim.",
                "Here’s the text of the zoning memo sent to Starbase residents:\n\nMay 21, 2025\n\nDear Starbase Property Owner/Property Occupant,\n\nNotice is hereby given that the City Commission for the City of Starbase will conduct a Public Hearing on Monday, June 23, 2025, at 9:00 a.m., at the City of Starbase temporary city hall located at 39046 LBJ Boulevard, Brownsville, TX 78521, to hear public comments, consider and act upon the adoption of a Comprehensive Zoning Ordinance and city wide Zoning Map.\n\nOur goal is to ensure that the zoning plan reflects the City’s vision for balanced growth, protecting critical economic drivers, ensuring public safety, and preserving green spaces. You are receiving this notice because you own the above listed property that will be located in the “Mixed Use District” and will be impacted if the zoning ordinance is approved. \n\nThe Mixed Use District allows for a blend of residential, office, retail, and small-scale service uses. A proposed zoning map is enclosed with this notice. You may view the draft zoning ordinance on the City’s website 72 hours prior to the above listed public hearing.\n\nThe City is required by Texas law to notify you of the following: THE CITY OF STARBASE IS HOLDING A HEARING THAT WILL DETERMINE WHETHER YOU MAY LOSE THE RIGHT TO CONTINUE USING YOUR PROPERTY FOR ITS CURRENT USE, PLEASE READ THIS NOTICE CAREFULLY. The foregoing notice is required by Texas Local Government Code section 211.006(a-1). The proposed zoning ordinance is based on current and existing uses.\n\nPlease contact City Administrator Kent Myers [email address redacted] with any questions or written comments. Your written comments must be submitted by 3:00 pm on June 22, 2025. Public comments may also be given at the above listed public hearing.\n\n \n\nBest Wishes, \n\nKent Myers\n\nCity Administrator, City of Starbase\n\n[addresses redacted]\n\ncityofstarbase-texas.com",
                "Another day older and deeper in debt",
                "Are we surprised? No, not at all.",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "So….. years ago almost all property in Boca chica village was acquired by SpaceX in buyouts. All of the residents were bought out and left. There were a few holdouts, some of the property is uninhabited but SpaceX does not own it. They had to build the factory around a few parcels because of it. \n\nThe people that live there now are employees and their families in houses built by the company. They are also building apartment complexes down the road. \n\nI would bet this notice is a legal thing.",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 21718,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "This ruling won't last long, but the damage sure will",
                "Our country is a fucking joke",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 10062,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "“I need you to be activist judges to stop the activist judges”",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "Why are they activist judges.  Jesus why can’t people tone down on the rhetoric.  They’re judges following the rule of law.  The congress is supposed to control taxation not the president.",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "4-year-old girl who receives medical treatment in US could die if deported, lawyer says",
            "external_url": "https://abcnews.go.com/US/4-year-girl-receiving-medical-treatment-us-die/story?id=122285755",
            "upvotes": 1956,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f56b3111-2ebe-4f83-a34b-ad223ffc18d7/Vargas-1-gty-er-250528_1748470039526_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where are all the pro-life people now?",
                "They assume the US cares if she dies or not",
                "They already deported 2 mid cancer treatment children who were US citizens …..",
                "I think that’s the idea, isn’t it? ",
                "Man, that treatment is intense and expensive. My aunt developed SBS after having surgery for cancer, and even with insurance the medical bills put her into bankruptcy. Can't imagine how this family will manage the expense even if they get to stay here...they will be financially crippled by this. Tragic situation. The American healthcare situation is broken.",
                "Maga don’t care about children after they are born . only when they are a fetus or bag of cells. Also they don’t care about brown people.",
                "The treatment for this is expensive.\n\nWhich is exactly why Trump wants her, and her family, deported.",
                "Eligible voters that didn’t vote for Kamala Harris allowed this to happen.",
                "MAGA probably filled with glee at the prospect.",
                "So, a win as far as conservatives are concerned."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 227,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "is france just asking for riots at this point",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "Any French BBQ restaurants are about to be in a world of hurt!",
                "That’s it, that’s the straw, I want out of this world. If you can’t fucking smoke in France of all places what’s the point anymore.\n\nWe’ve lost the plot…",
                "Smoking should be allowed only where it doenst reach people that do not smoke, specially kids.\n\nIt should only be allowed on private places with proper signaling, terraces should be smoke free because people have to walk near them a lot of times.\n\nNo one should risk geting cancer or asma in a public space because some guy is adicted to a substance.",
                "How do they expect to enforce this nonsense?",
                "As an American who's been in Paris the last 2 weeks, I would welcome this. It's awful to walk through constantly.",
                "I'm sure this will go well.",
                "At the end of the day, I agree with the ban near schools and beaches because due to littering. But parks seem over reaching (I want to smoke and picnic with some beer and wine and friends etc. and I’m thankful that they have left terraces alone. (Seems to signal that the cafe cigarette and coffee is safe). I know Americans in particular are really anti smoking. And that the French themselves are moving away from smoking. But it’s still a deeply cultural practice to smoke and have a coffee on the terrace."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 3429,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "Harrison was 96, a fuckin kid",
                "Tippecanoe and Tyler....3?",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "I didn't even know he was sick.",
                "One of the all time great history oddities! \nRIP Harrison"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 5186,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing.",
                "It has Harvard, illegal, and embryo in the title. It’s a MAGA wet dream.",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 8976,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                ">”A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.”\n\nSick freaks",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "This literally made my stomach turn. Wtaf?!",
                "Hell isn’t bad enough."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
            "external_url": "https://apnews.com/article/election-officials-threat-colorado-years-prison-a50f82a9fbad6ebf72eafef189a06f38",
            "upvotes": 2462,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It wasn’t my fault - I listened to people who claimed they’re the party of personal responsibility- how can *I* be blamed for my actions?”",
                "Online threats are literally how MAGA is controlling the GOP - any Republican member of the house or Senate that steps out of line gets called out by name and tagged on Twitter by Trump's dirtbag propagandist influencers. They are quickly brigaded by legions of maga Twitter incels and bots, replies filled with hate and threats until they bend the knee. This is how they go after judges too. I'm telling you, Twitter needs to be fucking purged entirely, along with its owner.",
                "Trump will pardon him.  As long as he broke the law to protect the fascist state trump will pardon him.",
                ">A judge sentenced a man who blamed exposure to far-right extremist content for motivating his online threats to kill Democratic election officials in Colorado and Arizona to three years in prison Thursday, saying the penalty for such “keyboard terrorism” needed to be serious enough to deter others from doing the same.\n\n>U.S. District Judge S. Kato Crews said that threats against election and other government officials are on the rise and people need to remember that differences need to be worked out through the democratic process, not violence.\n\n>“The public must not accept this as the norm,” he said in handing down the sentence for Teak Ty Brockbank.\n\n>Brockbank pleaded guilty in October to making threats between September 2021 and August 2022 against Colorado Secretary of State Jena Griswold and former Arizona Secretary of State Katie Hobbs, who is now governor. He also threatened a Colorado judge and federal agents.\n\n>Brockbank apologized in court for his “ugly posts” and said he has turned away from the fear, hate and anger that he found online that derailed his life.\n\n>Federal prosecutors sought three years in prison for Brockbank. He asked for leniency, saying he made the posts when he was drinking heavily, socially isolated and spending his evenings consuming conspiracy theories online. Jonathan Jacobson, a Washington-based trial attorney for the Justice Department’s public integrity section, pointed out that the threats continued during a period when Brockbank wasn’t drinking.\n\n>Brockbank posted online that Colorado’s top election official should “Hang by the neck” and her former counterpart in Arizona should also be put to death.\n\nKeyboard warrior or not, the nutcase deserves what he got, and then some.",
                "If you watch even a little Fox News (nevermind Newsmax or some of the other arguably more extreme sources of \"news\") you'll quickly see that they are definitely trying to make their viewers angry and, yes, even violent. \n\nWhen I was growing up the news was just an anchor telling you what happened that day. No emotion, very few adjectives even. A plane crashed. A war ended. A politician was indicted. Mostly just raw information.\n\nContrast that with Janine Pirro red-faced calling the Left \"DemonRats\" at the top of her lungs on her program or any of the many times Fox News (the most watched \"news\" in America) basically told their viewers that liberals were coming in the night to take their guns, turn their kids gay, abolish christianity, etc\n\nThey distort and lie and rile up their viewers, then practically *dare* their audience not to take matters into their own hands. \n\nThe Right's media apparatus in the US is responsible for more psychological damage and American suffering than Tokyo Rose could have ever hoped for",
                "\"I was allowed to believe things that weren't true\" - Marjorie Taylor Greene",
                "I’m sure he will be pardoned, just like the people that beat police officers down with American flags. I can’t believe this stupid ass country let the worst of us win the last election. Truly embarrassing",
                "What do cigarettes, liquor, and claw hammers have in common? Warning labels. Time for warning labels at Foxic Noise.",
                "Uh huh, and Ted Bundy blamed porn for his killing spree.\n\nFor him, it was a last-ditch attempt to deflect blame from where it lied - him. And this fella?",
                "Wait - so the brownshirts fighting to replace democracy with fascism get a free pass?\n\n\nI've been saying conservatism is a mental illness for years - I should have realised that fact would be exploited eventually. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 126,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "Oh.  No.\n\nBack to what I was doing",
                "This helps drain the swamp a little",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "Good riddance. Total scumbag. Rudy's henchman and partner in crime.",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "OK... No one else is going to say it? Nice!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 13,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "Looks like Boein's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A lawsuit says Honolulu police are arresting people for impaired driving even when they are sober",
            "external_url": "https://www.nbcnews.com/news/us-news/lawsuit-says-honolulu-police-are-arresting-people-impaired-driving-eve-rcna209904",
            "upvotes": 62,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250530-police-rs-1ff605.jpg",
            "top_comments": [
                "Supervisors give officers incentives, including telling night enforcement officers they can go home and still get paid for an entire shift if they make a DUI arrest, which results in officers taking investigative shortcuts or making arrests without probable cause, the ACLU said.\n\nPolice are attempting to show that officers are protecting the public, using arrest numbers to secure federal funding and to meet quotas, the organization said.",
                "Its dumb you can be arrested on a Friday at 10am and potentially won't get released until you see a judge on Monday. You lose all that freedom over a suspicion, and there's almost no recourse either.",
                "You can beat the charge, but you can't beat the ride."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 125,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "Oh.  No.\n\nBack to what I was doing",
                "This helps drain the swamp a little",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "Good riddance. Total scumbag. Rudy's henchman and partner in crime.",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "OK... No one else is going to say it? Nice!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russell Brand pleads not guilty to charges of rape and sexual assault in London court",
            "external_url": "https://abcnews.go.com/Entertainment/wireStory/russell-brand-pleads-guilty-charges-rape-sexual-assault-122336321",
            "upvotes": 105,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/62daa29a-0219-4291-a0f0-2a2f169bfaa8/wirestory_8927e37dec79856f60f04ce2d914dc01_16x9.jpg?w=1600",
            "top_comments": [
                "Brand is accused of raping a woman at a hotel room in Bournemouth when she attended a 1999 Labour Party conference and met him at an event where he was performing. The woman alleged that Brand stripped while she was in the bathroom and when she returned to the room he pushed her on the bed, removed her underwear and raped her.\n\nA second woman said Brand grabbed her forearm and attempted to drag her into a men’s toilet at a television station in London in 2001.",
                "But he's \"born again\" so its all cool, right?",
                "He was two people behind me in the security line at the Destin Florida airport a couple weeks ago. I was at first so confused because what the fuck what is he doing here? Then I remembered, oh yeah, he’s hiding away in a rapist-friendly state. Spent the rest of the time glaring at him at every opportunity.",
                "Just based on his persona and the way he has acted publicly in the past, it seems hard to give him the benefit of the doubt. But that could also be a reason why someone would target him. Hes done interviews with women where he constantly harasses them the entire time. ",
                "Why hasn't this serial rapist been deported with the other \"criminals\" with the same due process they were afforded?",
                "4 women?! Yea he guilty.",
                "We all know if he didn’t spend the last few years attacking certain people he wouldn’t have been charged.",
                "so sad what theyre doing to the christian right these days to silence them",
                "Beginning to think this, Epstein, Diddy, and the Tate Brothers are limited hangouts; references to the prevalence of sex work/crime without actual reference to sex work/crime.  No one is brave enough to address reality openly, so instead a certain tone is set by setting up people for narrative martyrdom."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 228,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "is france just asking for riots at this point",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "Any French BBQ restaurants are about to be in a world of hurt!",
                "That’s it, that’s the straw, I want out of this world. If you can’t fucking smoke in France of all places what’s the point anymore.\n\nWe’ve lost the plot…",
                "Smoking should be allowed only where it doenst reach people that do not smoke, specially kids.\n\nIt should only be allowed on private places with proper signaling, terraces should be smoke free because people have to walk near them a lot of times.\n\nNo one should risk geting cancer or asma in a public space because some guy is adicted to a substance.",
                "How do they expect to enforce this nonsense?",
                "As an American who's been in Paris the last 2 weeks, I would welcome this. It's awful to walk through constantly.",
                "I'm sure this will go well.",
                "At the end of the day, I agree with the ban near schools and beaches because due to littering. But parks seem over reaching (I want to smoke and picnic with some beer and wine and friends etc. and I’m thankful that they have left terraces alone. (Seems to signal that the cafe cigarette and coffee is safe). I know Americans in particular are really anti smoking. And that the French themselves are moving away from smoking. But it’s still a deeply cultural practice to smoke and have a coffee on the terrace."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Six dead gray whales found in San Francisco Bay area in the last week",
            "external_url": "https://www.nbcnews.com/news/us-news/six-dead-gray-whales-found-san-francisco-bay-area-last-week-rcna209892",
            "upvotes": 167,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250529-san-francisco-dead-whale-carcass-ac-1130p-b2a0f5.jpg",
            "top_comments": [
                "The gray whales were found dead from May 21 to Wednesday, when one was found washed ashore at Point Reyes National Seashore, the California Academy of Sciences said.\n\nOn Monday, two were found the same day — one on Alcatraz and one at Point Bonita, it said.\n\nIn most of the cases, no necropsy, which is like an autopsy for an animal, was performed. The partial necropsy for a yearling gray whale found at Bolinas was inconclusive, and results from the necropsy on the whale found Wednesday are pending, the academy said.",
                "Why not try to find out why they died?",
                "A whale was beached ashore in Florence Oregon USA in 1970. The local authorities thought the best thing to do was to blow it up. Not a good idea. https://en.m.wikipedia.org/wiki/Exploding_whale",
                "Kojima’s marketing budget is wild…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Car launches into Missouri veterans hall roof for 2nd time in 3 months",
            "external_url": "https://abcnews.go.com/US/car-launches-missouri-veterans-hall-roof-2nd-time/story?id=122310270",
            "upvotes": 130,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/2ecb68c5-ad80-4319-9b66-362f16c8d234/car-roof-ht-gmh-250529_1748542347511_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Did the Missouri Veterans recently buy a Dukes of Hazzard ramp?",
                "the launch angle is actually pretty impressive https://imgur.com/a/NzFd0y8",
                "Emergency crews responded to 208 Veterans Memorial Drive just before 7:30 a.m., where they found a vehicle that had driven off Sycamore Street and crashed into the building's roof.",
                "Launch a car into my roof once, shame on you. Launch a car into my roof twice….",
                "At first I thought they meant the SAME car.",
                "At what point does this become something they can sue the government entity in charge of the road for?",
                "Excuse me. You can’t park there.",
                "Big. Ass. Guardrail. Install one.",
                "The people are desperate for GTA 6",
                "That car must really hate that building.  Hopefully the authorities do something this time so it doesn’t do it a third time.  Also pretty amazing the car survived the first time."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "4-year-old girl who receives medical treatment in US could die if deported, lawyer says",
            "external_url": "https://abcnews.go.com/US/4-year-girl-receiving-medical-treatment-us-die/story?id=122285755",
            "upvotes": 1959,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f56b3111-2ebe-4f83-a34b-ad223ffc18d7/Vargas-1-gty-er-250528_1748470039526_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where are all the pro-life people now?",
                "They assume the US cares if she dies or not",
                "They already deported 2 mid cancer treatment children who were US citizens …..",
                "I think that’s the idea, isn’t it? ",
                "Man, that treatment is intense and expensive. My aunt developed SBS after having surgery for cancer, and even with insurance the medical bills put her into bankruptcy. Can't imagine how this family will manage the expense even if they get to stay here...they will be financially crippled by this. Tragic situation. The American healthcare situation is broken.",
                "Maga don’t care about children after they are born . only when they are a fetus or bag of cells. Also they don’t care about brown people.",
                "The treatment for this is expensive.\n\nWhich is exactly why Trump wants her, and her family, deported.",
                "Eligible voters that didn’t vote for Kamala Harris allowed this to happen.",
                "MAGA probably filled with glee at the prospect.",
                "So, a win as far as conservatives are concerned."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police arrest 13-year-old boy following fatal stabbing east of Toronto",
            "external_url": "https://www.ctvnews.ca/toronto/local/durham/article/no-longer-a-danger-to-the-public-police-arrest-13-year-old-boy-after-senior-fatally-stabbed-in-pickering-lift-shelter-in-place-alert/",
            "upvotes": 797,
            "date": "05/30/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/V6WKAQXRPRHPBA72VK67QLZ44A.jpg?smart=true&auth=ad4582fac66436d1f824a7f70eaa5e42457660b9338b90acb199e92acca69204&width=1200&height=630",
            "top_comments": [
                "*“After a brief interaction, the suspect stabbed the female in a sadistic and cowardly, unprovoked attack that was captured on video,” he told members of the media...*\n\nA 13 year old boy killing a senior during an altercation outside her home.  All the more horrible for seeming so wildly unlikely, at least on the surface of things.",
                "For those of you who don’t know, 100s of thousands of peoples phones went off with an emergency alarm due to this. There was a risk to public safety based on the details police had. Must have been that gruesome and unprovoked…",
                "With our justice system the kid will be released before the weekend is over.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 16764,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "A government so small it can take your land and rights on a whim.",
                "Here’s the text of the zoning memo sent to Starbase residents:\n\nMay 21, 2025\n\nDear Starbase Property Owner/Property Occupant,\n\nNotice is hereby given that the City Commission for the City of Starbase will conduct a Public Hearing on Monday, June 23, 2025, at 9:00 a.m., at the City of Starbase temporary city hall located at 39046 LBJ Boulevard, Brownsville, TX 78521, to hear public comments, consider and act upon the adoption of a Comprehensive Zoning Ordinance and city wide Zoning Map.\n\nOur goal is to ensure that the zoning plan reflects the City’s vision for balanced growth, protecting critical economic drivers, ensuring public safety, and preserving green spaces. You are receiving this notice because you own the above listed property that will be located in the “Mixed Use District” and will be impacted if the zoning ordinance is approved. \n\nThe Mixed Use District allows for a blend of residential, office, retail, and small-scale service uses. A proposed zoning map is enclosed with this notice. You may view the draft zoning ordinance on the City’s website 72 hours prior to the above listed public hearing.\n\nThe City is required by Texas law to notify you of the following: THE CITY OF STARBASE IS HOLDING A HEARING THAT WILL DETERMINE WHETHER YOU MAY LOSE THE RIGHT TO CONTINUE USING YOUR PROPERTY FOR ITS CURRENT USE, PLEASE READ THIS NOTICE CAREFULLY. The foregoing notice is required by Texas Local Government Code section 211.006(a-1). The proposed zoning ordinance is based on current and existing uses.\n\nPlease contact City Administrator Kent Myers [email address redacted] with any questions or written comments. Your written comments must be submitted by 3:00 pm on June 22, 2025. Public comments may also be given at the above listed public hearing.\n\n \n\nBest Wishes, \n\nKent Myers\n\nCity Administrator, City of Starbase\n\n[addresses redacted]\n\ncityofstarbase-texas.com",
                "Another day older and deeper in debt",
                "Are we surprised? No, not at all.",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "So….. years ago almost all property in Boca chica village was acquired by SpaceX in buyouts. All of the residents were bought out and left. There were a few holdouts, some of the property is uninhabited but SpaceX does not own it. They had to build the factory around a few parcels because of it. \n\nThe people that live there now are employees and their families in houses built by the company. They are also building apartment complexes down the road. \n\nI would bet this notice is a legal thing.",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 226,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "is france just asking for riots at this point",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "Any French BBQ restaurants are about to be in a world of hurt!",
                "That’s it, that’s the straw, I want out of this world. If you can’t fucking smoke in France of all places what’s the point anymore.\n\nWe’ve lost the plot…",
                "Smoking should be allowed only where it doenst reach people that do not smoke, specially kids.\n\nIt should only be allowed on private places with proper signaling, terraces should be smoke free because people have to walk near them a lot of times.\n\nNo one should risk geting cancer or asma in a public space because some guy is adicted to a substance.",
                "How do they expect to enforce this nonsense?",
                "As an American who's been in Paris the last 2 weeks, I would welcome this. It's awful to walk through constantly.",
                "I'm sure this will go well.",
                "At the end of the day, I agree with the ban near schools and beaches because due to littering. But parks seem over reaching (I want to smoke and picnic with some beer and wine and friends etc. and I’m thankful that they have left terraces alone. (Seems to signal that the cafe cigarette and coffee is safe). I know Americans in particular are really anti smoking. And that the French themselves are moving away from smoking. But it’s still a deeply cultural practice to smoke and have a coffee on the terrace."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police arrest 13-year-old boy following fatal stabbing east of Toronto",
            "external_url": "https://www.ctvnews.ca/toronto/local/durham/article/no-longer-a-danger-to-the-public-police-arrest-13-year-old-boy-after-senior-fatally-stabbed-in-pickering-lift-shelter-in-place-alert/",
            "upvotes": 794,
            "date": "05/30/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/V6WKAQXRPRHPBA72VK67QLZ44A.jpg?smart=true&auth=ad4582fac66436d1f824a7f70eaa5e42457660b9338b90acb199e92acca69204&width=1200&height=630",
            "top_comments": [
                "*“After a brief interaction, the suspect stabbed the female in a sadistic and cowardly, unprovoked attack that was captured on video,” he told members of the media...*\n\nA 13 year old boy killing a senior during an altercation outside her home.  All the more horrible for seeming so wildly unlikely, at least on the surface of things.",
                "For those of you who don’t know, 100s of thousands of peoples phones went off with an emergency alarm due to this. There was a risk to public safety based on the details police had. Must have been that gruesome and unprovoked…",
                "With our justice system the kid will be released before the weekend is over.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 16773,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "A government so small it can take your land and rights on a whim.",
                "Here’s the text of the zoning memo sent to Starbase residents:\n\nMay 21, 2025\n\nDear Starbase Property Owner/Property Occupant,\n\nNotice is hereby given that the City Commission for the City of Starbase will conduct a Public Hearing on Monday, June 23, 2025, at 9:00 a.m., at the City of Starbase temporary city hall located at 39046 LBJ Boulevard, Brownsville, TX 78521, to hear public comments, consider and act upon the adoption of a Comprehensive Zoning Ordinance and city wide Zoning Map.\n\nOur goal is to ensure that the zoning plan reflects the City’s vision for balanced growth, protecting critical economic drivers, ensuring public safety, and preserving green spaces. You are receiving this notice because you own the above listed property that will be located in the “Mixed Use District” and will be impacted if the zoning ordinance is approved. \n\nThe Mixed Use District allows for a blend of residential, office, retail, and small-scale service uses. A proposed zoning map is enclosed with this notice. You may view the draft zoning ordinance on the City’s website 72 hours prior to the above listed public hearing.\n\nThe City is required by Texas law to notify you of the following: THE CITY OF STARBASE IS HOLDING A HEARING THAT WILL DETERMINE WHETHER YOU MAY LOSE THE RIGHT TO CONTINUE USING YOUR PROPERTY FOR ITS CURRENT USE, PLEASE READ THIS NOTICE CAREFULLY. The foregoing notice is required by Texas Local Government Code section 211.006(a-1). The proposed zoning ordinance is based on current and existing uses.\n\nPlease contact City Administrator Kent Myers [email address redacted] with any questions or written comments. Your written comments must be submitted by 3:00 pm on June 22, 2025. Public comments may also be given at the above listed public hearing.\n\n \n\nBest Wishes, \n\nKent Myers\n\nCity Administrator, City of Starbase\n\n[addresses redacted]\n\ncityofstarbase-texas.com",
                "Another day older and deeper in debt",
                "Are we surprised? No, not at all.",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "So….. years ago almost all property in Boca chica village was acquired by SpaceX in buyouts. All of the residents were bought out and left. There were a few holdouts, some of the property is uninhabited but SpaceX does not own it. They had to build the factory around a few parcels because of it. \n\nThe people that live there now are employees and their families in houses built by the company. They are also building apartment complexes down the road. \n\nI would bet this notice is a legal thing.",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 21719,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "This ruling won't last long, but the damage sure will",
                "Our country is a fucking joke",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 10064,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "“I need you to be activist judges to stop the activist judges”",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "Why are they activist judges.  Jesus why can’t people tone down on the rhetoric.  They’re judges following the rule of law.  The congress is supposed to control taxation not the president.",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "4-year-old girl who receives medical treatment in US could die if deported, lawyer says",
            "external_url": "https://abcnews.go.com/US/4-year-girl-receiving-medical-treatment-us-die/story?id=122285755",
            "upvotes": 1953,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f56b3111-2ebe-4f83-a34b-ad223ffc18d7/Vargas-1-gty-er-250528_1748470039526_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where are all the pro-life people now?",
                "They assume the US cares if she dies or not",
                "They already deported 2 mid cancer treatment children who were US citizens …..",
                "I think that’s the idea, isn’t it? ",
                "Man, that treatment is intense and expensive. My aunt developed SBS after having surgery for cancer, and even with insurance the medical bills put her into bankruptcy. Can't imagine how this family will manage the expense even if they get to stay here...they will be financially crippled by this. Tragic situation. The American healthcare situation is broken.",
                "Maga don’t care about children after they are born . only when they are a fetus or bag of cells. Also they don’t care about brown people.",
                "The treatment for this is expensive.\n\nWhich is exactly why Trump wants her, and her family, deported.",
                "Eligible voters that didn’t vote for Kamala Harris allowed this to happen.",
                "MAGA probably filled with glee at the prospect.",
                "So, a win as far as conservatives are concerned."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 3430,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "Harrison was 96, a fuckin kid",
                "Tippecanoe and Tyler....3?",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "I didn't even know he was sick.",
                "One of the all time great history oddities! \nRIP Harrison"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 5192,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing.",
                "It has Harvard, illegal, and embryo in the title. It’s a MAGA wet dream.",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 8972,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                ">”A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.”\n\nSick freaks",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "This literally made my stomach turn. Wtaf?!",
                "Hell isn’t bad enough."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
            "external_url": "https://apnews.com/article/election-officials-threat-colorado-years-prison-a50f82a9fbad6ebf72eafef189a06f38",
            "upvotes": 2465,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It wasn’t my fault - I listened to people who claimed they’re the party of personal responsibility- how can *I* be blamed for my actions?”",
                "Online threats are literally how MAGA is controlling the GOP - any Republican member of the house or Senate that steps out of line gets called out by name and tagged on Twitter by Trump's dirtbag propagandist influencers. They are quickly brigaded by legions of maga Twitter incels and bots, replies filled with hate and threats until they bend the knee. This is how they go after judges too. I'm telling you, Twitter needs to be fucking purged entirely, along with its owner.",
                "Trump will pardon him.  As long as he broke the law to protect the fascist state trump will pardon him.",
                ">A judge sentenced a man who blamed exposure to far-right extremist content for motivating his online threats to kill Democratic election officials in Colorado and Arizona to three years in prison Thursday, saying the penalty for such “keyboard terrorism” needed to be serious enough to deter others from doing the same.\n\n>U.S. District Judge S. Kato Crews said that threats against election and other government officials are on the rise and people need to remember that differences need to be worked out through the democratic process, not violence.\n\n>“The public must not accept this as the norm,” he said in handing down the sentence for Teak Ty Brockbank.\n\n>Brockbank pleaded guilty in October to making threats between September 2021 and August 2022 against Colorado Secretary of State Jena Griswold and former Arizona Secretary of State Katie Hobbs, who is now governor. He also threatened a Colorado judge and federal agents.\n\n>Brockbank apologized in court for his “ugly posts” and said he has turned away from the fear, hate and anger that he found online that derailed his life.\n\n>Federal prosecutors sought three years in prison for Brockbank. He asked for leniency, saying he made the posts when he was drinking heavily, socially isolated and spending his evenings consuming conspiracy theories online. Jonathan Jacobson, a Washington-based trial attorney for the Justice Department’s public integrity section, pointed out that the threats continued during a period when Brockbank wasn’t drinking.\n\n>Brockbank posted online that Colorado’s top election official should “Hang by the neck” and her former counterpart in Arizona should also be put to death.\n\nKeyboard warrior or not, the nutcase deserves what he got, and then some.",
                "If you watch even a little Fox News (nevermind Newsmax or some of the other arguably more extreme sources of \"news\") you'll quickly see that they are definitely trying to make their viewers angry and, yes, even violent. \n\nWhen I was growing up the news was just an anchor telling you what happened that day. No emotion, very few adjectives even. A plane crashed. A war ended. A politician was indicted. Mostly just raw information.\n\nContrast that with Janine Pirro red-faced calling the Left \"DemonRats\" at the top of her lungs on her program or any of the many times Fox News (the most watched \"news\" in America) basically told their viewers that liberals were coming in the night to take their guns, turn their kids gay, abolish christianity, etc\n\nThey distort and lie and rile up their viewers, then practically *dare* their audience not to take matters into their own hands. \n\nThe Right's media apparatus in the US is responsible for more psychological damage and American suffering than Tokyo Rose could have ever hoped for",
                "\"I was allowed to believe things that weren't true\" - Marjorie Taylor Greene",
                "I’m sure he will be pardoned, just like the people that beat police officers down with American flags. I can’t believe this stupid ass country let the worst of us win the last election. Truly embarrassing",
                "What do cigarettes, liquor, and claw hammers have in common? Warning labels. Time for warning labels at Foxic Noise.",
                "Uh huh, and Ted Bundy blamed porn for his killing spree.\n\nFor him, it was a last-ditch attempt to deflect blame from where it lied - him. And this fella?",
                "Wait - so the brownshirts fighting to replace democracy with fascism get a free pass?\n\n\nI've been saying conservatism is a mental illness for years - I should have realised that fact would be exploited eventually. "
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/30/2025 12:16:06 UTC"
}