{
    "posts": [
        {
            "category": "HOT",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 9797,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "Jesus….Alito and Thomas are human garbage",
                "Trump gonna ignore this ruling too because he's a fat orange rapist",
                "So how long until Trump just decides he's going to have the SC justices who keep going against him arrested?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 7893,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "Donald Trump is doing to America what he did to his casinos.",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "South Dakota student who earned Ph.D. while DHS tried to deport her over minor traffic violation is granted injunction",
            "external_url": "https://www.nbcnews.com/news/us-news/south-dakota-indian-international-student-dhs-deport-traffic-violation-rcna206789",
            "upvotes": 16502,
            "date": "05/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-South-Dakota-School-of-Mines--Technology-RS-5bfbb7.jpg",
            "top_comments": [
                "It is completely bonkers that the US doesn't offer fast-track citizenship to every foreigner who completes an advanced degree at an accredited US university. \n\nWant to make America great? Put America first? Then let's \"steal\" every bright, talented, motivated person we can from all over the world.",
                "PhD in chemical and biological engineering? \n\nWould you like to  live in Australia.\n\nWe like smart people.",
                "She got a traffic ticket for \"failure to yield\", paid off her ticket, and then had her visas revoked. \n\n***These*** are the immigrant \"criminals\" that we're deporting. \n\nI wish I could've ended the last sentence with an interrobang to indicate a sense of bewildered surprise, but no, just a sad period.",
                "Brain drain played a significant part in Germany's defeat 80 years ago, and it is happening again here.  Half the voting population still does not care",
                "Usa has no bright future because of this administration and will suffer because of it .. the world is watching",
                "I feel like if you have a Ph.D. and are not yet a citizen then you should get an accelerated path to American Citizenship.",
                "Revoked over…a 3-year old traffic stop. Wow.",
                "“Dr. Saxena is exactly the kind of person we should want in this country.” \n\nAbsolutely. Heck, she is from india. It is a friendly nation even by the current administration's definition. Not Iran. Not China.\n\nWhat they should do is to give her a green card. Kicking PhDs in STEM disciplines out just because of some traffic violations is the epitome of stupidity.",
                "[Kristi Noem has had 20 speeding tickets, three stop-sign violations, two seat-belt violations and a citation for driving with no driver’s license. She has also been issued six court notices for failure to appear and two arrest warrants.](https://thehill.com/blogs/blog-briefing-room/news/169901-s-d-gop-candidate-cited-for-numerous-traffic-violations/)",
                "\"Oh no he's only going to get rid of the thugs!\" - my mom, when I was arguing with her about her support for Trump and how exactly this would happen."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 3125,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IF she can go after this person, why aren't they going after Noem for threatening standing congress members & judges?",
                "She’s the same one that had the sling after the handshake…",
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "Amazing how fast they move when it's them being threatened.",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "[removed]",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create.",
                "So, the trans person is responding after having her life threatened *repeatedly by the same group of people*. Got it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Boeing crash victims’ families say Justice Department set to drop criminal case, decry decision as ‘morally repugnant’",
            "external_url": "https://www.cnn.com/2025/05/16/business/boeing-justice-drop-criminal-case-morally-repugnant",
            "upvotes": 1215,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1247998567-20250516162540038.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> will instead reach a non-criminal settlement with the company. The new settlement will include an additional $444.5 million into a crash victims’ fund that would be divided evenly per crash victim.\n\nYes a slap on the wrist. Take half of their profits after paying the employees. Fine each of the executive team half of their wages. Cancel half of their thank you contracts. Make it hurt so much that they will never do it again.",
                "*\"This is morally repugnant. It is a slap on the wrist. And it feels like a bribe,\" said Sanjiv Singh, an attorney who represents 16 victims in the 2018 crash of a Lion Air Boeing 737 Max.*\n\nIn 2018 and 2019 there were 346 people killed in two Boeing crashes.",
                "Repugnant and very Trumpy.",
                "Who wants to bet someone at DOJ bought a bunch of Boeing stock recently?",
                "My conspiracy mind thinks, with no proof whatsoever here's how it will do down\n\nCheeto gets grifted a multimillion dollar Boeing for new AF1. It'll be big, it'll be beautiful. The best AF1 ever because someone of his ego deserves nothing less and you cant go get peed on by Russian hookers in just any old luxury aircraft.\n\nBut it'll need a complete multi-million dollar rebuild. In exchange for dropping the federal investigation if they can finish the refit before 2027, Boeing \"donates\" the non-classified retrofit in the amount they were about to get fined. After all, gonna need new engines and stuff to carry around a fully loaded diaper plus gold toilets and a McDonalds kiosk onboard.\n\nSince the military now only handles the classified security portion of the retrofit, the administration can claim they saved billions in government costs. <taps forehead>\n\nMeanwhile, to stave off the claims of bribery, it'll get donated to the library that will eventually be built since they have a concept of a floor plan.\n\nAnd all those pesky families seeking restitution? \n\nWell, they're all members of gangs so they can be deported.\n\n/S just in case",
                "What a coincidence this happened after Qatar bought all those plans from Boeing too. I’m sure those two things are not related. /s",
                "But they settled the case the family of the dead quality control engineer levied against them.\n\nSeems they are able to admit fault. They should appeal!!!\n\nDon't forget John Barnett and Josh Dean!",
                "It’s the DOJ. Expecting anything than corruption at this point is intentionally naive",
                "it's almost like we shouldn't elect criminals that have no regard to how our government functions",
                "Morally repugnant is all of the current administration."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump agrees deal for UAE to build largest AI campus outside US",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/trump-artificial-intelligence-uae?utm_source=chatgpt.com",
            "upvotes": 2165,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d366b3b21608957ff04add867d3343c8969fe6b/339_0_3331_2666/master/3331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10b67d750a6bab2874750f7a5e73a7e8",
            "top_comments": [
                "Bringing jobs back to . . . . Make Arabia Great Again?",
                "That's a bad location for data centers that need a lot of constant cooling.",
                "Bringing those jobs back to the US I see",
                "This entire trip so far has been such a disgrace to America and its people",
                "Ah, Nice plane for him, no US jobs and a foreign nation having access to our AI research. So much winning!",
                "Has anyone tried explaining to “conservatives” that if we switch away from fossil fuels that it will hurt brown people who live halfway across the world and have a religion that differs from theirs? I know it’s not bombing civilians and starving babies to death but they still won’t like it. ",
                "You flash money at him he'll do anything for any foreign country. The US is for sale.",
                "Trump on tour to line his own pockets.",
                "So, make UAE great again.",
                "It's going to be really sad when we spend all this time and money with the UAE to get a new AI model, and then China open sources a better one the next day. \n\nThe current view on AI by people like Trump and Musk is really a zero sum game for humanity, it's just that the 1% gains all the benefits at the cost to the 99%"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Gabbard fires 2 top intelligence officials and will shift office that preps Trump’s daily brief",
            "external_url": "https://apnews.com/article/national-intelligence-council-gabbard-trump-cia-2bc7d2dab2ab067b276d6b8b31a5dea7",
            "upvotes": 1134,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cool, so he's gonna get feel good affirmations instead of actual intelligence briefings. the enemies of the united states couldn't ask for a better deal.",
                "Last time he was the POTUS they needed to not only keep the briefs VERY short, but they realized they needed to insert his fucking name into every paragraph or so - or he [couldn't/wouldn't pay attention](https://www.buzzfeednews.com/article/davidmack/donald-j-trump). And that was nearly a decade ago. \n\nOur president is a demented idiot child.",
                "The fired officials failed to provide briefings at a fifth grade level.  This annoyed both Trump **and** Gabbard.",
                "Gabbard wants 0 actual intelligence and instead wants 100% propaganda, as Trump demands.",
                "Honestly it's not like he listen to the briefings anyways. He literally just does what Putin tells him to",
                "Wild that this “The director is working alongside President Trump to end the weaponization and politicization of the intelligence community,” comes after saying they fired 25 year vets for being against Trumps rhetoric and they stood by the truth.",
                "Great, get rid of experienced people and probably replace them with keen young things (e.g. Karoline Leavitt clones) who idolise Trump and can be relied upon to tell him whatever he wants to hear.  \n\nIt's amateur hour in the government.  What could possibly go wrong...",
                "That one guy who called me racist and sexist when I called Gabbard a danger a few years back. Believe me yet?",
                "ONLY GOOD NEWS, GUYS! How much clearly do we have to say it!?",
                "Will they make McDonald’s kids menu sheets and provide crayons for the briefings now?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Verizon ending DEI programs as it seeks US approval for Frontier deal",
            "external_url": "https://www.reuters.com/sustainability/society-equity/verizon-ending-dei-programs-it-seeks-us-approval-frontier-deal-2025-05-16/",
            "upvotes": 2071,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Verizon Communications said Friday it is ending diversity, equity and inclusion programs after the Trump administration opened a probe and as the U.S. telecom carrier seeks approval to purchase Frontier Communications”\n\nInteresting timing to say the least",
                "Our government just engages in extortion now.  Really making America great again.",
                "Time to switch carriers.",
                "It's this why everyone's bill had to go up $5 last month, even though we got nothing new/better in return?",
                "And another takes the knee and swears fealty to “The Party”. Sad, but it is the times we live in and the regime we live under.",
                "And now I want to cancel my Verizon plan and go with someone else.  They want to kneel to fascists and racists?  Then they don't need my money.",
                "If anyone is delusional enough to think corporations care more about morality rather than chasing the profit think again. It is another proof that those DEI policies were just for the show and PR.",
                "This company’s been awful before this too, this even just cements it. Fun fact about Verizon for any existing or considering customers, Verizon will refuse to ever remove any collections from your credit report regardless of if it was paid or if they made a mistake. \n\nThey made it impossible to pay my last bill and then sent it to collections right when I finally found a way to do so. Then they sent all physical notices of collection to the wrong address so I had no idea what company had my collection. \n\nFinally found out which one it was when they hit my credit score for 116 points, of course I paid everything down immediately but then when I tried to get a pay to delete, the collection company informed me that VZW was the one who still held control over the collection which makes no sense. From there every attempt at removing the collection, even when bringing up that they’re the ones that made paying my bill impossible, was met with hours on customer service being bounced around just to be told that they reserve the right not to ever remove any collections marks. \n\nThey gain nothing from keeping marks on your report, they just do it to be evil. I had to complain to the CFPB and dispute it with Experian to get everything tossed and thats just because they fucked up and I got lucky. \n\nBasically, fuck Verizon. Evil, awful, dogshit company.",
                "I’ve seen a lot of examples of companies bending to extortion but this one is awful. Just “fuck diversity, we were just pretending anyway”",
                "After Trump is gone we're going to remember the companies that sold out Americans to bow down to them for money."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 368,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "DOGE will eat it themselves",
                "How about just giving it to Americans"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police investigate disappearance of Melania Trump's statue in her native Slovenia",
            "external_url": "https://apnews.com/article/melania-trump-statue-slovenia-9440b43a0a6771256522290fb219efce",
            "upvotes": 1546,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I really don’t care. Do you?",
                "LOL. There’s a fucking statue of this woman that achieved absolutely nothing of significance whatsoever?\n\nSlovenia: “Hey, we’re commissioning you to make a sculpture for our town square”\n\nSculptor: “Wow! One our olympians perhaps? One of many scientists or scholars? Maybe Fritz Pregl, Nobel Prize winner?”\n\nSlovenia: “Mmmmm, not exactly, no”",
                ">The [life-size sculpture](https://apnews.com/general-news-fa29ec746c9200c33033177ac3a1d146) was unveiled in 2020 during President Donald Trump’s first term in office near Sevnica in central Slovenia, where Melanija Knavs was born in 1970. It replaced a wooden statue that had been set on fire earlier that year.\n\nI guess statues of Melania aren't too popular in Slovenia!",
                "Just like the real Melania, the statue disappeared shortly after the election…",
                "The Qatari jet is getting a new hood ornament.",
                "Your home must be pretty sad if the big figure they build a statue in honor of is a foreigners mail order bride.",
                "\"And here's our statue of what we're told is a beautiful woman who spread her legs for the promise of a comfortable life!\"",
                "Why was there even a statue of this woman in the first place?",
                "What about her disappearance as the First Lady of the United States.",
                "It was a hilariously shitty statue everyone laughed at passing by on trains. It was entertaining, at least. lol."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mother gets six years for Elkton townhouse fire that killed daughter, 10",
            "external_url": "https://www.cecildaily.com/news/mother-gets-six-years-for-elkton-townhouse-fire-that-killed-daughter-10/article_647550f6-966a-4fec-9f56-fab39f2a6afe.html",
            "upvotes": 18,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/cecildaily.com/content/tncms/assets/v3/editorial/d/db/ddbf8970-e4b3-42ad-a37e-95f201dcd39f/6824a54dc02fb.image.jpg?crop=770%2C404%2C0%2C279",
            "top_comments": [
                "Call me a POS for taking away from the girl's death or whatever but I find it disturbing that none of these articles comment on the outcome of all of the pets in the home.\n\nThey had **35** cats and dogs.  5 days prior to the fire, animal control took 18 of them.  How many of them were in crates or locked away while the adults of the house made their way to safety?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 4 dead after tornado and severe storm batters St. Louis, mayor says",
            "external_url": "https://www.thestar.com/news/world/united-states/at-least-4-dead-after-tornado-and-severe-storm-batters-st-louis-mayor-says/article_94311dad-37e9-502b-bbdc-0633b37f4a3c.html",
            "upvotes": 31,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/c/28/c288a2cc-ed8e-5297-bcc0-abc33d3e87d2/682753d03ea3b.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Things are pretty bad. The tornado hit smack in the middle of the city and the wrecked havoc up through the north side which is an area already struggling.",
                "*The storms were part of a severe weather system that spawned tornadoes in Wisconsin, downed trees, left thousands without power in the Great Lakes region and brought a punishing heat wave to Texas.*\n\nA weather system that includes every imaginable form of nasty weather."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "JSO activists spared jail after Heathrow glue plot",
            "external_url": "https://www.bbc.co.uk/news/articles/cgmjyk2z2y8o",
            "upvotes": 12,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/635a/live/340635b0-3275-11f0-bde1-b36cab78830c.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 367,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "DOGE will eat it themselves",
                "How about just giving it to Americans"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Manhunt underway for escaped prisoners (CBS)",
            "external_url": "https://www.cbsnews.com/news/new-orleans-jail-inmate-escape-armed-dangerous/?ftag=YHF4eb9d17",
            "upvotes": 36,
            "date": "05/16/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/16/f54dad95-7d46-4377-baf1-bd1fe2d60feb/thumbnail/1200x630/dff94232f44e41ea25e3bf2c8fc4d655/orleans-parish-jail-7zmj4yyb.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "*She said they notified some victims of the escapees, several of whom are facing murder charges or other violent charges. Police removed a family from their homes and took them to safety in the wake of the jailbreak, Kirkpatrick said.* \n\nAccording to this piece, help from both the inside and outside is presumed. I guess this makes sense when more than 2-3 inmates escape together--it's very hard for more to plan a successful breakout from an incredibly secure jail.",
                "You edited the news title to make it LESS informative. Congrats.",
                "Wow, that Derrick Groves guy looks like bad news! He carried out a mass shooting using a rifle, killing two, and he's connected to four other killings. Just [last October,](https://www.wdsu.com/article/2018-mardi-gras-killer-lands-guilty-verdict/62709703) he was finally convicted after having originally being convicted on an unconstitutional hung jury. Law enforcement is warning he may target witnesses from the trials",
                "He’s in the Oval Office.",
                "Common sense would have them try to get as much distance as possible from the jail but I feel like thats exactly why I would try to lay low in the general area as long as possible. Ideally I'd have had something planned on the outside where I can lay up for like a month atleast before even trying to make it out of the state.",
                "He’s in the Oval Office.",
                "Actually 11, 1 was caught afaik.",
                "He’s in the Oval Office."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 9819,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "Jesus….Alito and Thomas are human garbage",
                "Trump gonna ignore this ruling too because he's a fat orange rapist",
                "So how long until Trump just decides he's going to have the SC justices who keep going against him arrested?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 7914,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "Donald Trump is doing to America what he did to his casinos.",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'No more Nottoway': Historic Louisiana plantation house destroyed in massive fire",
            "external_url": "https://abcnews.go.com/US/nottoway-historic-louisiana-plantation-destroyed-massive-fire/story?id=121876986",
            "upvotes": 413,
            "date": "05/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8c41ff99-8ae3-4ee3-9f5c-4adb8e368b7f/nottoway-fire-main-ht-jt-250516_1747413847309_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"I believe I'm getting the vapors!\"\n\n\"No, the house is on fire.\"",
                "Sounds like there was Nottoway to put out the fire.",
                ">\"Nottoway was not only the largest remaining antebellum mansion in the South but also a symbol of both the grandeur and the deep complexities of our region's past,\" Daigle said.\n\n  \n\"deep complexities of our region's past\"?\n\n Not really. You enslaved, trafficked  and exploited human beings to be able to afford the \"grandeur\" of such buildings.",
                "General Sherman is smiling from the heavens.",
                "[Investigators say to be on the lookout for this man](https://en.wikipedia.org/wiki/William_Tecumseh_Sherman)",
                "Dang Van der Linde gang is at it again",
                "That is Nottoway I would have expected that house to go.",
                "*Article Text:*\n\nA devastating fire destroyed the Louisiana's historic Nottoway Resort, the largest antebellum mansion in the South, officials confirmed Friday.\n\n\"The fire has been contained now, but there's no more Nottoway. The house is completely destroyed,\" Iberville Sheriff's Department Capt. Monty Migliacio told ABC News on Friday.\n\nEmergency calls came in around 2:10 p.m. Thursday, reporting the fire, Migliacio told ABC News. The Iberville Sheriff's Department arrived first, followed quickly by firefighters who fought the blaze at the White Castle mansion for hours.\n\n\"It was the biggest fire I've seen in my entire 20-year career,\" Migliacio said.\n\nTen fire departments from surrounding areas worked together to contain the blaze and protect nearby buildings, according to officials.\n\nLouisiana Fire Marshalls are investigating the cause of the blaze, authorities said.\n\nOfficials confirmed that no one was injured. It is unknown if anyone was touring the mansion at the time of the fire, they said.\n\nIberville Parish President Chris Daigle highlighted the mansion's historical significance of the loss in a statement posted on Facebook.\n\n\"Nottoway was not only the largest remaining antebellum mansion in the South but also a symbol of both the grandeur and the deep complexities of our region's past,\" Daigle said.\n\nHe noted that it was built in 1859 and had been open to visitors since the '80s.",
                "Crazy how some of the last ever footage we have of the house is in BigXThaPlug’s video for [The Largest](https://youtu.be/3QwZjhHcLZk?si=10H1uH4wEap5K-Ib)",
                "One less Antebellum themed wedding venue. Oh well."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "BioLab closing Rockdale County plant after fallout from 2024 chemical fire",
            "external_url": "https://www.atlantanewsfirst.com/2025/05/16/biolab-ending-manufacturing-conyers-plant-following-2024-chemical-fire/",
            "upvotes": 66,
            "date": "05/16/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/TZ3FPMTFVVDITA4RKBSOHE7MPQ.png?auth=09e00b8591ebb165ecfefc0eb31dce5ce1557c96d93c1944965965c906189877&width=1200&height=600&smart=true",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Boeing crash victims’ families say Justice Department set to drop criminal case, decry decision as ‘morally repugnant’",
            "external_url": "https://www.cnn.com/2025/05/16/business/boeing-justice-drop-criminal-case-morally-repugnant",
            "upvotes": 1217,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1247998567-20250516162540038.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> will instead reach a non-criminal settlement with the company. The new settlement will include an additional $444.5 million into a crash victims’ fund that would be divided evenly per crash victim.\n\nYes a slap on the wrist. Take half of their profits after paying the employees. Fine each of the executive team half of their wages. Cancel half of their thank you contracts. Make it hurt so much that they will never do it again.",
                "*\"This is morally repugnant. It is a slap on the wrist. And it feels like a bribe,\" said Sanjiv Singh, an attorney who represents 16 victims in the 2018 crash of a Lion Air Boeing 737 Max.*\n\nIn 2018 and 2019 there were 346 people killed in two Boeing crashes.",
                "Repugnant and very Trumpy.",
                "Who wants to bet someone at DOJ bought a bunch of Boeing stock recently?",
                "My conspiracy mind thinks, with no proof whatsoever here's how it will do down\n\nCheeto gets grifted a multimillion dollar Boeing for new AF1. It'll be big, it'll be beautiful. The best AF1 ever because someone of his ego deserves nothing less and you cant go get peed on by Russian hookers in just any old luxury aircraft.\n\nBut it'll need a complete multi-million dollar rebuild. In exchange for dropping the federal investigation if they can finish the refit before 2027, Boeing \"donates\" the non-classified retrofit in the amount they were about to get fined. After all, gonna need new engines and stuff to carry around a fully loaded diaper plus gold toilets and a McDonalds kiosk onboard.\n\nSince the military now only handles the classified security portion of the retrofit, the administration can claim they saved billions in government costs. <taps forehead>\n\nMeanwhile, to stave off the claims of bribery, it'll get donated to the library that will eventually be built since they have a concept of a floor plan.\n\nAnd all those pesky families seeking restitution? \n\nWell, they're all members of gangs so they can be deported.\n\n/S just in case",
                "What a coincidence this happened after Qatar bought all those plans from Boeing too. I’m sure those two things are not related. /s",
                "But they settled the case the family of the dead quality control engineer levied against them.\n\nSeems they are able to admit fault. They should appeal!!!\n\nDon't forget John Barnett and Josh Dean!",
                "It’s the DOJ. Expecting anything than corruption at this point is intentionally naive",
                "it's almost like we shouldn't elect criminals that have no regard to how our government functions",
                "Morally repugnant is all of the current administration."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US aid cuts leave food for millions mouldering in storage",
            "external_url": "https://www.reuters.com/world/us-aid-cuts-leave-food-millions-mouldering-storage-2025-05-16/",
            "upvotes": 372,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So much winning!  Why not at least give out the stuff we have rather than letting it rot?",
                ">Food rations that could supply 3.5 million people for a month are mouldering in warehouses around the world because of U.S. aid cuts and risk becoming unusable, according to five people familiar with the situation.\n\n>The food stocks have been stuck inside four U.S. government warehouses since the Trump administration’s decision in January to cut global aid programmes, according to three people who previously worked at the U.S. Agency for International Development and two sources from other aid organisations.\n\n>Some stocks that are due to expire as early as July are likely to be destroyed, either by incineration, using them as animal feed or disposing of them in other ways, two of the sources said.\nThe warehouses, which are run by USAID’s Bureau for Humanitarian Assistance (BHA), contain between 60,000 to 66,000 metric tonnes of food, sourced from American farmers and manufacturers, the five people said.\n\n>An undated inventory list for the warehouses - which are located in Djibouti, South Africa, Dubai and Houston - stated that they contained more than 66,000 tonnes of commodities, including high-energy biscuits, vegetable oil and fortified grains.\n\n>Those supplies are valued at over $98 million, according to the document reviewed by Reuters, which was shared by an aid official and verified by a U.S. government source as up to date.\n\n>That food could feed over a million people for three months, or the entire population of Gaza for a month and a half, according to a Reuters analysis using figures from the World Food Programme, the world’s largest humanitarian agency.\n\nTo paraphrase Samuel Taylor Coleridge, *”Food, food everywhere, but not a crumb to eat.”*",
                "So all it takes is one shitty president and a few shitty EO's and the entire federal government is comfortable with cruelty and fascism? Good to know.",
                "A. MAGA speed running the US to a shithole country with maximum collateral damage. B. Don’t see “mouldering” in a headline everyday",
                "There were trucks coming to r/grandrapids that got diverted early on in the regime's rule.\n\nThey never arrived. They weren't headed for the rich's pantries.",
                "Abuse, abuse and abuse. The abuse from your oligarchs will continue until you succumb.",
                "This is Elon’s idea of “efficiency.” Fucking CyberDork",
                "And wasn’t that already money allocated? Dumpty just wasted a shit ton of money out of spite and hatred. Idiot.",
                "DOGE will eat it themselves",
                "How about just giving it to Americans"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 9828,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "Jesus….Alito and Thomas are human garbage",
                "Trump gonna ignore this ruling too because he's a fat orange rapist",
                "So how long until Trump just decides he's going to have the SC justices who keep going against him arrested?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Boeing crash victims’ families say Justice Department set to drop criminal case, decry decision as ‘morally repugnant’",
            "external_url": "https://www.cnn.com/2025/05/16/business/boeing-justice-drop-criminal-case-morally-repugnant",
            "upvotes": 1217,
            "date": "05/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1247998567-20250516162540038.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> will instead reach a non-criminal settlement with the company. The new settlement will include an additional $444.5 million into a crash victims’ fund that would be divided evenly per crash victim.\n\nYes a slap on the wrist. Take half of their profits after paying the employees. Fine each of the executive team half of their wages. Cancel half of their thank you contracts. Make it hurt so much that they will never do it again.",
                "*\"This is morally repugnant. It is a slap on the wrist. And it feels like a bribe,\" said Sanjiv Singh, an attorney who represents 16 victims in the 2018 crash of a Lion Air Boeing 737 Max.*\n\nIn 2018 and 2019 there were 346 people killed in two Boeing crashes.",
                "Repugnant and very Trumpy.",
                "Who wants to bet someone at DOJ bought a bunch of Boeing stock recently?",
                "My conspiracy mind thinks, with no proof whatsoever here's how it will do down\n\nCheeto gets grifted a multimillion dollar Boeing for new AF1. It'll be big, it'll be beautiful. The best AF1 ever because someone of his ego deserves nothing less and you cant go get peed on by Russian hookers in just any old luxury aircraft.\n\nBut it'll need a complete multi-million dollar rebuild. In exchange for dropping the federal investigation if they can finish the refit before 2027, Boeing \"donates\" the non-classified retrofit in the amount they were about to get fined. After all, gonna need new engines and stuff to carry around a fully loaded diaper plus gold toilets and a McDonalds kiosk onboard.\n\nSince the military now only handles the classified security portion of the retrofit, the administration can claim they saved billions in government costs. <taps forehead>\n\nMeanwhile, to stave off the claims of bribery, it'll get donated to the library that will eventually be built since they have a concept of a floor plan.\n\nAnd all those pesky families seeking restitution? \n\nWell, they're all members of gangs so they can be deported.\n\n/S just in case",
                "What a coincidence this happened after Qatar bought all those plans from Boeing too. I’m sure those two things are not related. /s",
                "But they settled the case the family of the dead quality control engineer levied against them.\n\nSeems they are able to admit fault. They should appeal!!!\n\nDon't forget John Barnett and Josh Dean!",
                "It’s the DOJ. Expecting anything than corruption at this point is intentionally naive",
                "it's almost like we shouldn't elect criminals that have no regard to how our government functions",
                "Morally repugnant is all of the current administration."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 7903,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "Donald Trump is doing to America what he did to his casinos.",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "'No more Nottoway': Historic Louisiana plantation house destroyed in massive fire",
            "external_url": "https://abcnews.go.com/US/nottoway-historic-louisiana-plantation-destroyed-massive-fire/story?id=121876986",
            "upvotes": 416,
            "date": "05/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8c41ff99-8ae3-4ee3-9f5c-4adb8e368b7f/nottoway-fire-main-ht-jt-250516_1747413847309_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"I believe I'm getting the vapors!\"\n\n\"No, the house is on fire.\"",
                "Sounds like there was Nottoway to put out the fire.",
                ">\"Nottoway was not only the largest remaining antebellum mansion in the South but also a symbol of both the grandeur and the deep complexities of our region's past,\" Daigle said.\n\n  \n\"deep complexities of our region's past\"?\n\n Not really. You enslaved, trafficked  and exploited human beings to be able to afford the \"grandeur\" of such buildings.",
                "General Sherman is smiling from the heavens.",
                "[Investigators say to be on the lookout for this man](https://en.wikipedia.org/wiki/William_Tecumseh_Sherman)",
                "Dang Van der Linde gang is at it again",
                "That is Nottoway I would have expected that house to go.",
                "*Article Text:*\n\nA devastating fire destroyed the Louisiana's historic Nottoway Resort, the largest antebellum mansion in the South, officials confirmed Friday.\n\n\"The fire has been contained now, but there's no more Nottoway. The house is completely destroyed,\" Iberville Sheriff's Department Capt. Monty Migliacio told ABC News on Friday.\n\nEmergency calls came in around 2:10 p.m. Thursday, reporting the fire, Migliacio told ABC News. The Iberville Sheriff's Department arrived first, followed quickly by firefighters who fought the blaze at the White Castle mansion for hours.\n\n\"It was the biggest fire I've seen in my entire 20-year career,\" Migliacio said.\n\nTen fire departments from surrounding areas worked together to contain the blaze and protect nearby buildings, according to officials.\n\nLouisiana Fire Marshalls are investigating the cause of the blaze, authorities said.\n\nOfficials confirmed that no one was injured. It is unknown if anyone was touring the mansion at the time of the fire, they said.\n\nIberville Parish President Chris Daigle highlighted the mansion's historical significance of the loss in a statement posted on Facebook.\n\n\"Nottoway was not only the largest remaining antebellum mansion in the South but also a symbol of both the grandeur and the deep complexities of our region's past,\" Daigle said.\n\nHe noted that it was built in 1859 and had been open to visitors since the '80s.",
                "Crazy how some of the last ever footage we have of the house is in BigXThaPlug’s video for [The Largest](https://youtu.be/3QwZjhHcLZk?si=10H1uH4wEap5K-Ib)",
                "One less Antebellum themed wedding venue. Oh well."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Gaza children are sent back to war zone following medical care after Jordan rejects requests to stay",
            "external_url": "https://apnews.com/article/jordan-gaza-sick-children-israel-hamas-war-f656a459121033118c98b4d3e13fbd2b",
            "upvotes": 1069,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why did Jordan reject their requests to stay?",
                "It's completely understandable why Jordan wouldn't want more Palestinian refugees, again, but it's sad to see.",
                "Turns out the Arab countries hate the Palestinians and have always refused o integrate them.  They all live in refugee camps in the various countries. Gaza specifically is Egyptian territory that they refuse to let the population leave.",
                "Which is ironic, considering the vast majority of historical \"Palestine\" sits within the borders of Jordan.",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Gabbard fires 2 top intelligence officials and will shift office that preps Trump’s daily brief",
            "external_url": "https://apnews.com/article/national-intelligence-council-gabbard-trump-cia-2bc7d2dab2ab067b276d6b8b31a5dea7",
            "upvotes": 1137,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cool, so he's gonna get feel good affirmations instead of actual intelligence briefings. the enemies of the united states couldn't ask for a better deal.",
                "Last time he was the POTUS they needed to not only keep the briefs VERY short, but they realized they needed to insert his fucking name into every paragraph or so - or he [couldn't/wouldn't pay attention](https://www.buzzfeednews.com/article/davidmack/donald-j-trump). And that was nearly a decade ago. \n\nOur president is a demented idiot child.",
                "The fired officials failed to provide briefings at a fifth grade level.  This annoyed both Trump **and** Gabbard.",
                "Gabbard wants 0 actual intelligence and instead wants 100% propaganda, as Trump demands.",
                "Honestly it's not like he listen to the briefings anyways. He literally just does what Putin tells him to",
                "Wild that this “The director is working alongside President Trump to end the weaponization and politicization of the intelligence community,” comes after saying they fired 25 year vets for being against Trumps rhetoric and they stood by the truth.",
                "Great, get rid of experienced people and probably replace them with keen young things (e.g. Karoline Leavitt clones) who idolise Trump and can be relied upon to tell him whatever he wants to hear.  \n\nIt's amateur hour in the government.  What could possibly go wrong...",
                "That one guy who called me racist and sexist when I called Gabbard a danger a few years back. Believe me yet?",
                "ONLY GOOD NEWS, GUYS! How much clearly do we have to say it!?",
                "Will they make McDonald’s kids menu sheets and provide crayons for the briefings now?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Transgender activist charged with threatening life of SC Congresswoman Nancy Mace",
            "external_url": "https://www.thestate.com/news/politics-government/article306493336.html",
            "upvotes": 3132,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IF she can go after this person, why aren't they going after Noem for threatening standing congress members & judges?",
                "She’s the same one that had the sling after the handshake…",
                "Nancy Mace is literally playing the game where she holds her hand an inch from your face and says, \"I'm not touching you.\" Then you slap her hand away and she screams and tattles.\n\nFuck her.",
                "Amazing how fast they move when it's them being threatened.",
                "What a stupid thing to post. Like it's begging for an arrest.",
                "[removed]",
                "Things you don’t post on the internet. \n\n1. How much money in your house. \n\n2. How many guns in your house\n\n3. How much drugs in your house\n\n4. Assignation plots.",
                "Fuck Nancy Mace and all transphobes.\n  \nAlso, don't make death threats. Death threats are bad.",
                "Definitely a crime and the charge is warranted.\n\nBut also not the least bit surprising, this is exactly the sort of scenario that Nancy Mace spends her entire waking life trying to create.",
                "So, the trans person is responding after having her life threatened *repeatedly by the same group of people*. Got it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WHO declares polio outbreak in Papua New Guinea",
            "external_url": "https://www.bbc.com/news/articles/cvg9men89yvo",
            "upvotes": 410,
            "date": "05/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/aae3/live/0f13d210-3213-11f0-be45-61e3c2f49cfe.jpg",
            "top_comments": [
                ">Papua New Guinea was said to be polio-free since 2000, until an outbreak in 2018, which was contained within the same year.\n\n>Health Minister Elias Kapavore has vowed to achieve 100% polio immunisation in the country by the end of this year\n\nMust be nice to have a health minister overreacting in the best possible way. \n\n>Polio has staged a comeback elsewhere in Asia in recent years. Pakistan saw 74 cases of the disease last year, while Afghanistan recorded 24 cases.\n\nI really hope they get ahead of this.",
                "We better air drop JFK Jr there immediately. No time for a parachute. ",
                "Send Secretary Kennedy",
                "My grandma got polio back in the 50s but luckily she lived in Minnesota and went to the Sister Kenny Institute.  My dad lived with an relatives until she came back  She was able to move around with her \"sticks\" (wooden forearm crutches) until she was much older.  It makes me sick that this disease is popping up again and most likely come back to the US.  America is quickly becoming a shithole country.",
                "> We have to make maximum effort to get 100% [vaccination] coverage,\" Dr Huseynova said at a media conference on Thursday.\n\"Polio knows no borders.\"\n\nA mindset that is dying at an alarming rate here in the US. Sadly, those that are paying the price of it are typically young children.",
                "Just for you to know. When you have a bacteria or virus almost extinct, but you don't competely wipe them out, you end up with the most adaptable and survivor strains spreading their genetic information.\n\nThis is what makes super bacteria. The most resilient ones spread and evolve, so it will make our vaccines and antibiotics less efficient over time.\n\nAllowing these people to give a second opportunity to those almost extinct illnesses is much much more dangerous and evil than what it looks like. One day, a mutation of these surviving strains will jump into a vaccinated person succesfully and then, most of the vaccinated people will be in danger as well.\n\n\nThis is a matter of survival, not just 4 crazy people punching themselves.",
                "Wait…quick check. Where’s RFK, Jr. on this one?\n\nOh he’s not a doctor? Huh.",
                "[deleted]",
                "Wait how did that happen?? Isn’t there like one guy left in an iron lung with polio?",
                "*Who the fuck is playing* Pandemic *at a time like this?*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump agrees deal for UAE to build largest AI campus outside US",
            "external_url": "https://www.theguardian.com/us-news/2025/may/15/trump-artificial-intelligence-uae?utm_source=chatgpt.com",
            "upvotes": 2161,
            "date": "05/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d366b3b21608957ff04add867d3343c8969fe6b/339_0_3331_2666/master/3331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10b67d750a6bab2874750f7a5e73a7e8",
            "top_comments": [
                "Bringing jobs back to . . . . Make Arabia Great Again?",
                "That's a bad location for data centers that need a lot of constant cooling.",
                "Bringing those jobs back to the US I see",
                "This entire trip so far has been such a disgrace to America and its people",
                "Ah, Nice plane for him, no US jobs and a foreign nation having access to our AI research. So much winning!",
                "Has anyone tried explaining to “conservatives” that if we switch away from fossil fuels that it will hurt brown people who live halfway across the world and have a religion that differs from theirs? I know it’s not bombing civilians and starving babies to death but they still won’t like it. ",
                "You flash money at him he'll do anything for any foreign country. The US is for sale.",
                "Trump on tour to line his own pockets.",
                "So, make UAE great again.",
                "It's going to be really sad when we spend all this time and money with the UAE to get a new AI model, and then China open sources a better one the next day. \n\nThe current view on AI by people like Trump and Musk is really a zero sum game for humanity, it's just that the 1% gains all the benefits at the cost to the 99%"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/17/2025 00:43:04 UTC"
}