{
    "posts": [
        {
            "category": "HOT",
            "title": "Ice deports Venezuelan teen despite reportedly knowing he was not a target",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/15/merwil-gutierrez-venezuelan-teen-deported-el-salvador",
            "upvotes": 13215,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ee360365a30b84e756e6cd505a06b458cdacf009/0_61_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be7ae080843db1eb7019eb2e247be2f1",
            "top_comments": [
                "From The Guardian:\n\n>A 19-year-old Venezuelan in New York City reportedly was apprehended by Trump administration immigration authorities and deported to El Salvador despite agents’ realizing he was not whom they meant to arrest in a targeted operation.\n\n>Merwil Gutiérrez, whose family opened an asylum case after arriving in the US, was deported from the Bronx to the notorious Cecot prison in El Salvador despite his relatives’ insistence that he has no gang ties or criminal history, according to Documented, a newsroom dedicated to telling the stories of immigrants in New York City. The Gutiérrez family says it has been left without information or answers.\n\n>The teen was detained alongside 237 other Venezuelans on 24 February by US Immigration and Customs Enforcement (Ice). His father, Wilmer Gutiérrez, told Documented: “I feel like my son was kidnapped.\n\n>“I’ve spent countless hours searching for him, going from one precinct to another, speaking with numerous people who kept referring me elsewhere. Yet, after all this, no one has given me any information or provided a single document about his case.”\n\n>The elder Gutiérrez reportedly said he overheard Ice agents saying that his son had not been the person they had come to get.\n\n>**The officers grabbed him and two other boys right at the entrance to our building. One said: ‘No, he’s not the one,’ like they were looking for someone else. But the other said: ‘Take him anyway,’” he recalled.**\n\n>**Gutiérrez has no criminal record either in Venezuela or the US, his family said. He also did not have any tattoos** which is a feature that US law enforcement often use to link people to the Tren de Aragua gang – a transnational criminal organization from Venezuela – and to justify their expulsions from the country.\n\n>**Despite this, Gutiérrez was arrested and later deported to El Salvador, to which he has no ties.**\n\n>Wilmer Gutiérrez says he discovered through a news report that his son had been deported to El Salvador under the Alien Enemies Act of 1798. He watched videos on social media that showed detainees facing harsh conditions, such as having their heads shaved by authorities and being marched to their prison cells.\n\n>”I could have understood if he’d been sent back to Venezuela,” he said. “But why to a foreign country he’s never even been to?”\n\n>The Gutiérrez family’s reported ordeal comes after the Trump administration admitted to wrongly deporting a Maryland man, Kilmar Abrego García, to the same Cecot facility.\n\n>The president of El Salvador said in a meeting with Trump on Monday that the Salvadoran government would not order the return of Abrego García to the US.\n\n>Monday’s meeting at the White House came amid a broader push by the Trump administration to remove noncitizens from the US, including people who are here legally and have not been charged with crimes.\n\n>Trump has also openly stated that he would like to remove US citizens who commit unspecified violent crimes and send them to the same Salvadoran prison as Abrego García and Gutiérrez.",
                "\"Deported\" is such a sanitized term for the horrors they're committing.",
                "We should prosecute the people who are actually doing these things. Make them afraid to follow illegal orders. It's pretty clear the people in charge are not going to stop or fix their mistakes.",
                "As things stand now, anyone deported is as good as dead. We should absolutely fight to get them back but the disgusting reality is that at present, there is very little motivating the president/admin of either the US or El Salvador to return these people. The US government is sending INNOCENT people including LEGAL migrants to DIE in a maximum security concrete box and Congress and the Judiciary are just watching and wringing their hands. This is all such a horrific, despicable nightmare.",
                "Trump has, in only a few months, flew beyond two legal instruments once used by England that the founding fathers found so despotic they outright prohibited them in the constitution and gave them as reason for the revolution - Transportation for trial and bills of attainder. \n\nExcept if you were transported for trial, you'd still get a trial, and a bill of attainder requires the legislature to vote to condemn someone. With Trump, theres no trial, and its just the whim of one man.\n\nWhat Trump is doing flies directly in the face of the Revolution and Constitution. He openly plots to extend this treatment to citizens. He is a tyrant and all means of resistance to him and his lackeys is justified.",
                "This is what fascism looks like and is the exact reason why we need due process. US citizens are next up. Trump said he would love to send home grown terrorists to El Salvador. ",
                "Explain to me like I’m 5 how this is not the literal definition of kidnapping.",
                "This is exactly why we have a Second Amendment.",
                "I can't stand this. What can I do? I feel powerless. I tried calling my representative, but I don't feel like that does anything. I feel so helpless.",
                "Someone please explain how this is different than German SS raids, because I see quite literally no distinguishing features"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Whistleblower org says DOGE may have caused ‘significant cyber breach’ at US labor watchdog",
            "external_url": "https://www.reuters.com/technology/cybersecurity/whistleblower-org-says-doge-may-have-caused-significant-cyber-breach-us-labor-2025-04-15/",
            "upvotes": 5822,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just imagine the damage we won't find out about until years later",
                "DOGE is the cyber breach...",
                "This story is getting lost in the sauce, but outside of the current disappearing of non-native citizens, this is probably the largest \"wtf omg bbq\" scandal of the administration. DOGE staffers stole 10 gigabytes worth of data from NLRB's network, and then attempted to hide their trail so no one would find out. They're stealing information on almost all americans, but also sensitive information on unions, ongoing legal cases and corporate secrets, including cases involving Musk's companies. It's a long read, but the source is from NPR.  \"https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security",
                "> The NLRB, a New Deal-era agency that is tasked with protecting workers' rights to organize and join unions, has for years been a target of America's corporate titans, including Musk, some of whom are now seeking to have the agency's powers declared unconstitutional.\n\n>In an affidavit, Berulis said he had evidence that DOGE staffers were given extraordinarily sweeping access to the NLRB's systems, including to sensitive case files. He said that beginning in early March, logging protocols created to audit users appeared to have been tampered with, and that he had detected the removal of about 10 gigabytes worth of data from NLRB's network sometime thereafter.\n\n> That kind of spike is extremely unusual because data almost never directly leaves NLRB's databases,\" Berulis said in his affidavit.\nA spokesperson for Musk's team - officially known as U.S. DOGE Service - didn't immediately return a message seeking comment. A message left with the NLRB also wasn't immediately returned, although NPR, which first reported the story, opens new tab, quoted an NLRB spokesperson as disputing Berulis' claims and saying there had been no breach. Cotton and Warner didn't immediately return messages seeking comment.\n\n> NPR, which said it interviewed 30 sources in government, law enforcement, the cybersecurity industry, and the labor movement about the complaint, said that the disabling of logging software was reminiscent of cybercriminal behavior.\n\n>Berulis' affidavit said that an effort by him and his colleague to formally investigate and alert the Cybersecurity and Infrastructure Security Agency (CISA) was disrupted by higher-ups without explanation. A message left with CISA wasn't immediately returned.",
                "I heard about this on NPR. What NPR reported but is not included in this article, is that they detected remote logins using legitimate usernames and passwords, but originating from a Russian IP address. So not only is DOGE removing information, but they’ve given remote access to Russia. 99.9999999% chance this isn’t the only agency they now have access to.",
                "I can only imagine what DOGE would be doing at the NLRB… oh wait, targeting union organizers. \n\nIt is happening.",
                "Whichever departments are still untouched should probably get going on independent backups of their data.",
                ">The employees grew concerned that the NLRB's confidential data could be exposed, particularly after they started detecting suspicious log-in attempts from an IP address in Russia\n\nwho could have seen this coming",
                "Quote from the legal document presented by the NLRB's lawyers\n\n\n>This declaration details DOGE activity within NLRB, the exfiltration of data fromNLRB systems, and – concerningly – near real-time access by users in Russia. \n\n\n>Notably,within minutes of DOGE personnel creating user accounts in NLRB systems, onmultiple occasions someone or something within Russia attempted to login using all ofthe valid credentials (eg. Usernames/Passwords).\n\n\nHoly fuck. Sends chills down my spine. They are really russian assests that have infilitrated the highest levels of The U.S. government.\n\n\nBlood will spill over all of this shit",
                "What? An illegitimate organization, created for the sole person of enriching its creator, is causing harm. Get the fuck out of here."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "‘Treated like a criminal': US citizen says he was detained returning from Canada",
            "external_url": "https://nbcnewyork.app.link/UHX2TktOASb",
            "upvotes": 3222,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said. \"Things actually changed to the worse.\"\n\n  \nWhatta maroon.",
                "> \"I literally drove my car to Canada for the weekend, and on the way back, I was treated like a criminal,\" said Atallah, who has been a U.S. citizen for 10 years.\n\n> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nI never thought the leopards would eat my face.",
                "Trump supporter is impacted by Trump's vileness.\n\n[https://youtu.be/8QGy9D\\_c1pY?feature=shared&t=22](https://youtu.be/8QGy9D_c1pY?feature=shared&t=22)\n\n\n\n>Atallah is planning to leave for Lebanon in a few days, and he is not sure what will happen when he tries to return.\n\n\n\nROFL.  If he got detained driving back from Canada, there is no way the Trump administration is letting him back in the country from Lebanon.",
                "Not only is he a moron for supporting Trump, he's also a moron for letting his attorney-client privileged communications be searched through by customs/border agents. I hope anyone who retained this idiot fires him pronto.",
                "Why do trump voters all think they're so fucking special? It really ought to be studied how they all have this main character syndrome. It won't happen to *me*, I'm awesome! Trump loves *me*!",
                "It's so hard to have empathy for people who voted for this.\n\n>I thought things would be better with Mr Trump but they are worse.\n\nFucking dummy would probably vote for him again.",
                "Went through all that, then goes off to lebanon, not the brightest bulb in the pack",
                ">\"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said. \"Things actually changed to the worse.\"\n\n>NBC10 Boston has reached out to the Department of Homeland Security and Customs and Border Protection, but has not heard back.\n\n>Atallah is planning to leave for Lebanon in a few days, and he is not sure what will happen when he tries to return.\n\nMan who voted for the face eating leopards is surprised that the leopard started eating his face, too. And then he's about to put himself back into this situation by leaving the country again.\n\n  \nFucking idiot. He got what he voted for.",
                "Man as a lebanese myself i can’t help but laugh at this idiot, you deserve it",
                "People with ethnically diverse names should know better.\n\nEdit: typo."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Funeral to be held for Idaho teen with autism shot 9 times by police in his yard",
            "external_url": "https://www.nbcnews.com/news/us-news/funeral-held-idaho-teen-autism-shot-9-police-yard-rcna201360",
            "upvotes": 2788,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-victor-perez-mn-1305-dda988.jpg",
            "top_comments": [
                "These fucking pigs had a goddamn fence between them and the kid that looked like he couldn’t even walk and unloaded on him in less than 15 seconds from the time they arrived. Fuck all of them.",
                "As a parent to a son with autism this story scares the shit out of me.",
                "they'll try to justify this moment to themselves for the rest of their lives, and the law may address it one way or the other, but every one of them who fired their gun just *murdered* this kid.",
                "We have the video. The kid could barely stand up, was 6 feet behind a fence, and the cops started shooting almost immediately after getting out of their cars. This was a straight up murder. \n\nI have autism and mental illness and spend a lot of time with people who could easily become this boy. It's really scary.",
                "Shithole country. Anywhere else, no less than the president or prime minister would be addressing the entire nation.",
                "Crazy that an unarmed disabled child scared these officers enough that they immediately drew service weapons and didn't even consider less lethal means. Really speaks poorly of their character and courage.",
                "I've watched several videos of teens with autism getting man-handled or straight up physically abused by cops because of spasms or whatever else. It's pretty horrifying to think about. This is the worst case I think i've heard about. Just absolutely mind boggling. So much wrong..",
                "They went and executed this kid. Fuck those pigs. ",
                "Surprised they could hit a target 9 times.. wonder how many shots they fired ",
                "Here is the number for the Pocatello Mayor’s office if you’d like to voice your dismay over this murder:\n\n208-234-6163"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Woman dies and another in hospital after cryotherapy session at Paris gym",
            "external_url": "https://www.theguardian.com/world/2025/apr/15/woman-dies-hospital-cryotherapy-paris-gym",
            "upvotes": 5285,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e1c914d11deb040a2daddb7e7a32308330b4ddbd/0_579_8688_5213/master/8688.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=59b89eb461ff34a2bee6fe69205abf6a",
            "top_comments": [
                "Inhaled nitrogen displaces the oxygen in your lungs.  Because it is not carbon dioxide, your body does not realize it is being oxygen starved.  You just breath it in and pass out, then die if you do not have assistance.\n\nScary stuff.",
                "This happened in Vegas a decade or so ago. \n\nWeeks after a spa worker was found dead at a Las Vegas cryotherapy center, authorities said Tuesday she suffocated in the chamber chilled by liquid nitrogen.\n\nChelsea Patricia Ake-Salvacion, 24, died accidentally from the asphyxia caused by low oxygen levels, the Clark County coroner’s office said.\n\nThe death drew scrutiny to the treatment where people are subjected to extremely low temperatures not found anywhere on Earth.\n\nBackers claim it can ease pain and inflammation, aid blood flow and weight loss, improve skin and even ward off aging and depression.\n\nThe treatments, however, have not been approved for medical use by the U.S. Food and Drug Administration.\n\n[Link](https://apnews.com/general-news-4b2b9b54c046443694b83bb002e39164#:~:text=LAS%20VEGAS%20(AP)%20—%20Weeks,Clark%20County%20coroner's%20office%20said)",
                "> The dead woman, a 29-year-old employee of the gym, collapsed after a nitrogen leak from a cold chamber that had been repaired earlier in the day, sources close to the inquiry said. The colourless and odourless gas is used to create an atmosphere of extreme subzero temperatures.\n\nIf the repair they did was dealing with a leak, this is a tragedy that could have easily been prevented. They could have taken the time to make sure the equipment was indeed safe.",
                "This was completely unnecessary and should have been prevented. I used to work with cryogens and there should have been a risk assessment, and safety measures in place. This is so sad.",
                "Water ice is cold enough for most purposes. And its vapor is harmless.",
                "This shit is a pseudo science scam and needs to be banned. These clowns will claim that these chambers that essentially flash freeze your body force your body to expend 100s of calories worth of energy in an extremely short window to fight off the cold and give you the benefits of an extended cardio workout in a very short period of time.\n\nThis is one of the countless scams that, if there were any evidence that this actually worked, would have become a widespread common practice decades ago.",
                "This is some Final Destination 2 stuff.",
                ">Modern cryotherapy involves using liquid nitrogen or nitrous oxide to expose the body to temperatures between -110C and -140C (-166F and -230F) in baths or cabins.\n\nSeems they added a 1 in front of the temps.\n\nExposed skin in -230f would break off like the T-1000 at the end of Terminator 2.",
                "It reminded me of Linda Evangelista and cool sculpting, and how her body became disfigured. She hid for years.",
                "Why are people playing with liquid nitrogen?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Indiana mom brought gun to grade school and threatened lesbian teacher, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/mom-arrested-bringing-gun-indiana-elementary-school-harassing-teacher-rcna201316",
            "upvotes": 1113,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-wthr-mom-gun-3-ew-1120a-033dc9.jpg",
            "top_comments": [
                ">The teacher, who keeps a picture of her wife and daughter on her desk, told police that she \"gave an assignment to the whole class with the subject matter of flags.\" When she was giving examples of country flags, she also referenced the rainbow flag in the classroom with the words \"be kind\" on it, the affidavit said.\n\n>Rivers told the teacher she disagreed with an assignment, accusing the educator of \"trying to push her personal agenda in regard to sexuality on her daughter,\" the affidavit said. The teacher said she allowed Rivers' daughter to skip the assignment.\n\nRemember that time Jesus said fuck being kind to people?\n\n  \nAlso just imagine living in so much fear that you feel the need to bring a gun to drop off your kid. That level of paranoia is just unfathomable to me.",
                "> Police let Rivers go, but then she sent a threatening message to her daughter's teacher 25 minutes later, the affidavit states.\nRivers told the teacher that \"god will condemn you to hell\" and that \"your (sic) a child predator,\" the affidavit states.\nRivers allegedly told the teacher to \"say ur prayers and kiss ur kids goodbye and goodnight u never know when god says its (sic) our time so be prepared.\"\n\nThis person plans to homeschool their child? Maybe they can take lessons in spelling together. Sadly, the thing they're most likely to teach their child is hatred.",
                "Them Christian values. I doubt any of them actually reads the Bible. Just a club to hate on people.\nLol",
                "Hilarious that her excuse as a responsible gun owner was that she \"didn't even realize she had it on\" and has committed the same crime of bringing it to a school multiple times in the past",
                "Will POTUS say “whack job” as he did regarding the arsonist who attacked the Pennsylvania’s Governor’s Mansion???",
                "Carrying a gun on a school campus and threatening a teacher cause they used a pride flag that said “be kind” on it as one of her several examples. I don’t know God, but I have a hard time they would want this person speaking for them. \n\nAlso, I feel horrible for that kid. Their parents are beyond psycho and now they’ll be “homeschooled” away from any protection. ",
                "When \"Be Kind\" is enough to provoke people to threats and violence, maybe it's time to take a deeper look at where these people are getting indoctrinated.",
                "They didn't even arrest her for the gun initially. All this was swept away with a warning but then ole girl doubles down and makes more threats 25 minutes later. Somebody tell her white privilege has a 30 minute cool down before it can be used for the same thing again.",
                "I wonder what would happen if a gay person showed up to a school with a gun and threatened to shoot a straight teacher for having a picture of their family on their desk 🧐",
                "It's always a good day to read up on \"stochastic terrorism\".\n\nA few things jumped out at me:\n\n>When [police] arrived, officers noticed Rivers had something on her waistband that looked like a firearm, the affidavit stated... \"Carrie Rivers stated that she did have a gun as I was removing it from her person,\" responding police officer Tabetha Emenaker wrote in the affidavit. \"I advised Carrie Rivers on the law in regard to having a firearm on school premises and that it was an arrestable offense. \n\nThe police, however, *did not arrest her.* Not only did they miraculously de-escalate the situation, they also let the person go. I haven't seen any pictures of her, but she's definitely white. \n\n\n>She understood and stated that she didn't even realize that she had it on because she is so used to wearing it and has been on school property with it before.\"\n\nMurica!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "At US antitrust trial, Meta's Zuckerberg admits he bought Instagram because it was 'better' -",
            "external_url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-antitrust-trial-metas-zuckerberg-admits-he-bought-instagram-because-it-was-2025-04-15/",
            "upvotes": 1639,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you can't beat them, buy them and absorb their data.",
                "I mean, why else would he buy it?",
                "and then he made it worse",
                "Why bother innovating when you can simply become a monopoly?",
                "Why is this news? They all do that... buy up the competition",
                "Someone, please tell one of Zuck's **Yes** people that he looks like Andy Dick with that hair!",
                "And then he fucking ruined it",
                "Hopefully this testimony is a meaningful component to unwinding the deal. I deleted Facebook and kept Instagram…because it’s better. I don’t use it much but I still wish Facebook never gobbled it up.\n\nGet fucked, Zuck. 🖕🏻",
                "I think buying it even if it's worse would be more of a problem, because they you really are just removing competition from the marketplace. At least if you buy it because it's better, you have a genuine reason for doing it.\nBuying all competitors, even the shit ones, should be a red flag.",
                "I agree Mr. Zuckerberg it WAS better before you bought it"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Measles cases linked to Texas outbreak reach 561, with 20 new infections confirmed",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-reach-561-20/story?id=120819175",
            "upvotes": 1330,
            "date": "04/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/96cbf0af-721a-49d6-8ca6-c3054c6b7bfb/measles-sign-ap-jt-250311_1741732269895_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This was entirely preventable. \n\nSo many children will suffer, become disabled, or die for literally no good reason.",
                "The cases are almost certainly undercounted by a large margin. The number of deaths and complications would are occuring at a rate higher than reported numbers should indicate. \n\n[Texas measles outbreak hits 500 cases, but expert says it could be 4 times higher](https://www.statesman.com/story/news/healthcare/2025/04/09/texas-measles-cases-hit-500-but-expert-says-it-could-be-4-times-that/82998607007/) (*Austin American Statesman*). \n\nThis article says 4x, but I've seen sources that say it may be higher.",
                "Meanwhile the father of the girl who died of measles [has no regrets and is blaming the liberal media while insisting she didn't die of measles.](https://www.nysun.com/article/father-of-second-texas-child-to-die-of-measles-says-he-has-no-regrets-about-not-vaccinating-his-daughter-blames-left-wing-media) The US has hit a point where vaccination is outright rejected and parents of dead kids refuse to acknowledge their child died from a preventable disease. We've officially hit idiocracy and the amount of measles cases are only going to continue increasing.",
                "This update adds 20 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 36 cases. Last Tuesday's update added 24 cases. Last Friday's update added 59 cases.\n\nTwo new hospitalizations were reported, up to 58 from 56. Texas has two deaths associated with this outbreak. Both were in school-aged children.",
                "Remember, pro life only means before you enter this world. After… meh",
                "If this didn't have serious and harmful consequences it would almost be funny. Sadly they are letting this shit happen because they are scared of vaccines. \"I'd rather have a dead kid than whatever was in the vaccine \"",
                "Since it’s also spread to many other states at this point, and is just crazy contagious, I like to spread the word to parents that babies can be vaccinated for measles as early as 6 months. They’ll still need two shots after age one to reach peak immunity, but they can get some protection before the official vaccine schedule. If insurance doesn’t want to cover it, tell the doctor you’re traveling abroad.",
                "WTF how many unvacinated people are there in texas?",
                "Of the other states that have cases associated with this outbreak that's concentrated in conservative Mennonite communities, only New Mexico updates on Friday like Texas. So far, they're not showing an increase in cases but that may be because they haven't posted today's update yet. They are currently at 58 cases and have reported one death that is suspected to be from measles but the official cause of death is still under investigation.\n\nOklahoma only updates on Tuesdays. Their reported cases have decreased from 10 to 9. That likely means they had a probable case in their count that didn't end up being a confirmed case.\n\nKansas updates on Wednesdays. Their case total is at 32 and their outbreak was reported as likely connected to the larger Texas outbreak. They have reported one hospitalization.",
                "Making Measles great again."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "In a first, Japan issues cease-and-desist order against Google",
            "external_url": "https://www.japantimes.co.jp/business/2025/04/15/companies/google-anti-monopoly-law/",
            "upvotes": 2361,
            "date": "04/15/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/15/463652.jpg?v=3.1",
            "top_comments": [
                "I’m all for reining in big tech. Going by the article though, if there is no default choice, then these “at least 6” of the manufacturers would lose search revenue sharing that is cited… which then i assume would lower overall choice in the market from a phone manufacturer perspective further consolidating the market to Google and Apple",
                "I agree with this, even Microsoft got the heat in the 90's. But, how has Apple been so immune to this?",
                "Can you buy a laptop without either Windows or Apple on it? I don't understand, unless this is just the beginning...",
                "Wow this must really hurt after getting fined $2 undecillion by Russia",
                "The problem is that manufacturers also like this deal on which they get to receive an amount of money for selling the most valuable screen space to the highest bidder, on their phones.",
                "They’ll take the fine and not even blink.",
                "Google has spent money/time developing the Android OS. If they dont like it - find a company that makes other smartphone OS to use different browser.\n\nPeople just love to complain."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "West Point graduate becomes the first woman to compete in the grueling Army Ranger contest",
            "external_url": "https://apnews.com/article/army-ranger-competition-female-first-7182c5659e04162a4476eae2113b15d7",
            "upvotes": 1359,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Her team came in 14th of 52.  Nice job.",
                "Great... now she will be canned because of DEI.",
                "Surprised the current leadership allowed it.",
                ">Female soldiers were not allowed to be Army Rangers until 2015\n\nThat's crazy",
                "And she seemingly performed quite well. \n\nA shame the military hates women that do well.",
                "Just wait until The Orange Turd and associates hear that a woman is better than man in the Rangers Army , She will be dismissed/fired soon enough…",
                "She's also the first woman to have her award denied as part of anti-DEI efforts from the trump administration. /s",
                "It was one for the history books",
                "Can't wait for Republicans to blame her when something goes wrong in her vicinity",
                "Fuck yea! Thats so awesome!"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "834 cases of amputation recorded among children since Israel resumed war on Gaza",
            "external_url": "https://www.mena.org.eg/en/news/dbcall/table/textnews/id/11139924",
            "upvotes": 9,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "April 19: 'No Kings Day' – 50501 Mobilizes Protests Across All 50 States",
            "external_url": "https://yellowscene.com/events/april-19-no-kings-day-50501-mobilizes-protests-across-all-50-states/",
            "upvotes": 22,
            "date": "04/15/2025",
            "thumbnail": "https://yellowscene.com/wp-content/uploads/2025/04/No-Kings-Day.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police respond to shooting at Wilmer-Hutchins High School in Dallas, Texas",
            "external_url": "https://www.cbsnews.com/texas/news/shooting-wilmer-hutchins-high-school-dallas-police/",
            "upvotes": 84,
            "date": "04/15/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/3f888c36-e560-46d5-a63d-7d2a51e69d81/thumbnail/1200x630/3a2611275f7d95f4eccb673e7e496ea2/toc-04152025-chopper-wilmer-hutchins-school-shooting-13-30-56-00.jpg?v=412b48b2e3085db78364e6e02a7dc2b8",
            "top_comments": [
                "This was the only silver lining to covid for me. For a year I never had to worry about this with my kids.",
                "Well, at least *one* thing about the US remains constant amidst the additional madness.",
                "Article says that school had a shooting 1 year ago too.",
                "What number is that this year",
                "\"We've tried nothing and we're all out of ideas!\"",
                "Respond with indifference?",
                "4 people were taken to the hospital, and among these was one 17 year old student was shot in the leg."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "NEW",
            "title": "US judge to question Trump officials' refusal to return Kilmar Abrego Garcia",
            "external_url": "https://apnews.com/article/kilmar-abrego-garcia-el-salvador-trump-deported-e537cfb69a9840046b5d3e512509e9a8",
            "upvotes": 206,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Why won't you?\"\n\n\"Don't want to.\"\n\n\"Oh. Okay.\"",
                "Just want to point out how Mr. Garcia's case illustrates how if the US permits the deportation of criminals, Trump will have unlimited power to imprison Americans without trial and without judicial review.\n\nThe mechanism for releasing a person imprisoned unlawfully is a legal process called Habeas Corpus, or a Habeas petition.  A Habeast petition, legally, is an instruction issued by the Court to an officer of the government to indicate that the detention of an individual is unlawful, and to order that person's release.\n\nIf a person is unlawfully detained in an American prison, the way you get out is to have a Habeas petition accepted by a US Court, which then issues the Court order granting release.\n\nWhy doesn't this work for Mr. Garcia?  Because Mr. Garcia is being held in an El Savadorian Prison--the Court can determine that his deportation and imprisonment is unlawful, but the Court lacks the legal authority to tell El Salvadore to do anything.\n\nWhat's less clear is what the Court can do to compel the Executive Branch to act to bring him back--that is a KEY question in this case.\n\nBut this also highlights how if the President were permitted to imprison people overseas, all Due Process rights for Americans would disappear in an instant.\n\nSalvadorian prisons do not need to comply with Habeas Petitions.  If an American were arrested in the middle of the night and put on a plane to a prison in El Salvadore, the only way to ordinarily release that person would be to file a Habeas Petition--but that person is already overseas and under the management of the Gov't of El Salvadore.\n\nThe Executive Branch could refuse to seek that person's release from El Salvadore and the their govnerment could comply with that request.\n\nAnd the Courts would be powerless to enforce a finding that the imprisonment of an American is illegal.\n\nIn other words, Trump could have people arrested whenever he wanted to and imprison them without trial by shipping them to El Salvador, and the Courts would be powerless to stop him.\n\nTrump's push to imprison Americans in overseas prisons is one of the most Constitutionally dangerous proposals I have heard in my lifetime.",
                "Not only did Trump defy the US Supreme Court, but he openly mocked them by bringing the El Salvadore President to the Oval Office so they could both laugh at the notion of following the Supreme Court ruling.\n\nWe don't have a Constitution if the President is allowed to ignore it.",
                "Fucking useless checks and balances",
                "If ICE takes you, you may never see home again. Don't ever go with these people.",
                "They should also try a strongly worded letter. ",
                "I can’t wait for the Trump regime to ignore yet another court order. /s\n\nIt’s so fucked up that these thugs continue to flout laws and norms that the rest of us would be killed for.",
                "What Trump has proposed with American Citizens, what he's done to those here lawfully, and what he's done to those alledged to be here illegally... Isn't he showing people that it's better to fight till the death instead of being picked up by police?",
                "When they find out he's been unalived, then what? Finger wagging and whispering \"Bad donny, bad.\""
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Trump ally Marjorie Taylor Greene bought Tesla, Amazon, Blackstone before rally",
            "external_url": "https://www.bnnbloomberg.ca/business/2025/04/15/trump-ally-marjorie-taylor-greene-bought-tesla-amazon-blackstone-before-rally/",
            "upvotes": 218,
            "date": "04/15/2025",
            "thumbnail": "https://www.bnnbloomberg.ca/resizer/v2/KZAKZXMPKYUIYS4JXIPTC7C7IE.jpg?smart=true&auth=e48232a8a346ec23e352c56653c5fee2c2a9a7a83da89aa61e8e4b7876e157a1&width=1200&height=630",
            "top_comments": [
                "Even though everyone can agree congresspeople shouldnt be trading stock\n\nIts up to congresspeople to change that which is why i would be astonished to see it happen in my lifetime\n\nAnd this admin is no stranger to open conflicts of interest, clear insider trading and even loosening regulation on taking bribes\n\nPlus our supreme court loves to take bribes \n\nWhat a joke",
                "I'm sure the SEC will get right on that.",
                "The missing story here is who traded contracts. MTG and others might have bought long term investments but if you are insider trading leverage is so much more profitable and if they are only held for a short time I don't think they will be reported. SPY calls went parabolic before the pause announcement.",
                "Why are we even reporting insider trading at this point? Every politician has been doing it for decades, clearly it's 100% legal and socially acceptable."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Indiana mom brought gun to grade school and threatened lesbian teacher, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/mom-arrested-bringing-gun-indiana-elementary-school-harassing-teacher-rcna201316",
            "upvotes": 1115,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-wthr-mom-gun-3-ew-1120a-033dc9.jpg",
            "top_comments": [
                ">The teacher, who keeps a picture of her wife and daughter on her desk, told police that she \"gave an assignment to the whole class with the subject matter of flags.\" When she was giving examples of country flags, she also referenced the rainbow flag in the classroom with the words \"be kind\" on it, the affidavit said.\n\n>Rivers told the teacher she disagreed with an assignment, accusing the educator of \"trying to push her personal agenda in regard to sexuality on her daughter,\" the affidavit said. The teacher said she allowed Rivers' daughter to skip the assignment.\n\nRemember that time Jesus said fuck being kind to people?\n\n  \nAlso just imagine living in so much fear that you feel the need to bring a gun to drop off your kid. That level of paranoia is just unfathomable to me.",
                "> Police let Rivers go, but then she sent a threatening message to her daughter's teacher 25 minutes later, the affidavit states.\nRivers told the teacher that \"god will condemn you to hell\" and that \"your (sic) a child predator,\" the affidavit states.\nRivers allegedly told the teacher to \"say ur prayers and kiss ur kids goodbye and goodnight u never know when god says its (sic) our time so be prepared.\"\n\nThis person plans to homeschool their child? Maybe they can take lessons in spelling together. Sadly, the thing they're most likely to teach their child is hatred.",
                "Them Christian values. I doubt any of them actually reads the Bible. Just a club to hate on people.\nLol",
                "Hilarious that her excuse as a responsible gun owner was that she \"didn't even realize she had it on\" and has committed the same crime of bringing it to a school multiple times in the past",
                "Will POTUS say “whack job” as he did regarding the arsonist who attacked the Pennsylvania’s Governor’s Mansion???",
                "Carrying a gun on a school campus and threatening a teacher cause they used a pride flag that said “be kind” on it as one of her several examples. I don’t know God, but I have a hard time they would want this person speaking for them. \n\nAlso, I feel horrible for that kid. Their parents are beyond psycho and now they’ll be “homeschooled” away from any protection. ",
                "When \"Be Kind\" is enough to provoke people to threats and violence, maybe it's time to take a deeper look at where these people are getting indoctrinated.",
                "They didn't even arrest her for the gun initially. All this was swept away with a warning but then ole girl doubles down and makes more threats 25 minutes later. Somebody tell her white privilege has a 30 minute cool down before it can be used for the same thing again.",
                "I wonder what would happen if a gay person showed up to a school with a gun and threatened to shoot a straight teacher for having a picture of their family on their desk 🧐",
                "It's always a good day to read up on \"stochastic terrorism\".\n\nA few things jumped out at me:\n\n>When [police] arrived, officers noticed Rivers had something on her waistband that looked like a firearm, the affidavit stated... \"Carrie Rivers stated that she did have a gun as I was removing it from her person,\" responding police officer Tabetha Emenaker wrote in the affidavit. \"I advised Carrie Rivers on the law in regard to having a firearm on school premises and that it was an arrestable offense. \n\nThe police, however, *did not arrest her.* Not only did they miraculously de-escalate the situation, they also let the person go. I haven't seen any pictures of her, but she's definitely white. \n\n\n>She understood and stated that she didn't even realize that she had it on because she is so used to wearing it and has been on school property with it before.\"\n\nMurica!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Funeral to be held for Idaho teen with autism shot 9 times by police in his yard",
            "external_url": "https://www.nbcnews.com/news/us-news/funeral-held-idaho-teen-autism-shot-9-police-yard-rcna201360",
            "upvotes": 2785,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-victor-perez-mn-1305-dda988.jpg",
            "top_comments": [
                "These fucking pigs had a goddamn fence between them and the kid that looked like he couldn’t even walk and unloaded on him in less than 15 seconds from the time they arrived. Fuck all of them.",
                "As a parent to a son with autism this story scares the shit out of me.",
                "they'll try to justify this moment to themselves for the rest of their lives, and the law may address it one way or the other, but every one of them who fired their gun just *murdered* this kid.",
                "We have the video. The kid could barely stand up, was 6 feet behind a fence, and the cops started shooting almost immediately after getting out of their cars. This was a straight up murder. \n\nI have autism and mental illness and spend a lot of time with people who could easily become this boy. It's really scary.",
                "Shithole country. Anywhere else, no less than the president or prime minister would be addressing the entire nation.",
                "Crazy that an unarmed disabled child scared these officers enough that they immediately drew service weapons and didn't even consider less lethal means. Really speaks poorly of their character and courage.",
                "I've watched several videos of teens with autism getting man-handled or straight up physically abused by cops because of spasms or whatever else. It's pretty horrifying to think about. This is the worst case I think i've heard about. Just absolutely mind boggling. So much wrong..",
                "They went and executed this kid. Fuck those pigs. ",
                "Surprised they could hit a target 9 times.. wonder how many shots they fired ",
                "Here is the number for the Pocatello Mayor’s office if you’d like to voice your dismay over this murder:\n\n208-234-6163"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Video shows a Venezuelan man tackled in a New Hampshire courthouse. He was then sent by ICE to Texas.",
            "external_url": "https://www.cbsnews.com/boston/news/venezuelan-man-tackled-new-hampshire-courthouse-texas-ice/?intcid=CNM-00-10abd1h",
            "upvotes": 308,
            "date": "04/15/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/14/8562a2a7-a30b-4aa5-9b17-1ed911e3231c/thumbnail/1200x630/8bf9800f5df22532c75eccedac116860/ice-nh-courthouse.jpg?v=412b48b2e3085db78364e6e02a7dc2b8",
            "top_comments": [
                "Brown shirts abducting people to send them to Dachau. ",
                "Canadian here. I remember when I was on tour with my band back in 2013, and we were driving through Texas when we came across one of those ICE checkstops(?). We had one of those big Ford Econoline vans, & I was in the front passenger seat and the sternfaced ICE agent approached our window and noticeably softened when he saw that 2 white kids were in the front seats. With a smile on his face he went \"All American citizens here boys?\" with a tone that was very \"of course you are, I'm just asking the question and I'll send you on your way.\" and the driver responded, \"no sir.\".\n\nI can not begin to describe how the second those words left his lips the tone of the entire interaction flipped on a dime, the face of the ICE agent changed in a flash to a look of pure \"I've been training my whole life for this moment when I get to gun down an illegal\", and I could see his hand slowly move down to his hip. \n\nThe whole thing lasted about 2 seconds before I cut in with a \"Canadians!\" and he took our passports and verified it before letting us go, but that 2 seconds felt like hours in the moment. It was at that point I realized that ICE agents have zero humanity.",
                "\"Live Free or Die\" \n\nWelp... The motto holds true.",
                "I mean the content alone is already problematic but did they really need to tackle him to the ground too? Like, c'mon guys you're already wearing the red armbands, do you need the skull caps too?",
                "This man with no violent criminal history could be a threat, guns drawn boys.",
                "Oh good God! Anywhere but Texas!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "‘Treated like a criminal': US citizen says he was detained returning from Canada",
            "external_url": "https://nbcnewyork.app.link/UHX2TktOASb",
            "upvotes": 3232,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said. \"Things actually changed to the worse.\"\n\n  \nWhatta maroon.",
                "> \"I literally drove my car to Canada for the weekend, and on the way back, I was treated like a criminal,\" said Atallah, who has been a U.S. citizen for 10 years.\n\n> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nI never thought the leopards would eat my face.",
                "Trump supporter is impacted by Trump's vileness.\n\n[https://youtu.be/8QGy9D\\_c1pY?feature=shared&t=22](https://youtu.be/8QGy9D_c1pY?feature=shared&t=22)\n\n\n\n>Atallah is planning to leave for Lebanon in a few days, and he is not sure what will happen when he tries to return.\n\n\n\nROFL.  If he got detained driving back from Canada, there is no way the Trump administration is letting him back in the country from Lebanon.",
                "Not only is he a moron for supporting Trump, he's also a moron for letting his attorney-client privileged communications be searched through by customs/border agents. I hope anyone who retained this idiot fires him pronto.",
                "Why do trump voters all think they're so fucking special? It really ought to be studied how they all have this main character syndrome. It won't happen to *me*, I'm awesome! Trump loves *me*!",
                "It's so hard to have empathy for people who voted for this.\n\n>I thought things would be better with Mr Trump but they are worse.\n\nFucking dummy would probably vote for him again.",
                "Went through all that, then goes off to lebanon, not the brightest bulb in the pack",
                ">\"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said. \"Things actually changed to the worse.\"\n\n>NBC10 Boston has reached out to the Department of Homeland Security and Customs and Border Protection, but has not heard back.\n\n>Atallah is planning to leave for Lebanon in a few days, and he is not sure what will happen when he tries to return.\n\nMan who voted for the face eating leopards is surprised that the leopard started eating his face, too. And then he's about to put himself back into this situation by leaving the country again.\n\n  \nFucking idiot. He got what he voted for.",
                "Man as a lebanese myself i can’t help but laugh at this idiot, you deserve it",
                "People with ethnically diverse names should know better.\n\nEdit: typo."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Whistleblower org says DOGE may have caused ‘significant cyber breach’ at US labor watchdog",
            "external_url": "https://www.reuters.com/technology/cybersecurity/whistleblower-org-says-doge-may-have-caused-significant-cyber-breach-us-labor-2025-04-15/",
            "upvotes": 5831,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just imagine the damage we won't find out about until years later",
                "DOGE is the cyber breach...",
                "This story is getting lost in the sauce, but outside of the current disappearing of non-native citizens, this is probably the largest \"wtf omg bbq\" scandal of the administration. DOGE staffers stole 10 gigabytes worth of data from NLRB's network, and then attempted to hide their trail so no one would find out. They're stealing information on almost all americans, but also sensitive information on unions, ongoing legal cases and corporate secrets, including cases involving Musk's companies. It's a long read, but the source is from NPR.  \"https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security",
                "> The NLRB, a New Deal-era agency that is tasked with protecting workers' rights to organize and join unions, has for years been a target of America's corporate titans, including Musk, some of whom are now seeking to have the agency's powers declared unconstitutional.\n\n>In an affidavit, Berulis said he had evidence that DOGE staffers were given extraordinarily sweeping access to the NLRB's systems, including to sensitive case files. He said that beginning in early March, logging protocols created to audit users appeared to have been tampered with, and that he had detected the removal of about 10 gigabytes worth of data from NLRB's network sometime thereafter.\n\n> That kind of spike is extremely unusual because data almost never directly leaves NLRB's databases,\" Berulis said in his affidavit.\nA spokesperson for Musk's team - officially known as U.S. DOGE Service - didn't immediately return a message seeking comment. A message left with the NLRB also wasn't immediately returned, although NPR, which first reported the story, opens new tab, quoted an NLRB spokesperson as disputing Berulis' claims and saying there had been no breach. Cotton and Warner didn't immediately return messages seeking comment.\n\n> NPR, which said it interviewed 30 sources in government, law enforcement, the cybersecurity industry, and the labor movement about the complaint, said that the disabling of logging software was reminiscent of cybercriminal behavior.\n\n>Berulis' affidavit said that an effort by him and his colleague to formally investigate and alert the Cybersecurity and Infrastructure Security Agency (CISA) was disrupted by higher-ups without explanation. A message left with CISA wasn't immediately returned.",
                "I heard about this on NPR. What NPR reported but is not included in this article, is that they detected remote logins using legitimate usernames and passwords, but originating from a Russian IP address. So not only is DOGE removing information, but they’ve given remote access to Russia. 99.9999999% chance this isn’t the only agency they now have access to.",
                "I can only imagine what DOGE would be doing at the NLRB… oh wait, targeting union organizers. \n\nIt is happening.",
                "Whichever departments are still untouched should probably get going on independent backups of their data.",
                ">The employees grew concerned that the NLRB's confidential data could be exposed, particularly after they started detecting suspicious log-in attempts from an IP address in Russia\n\nwho could have seen this coming",
                "Quote from the legal document presented by the NLRB's lawyers\n\n\n>This declaration details DOGE activity within NLRB, the exfiltration of data fromNLRB systems, and – concerningly – near real-time access by users in Russia. \n\n\n>Notably,within minutes of DOGE personnel creating user accounts in NLRB systems, onmultiple occasions someone or something within Russia attempted to login using all ofthe valid credentials (eg. Usernames/Passwords).\n\n\nHoly fuck. Sends chills down my spine. They are really russian assests that have infilitrated the highest levels of The U.S. government.\n\n\nBlood will spill over all of this shit",
                "What? An illegitimate organization, created for the sole person of enriching its creator, is causing harm. Get the fuck out of here."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump ally Marjorie Taylor Greene bought Tesla, Amazon, Blackstone before rally",
            "external_url": "https://www.bnnbloomberg.ca/business/2025/04/15/trump-ally-marjorie-taylor-greene-bought-tesla-amazon-blackstone-before-rally/",
            "upvotes": 217,
            "date": "04/15/2025",
            "thumbnail": "https://www.bnnbloomberg.ca/resizer/v2/KZAKZXMPKYUIYS4JXIPTC7C7IE.jpg?smart=true&auth=e48232a8a346ec23e352c56653c5fee2c2a9a7a83da89aa61e8e4b7876e157a1&width=1200&height=630",
            "top_comments": [
                "Even though everyone can agree congresspeople shouldnt be trading stock\n\nIts up to congresspeople to change that which is why i would be astonished to see it happen in my lifetime\n\nAnd this admin is no stranger to open conflicts of interest, clear insider trading and even loosening regulation on taking bribes\n\nPlus our supreme court loves to take bribes \n\nWhat a joke",
                "I'm sure the SEC will get right on that.",
                "The missing story here is who traded contracts. MTG and others might have bought long term investments but if you are insider trading leverage is so much more profitable and if they are only held for a short time I don't think they will be reported. SPY calls went parabolic before the pause announcement.",
                "Why are we even reporting insider trading at this point? Every politician has been doing it for decades, clearly it's 100% legal and socially acceptable."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "US judge to question Trump officials' refusal to return Kilmar Abrego Garcia",
            "external_url": "https://apnews.com/article/kilmar-abrego-garcia-el-salvador-trump-deported-e537cfb69a9840046b5d3e512509e9a8",
            "upvotes": 207,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Why won't you?\"\n\n\"Don't want to.\"\n\n\"Oh. Okay.\"",
                "Just want to point out how Mr. Garcia's case illustrates how if the US permits the deportation of criminals, Trump will have unlimited power to imprison Americans without trial and without judicial review.\n\nThe mechanism for releasing a person imprisoned unlawfully is a legal process called Habeas Corpus, or a Habeas petition.  A Habeast petition, legally, is an instruction issued by the Court to an officer of the government to indicate that the detention of an individual is unlawful, and to order that person's release.\n\nIf a person is unlawfully detained in an American prison, the way you get out is to have a Habeas petition accepted by a US Court, which then issues the Court order granting release.\n\nWhy doesn't this work for Mr. Garcia?  Because Mr. Garcia is being held in an El Savadorian Prison--the Court can determine that his deportation and imprisonment is unlawful, but the Court lacks the legal authority to tell El Salvadore to do anything.\n\nWhat's less clear is what the Court can do to compel the Executive Branch to act to bring him back--that is a KEY question in this case.\n\nBut this also highlights how if the President were permitted to imprison people overseas, all Due Process rights for Americans would disappear in an instant.\n\nSalvadorian prisons do not need to comply with Habeas Petitions.  If an American were arrested in the middle of the night and put on a plane to a prison in El Salvadore, the only way to ordinarily release that person would be to file a Habeas Petition--but that person is already overseas and under the management of the Gov't of El Salvadore.\n\nThe Executive Branch could refuse to seek that person's release from El Salvadore and the their govnerment could comply with that request.\n\nAnd the Courts would be powerless to enforce a finding that the imprisonment of an American is illegal.\n\nIn other words, Trump could have people arrested whenever he wanted to and imprison them without trial by shipping them to El Salvador, and the Courts would be powerless to stop him.\n\nTrump's push to imprison Americans in overseas prisons is one of the most Constitutionally dangerous proposals I have heard in my lifetime.",
                "Not only did Trump defy the US Supreme Court, but he openly mocked them by bringing the El Salvadore President to the Oval Office so they could both laugh at the notion of following the Supreme Court ruling.\n\nWe don't have a Constitution if the President is allowed to ignore it.",
                "Fucking useless checks and balances",
                "If ICE takes you, you may never see home again. Don't ever go with these people.",
                "They should also try a strongly worded letter. ",
                "I can’t wait for the Trump regime to ignore yet another court order. /s\n\nIt’s so fucked up that these thugs continue to flout laws and norms that the rest of us would be killed for.",
                "What Trump has proposed with American Citizens, what he's done to those here lawfully, and what he's done to those alledged to be here illegally... Isn't he showing people that it's better to fight till the death instead of being picked up by police?",
                "When they find out he's been unalived, then what? Finger wagging and whispering \"Bad donny, bad.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Whistleblower org says DOGE may have caused ‘significant cyber breach’ at US labor watchdog",
            "external_url": "https://www.reuters.com/technology/cybersecurity/whistleblower-org-says-doge-may-have-caused-significant-cyber-breach-us-labor-2025-04-15/",
            "upvotes": 5834,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just imagine the damage we won't find out about until years later",
                "DOGE is the cyber breach...",
                "This story is getting lost in the sauce, but outside of the current disappearing of non-native citizens, this is probably the largest \"wtf omg bbq\" scandal of the administration. DOGE staffers stole 10 gigabytes worth of data from NLRB's network, and then attempted to hide their trail so no one would find out. They're stealing information on almost all americans, but also sensitive information on unions, ongoing legal cases and corporate secrets, including cases involving Musk's companies. It's a long read, but the source is from NPR.  \"https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security",
                "> The NLRB, a New Deal-era agency that is tasked with protecting workers' rights to organize and join unions, has for years been a target of America's corporate titans, including Musk, some of whom are now seeking to have the agency's powers declared unconstitutional.\n\n>In an affidavit, Berulis said he had evidence that DOGE staffers were given extraordinarily sweeping access to the NLRB's systems, including to sensitive case files. He said that beginning in early March, logging protocols created to audit users appeared to have been tampered with, and that he had detected the removal of about 10 gigabytes worth of data from NLRB's network sometime thereafter.\n\n> That kind of spike is extremely unusual because data almost never directly leaves NLRB's databases,\" Berulis said in his affidavit.\nA spokesperson for Musk's team - officially known as U.S. DOGE Service - didn't immediately return a message seeking comment. A message left with the NLRB also wasn't immediately returned, although NPR, which first reported the story, opens new tab, quoted an NLRB spokesperson as disputing Berulis' claims and saying there had been no breach. Cotton and Warner didn't immediately return messages seeking comment.\n\n> NPR, which said it interviewed 30 sources in government, law enforcement, the cybersecurity industry, and the labor movement about the complaint, said that the disabling of logging software was reminiscent of cybercriminal behavior.\n\n>Berulis' affidavit said that an effort by him and his colleague to formally investigate and alert the Cybersecurity and Infrastructure Security Agency (CISA) was disrupted by higher-ups without explanation. A message left with CISA wasn't immediately returned.",
                "I heard about this on NPR. What NPR reported but is not included in this article, is that they detected remote logins using legitimate usernames and passwords, but originating from a Russian IP address. So not only is DOGE removing information, but they’ve given remote access to Russia. 99.9999999% chance this isn’t the only agency they now have access to.",
                "I can only imagine what DOGE would be doing at the NLRB… oh wait, targeting union organizers. \n\nIt is happening.",
                "Whichever departments are still untouched should probably get going on independent backups of their data.",
                ">The employees grew concerned that the NLRB's confidential data could be exposed, particularly after they started detecting suspicious log-in attempts from an IP address in Russia\n\nwho could have seen this coming",
                "Quote from the legal document presented by the NLRB's lawyers\n\n\n>This declaration details DOGE activity within NLRB, the exfiltration of data fromNLRB systems, and – concerningly – near real-time access by users in Russia. \n\n\n>Notably,within minutes of DOGE personnel creating user accounts in NLRB systems, onmultiple occasions someone or something within Russia attempted to login using all ofthe valid credentials (eg. Usernames/Passwords).\n\n\nHoly fuck. Sends chills down my spine. They are really russian assests that have infilitrated the highest levels of The U.S. government.\n\n\nBlood will spill over all of this shit",
                "What? An illegitimate organization, created for the sole person of enriching its creator, is causing harm. Get the fuck out of here."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Funeral to be held for Idaho teen with autism shot 9 times by police in his yard",
            "external_url": "https://www.nbcnews.com/news/us-news/funeral-held-idaho-teen-autism-shot-9-police-yard-rcna201360",
            "upvotes": 2775,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-victor-perez-mn-1305-dda988.jpg",
            "top_comments": [
                "These fucking pigs had a goddamn fence between them and the kid that looked like he couldn’t even walk and unloaded on him in less than 15 seconds from the time they arrived. Fuck all of them.",
                "As a parent to a son with autism this story scares the shit out of me.",
                "they'll try to justify this moment to themselves for the rest of their lives, and the law may address it one way or the other, but every one of them who fired their gun just *murdered* this kid.",
                "We have the video. The kid could barely stand up, was 6 feet behind a fence, and the cops started shooting almost immediately after getting out of their cars. This was a straight up murder. \n\nI have autism and mental illness and spend a lot of time with people who could easily become this boy. It's really scary.",
                "Shithole country. Anywhere else, no less than the president or prime minister would be addressing the entire nation.",
                "Crazy that an unarmed disabled child scared these officers enough that they immediately drew service weapons and didn't even consider less lethal means. Really speaks poorly of their character and courage.",
                "I've watched several videos of teens with autism getting man-handled or straight up physically abused by cops because of spasms or whatever else. It's pretty horrifying to think about. This is the worst case I think i've heard about. Just absolutely mind boggling. So much wrong..",
                "They went and executed this kid. Fuck those pigs. ",
                "Surprised they could hit a target 9 times.. wonder how many shots they fired ",
                "Here is the number for the Pocatello Mayor’s office if you’d like to voice your dismay over this murder:\n\n208-234-6163"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Ice deports Venezuelan teen despite reportedly knowing he was not a target",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/15/merwil-gutierrez-venezuelan-teen-deported-el-salvador",
            "upvotes": 13258,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ee360365a30b84e756e6cd505a06b458cdacf009/0_61_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be7ae080843db1eb7019eb2e247be2f1",
            "top_comments": [
                "From The Guardian:\n\n>A 19-year-old Venezuelan in New York City reportedly was apprehended by Trump administration immigration authorities and deported to El Salvador despite agents’ realizing he was not whom they meant to arrest in a targeted operation.\n\n>Merwil Gutiérrez, whose family opened an asylum case after arriving in the US, was deported from the Bronx to the notorious Cecot prison in El Salvador despite his relatives’ insistence that he has no gang ties or criminal history, according to Documented, a newsroom dedicated to telling the stories of immigrants in New York City. The Gutiérrez family says it has been left without information or answers.\n\n>The teen was detained alongside 237 other Venezuelans on 24 February by US Immigration and Customs Enforcement (Ice). His father, Wilmer Gutiérrez, told Documented: “I feel like my son was kidnapped.\n\n>“I’ve spent countless hours searching for him, going from one precinct to another, speaking with numerous people who kept referring me elsewhere. Yet, after all this, no one has given me any information or provided a single document about his case.”\n\n>The elder Gutiérrez reportedly said he overheard Ice agents saying that his son had not been the person they had come to get.\n\n>**The officers grabbed him and two other boys right at the entrance to our building. One said: ‘No, he’s not the one,’ like they were looking for someone else. But the other said: ‘Take him anyway,’” he recalled.**\n\n>**Gutiérrez has no criminal record either in Venezuela or the US, his family said. He also did not have any tattoos** which is a feature that US law enforcement often use to link people to the Tren de Aragua gang – a transnational criminal organization from Venezuela – and to justify their expulsions from the country.\n\n>**Despite this, Gutiérrez was arrested and later deported to El Salvador, to which he has no ties.**\n\n>Wilmer Gutiérrez says he discovered through a news report that his son had been deported to El Salvador under the Alien Enemies Act of 1798. He watched videos on social media that showed detainees facing harsh conditions, such as having their heads shaved by authorities and being marched to their prison cells.\n\n>”I could have understood if he’d been sent back to Venezuela,” he said. “But why to a foreign country he’s never even been to?”\n\n>The Gutiérrez family’s reported ordeal comes after the Trump administration admitted to wrongly deporting a Maryland man, Kilmar Abrego García, to the same Cecot facility.\n\n>The president of El Salvador said in a meeting with Trump on Monday that the Salvadoran government would not order the return of Abrego García to the US.\n\n>Monday’s meeting at the White House came amid a broader push by the Trump administration to remove noncitizens from the US, including people who are here legally and have not been charged with crimes.\n\n>Trump has also openly stated that he would like to remove US citizens who commit unspecified violent crimes and send them to the same Salvadoran prison as Abrego García and Gutiérrez.",
                "\"Deported\" is such a sanitized term for the horrors they're committing.",
                "We should prosecute the people who are actually doing these things. Make them afraid to follow illegal orders. It's pretty clear the people in charge are not going to stop or fix their mistakes.",
                "As things stand now, anyone deported is as good as dead. We should absolutely fight to get them back but the disgusting reality is that at present, there is very little motivating the president/admin of either the US or El Salvador to return these people. The US government is sending INNOCENT people including LEGAL migrants to DIE in a maximum security concrete box and Congress and the Judiciary are just watching and wringing their hands. This is all such a horrific, despicable nightmare.",
                "Trump has, in only a few months, flew beyond two legal instruments once used by England that the founding fathers found so despotic they outright prohibited them in the constitution and gave them as reason for the revolution - Transportation for trial and bills of attainder. \n\nExcept if you were transported for trial, you'd still get a trial, and a bill of attainder requires the legislature to vote to condemn someone. With Trump, theres no trial, and its just the whim of one man.\n\nWhat Trump is doing flies directly in the face of the Revolution and Constitution. He openly plots to extend this treatment to citizens. He is a tyrant and all means of resistance to him and his lackeys is justified.",
                "This is what fascism looks like and is the exact reason why we need due process. US citizens are next up. Trump said he would love to send home grown terrorists to El Salvador. ",
                "Explain to me like I’m 5 how this is not the literal definition of kidnapping.",
                "This is exactly why we have a Second Amendment.",
                "I can't stand this. What can I do? I feel powerless. I tried calling my representative, but I don't feel like that does anything. I feel so helpless.",
                "Someone please explain how this is different than German SS raids, because I see quite literally no distinguishing features"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Video shows a Venezuelan man tackled in a New Hampshire courthouse. He was then sent by ICE to Texas.",
            "external_url": "https://www.cbsnews.com/boston/news/venezuelan-man-tackled-new-hampshire-courthouse-texas-ice/?intcid=CNM-00-10abd1h",
            "upvotes": 309,
            "date": "04/15/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/14/8562a2a7-a30b-4aa5-9b17-1ed911e3231c/thumbnail/1200x630/8bf9800f5df22532c75eccedac116860/ice-nh-courthouse.jpg?v=412b48b2e3085db78364e6e02a7dc2b8",
            "top_comments": [
                "Brown shirts abducting people to send them to Dachau. ",
                "Canadian here. I remember when I was on tour with my band back in 2013, and we were driving through Texas when we came across one of those ICE checkstops(?). We had one of those big Ford Econoline vans, & I was in the front passenger seat and the sternfaced ICE agent approached our window and noticeably softened when he saw that 2 white kids were in the front seats. With a smile on his face he went \"All American citizens here boys?\" with a tone that was very \"of course you are, I'm just asking the question and I'll send you on your way.\" and the driver responded, \"no sir.\".\n\nI can not begin to describe how the second those words left his lips the tone of the entire interaction flipped on a dime, the face of the ICE agent changed in a flash to a look of pure \"I've been training my whole life for this moment when I get to gun down an illegal\", and I could see his hand slowly move down to his hip. \n\nThe whole thing lasted about 2 seconds before I cut in with a \"Canadians!\" and he took our passports and verified it before letting us go, but that 2 seconds felt like hours in the moment. It was at that point I realized that ICE agents have zero humanity.",
                "\"Live Free or Die\" \n\nWelp... The motto holds true.",
                "I mean the content alone is already problematic but did they really need to tackle him to the ground too? Like, c'mon guys you're already wearing the red armbands, do you need the skull caps too?",
                "This man with no violent criminal history could be a threat, guns drawn boys.",
                "Oh good God! Anywhere but Texas!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Indiana mom brought gun to grade school and threatened lesbian teacher, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/mom-arrested-bringing-gun-indiana-elementary-school-harassing-teacher-rcna201316",
            "upvotes": 1123,
            "date": "04/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-wthr-mom-gun-3-ew-1120a-033dc9.jpg",
            "top_comments": [
                ">The teacher, who keeps a picture of her wife and daughter on her desk, told police that she \"gave an assignment to the whole class with the subject matter of flags.\" When she was giving examples of country flags, she also referenced the rainbow flag in the classroom with the words \"be kind\" on it, the affidavit said.\n\n>Rivers told the teacher she disagreed with an assignment, accusing the educator of \"trying to push her personal agenda in regard to sexuality on her daughter,\" the affidavit said. The teacher said she allowed Rivers' daughter to skip the assignment.\n\nRemember that time Jesus said fuck being kind to people?\n\n  \nAlso just imagine living in so much fear that you feel the need to bring a gun to drop off your kid. That level of paranoia is just unfathomable to me.",
                "> Police let Rivers go, but then she sent a threatening message to her daughter's teacher 25 minutes later, the affidavit states.\nRivers told the teacher that \"god will condemn you to hell\" and that \"your (sic) a child predator,\" the affidavit states.\nRivers allegedly told the teacher to \"say ur prayers and kiss ur kids goodbye and goodnight u never know when god says its (sic) our time so be prepared.\"\n\nThis person plans to homeschool their child? Maybe they can take lessons in spelling together. Sadly, the thing they're most likely to teach their child is hatred.",
                "Them Christian values. I doubt any of them actually reads the Bible. Just a club to hate on people.\nLol",
                "Hilarious that her excuse as a responsible gun owner was that she \"didn't even realize she had it on\" and has committed the same crime of bringing it to a school multiple times in the past",
                "Will POTUS say “whack job” as he did regarding the arsonist who attacked the Pennsylvania’s Governor’s Mansion???",
                "Carrying a gun on a school campus and threatening a teacher cause they used a pride flag that said “be kind” on it as one of her several examples. I don’t know God, but I have a hard time they would want this person speaking for them. \n\nAlso, I feel horrible for that kid. Their parents are beyond psycho and now they’ll be “homeschooled” away from any protection. ",
                "When \"Be Kind\" is enough to provoke people to threats and violence, maybe it's time to take a deeper look at where these people are getting indoctrinated.",
                "They didn't even arrest her for the gun initially. All this was swept away with a warning but then ole girl doubles down and makes more threats 25 minutes later. Somebody tell her white privilege has a 30 minute cool down before it can be used for the same thing again.",
                "I wonder what would happen if a gay person showed up to a school with a gun and threatened to shoot a straight teacher for having a picture of their family on their desk 🧐",
                "It's always a good day to read up on \"stochastic terrorism\".\n\nA few things jumped out at me:\n\n>When [police] arrived, officers noticed Rivers had something on her waistband that looked like a firearm, the affidavit stated... \"Carrie Rivers stated that she did have a gun as I was removing it from her person,\" responding police officer Tabetha Emenaker wrote in the affidavit. \"I advised Carrie Rivers on the law in regard to having a firearm on school premises and that it was an arrestable offense. \n\nThe police, however, *did not arrest her.* Not only did they miraculously de-escalate the situation, they also let the person go. I haven't seen any pictures of her, but she's definitely white. \n\n\n>She understood and stated that she didn't even realize that she had it on because she is so used to wearing it and has been on school property with it before.\"\n\nMurica!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "‘Treated like a criminal': US citizen says he was detained returning from Canada",
            "external_url": "https://nbcnewyork.app.link/UHX2TktOASb",
            "upvotes": 3225,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said. \"Things actually changed to the worse.\"\n\n  \nWhatta maroon.",
                "> \"I literally drove my car to Canada for the weekend, and on the way back, I was treated like a criminal,\" said Atallah, who has been a U.S. citizen for 10 years.\n\n> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nI never thought the leopards would eat my face.",
                "Trump supporter is impacted by Trump's vileness.\n\n[https://youtu.be/8QGy9D\\_c1pY?feature=shared&t=22](https://youtu.be/8QGy9D_c1pY?feature=shared&t=22)\n\n\n\n>Atallah is planning to leave for Lebanon in a few days, and he is not sure what will happen when he tries to return.\n\n\n\nROFL.  If he got detained driving back from Canada, there is no way the Trump administration is letting him back in the country from Lebanon.",
                "Not only is he a moron for supporting Trump, he's also a moron for letting his attorney-client privileged communications be searched through by customs/border agents. I hope anyone who retained this idiot fires him pronto.",
                "Why do trump voters all think they're so fucking special? It really ought to be studied how they all have this main character syndrome. It won't happen to *me*, I'm awesome! Trump loves *me*!",
                "It's so hard to have empathy for people who voted for this.\n\n>I thought things would be better with Mr Trump but they are worse.\n\nFucking dummy would probably vote for him again.",
                "Went through all that, then goes off to lebanon, not the brightest bulb in the pack",
                ">\"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said. \"Things actually changed to the worse.\"\n\n>NBC10 Boston has reached out to the Department of Homeland Security and Customs and Border Protection, but has not heard back.\n\n>Atallah is planning to leave for Lebanon in a few days, and he is not sure what will happen when he tries to return.\n\nMan who voted for the face eating leopards is surprised that the leopard started eating his face, too. And then he's about to put himself back into this situation by leaving the country again.\n\n  \nFucking idiot. He got what he voted for.",
                "Man as a lebanese myself i can’t help but laugh at this idiot, you deserve it",
                "People with ethnically diverse names should know better.\n\nEdit: typo."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles cases linked to Texas outbreak reach 561, with 20 new infections confirmed",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-texas-outbreak-reach-561-20/story?id=120819175",
            "upvotes": 1334,
            "date": "04/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/96cbf0af-721a-49d6-8ca6-c3054c6b7bfb/measles-sign-ap-jt-250311_1741732269895_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This was entirely preventable. \n\nSo many children will suffer, become disabled, or die for literally no good reason.",
                "The cases are almost certainly undercounted by a large margin. The number of deaths and complications would are occuring at a rate higher than reported numbers should indicate. \n\n[Texas measles outbreak hits 500 cases, but expert says it could be 4 times higher](https://www.statesman.com/story/news/healthcare/2025/04/09/texas-measles-cases-hit-500-but-expert-says-it-could-be-4-times-that/82998607007/) (*Austin American Statesman*). \n\nThis article says 4x, but I've seen sources that say it may be higher.",
                "Meanwhile the father of the girl who died of measles [has no regrets and is blaming the liberal media while insisting she didn't die of measles.](https://www.nysun.com/article/father-of-second-texas-child-to-die-of-measles-says-he-has-no-regrets-about-not-vaccinating-his-daughter-blames-left-wing-media) The US has hit a point where vaccination is outright rejected and parents of dead kids refuse to acknowledge their child died from a preventable disease. We've officially hit idiocracy and the amount of measles cases are only going to continue increasing.",
                "This update adds 20 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 36 cases. Last Tuesday's update added 24 cases. Last Friday's update added 59 cases.\n\nTwo new hospitalizations were reported, up to 58 from 56. Texas has two deaths associated with this outbreak. Both were in school-aged children.",
                "Remember, pro life only means before you enter this world. After… meh",
                "If this didn't have serious and harmful consequences it would almost be funny. Sadly they are letting this shit happen because they are scared of vaccines. \"I'd rather have a dead kid than whatever was in the vaccine \"",
                "Since it’s also spread to many other states at this point, and is just crazy contagious, I like to spread the word to parents that babies can be vaccinated for measles as early as 6 months. They’ll still need two shots after age one to reach peak immunity, but they can get some protection before the official vaccine schedule. If insurance doesn’t want to cover it, tell the doctor you’re traveling abroad.",
                "WTF how many unvacinated people are there in texas?",
                "Of the other states that have cases associated with this outbreak that's concentrated in conservative Mennonite communities, only New Mexico updates on Friday like Texas. So far, they're not showing an increase in cases but that may be because they haven't posted today's update yet. They are currently at 58 cases and have reported one death that is suspected to be from measles but the official cause of death is still under investigation.\n\nOklahoma only updates on Tuesdays. Their reported cases have decreased from 10 to 9. That likely means they had a probable case in their count that didn't end up being a confirmed case.\n\nKansas updates on Wednesdays. Their case total is at 32 and their outbreak was reported as likely connected to the larger Texas outbreak. They have reported one hospitalization.",
                "Making Measles great again."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "At US antitrust trial, Meta's Zuckerberg admits he bought Instagram because it was 'better' -",
            "external_url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-antitrust-trial-metas-zuckerberg-admits-he-bought-instagram-because-it-was-2025-04-15/",
            "upvotes": 1639,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you can't beat them, buy them and absorb their data.",
                "I mean, why else would he buy it?",
                "and then he made it worse",
                "Why bother innovating when you can simply become a monopoly?",
                "Why is this news? They all do that... buy up the competition",
                "Someone, please tell one of Zuck's **Yes** people that he looks like Andy Dick with that hair!",
                "And then he fucking ruined it",
                "Hopefully this testimony is a meaningful component to unwinding the deal. I deleted Facebook and kept Instagram…because it’s better. I don’t use it much but I still wish Facebook never gobbled it up.\n\nGet fucked, Zuck. 🖕🏻",
                "I think buying it even if it's worse would be more of a problem, because they you really are just removing competition from the marketplace. At least if you buy it because it's better, you have a genuine reason for doing it.\nBuying all competitors, even the shit ones, should be a red flag.",
                "I agree Mr. Zuckerberg it WAS better before you bought it"
            ],
            "aggregate_sentiment": 5.0
        }
    ],
    "last_updated": "04/15/2025 20:09:57 UTC"
}