{
    "posts": [
        {
            "category": "HOT",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 34345,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "That’s one of the best things i’ve read since Jan 21. He took risk going there and now the guy knows people are fighting for him. His Senator is fighting for him.",
                "It's a relief there's proof of life"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 14644,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "how fitting today UNH drops 22%",
                "This is going to be a shitshow.",
                "Is it normal for this stuff to be federal in the US?",
                "The headline makes it sound like CEO killing is its own separate and worse version of regular murder.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "I don't think you Americans are quite at the point yet where it's open season on the government, but the difference between reality and the movie Civil War is that Trump will not be caught in the White house because he will have long left the US to go and live with his boss in Russia.",
                "If someone smuggles him a MAGA hat and fakes some pro J6 posts written by him, he will guarantee himself a presidential pardon and the support of law-enforcement."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 22491,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "This is going to kill people. \n\nGuaranteed.",
                "Poison themselves to own the libs.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "Oh good I was hoping I would get worms in 2025",
                "Ummm… do republicans not eat food?",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Upton Sinclair is rolling in his grave.",
                "Wtf are my taxes even for anymore?",
                "Food safety specialist here!   This is what I was afraid of.  We're all fucked.   A lot of people are going to die."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 6296,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "Yes, America is failing its citizens to allow for corporate greed",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts according to reuters [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "89 cases they know about.  There are undoubtedly hundreds if not thousands of cases not reported.  I’ve been poisoned multiple times, and never once reach the level of statistic.",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back.",
                "**Censorship by omission**"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 13038,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "Hey look it’s the thing everyone said he wouldn’t do. Wonder how the Latinos for Trump are feeling right now.",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen from Georgia released from jail after arrest under Florida’s new anti-immigration law",
            "external_url": "https://www.jacksonprogress-argus.com/plus/u-s-citizen-from-georgia-released-from-jail-after-arrest-under-florida-s-new-anti/article_d069906f-c2bb-5e33-841f-d9d30bd6df2a.html",
            "upvotes": 1837,
            "date": "04/18/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg?resize=600%2C339",
            "top_comments": [
                "> Lopez-Gomez will have to return to the Leon County Courthouse on May 6. He was charged under a recently passed law that a federal judge has temporarily barred the state from enforcing, further calling into question the validity of his arrest, the charge, and detention.\n\nEven though a judge already said he's an American citizen, they still expect him to return to the courthouse at a later date. These charges shouldn't even have happened. The law they're trying to enforce was barred by another judge for the time being. The only thing they should be doing is apologizing to this man, but that isn't going to happen.",
                "Thank goodness. Shouldn't have even come to this.",
                "Welp not going to Florida, ever. This should be a sign for any person from any state out side of Florida to practically forget that it exists. The sooner it sinks into the sea the better.",
                "\"We don't mind immigration if you do it the right way\" \n\n-GOP in 2024\n\n\"We think sending people to camps in El Salvador is funny\" \n\n-GOP in 2025",
                "How's that freedom going......",
                "I see how the cowardly police department was too ashamed to talk to the press. Fascists!",
                "Pretty sure part of the point of that whole civil war we did was to say states can't just do things that are the fed's job.",
                "I'm shocked but thrilled; I was sure he'd end up in El Salvador before that 48 hour hold was up.",
                "Florida is gonna have zero visitors from other states at this rate.",
                "I’m from and live in St. Pete. We are a very liberal area but the trad off is I live in Florida and I hate it."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "US will 'move on' from Ukraine peace talks in days if no progress soon",
            "external_url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
            "upvotes": 748,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d807/live/b67a7f40-1c2e-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "After they categorically gave up every single piece of leverage they had to force Russia into a long lasting and fair peace settlement this should surprise absolutely nobody.\n\nThey want to normalize relations with Russia, war in Ukraine or not. They just wanted to keep up this charade for long enough that they could eventually blame everyone else for why the negotiations are \"failing\".",
                "Mister \"I'll end the war in Ukraine on Day One\" is giving up on ending the war in Ukraine",
                "Diplomacy is hard, ruling by executive order is so much easier, what a bunch of light weights!",
                "Trump promised to end the war in 24h. The President of the US cannot be trusted anymore.",
                "Honestly tired of these \"deadlines\". Either commit to helping Ukraine or don't. All this back and forth just gives Russia more time to dig in while Ukraine loses people everyday.",
                "I cAn EnD tHe WaR iN a DaY",
                "Wasn’t he going to end the war in one day? Lies, lies, and more lies from the Russian-controlled US government.",
                "Grab your coat on the way out.",
                "Give them their nukes back then",
                "Good please just fuck off."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Active shooter reported on Florida State University campus",
            "external_url": "https://www.cnn.com/2025/04/17/us/florida-state-university-active-shooter/index.html",
            "upvotes": 25886,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21552290-116331-746-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Suspect in custody\n1:05 p.m. – A Tallahassee police spokesperson confirmed that one person is in custody but could not confirm any deaths. There were, however, \"multiple injuries.\"\n\nA live update on another article.",
                "6 patients, 1 in critical condition, the rest in serious condition \n\nhttps://www.tallahassee.com/story/news/local/2025/04/17/active-shooter-reported-at-fsu-shelter-in-place-alert-sent-out/83139928007/\n\nEdit: as of 2p  law enforcement has not confirmed any deaths\n\n\nEdit 2: as of 2:32, NBC reporting one dead, 6 injured\n\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756\n\nEdit 3: 4:35p according to press conference, 2 dead (not students), 5 injured, they have ID'd the shooter, 20 yo son of sheriff deputy, I did not catch the name, he had access to one of her weapons which was found at the scene",
                "Shooter in custody according to CNN.",
                "CNN says the suspect used his mom's gun, and that the suspect's mom was a sheriff deputy.",
                "Reminder that FSU had a similar event back in 2014 when a gunmen went into the library and started shooting kids.",
                "Yesterday was 18 years since the Virginia Tech shooting 😢",
                "Sad to think some of these kids are graduates of Stoneman, and most likely experienced their second school shooting of their life. Unreal and awful.",
                "[http://tallahasseefamilymagazine.com/wordpress/2016/04/12/safe-surfing-on-the-internet/](http://tallahasseefamilymagazine.com/wordpress/2016/04/12/safe-surfing-on-the-internet/)   \n......wrote by his mom\n\n[https://pbs.twimg.com/media/Gow-40\\_WMAAel0R?format=jpg&name=4096x4096](https://pbs.twimg.com/media/Gow-40_WMAAel0R?format=jpg&name=4096x4096)\n\n  \n(his mom)",
                "His IG just got taken down, was already private, all I saw was the Bio. Bio was just a quote from Jeremiah: \"You are my war club, my weapon for battle— with you I shatter nations, with you I destroy kingdoms\"",
                "Actually briefly forgot about mass shootings at schools. Sigh."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 4748,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                ">The suspect in the FSU shooting espoused white supremacist views and was removed from a political club, the group's president, Reid Seybold, said.\n\n>Seybold said he was part of a club with the suspect at Tallahassee State College, where they both attended before transferring to FSU. He was president of a club called \"political round table,\" where the suspect was asked not to return after repeated issues with the suspect's rhetoric.\n\n>\"Basically our only rule was no Nazis — colloquially speaking — and he espoused so much white supremacist rhetoric, and far-right rhetoric as well, to the point where we had to exercise that role,\" Seybold said.\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Yet another white, republican terrorist.",
                "Someone somewhere is blaming Biden"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "2 Defense Department officials, including senior adviser to Pete Hegseth, put on leave amid leak investigation",
            "external_url": "https://www.cbsnews.com/news/dan-caldwell-pentagon-leak-investigation-on-leave/",
            "upvotes": 27113,
            "date": "04/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/37068e63-d5d8-44de-a1f5-d962712cccf3/thumbnail/1200x630/18120fcbb01fc5c0cb9650e2ab0af4fe/gettyimages-2203658198.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                ">A source familiar says Caldwell is accused of sharing classified documents with reporters.\n\nOh, is that a problem for Hegseth now?",
                "Such a mess. 0 Professionalism",
                "What about Hegseth? Shouldn't he be on leave too?",
                "WHISKEY LEAKS\nRemember: Trump only hires the best. ",
                "Damn, I got excited when I misread \"including Pete hegseth\"... then I remembered he's already at the top of that chain",
                "Every top official on that chat knew it was illegal to use for classified information. All of them, including the VP, needs to be impeached, removed from office, and prosecuted.",
                "This DEI-less experiment seems to be a disaster.  Can we go back to being really good at things again?",
                "Imagine being the one in the chat, leaking information, and then it's your assistant that gets suspended...Much accountability, much wow.",
                "It's three of them now. https://www.politico.com/news/2025/04/16/pentagon-official-suspended-leak-investigation-00293473",
                "Just over 3 months in and this administration is a shitshow. Totally expected but hey at least we are Making America Great Again lol  /s"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Boston immigration attorney, a citizen, told by DHS to leave the country in apparent mistake",
            "external_url": "https://www.boston.com/news/local-news/2025/04/13/boston-immigration-attorney-a-citizen-told-by-dhs-to-leave-the-country/",
            "upvotes": 3,
            "date": "04/18/2025",
            "thumbnail": "https://bdc2020.o0bc.com/wp-content/uploads/2025/04/cbponeapp-67fc2ac1a37a7-768x432.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'My home is worth millions but my kids can't afford to live here'",
            "external_url": "https://www.bbc.com/news/articles/cy70y75v5l7o",
            "upvotes": 441,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b557/live/83ad2730-1a34-11f0-b287-9bbf4848835b.jpg",
            "top_comments": [
                "How about tax breaks on your first actual home\n\nAnd massive taxes on any after that. \n\nAnd stop commodifying housing as it's taxing you on living",
                "This is what it’s like in Miami. My parents bought their Redland ranch home on an acre for like 100k after Hurricane Andrew and now it’s worth almost a million dollars. I would love to raise a family where I grew up but it’s impossible unless you’re a doctor or a lawyer or a drug dealer.",
                "Canada is an extreme example, but this is happening in a lot of places all over the world, and is concentrated in metropolitan areas. There are several factors, but the main ones are:\n\n1. People think of their homes as investments and not houses to live in. This leads them to fight against literally any new housing, but particularly affordable housing because that will lower the value of their \"investment.\" They also fight rezoning.\n\n2. Businesses build portfolios of homes and apartment buildings to monetize.\n\n3. People with the means buy multiple homes and rent the ones they aren't living in out, often times short term through Airbnb and Vrbo.\n\nThe ways to fix this are not easy, but if they don't happen it will just keep getting worse. Multifamily zoning laws need to be implemented. Permitting of new construction needs to be easier and much harder for residents to block. Tax incentives need to be granted for builders of less expensive, and more modest homes and multifamily buildings. Limits need to be placed on businesses and individuals who own multiple properties. Restrictions need to be placed on short term rentals (like only being able to rent them out for 3 months a year, and only if you live in the house for at least 7 months of that year).\n\nSupply of affordable housing isn't going to happen naturally.",
                "Would they be able to afford it if it was a $6-700K new construction?\n\nIts intentional.",
                "I'd like to point out that Vancouver is in Canada's Southwest.",
                "Yeha way to go team. Then complain that your kids have to buy places hours away and you never see your grandkids.   \nSuch a stupid situation to be in…",
                "Me growing up in Santa Cruz Cali. I could never live in my hometown now.",
                "Same story in central NJ",
                "we are apparently to stupid to solve 4 walls and a roof, i swear money and greed is going make this species go extinct because solving whatever existential crisis that's gonna pop up will be deemed to expensive, even tho money is not used as a actual resource in the making of anything",
                "I think people are starting to realize that homeownership isn’t the investment it once was. It’s a liability. It’s only an investment if you get passive income from it. Otherwise it’s a money pit. You never really own your home. You’re just paying the government to live in it, as long as you keep it."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "US will 'move on' from Ukraine peace talks in days if no progress soon",
            "external_url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
            "upvotes": 746,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d807/live/b67a7f40-1c2e-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "After they categorically gave up every single piece of leverage they had to force Russia into a long lasting and fair peace settlement this should surprise absolutely nobody.\n\nThey want to normalize relations with Russia, war in Ukraine or not. They just wanted to keep up this charade for long enough that they could eventually blame everyone else for why the negotiations are \"failing\".",
                "Mister \"I'll end the war in Ukraine on Day One\" is giving up on ending the war in Ukraine",
                "Diplomacy is hard, ruling by executive order is so much easier, what a bunch of light weights!",
                "Trump promised to end the war in 24h. The President of the US cannot be trusted anymore.",
                "Honestly tired of these \"deadlines\". Either commit to helping Ukraine or don't. All this back and forth just gives Russia more time to dig in while Ukraine loses people everyday.",
                "I cAn EnD tHe WaR iN a DaY",
                "Wasn’t he going to end the war in one day? Lies, lies, and more lies from the Russian-controlled US government.",
                "Grab your coat on the way out.",
                "Give them their nukes back then",
                "Good please just fuck off."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen from Georgia released from jail after arrest under Florida’s new anti-immigration law",
            "external_url": "https://www.jacksonprogress-argus.com/plus/u-s-citizen-from-georgia-released-from-jail-after-arrest-under-florida-s-new-anti/article_d069906f-c2bb-5e33-841f-d9d30bd6df2a.html",
            "upvotes": 1840,
            "date": "04/18/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg?resize=600%2C339",
            "top_comments": [
                "> Lopez-Gomez will have to return to the Leon County Courthouse on May 6. He was charged under a recently passed law that a federal judge has temporarily barred the state from enforcing, further calling into question the validity of his arrest, the charge, and detention.\n\nEven though a judge already said he's an American citizen, they still expect him to return to the courthouse at a later date. These charges shouldn't even have happened. The law they're trying to enforce was barred by another judge for the time being. The only thing they should be doing is apologizing to this man, but that isn't going to happen.",
                "Thank goodness. Shouldn't have even come to this.",
                "Welp not going to Florida, ever. This should be a sign for any person from any state out side of Florida to practically forget that it exists. The sooner it sinks into the sea the better.",
                "\"We don't mind immigration if you do it the right way\" \n\n-GOP in 2024\n\n\"We think sending people to camps in El Salvador is funny\" \n\n-GOP in 2025",
                "How's that freedom going......",
                "I see how the cowardly police department was too ashamed to talk to the press. Fascists!",
                "Pretty sure part of the point of that whole civil war we did was to say states can't just do things that are the fed's job.",
                "I'm shocked but thrilled; I was sure he'd end up in El Salvador before that 48 hour hold was up.",
                "Florida is gonna have zero visitors from other states at this rate.",
                "I’m from and live in St. Pete. We are a very liberal area but the trad off is I live in Florida and I hate it."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Trump administration announces fees on Chinese ships docking at U.S. ports",
            "external_url": "https://www.cnbc.com/2025/04/17/trump-administration-announces-fees-on-chinese-ships-docking-at-us-ports.html",
            "upvotes": 1062,
            "date": "04/18/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108132371-1744750747440-gettyimages-2210460440-jr_11302_2mfwszjy.jpeg?v=1744750835&w=1920&h=1080",
            "top_comments": [
                "Wait. So they want to charge a fee where every time a Chinese BUILT ship comes into a US port we tax it? Not even a who owns it fee, but simply where the ship was built even if it’s owned by a US company. \n\nYeah, that’s going to go over well. Where the fuck do we even do commercial shipbuilding anymore? This is just going to make prices go up even more because it’s now a tax on shipping that’s going to be passed on to consumers.",
                "Trump’s just mad at China because they were able to build a wall. A Great Wall",
                "Every second it just gets dumber.  Impeach this guy please. ",
                "He is doing everything he can to tank the US dollar.",
                "I work in this industry. most vessels nowadays are manufactured in China. the USA does not have enough vessels to satisfy their supply needs, this will kill much of the north american shipping industry dead in the water.",
                "Basically, Trump wants world economy to fail. He will then say or retract the imposed tarrif and such rules to bo claim he saved the economy. Creat a problem to seam like fixing it.",
                "It's not even 3 months yet. There are 1350+ more days of tariff rules changing. ",
                "Here comes the empty shelves and skyrocketing prices!",
                "USA has become a hostile nation to be avoided in all ways trade and tourism . \n\nThe fallout of this dumbfuckery will last for decades .",
                "Does anyone in the Whitehouse have a basic understanding of economics or international trade? Are they wanting to start a war with China without any provocation? Is this new tax because Xi won't answer the phone? The USA economy is going to be in ruins before anything is done to stop the madness."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 34354,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "That’s one of the best things i’ve read since Jan 21. He took risk going there and now the guy knows people are fighting for him. His Senator is fighting for him.",
                "It's a relief there's proof of life"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "NEW",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 6297,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "Yes, America is failing its citizens to allow for corporate greed",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts according to reuters [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "89 cases they know about.  There are undoubtedly hundreds if not thousands of cases not reported.  I’ve been poisoned multiple times, and never once reach the level of statistic.",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back.",
                "**Censorship by omission**"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 2643,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "Mom should be held culpable.",
                "The real story is that he is maga.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "WAIT this is the perfect moment. Time to prove you’re deporting the bad Americans",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "Well, he's either going to be sent to an El Salvadorian concentration camp, or be made into the next Homeland Security Secretary. Given that he's a white male Republican whose expressed anger towards Democrats, I'll assume the latter.",
                "That articles shows a lot of photos of students hanging around outside during an active shooting. \n\nIf you’re ever anywhere where this is happening, get inside anywhere and lock the door until you get word about an all clear.",
                "I just read somewhere that some students at FSU are Parkland massacre survivors as well. That is INSANE. America is broken beyond repair"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "American citizen hijacks small plane in Belize, 3 injured",
            "external_url": "https://abcnews.go.com/International/american-citizen-hijacks-small-plane-belize-3-injured/story?id=120916154",
            "upvotes": 341,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26df2c2b-0032-4b7f-b673-0cafd853ce3c/belize-plane-04-ht-jt-250417_1744916656230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Filibusters (in the original sense) coming back into fashion?? \n\n> ... a mercenary who travelled illegally in an organized group **from the United States to a country in Central America** or the Spanish West Indies in the mid-19th century seeking economic and political benefits through **armed force.**\n\nhttps://en.wiktionary.org/wiki/filibuster#Noun",
                "\"hijacked a small plane at knifepoint \"\n\n\"The hijacker was fatally shot in the chest by a passenger who had a licensed firearm\"\n\nWell, that is what happen when you bring a knife to a gun fight. A rare case when the day is saved by the good guy with a gun.",
                "Reminds me of this book I read that talked about how common skyjacking was in 70s. There’s just something about wanting a plane to fly you to a third world country when you jump off the deep end.",
                "I have flown as a passenger on that flight four times. I have passed through their security, how did the good guy’s gun get in the cabin?",
                "Not sending their best.",
                "US airlines have become so unsafe under Trump’s FAA that terrorists have to go to other countries just to hijack a plane.",
                "When the United States sends its people, they're not sending their best. They're sending people that have lots of problems, and they're bringing those problems with us. They're bringing drugs. They're bringing crime. They're plane hijackers. And some, I assume, are good people.",
                "I feel like there is a movie plot behind this."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 14645,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "how fitting today UNH drops 22%",
                "This is going to be a shitshow.",
                "Is it normal for this stuff to be federal in the US?",
                "The headline makes it sound like CEO killing is its own separate and worse version of regular murder.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "I don't think you Americans are quite at the point yet where it's open season on the government, but the difference between reality and the movie Civil War is that Trump will not be caught in the White house because he will have long left the US to go and live with his boss in Russia.",
                "If someone smuggles him a MAGA hat and fakes some pro J6 posts written by him, he will guarantee himself a presidential pardon and the support of law-enforcement."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen from Georgia released from jail after arrest under Florida’s new anti-immigration law",
            "external_url": "https://www.jacksonprogress-argus.com/plus/u-s-citizen-from-georgia-released-from-jail-after-arrest-under-florida-s-new-anti/article_d069906f-c2bb-5e33-841f-d9d30bd6df2a.html",
            "upvotes": 1838,
            "date": "04/18/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/jacksonprogress-argus.com/content/tncms/custom/image/e71f08c6-99cc-11e5-9445-27ee81b2c343.jpg?resize=600%2C339",
            "top_comments": [
                "> Lopez-Gomez will have to return to the Leon County Courthouse on May 6. He was charged under a recently passed law that a federal judge has temporarily barred the state from enforcing, further calling into question the validity of his arrest, the charge, and detention.\n\nEven though a judge already said he's an American citizen, they still expect him to return to the courthouse at a later date. These charges shouldn't even have happened. The law they're trying to enforce was barred by another judge for the time being. The only thing they should be doing is apologizing to this man, but that isn't going to happen.",
                "Thank goodness. Shouldn't have even come to this.",
                "Welp not going to Florida, ever. This should be a sign for any person from any state out side of Florida to practically forget that it exists. The sooner it sinks into the sea the better.",
                "\"We don't mind immigration if you do it the right way\" \n\n-GOP in 2024\n\n\"We think sending people to camps in El Salvador is funny\" \n\n-GOP in 2025",
                "How's that freedom going......",
                "I see how the cowardly police department was too ashamed to talk to the press. Fascists!",
                "Pretty sure part of the point of that whole civil war we did was to say states can't just do things that are the fed's job.",
                "I'm shocked but thrilled; I was sure he'd end up in El Salvador before that 48 hour hold was up.",
                "Florida is gonna have zero visitors from other states at this rate.",
                "I’m from and live in St. Pete. We are a very liberal area but the trad off is I live in Florida and I hate it."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US will 'move on' from Ukraine peace talks in days if no progress soon",
            "external_url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
            "upvotes": 744,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d807/live/b67a7f40-1c2e-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "After they categorically gave up every single piece of leverage they had to force Russia into a long lasting and fair peace settlement this should surprise absolutely nobody.\n\nThey want to normalize relations with Russia, war in Ukraine or not. They just wanted to keep up this charade for long enough that they could eventually blame everyone else for why the negotiations are \"failing\".",
                "Mister \"I'll end the war in Ukraine on Day One\" is giving up on ending the war in Ukraine",
                "Diplomacy is hard, ruling by executive order is so much easier, what a bunch of light weights!",
                "Trump promised to end the war in 24h. The President of the US cannot be trusted anymore.",
                "Honestly tired of these \"deadlines\". Either commit to helping Ukraine or don't. All this back and forth just gives Russia more time to dig in while Ukraine loses people everyday.",
                "I cAn EnD tHe WaR iN a DaY",
                "Wasn’t he going to end the war in one day? Lies, lies, and more lies from the Russian-controlled US government.",
                "Grab your coat on the way out.",
                "Give them their nukes back then",
                "Good please just fuck off."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "'My home is worth millions but my kids can't afford to live here'",
            "external_url": "https://www.bbc.com/news/articles/cy70y75v5l7o",
            "upvotes": 441,
            "date": "04/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b557/live/83ad2730-1a34-11f0-b287-9bbf4848835b.jpg",
            "top_comments": [
                "How about tax breaks on your first actual home\n\nAnd massive taxes on any after that. \n\nAnd stop commodifying housing as it's taxing you on living",
                "This is what it’s like in Miami. My parents bought their Redland ranch home on an acre for like 100k after Hurricane Andrew and now it’s worth almost a million dollars. I would love to raise a family where I grew up but it’s impossible unless you’re a doctor or a lawyer or a drug dealer.",
                "Canada is an extreme example, but this is happening in a lot of places all over the world, and is concentrated in metropolitan areas. There are several factors, but the main ones are:\n\n1. People think of their homes as investments and not houses to live in. This leads them to fight against literally any new housing, but particularly affordable housing because that will lower the value of their \"investment.\" They also fight rezoning.\n\n2. Businesses build portfolios of homes and apartment buildings to monetize.\n\n3. People with the means buy multiple homes and rent the ones they aren't living in out, often times short term through Airbnb and Vrbo.\n\nThe ways to fix this are not easy, but if they don't happen it will just keep getting worse. Multifamily zoning laws need to be implemented. Permitting of new construction needs to be easier and much harder for residents to block. Tax incentives need to be granted for builders of less expensive, and more modest homes and multifamily buildings. Limits need to be placed on businesses and individuals who own multiple properties. Restrictions need to be placed on short term rentals (like only being able to rent them out for 3 months a year, and only if you live in the house for at least 7 months of that year).\n\nSupply of affordable housing isn't going to happen naturally.",
                "Would they be able to afford it if it was a $6-700K new construction?\n\nIts intentional.",
                "I'd like to point out that Vancouver is in Canada's Southwest.",
                "Yeha way to go team. Then complain that your kids have to buy places hours away and you never see your grandkids.   \nSuch a stupid situation to be in…",
                "Me growing up in Santa Cruz Cali. I could never live in my hometown now.",
                "Same story in central NJ",
                "we are apparently to stupid to solve 4 walls and a roof, i swear money and greed is going make this species go extinct because solving whatever existential crisis that's gonna pop up will be deemed to expensive, even tho money is not used as a actual resource in the making of anything",
                "I think people are starting to realize that homeownership isn’t the investment it once was. It’s a liability. It’s only an investment if you get passive income from it. Otherwise it’s a money pit. You never really own your home. You’re just paying the government to live in it, as long as you keep it."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 6298,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "Yes, America is failing its citizens to allow for corporate greed",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts according to reuters [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "89 cases they know about.  There are undoubtedly hundreds if not thousands of cases not reported.  I’ve been poisoned multiple times, and never once reach the level of statistic.",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back.",
                "**Censorship by omission**"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 34345,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "That’s one of the best things i’ve read since Jan 21. He took risk going there and now the guy knows people are fighting for him. His Senator is fighting for him.",
                "It's a relief there's proof of life"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Trump administration announces fees on Chinese ships docking at U.S. ports",
            "external_url": "https://www.cnbc.com/2025/04/17/trump-administration-announces-fees-on-chinese-ships-docking-at-us-ports.html",
            "upvotes": 1054,
            "date": "04/18/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108132371-1744750747440-gettyimages-2210460440-jr_11302_2mfwszjy.jpeg?v=1744750835&w=1920&h=1080",
            "top_comments": [
                "Wait. So they want to charge a fee where every time a Chinese BUILT ship comes into a US port we tax it? Not even a who owns it fee, but simply where the ship was built even if it’s owned by a US company. \n\nYeah, that’s going to go over well. Where the fuck do we even do commercial shipbuilding anymore? This is just going to make prices go up even more because it’s now a tax on shipping that’s going to be passed on to consumers.",
                "Trump’s just mad at China because they were able to build a wall. A Great Wall",
                "Every second it just gets dumber.  Impeach this guy please. ",
                "He is doing everything he can to tank the US dollar.",
                "I work in this industry. most vessels nowadays are manufactured in China. the USA does not have enough vessels to satisfy their supply needs, this will kill much of the north american shipping industry dead in the water.",
                "Basically, Trump wants world economy to fail. He will then say or retract the imposed tarrif and such rules to bo claim he saved the economy. Creat a problem to seam like fixing it.",
                "It's not even 3 months yet. There are 1350+ more days of tariff rules changing. ",
                "Here comes the empty shelves and skyrocketing prices!",
                "USA has become a hostile nation to be avoided in all ways trade and tourism . \n\nThe fallout of this dumbfuckery will last for decades .",
                "Does anyone in the Whitehouse have a basic understanding of economics or international trade? Are they wanting to start a war with China without any provocation? Is this new tax because Xi won't answer the phone? The USA economy is going to be in ruins before anything is done to stop the madness."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 14649,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "how fitting today UNH drops 22%",
                "This is going to be a shitshow.",
                "Is it normal for this stuff to be federal in the US?",
                "The headline makes it sound like CEO killing is its own separate and worse version of regular murder.",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "I don't think you Americans are quite at the point yet where it's open season on the government, but the difference between reality and the movie Civil War is that Trump will not be caught in the White house because he will have long left the US to go and live with his boss in Russia.",
                "If someone smuggles him a MAGA hat and fakes some pro J6 posts written by him, he will guarantee himself a presidential pardon and the support of law-enforcement."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 22492,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "This is going to kill people. \n\nGuaranteed.",
                "Poison themselves to own the libs.",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "Oh good I was hoping I would get worms in 2025",
                "Ummm… do republicans not eat food?",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Upton Sinclair is rolling in his grave.",
                "Wtf are my taxes even for anymore?",
                "Food safety specialist here!   This is what I was afraid of.  We're all fucked.   A lot of people are going to die."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 13042,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "Hey look it’s the thing everyone said he wouldn’t do. Wonder how the Latinos for Trump are feeling right now.",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Active shooter reported on Florida State University campus",
            "external_url": "https://www.cnn.com/2025/04/17/us/florida-state-university-active-shooter/index.html",
            "upvotes": 25886,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21552290-116331-746-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Suspect in custody\n1:05 p.m. – A Tallahassee police spokesperson confirmed that one person is in custody but could not confirm any deaths. There were, however, \"multiple injuries.\"\n\nA live update on another article.",
                "6 patients, 1 in critical condition, the rest in serious condition \n\nhttps://www.tallahassee.com/story/news/local/2025/04/17/active-shooter-reported-at-fsu-shelter-in-place-alert-sent-out/83139928007/\n\nEdit: as of 2p  law enforcement has not confirmed any deaths\n\n\nEdit 2: as of 2:32, NBC reporting one dead, 6 injured\n\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756\n\nEdit 3: 4:35p according to press conference, 2 dead (not students), 5 injured, they have ID'd the shooter, 20 yo son of sheriff deputy, I did not catch the name, he had access to one of her weapons which was found at the scene",
                "Shooter in custody according to CNN.",
                "CNN says the suspect used his mom's gun, and that the suspect's mom was a sheriff deputy.",
                "Reminder that FSU had a similar event back in 2014 when a gunmen went into the library and started shooting kids.",
                "Yesterday was 18 years since the Virginia Tech shooting 😢",
                "Sad to think some of these kids are graduates of Stoneman, and most likely experienced their second school shooting of their life. Unreal and awful.",
                "[http://tallahasseefamilymagazine.com/wordpress/2016/04/12/safe-surfing-on-the-internet/](http://tallahasseefamilymagazine.com/wordpress/2016/04/12/safe-surfing-on-the-internet/)   \n......wrote by his mom\n\n[https://pbs.twimg.com/media/Gow-40\\_WMAAel0R?format=jpg&name=4096x4096](https://pbs.twimg.com/media/Gow-40_WMAAel0R?format=jpg&name=4096x4096)\n\n  \n(his mom)",
                "His IG just got taken down, was already private, all I saw was the Bio. Bio was just a quote from Jeremiah: \"You are my war club, my weapon for battle— with you I shatter nations, with you I destroy kingdoms\"",
                "Actually briefly forgot about mass shootings at schools. Sigh."
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "04/18/2025 12:15:17 UTC"
}