{
    "posts": [
        {
            "category": "HOT",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 9803,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "Long term gain, though, right?\n\n...you guys?",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "If Powell leaves it'll tumble another 1000.",
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "I think a corky laugh and a stable 401k would’ve been better than this.",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "Im so tired of winning.",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "Yesterday, had a family member say, “Imagine how bad it would be if Harris had won.”\n\nI should text him and say, well, the Dow wouldn’t be at a 3 year low."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 7151,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.",
                "Unfortunately, america no longer has a justice system.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Nothing gets conservative wackos to backtrack on their bullshit quicker than getting hit with a massive judgment.\n\nSee also: Dominion",
                "Sounds like 100 million to me. These guys all need to be bankrupted. All of them."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder",
            "external_url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc",
            "upvotes": 5772,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Patrick Crusius was automatically be sentenced to life in prison without parole in the massacre near the U.S.-Mexico border. The change of plea comes after local prosecutors took the death penalty off the table.\n\n>El Paso County District Attorney James Montoya declined to pursue the death penalty, saying that decision was driven by a majority of victims’ relatives who want the case to be over.\n\nI can see the sentiment of just wanting to not think about it anymore. The murderer is 26 now and will likely spend decades in [a Texas prison](https://www.texastribune.org/2022/08/24/texas-prisons-air-conditioning/).",
                "So death for the UHC CEO murderer, but this dude gets to live?  Cool.  Cool.",
                "Wait, hold on. This guy kills 23 people in a racist attack and isn't considered a terrorist, but a guy killing a corrupt CEO is a terrorist?",
                "> About 100 people from victims’ families were seated in the gallery behind a few rows reserved for media, prosecutors and Crusius’ defense team. They will be given the time to give victim impact statements starting Monday afternoon. Dozens made emotional statements during a similar hearing in federal court in 2023 that lasted for three days.\n\n> The people who were killed at Walmart ranged in age from a 15-year-old high school athlete to elderly grandparents. They included immigrants, a retired city bus driver, a teacher, tradesmen including a former iron worker, and several Mexican nationals who had crossed the U.S. border on routine shopping trips.\n\nThose people leave behind a legacy of loved ones who will keep their memories alive. 100 loved ones to share their stories. This man leaves no legacy but hatred, and will be remembered as a bigoted monster. May he rot in prison and fade into obscurity.",
                "> The online rant speaks of a “Hispanic invasion of Texas.”\n\n>“They are the instigators, not me,” it says. “I am simply defending my country from cultural and ethnic replacement brought on by an invasion.”\n\n\nAsshole never studied U.S. history, clearly. It’s the other way around.",
                "23 people. Killed. In a grocery store.  \n\nMake it make sense. 2 is horrible but 23????",
                "I was just thinking about this the other day. Some madman guns down Hispanics at Walmart enraged at Mexicans under Trump's stoking of hatred, for said group. Mad man kills a mother and father leaving a baby homeless. Uncle of the baby is a MAGA lover, finds out Trump is coming, first thought is not overwhelming grief for his lost sister and orphaned niece, no he thinks! Bingo! If I grab the baby like a prop and head back to hospital where my sister and brother in law just died, maybe I can get a picture with Trump! https://www.theguardian.com/us-news/2019/aug/09/trump-el-paso-melania-orphan-baby-thumbs-up\nAnd he got his picture. I always think of this when people get shocked that the maga won't turn on him.",
                "It's important to note that you cannot appeal a conviction in which you plead guilty to with much chance of success. \n\nMost appeals that are successful aren't about innocence, but procedural mistakes by the prosecution and law enforcement officers in the case. \n\nAs high profile as this is, I imagine that the last thing anyone wants is for someone to have made one tiny mistake in an otherwise open and shut case and this guy go free because of it. There is still the fact that the judge can alter sentencing, and order modifiers such as without parole, or non concurrent sentences, meaning a separate life sentence for each victim, to be stacked on top of each other. \n\nI'm not a huge fan of the death penalty, but that's not the only way to make sure this man never walks away free.",
                "Surely the charges will be as bad as Luigi, right?",
                "We just shouldn’t have the death penalty at all. It’s far too permanent for something we can’t be right about 100% of the time. And life in prison is already a severe punishment (deservedly, in this case). Allowing our justice system to give in to bloodlust doesn’t help our society"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 49828,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm glad he made it out of the hospital, anyway. He died in his own bed.",
                "Must have been holding out for one last Easter",
                "Gone the day after Easter. Idk, is there anything more... Catholic? May he rest in eternal peace far from the trials and tribulations of Earth.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "> Francis appointed nearly 80% of the cardinal electors who will choose the next pope, increasing the possibility that his successor will continue his progressive policies, despite the strong pushback from traditionalists.\n\n\nThis will provide some hope.",
                "I was a closeted teenager in Catholic school when he was elected, and as he preached compassion over the years I felt like I could tangibly sense the people around me change their viewpoints on queerness. So many of my family members, including my godfather, changed their minds without knowing at the time that I was queer. I think it made me feel a lot more secure in my self when I did decide to start coming out a few years ago.\n\nI'm not Catholic anymore, but I think it would have taken me a lot longer to get on my own path if not for him. I'll always appreciate him for that. I hope he knows that he helped a little lesbian feel a bit more loved.\n\nEdit - OH MY GOD thank you guys for the awards!!!!!!",
                "Damn, the guy clung to life for that Easter appearance, probably because he knew that it would mean a lot to a lot of people and then he just let go. \n\nRest in Peace, Francis. You were actually a good Pope. \n\nI hope we can find someone similar, especially in these insane times.",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "We gonna get another conclave boys.",
                "At least he lived past Easter and lived long enough to make that impact standing."
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "HOT",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 1725,
            "date": "04/21/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "With a 2025 budget of $295 Million, cutting the IMLS will offset Trump's golf expenses.  \n\nMusk is still looking for cuts to help cover Trump's trip to the Superbowl and the Daytona 500.",
                "There was a time when we used to look up to smart people.  \n\nNow, smart people are a threat to the dumb fucks trying to destroy the country for their own profit.",
                "Libraries: the nexus of evil",
                "Yup our state library staff is being laid off due to federal cuts. It’s really depressing. These libraries help low income children with meals during the summer due to school being closed and not providing food.\n\nAll the money these oligarchs have and they’re cutting programs that help kids have food. This is despicable.",
                "This timeline is just getting depressing at this point.",
                "Republicans have been against libraries and non-commercial museums for decades. Sad more voters didn't consider this outcome when voting to give them more power.",
                "[This tweet remains relevant](https://x.com/sketchesbyboze/status/1304555319817797634?s=46&t=gYqP6Q5IoxKTzkC236AFpA)\n\n> my girlfriend regularly tells me “if free public libraries didn’t already exist and someone tried to invent them, they would be condemned as a socialist plot” and I think about that a lot.",
                "You know I would love to ask someone who voted for these clowns ONE question when I see things like this.\n\nWhat is the benefit to the American people of doing things like this?  \n\nAnd I would really like an honest answer. But doubt I'd ever get one.",
                "Welp, now I know why Cruz and Cornyn want to move the Discovery to Texas...",
                "Reminds me of the book Fahrenheit 451"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Red Lake Nation citizen cited for ‘fake’ license plates in Georgia",
            "external_url": "https://www.mprnews.org/story/2025/04/21/red-lake-nation-citizen-cited-for-fake-license-plates-in-georgia",
            "upvotes": 1861,
            "date": "04/21/2025",
            "thumbnail": "https://img.apmcdn.org/99cfe88d89c044db4320ef3bf990cde07ba53e9b/widescreen/ec7e6d-20250418-man-and-family-03-2000.jpg",
            "top_comments": [
                "I feel that the old, \"Ignorance of the law, is no excuse.\" should apply to the Police as well, in fact, even more so, as that's literally their only job. Enforcing laws. You'd think they'd bother to learn a couple.",
                "I just saw tribal plates for the first time last week and had to do a double take. I actually didn't realize tribal plates were a thing but I feel like cops should probably know better.",
                "SC Justice Gorsuch will eat this up, he may be a conservative but he also has a bone to pick about how state and federal government have trampled native rights in the US. It's weird.",
                "To be fair, it’s Georgia, there’s a good chance the cops were illiterate. ",
                "Where I live we see Mexico license plates sometimes. I’d think that would be pretty much the same as tribal plates. Maybe the real issue is that the Georgia officer couldn’t lookup the plate number or verify it?",
                "Kind of surprised that the cop didn't let him go after ordering him to remove the plates, then pull him over a mile later and ticket him for not having plates, since the guy argued about it.",
                "Was expecting some Sov Citizen nonsense before reading the article",
                "Reading the article, it does seem like the legality of tribal plates is questionable in the state of Georgia. Even the Red Lake lawyer cited says \"should be recognized by Georgia\", not that it is recognized. And I agree that it should be but I don't think this is a matter of \"dumb cop didn't know the law\". ",
                "In Oklahoma many of the tribes issue their own plates.  Surely they don't have these same issues driving around to other states like this?  Tribal plates aren't a new thing and police shouldn't be surprised by them at this point.  Morons.",
                "A smart lawyer should be able to get both citations dismissed before the court date. If the unusual plate is what caused the officer to begin tailing in the hope of a citation then they tacked on the speeding it may be fruit-of-the-poison-tree. If the other way around & there was an assumption of lenience on the speed except that the officer did not know how to record then it might be just dismissed."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Homeland Security Sec Kristi Noem has purse stolen in restaurant",
            "external_url": "https://www.cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/index.html",
            "upvotes": 1269,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25099707900433.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Who carries 3000.00 in cash?\n\n  \nEdit: after 34 minutes I would like to thank all of you for some humorous responses. Let's hold them account!!",
                "What was she doing with $3000 in cash on her? Feels like possible MS13 gang activity, should probably send her to Cecot to be safe. She might even have tattoos.",
                "The incompetence of Trump's staff is staggering.  \n \nThe thief got away with Noem’s driver’s license, medication, apartment keys, passport, DHS access badge, makeup bag, blank checks, and about $3,000 in cash.",
                "Walking around with $3000 in cash while wearing a $60,000 Rolex - look at how these parasites live while our 401ks dissolve.",
                "Spycraft often happens in plain sight. Now I'm not saying this was spycraft, but of you wanted to hand off stuff with plausible deniability, play the victim.\n\nOr, you're just grossly incompetent.",
                "If she can't even keep her own purse secure...",
                "Homeland Security Secretary can’t even secure her own purse? That’s hilariously ironic",
                "Gee, I wonder how many Signal chats that thief now has access to...",
                "[deleted]",
                "Maybe if this current Trump administration works really, really hard they can eventually increase their level of security to that of Hillary Clinton's staff going into the 2016 election."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US citizen wrongfully arrested by border patrol in Arizona held for nearly 10 days | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/20/us-citizen-jose-hermosillo-border-patrol",
            "upvotes": 7706,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cbfef30392575583987696eeaa4fc2095a168dc7/0_407_6500_3902/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=777eb2c63672ae9ad29d3e3a28ea5d41",
            "top_comments": [
                "Notice the recurring theme of how the border cops always lie to the court and say that the US citizen confessed to them (with zero evidence) to being an illegal immigrant? \n\n“According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico. Two days later, the federal court document notes that Hermosillo continued to claim he was a US citizen. On 17 April, a federal judge dismissed his case.”",
                "Nothing in America takes 10 days.  They knew after an hour, maybe two.  The other 238 hours were because they didn't like him.",
                "This is the 2nd incident of a US citizen being detained. Another US citizen in Florida was detained last week",
                "Yesterday NBC published an article on what to do if you’re a US citizen detained by ICE. Unbelievable that this is happening, and how fast we’ve fallen.\n\nhttps://www.nbcnews.com/news/us-news/us-citizens-email-notice-to-deport-rcna201862",
                "Remember when Democrats warned this would happen and republican said we were fear mongering. ",
                "Trump's personal gestapo. There's a reason organizations like border patrol, corrections and homeland security were deployed to Portland during the George Floyd protests. This isn't trump 1.0 with the Drumpf jokes, Rudy's hair peeling off and the four seasons landscaping fiasco. This is organized. They've got a plan and they're putting it into motion. Who knows where this will end.",
                "*Travelling while brown*.\n\nOnly *felony interference with profit* is worse.",
                "Ice needs to be dissolved and a new immigration enforcement agency needs to be built in its place. \n\nIt’s obvious the current culture of ice doesn’t care about due process.",
                "What sucks is anyone with a spanish ancestry who looks...\"spanish\"  is getting stopped.",
                "Border patrol agents are scum, just straight up lying. It is actually terrifying that ICE is detaining US citizens. It has now happened in several states. \n\n>”According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico.\n\n>”He did say he was a US citizen, but they didn’t believe him,” Hermosillo’s girlfriend’s aunt told AZPM. “I think they would have kept him. I think they would have, if they would have not got that information yesterday in the court, and gave that to Ice and the border patrol. He probably would have been deported already to Mexico.”"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "One day before Pope Francis’ death, U.S. Vice-President Vance received an audience on Easter Sunday",
            "external_url": "https://www.ctvnews.ca/world/article/one-day-before-pope-francis-death-us-vice-president-vance-received-an-audience-on-easter-sunday/",
            "upvotes": 503,
            "date": "04/21/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/EANVWOQYVY2KWLIARXSYD5DBE4.jpg?smart=true&auth=db8ad35d4a63bbb6c290dd755209abb4bb56545de82fd623f0ccf6ca31a1ea02&width=1200&height=630",
            "top_comments": [
                "It's like when the Queen met Liz Truss:\n\n\"I can't even with this idiot.\" *Dies*",
                "The one man that can make both Ottomans and Catholics nervous",
                "So the clear common sense logic provides us with 100% incontrovertible evidence that JD Vance murdered the Pope. Likely in a fit of rage.",
                "First Vance drops the college football national championship trophy. Now this.\n\n  \nHe's got a real medias touch, this one does.",
                "Bloody Americans, always have to be the biggest in everything.\n\nLiz Truss in the UK kills the Queen, so you guys just have to go and off the Pope? Can never let anyone else win eh?",
                "If I were religious, I too would be left a little shaken after meeting with the Antichrist’s lackey.",
                "Please have Vance meet with Putin before returning to the White House to meet with Trump immediately.",
                "JD Vance is the antichrist confirmed",
                "Seeing his face in person will take 10 years off anyones life",
                "The Vatican should detain him until we can figure out what's going on."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 38266,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Sir, a second group chat has hit the pentagon",
                "“I know what I am doing”",
                "So like, you know lets pretend for a second that we give this jackass a second chance to stop fucking up so badly for 5 fucking seconds. \n\n\n\nHow the fuck are Republicans in congress up in arms about Hilary's emails, but see no problem with this guy getting caught, not changing his behavior, and then doubling down on his fucking idiocy. \n\n\n\n\nThese fucks all deserve the boot, if not jail time. Fuck em all, hypocritical fuckheads.",
                "SECOND Signal chat?  Wtf?! Are the secure communications channels that our tax dollars pay for not good enough, Republicans? You have to go out of your way to compromise our ridiculously expensive security?!",
                "MAGA – Morons Are Governing America"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Defense Secretary gets purse containing IDs and thousands of cash stolen",
            "external_url": "https://www.cbsnews.com/news/kristi-noems-purse-stolen-id-cash-washington-dc-restaurant/?ftag=CNM-00-10aab6j&linkId=802478845&fbclid=IwZXh0bgNhZW0CMTEAAR5pM2RpYYMP5fIdPhiMaD6aDMC-pg1E7uXD3153iDAb05tZkmVu9pPkJt0UfA_aem__L0KIRGwvGSYZ56y8JuEhw",
            "upvotes": 11,
            "date": "04/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/21/a3cd58fa-8581-45f0-9a2e-fb5b01c72d5e/thumbnail/1200x630/bf2e87d8aa82f9c0e36aeaf35f201351/gettyimages-2206717045.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Thousands in Bribe money.  Entitled people like her use credit and write it all off on expense accounts.",
                "Did they make her Secretary of Defense today?",
                "(1) not the headline\n\n(2) not the defense secretary ",
                "Somebody ask her about meeting Kim Jong Un again.",
                "The reason for the cash in the article is so fucking Sus \n\nAlso she’s not the SECDEF.",
                "she's not the defense secretary - that's the drunk.\nshe's the homeland security secretart"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Passengers on Delta flight evacuate on slides after engine fire at Orlando airport",
            "external_url": "https://www.nbcnews.com/news/us-news/passengers-delta-flight-evacuate-slides-engine-fire-orlando-airport-rcna202183",
            "upvotes": 89,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250421-orlando-airport-delta-ew-128p-95838a.jpg",
            "top_comments": [
                "I mean, that's scary, but those slides do look fun. So there's that.",
                "Doesn't Ever Leave The Airport",
                "This’ll help the already struggling domestic airline industry for sure"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "One day before Pope Francis’ death, U.S. Vice-President Vance received an audience on Easter Sunday",
            "external_url": "https://www.ctvnews.ca/world/article/one-day-before-pope-francis-death-us-vice-president-vance-received-an-audience-on-easter-sunday/",
            "upvotes": 504,
            "date": "04/21/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/EANVWOQYVY2KWLIARXSYD5DBE4.jpg?smart=true&auth=db8ad35d4a63bbb6c290dd755209abb4bb56545de82fd623f0ccf6ca31a1ea02&width=1200&height=630",
            "top_comments": [
                "It's like when the Queen met Liz Truss:\n\n\"I can't even with this idiot.\" *Dies*",
                "The one man that can make both Ottomans and Catholics nervous",
                "So the clear common sense logic provides us with 100% incontrovertible evidence that JD Vance murdered the Pope. Likely in a fit of rage.",
                "First Vance drops the college football national championship trophy. Now this.\n\n  \nHe's got a real medias touch, this one does.",
                "Bloody Americans, always have to be the biggest in everything.\n\nLiz Truss in the UK kills the Queen, so you guys just have to go and off the Pope? Can never let anyone else win eh?",
                "If I were religious, I too would be left a little shaken after meeting with the Antichrist’s lackey.",
                "Please have Vance meet with Putin before returning to the White House to meet with Trump immediately.",
                "JD Vance is the antichrist confirmed",
                "Seeing his face in person will take 10 years off anyones life",
                "The Vatican should detain him until we can figure out what's going on."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 7180,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.",
                "Unfortunately, america no longer has a justice system.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Nothing gets conservative wackos to backtrack on their bullshit quicker than getting hit with a massive judgment.\n\nSee also: Dominion",
                "Sounds like 100 million to me. These guys all need to be bankrupted. All of them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Pakistan expels 80,000 Afghans in two weeks amid crackdown on undocumented migrants",
            "external_url": "https://www.abc.net.au/news/2025-04-19/pakistan-expels-afghans-amid-crackdown-on-undocumented-migrants/105193418",
            "upvotes": 194,
            "date": "04/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/f17eb1eb2d355ef87e4d9a38b750216c?impolicy=wcms_watermark_news&cropH=2295&cropW=4080&xPos=0&yPos=213&width=862&height=485&imformat=generic",
            "top_comments": [
                "Deportations are so hot right now 🥵",
                "*Thousands of Afghans who have lived in Pakistan for years — some for decades —are being forced to return to a homeland they describe as unsafe, economically crippled, and socially repressive under Taliban rule.  Many cite fears over limited job prospects, insecurity, and the Taliban's ongoing restrictions on women...*\n\nAdd to this the 9,000 Afghans presently seeking asylum in the U.S. who are about to be deported.",
                "Not to distract but I thought the thumbnail was ace Ventura in a rhino ",
                "Holy fuck the world is a mess. Why did I choose 2025 to start watching the news and paying attention.",
                "The ones who least wanted the democratic regime to fall were those absent when it did. \nTragic."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 9797,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "Long term gain, though, right?\n\n...you guys?",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "If Powell leaves it'll tumble another 1000.",
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "I think a corky laugh and a stable 401k would’ve been better than this.",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "Im so tired of winning.",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "Yesterday, had a family member say, “Imagine how bad it would be if Harris had won.”\n\nI should text him and say, well, the Dow wouldn’t be at a 3 year low."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder",
            "external_url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc",
            "upvotes": 5754,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Patrick Crusius was automatically be sentenced to life in prison without parole in the massacre near the U.S.-Mexico border. The change of plea comes after local prosecutors took the death penalty off the table.\n\n>El Paso County District Attorney James Montoya declined to pursue the death penalty, saying that decision was driven by a majority of victims’ relatives who want the case to be over.\n\nI can see the sentiment of just wanting to not think about it anymore. The murderer is 26 now and will likely spend decades in [a Texas prison](https://www.texastribune.org/2022/08/24/texas-prisons-air-conditioning/).",
                "So death for the UHC CEO murderer, but this dude gets to live?  Cool.  Cool.",
                "Wait, hold on. This guy kills 23 people in a racist attack and isn't considered a terrorist, but a guy killing a corrupt CEO is a terrorist?",
                "> About 100 people from victims’ families were seated in the gallery behind a few rows reserved for media, prosecutors and Crusius’ defense team. They will be given the time to give victim impact statements starting Monday afternoon. Dozens made emotional statements during a similar hearing in federal court in 2023 that lasted for three days.\n\n> The people who were killed at Walmart ranged in age from a 15-year-old high school athlete to elderly grandparents. They included immigrants, a retired city bus driver, a teacher, tradesmen including a former iron worker, and several Mexican nationals who had crossed the U.S. border on routine shopping trips.\n\nThose people leave behind a legacy of loved ones who will keep their memories alive. 100 loved ones to share their stories. This man leaves no legacy but hatred, and will be remembered as a bigoted monster. May he rot in prison and fade into obscurity.",
                "> The online rant speaks of a “Hispanic invasion of Texas.”\n\n>“They are the instigators, not me,” it says. “I am simply defending my country from cultural and ethnic replacement brought on by an invasion.”\n\n\nAsshole never studied U.S. history, clearly. It’s the other way around.",
                "23 people. Killed. In a grocery store.  \n\nMake it make sense. 2 is horrible but 23????",
                "I was just thinking about this the other day. Some madman guns down Hispanics at Walmart enraged at Mexicans under Trump's stoking of hatred, for said group. Mad man kills a mother and father leaving a baby homeless. Uncle of the baby is a MAGA lover, finds out Trump is coming, first thought is not overwhelming grief for his lost sister and orphaned niece, no he thinks! Bingo! If I grab the baby like a prop and head back to hospital where my sister and brother in law just died, maybe I can get a picture with Trump! https://www.theguardian.com/us-news/2019/aug/09/trump-el-paso-melania-orphan-baby-thumbs-up\nAnd he got his picture. I always think of this when people get shocked that the maga won't turn on him.",
                "It's important to note that you cannot appeal a conviction in which you plead guilty to with much chance of success. \n\nMost appeals that are successful aren't about innocence, but procedural mistakes by the prosecution and law enforcement officers in the case. \n\nAs high profile as this is, I imagine that the last thing anyone wants is for someone to have made one tiny mistake in an otherwise open and shut case and this guy go free because of it. There is still the fact that the judge can alter sentencing, and order modifiers such as without parole, or non concurrent sentences, meaning a separate life sentence for each victim, to be stacked on top of each other. \n\nI'm not a huge fan of the death penalty, but that's not the only way to make sure this man never walks away free.",
                "Surely the charges will be as bad as Luigi, right?",
                "We just shouldn’t have the death penalty at all. It’s far too permanent for something we can’t be right about 100% of the time. And life in prison is already a severe punishment (deservedly, in this case). Allowing our justice system to give in to bloodlust doesn’t help our society"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "Homeland Security Sec Kristi Noem has purse stolen in restaurant",
            "external_url": "https://www.cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/index.html",
            "upvotes": 1272,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25099707900433.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Who carries 3000.00 in cash?\n\n  \nEdit: after 34 minutes I would like to thank all of you for some humorous responses. Let's hold them account!!",
                "What was she doing with $3000 in cash on her? Feels like possible MS13 gang activity, should probably send her to Cecot to be safe. She might even have tattoos.",
                "The incompetence of Trump's staff is staggering.  \n \nThe thief got away with Noem’s driver’s license, medication, apartment keys, passport, DHS access badge, makeup bag, blank checks, and about $3,000 in cash.",
                "Walking around with $3000 in cash while wearing a $60,000 Rolex - look at how these parasites live while our 401ks dissolve.",
                "Spycraft often happens in plain sight. Now I'm not saying this was spycraft, but of you wanted to hand off stuff with plausible deniability, play the victim.\n\nOr, you're just grossly incompetent.",
                "If she can't even keep her own purse secure...",
                "Homeland Security Secretary can’t even secure her own purse? That’s hilariously ironic",
                "Gee, I wonder how many Signal chats that thief now has access to...",
                "[deleted]",
                "Maybe if this current Trump administration works really, really hard they can eventually increase their level of security to that of Hillary Clinton's staff going into the 2016 election."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 1725,
            "date": "04/21/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "With a 2025 budget of $295 Million, cutting the IMLS will offset Trump's golf expenses.  \n\nMusk is still looking for cuts to help cover Trump's trip to the Superbowl and the Daytona 500.",
                "There was a time when we used to look up to smart people.  \n\nNow, smart people are a threat to the dumb fucks trying to destroy the country for their own profit.",
                "Libraries: the nexus of evil",
                "Yup our state library staff is being laid off due to federal cuts. It’s really depressing. These libraries help low income children with meals during the summer due to school being closed and not providing food.\n\nAll the money these oligarchs have and they’re cutting programs that help kids have food. This is despicable.",
                "This timeline is just getting depressing at this point.",
                "Republicans have been against libraries and non-commercial museums for decades. Sad more voters didn't consider this outcome when voting to give them more power.",
                "[This tweet remains relevant](https://x.com/sketchesbyboze/status/1304555319817797634?s=46&t=gYqP6Q5IoxKTzkC236AFpA)\n\n> my girlfriend regularly tells me “if free public libraries didn’t already exist and someone tried to invent them, they would be condemned as a socialist plot” and I think about that a lot.",
                "You know I would love to ask someone who voted for these clowns ONE question when I see things like this.\n\nWhat is the benefit to the American people of doing things like this?  \n\nAnd I would really like an honest answer. But doubt I'd ever get one.",
                "Welp, now I know why Cruz and Cornyn want to move the Discovery to Texas...",
                "Reminds me of the book Fahrenheit 451"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Red Lake Nation citizen cited for ‘fake’ license plates in Georgia",
            "external_url": "https://www.mprnews.org/story/2025/04/21/red-lake-nation-citizen-cited-for-fake-license-plates-in-georgia",
            "upvotes": 1867,
            "date": "04/21/2025",
            "thumbnail": "https://img.apmcdn.org/99cfe88d89c044db4320ef3bf990cde07ba53e9b/widescreen/ec7e6d-20250418-man-and-family-03-2000.jpg",
            "top_comments": [
                "I feel that the old, \"Ignorance of the law, is no excuse.\" should apply to the Police as well, in fact, even more so, as that's literally their only job. Enforcing laws. You'd think they'd bother to learn a couple.",
                "I just saw tribal plates for the first time last week and had to do a double take. I actually didn't realize tribal plates were a thing but I feel like cops should probably know better.",
                "SC Justice Gorsuch will eat this up, he may be a conservative but he also has a bone to pick about how state and federal government have trampled native rights in the US. It's weird.",
                "To be fair, it’s Georgia, there’s a good chance the cops were illiterate. ",
                "Where I live we see Mexico license plates sometimes. I’d think that would be pretty much the same as tribal plates. Maybe the real issue is that the Georgia officer couldn’t lookup the plate number or verify it?",
                "Kind of surprised that the cop didn't let him go after ordering him to remove the plates, then pull him over a mile later and ticket him for not having plates, since the guy argued about it.",
                "Was expecting some Sov Citizen nonsense before reading the article",
                "Reading the article, it does seem like the legality of tribal plates is questionable in the state of Georgia. Even the Red Lake lawyer cited says \"should be recognized by Georgia\", not that it is recognized. And I agree that it should be but I don't think this is a matter of \"dumb cop didn't know the law\". ",
                "In Oklahoma many of the tribes issue their own plates.  Surely they don't have these same issues driving around to other states like this?  Tribal plates aren't a new thing and police shouldn't be surprised by them at this point.  Morons.",
                "A smart lawyer should be able to get both citations dismissed before the court date. If the unusual plate is what caused the officer to begin tailing in the hope of a citation then they tacked on the speeding it may be fruit-of-the-poison-tree. If the other way around & there was an assumption of lenience on the speed except that the officer did not know how to record then it might be just dismissed."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 7178,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.",
                "Unfortunately, america no longer has a justice system.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Nothing gets conservative wackos to backtrack on their bullshit quicker than getting hit with a massive judgment.\n\nSee also: Dominion",
                "Sounds like 100 million to me. These guys all need to be bankrupted. All of them."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 1725,
            "date": "04/21/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "With a 2025 budget of $295 Million, cutting the IMLS will offset Trump's golf expenses.  \n\nMusk is still looking for cuts to help cover Trump's trip to the Superbowl and the Daytona 500.",
                "There was a time when we used to look up to smart people.  \n\nNow, smart people are a threat to the dumb fucks trying to destroy the country for their own profit.",
                "Libraries: the nexus of evil",
                "Yup our state library staff is being laid off due to federal cuts. It’s really depressing. These libraries help low income children with meals during the summer due to school being closed and not providing food.\n\nAll the money these oligarchs have and they’re cutting programs that help kids have food. This is despicable.",
                "This timeline is just getting depressing at this point.",
                "Republicans have been against libraries and non-commercial museums for decades. Sad more voters didn't consider this outcome when voting to give them more power.",
                "[This tweet remains relevant](https://x.com/sketchesbyboze/status/1304555319817797634?s=46&t=gYqP6Q5IoxKTzkC236AFpA)\n\n> my girlfriend regularly tells me “if free public libraries didn’t already exist and someone tried to invent them, they would be condemned as a socialist plot” and I think about that a lot.",
                "You know I would love to ask someone who voted for these clowns ONE question when I see things like this.\n\nWhat is the benefit to the American people of doing things like this?  \n\nAnd I would really like an honest answer. But doubt I'd ever get one.",
                "Welp, now I know why Cruz and Cornyn want to move the Discovery to Texas...",
                "Reminds me of the book Fahrenheit 451"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 9796,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "Long term gain, though, right?\n\n...you guys?",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "If Powell leaves it'll tumble another 1000.",
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "I think a corky laugh and a stable 401k would’ve been better than this.",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "Im so tired of winning.",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "Yesterday, had a family member say, “Imagine how bad it would be if Harris had won.”\n\nI should text him and say, well, the Dow wouldn’t be at a 3 year low."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder",
            "external_url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc",
            "upvotes": 5769,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Patrick Crusius was automatically be sentenced to life in prison without parole in the massacre near the U.S.-Mexico border. The change of plea comes after local prosecutors took the death penalty off the table.\n\n>El Paso County District Attorney James Montoya declined to pursue the death penalty, saying that decision was driven by a majority of victims’ relatives who want the case to be over.\n\nI can see the sentiment of just wanting to not think about it anymore. The murderer is 26 now and will likely spend decades in [a Texas prison](https://www.texastribune.org/2022/08/24/texas-prisons-air-conditioning/).",
                "So death for the UHC CEO murderer, but this dude gets to live?  Cool.  Cool.",
                "Wait, hold on. This guy kills 23 people in a racist attack and isn't considered a terrorist, but a guy killing a corrupt CEO is a terrorist?",
                "> About 100 people from victims’ families were seated in the gallery behind a few rows reserved for media, prosecutors and Crusius’ defense team. They will be given the time to give victim impact statements starting Monday afternoon. Dozens made emotional statements during a similar hearing in federal court in 2023 that lasted for three days.\n\n> The people who were killed at Walmart ranged in age from a 15-year-old high school athlete to elderly grandparents. They included immigrants, a retired city bus driver, a teacher, tradesmen including a former iron worker, and several Mexican nationals who had crossed the U.S. border on routine shopping trips.\n\nThose people leave behind a legacy of loved ones who will keep their memories alive. 100 loved ones to share their stories. This man leaves no legacy but hatred, and will be remembered as a bigoted monster. May he rot in prison and fade into obscurity.",
                "> The online rant speaks of a “Hispanic invasion of Texas.”\n\n>“They are the instigators, not me,” it says. “I am simply defending my country from cultural and ethnic replacement brought on by an invasion.”\n\n\nAsshole never studied U.S. history, clearly. It’s the other way around.",
                "23 people. Killed. In a grocery store.  \n\nMake it make sense. 2 is horrible but 23????",
                "I was just thinking about this the other day. Some madman guns down Hispanics at Walmart enraged at Mexicans under Trump's stoking of hatred, for said group. Mad man kills a mother and father leaving a baby homeless. Uncle of the baby is a MAGA lover, finds out Trump is coming, first thought is not overwhelming grief for his lost sister and orphaned niece, no he thinks! Bingo! If I grab the baby like a prop and head back to hospital where my sister and brother in law just died, maybe I can get a picture with Trump! https://www.theguardian.com/us-news/2019/aug/09/trump-el-paso-melania-orphan-baby-thumbs-up\nAnd he got his picture. I always think of this when people get shocked that the maga won't turn on him.",
                "It's important to note that you cannot appeal a conviction in which you plead guilty to with much chance of success. \n\nMost appeals that are successful aren't about innocence, but procedural mistakes by the prosecution and law enforcement officers in the case. \n\nAs high profile as this is, I imagine that the last thing anyone wants is for someone to have made one tiny mistake in an otherwise open and shut case and this guy go free because of it. There is still the fact that the judge can alter sentencing, and order modifiers such as without parole, or non concurrent sentences, meaning a separate life sentence for each victim, to be stacked on top of each other. \n\nI'm not a huge fan of the death penalty, but that's not the only way to make sure this man never walks away free.",
                "Surely the charges will be as bad as Luigi, right?",
                "We just shouldn’t have the death penalty at all. It’s far too permanent for something we can’t be right about 100% of the time. And life in prison is already a severe punishment (deservedly, in this case). Allowing our justice system to give in to bloodlust doesn’t help our society"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Pakistan expels 80,000 Afghans in two weeks amid crackdown on undocumented migrants",
            "external_url": "https://www.abc.net.au/news/2025-04-19/pakistan-expels-afghans-amid-crackdown-on-undocumented-migrants/105193418",
            "upvotes": 198,
            "date": "04/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/f17eb1eb2d355ef87e4d9a38b750216c?impolicy=wcms_watermark_news&cropH=2295&cropW=4080&xPos=0&yPos=213&width=862&height=485&imformat=generic",
            "top_comments": [
                "Deportations are so hot right now 🥵",
                "*Thousands of Afghans who have lived in Pakistan for years — some for decades —are being forced to return to a homeland they describe as unsafe, economically crippled, and socially repressive under Taliban rule.  Many cite fears over limited job prospects, insecurity, and the Taliban's ongoing restrictions on women...*\n\nAdd to this the 9,000 Afghans presently seeking asylum in the U.S. who are about to be deported.",
                "Not to distract but I thought the thumbnail was ace Ventura in a rhino ",
                "Holy fuck the world is a mess. Why did I choose 2025 to start watching the news and paying attention.",
                "The ones who least wanted the democratic regime to fall were those absent when it did. \nTragic."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Red Lake Nation citizen cited for ‘fake’ license plates in Georgia",
            "external_url": "https://www.mprnews.org/story/2025/04/21/red-lake-nation-citizen-cited-for-fake-license-plates-in-georgia",
            "upvotes": 1858,
            "date": "04/21/2025",
            "thumbnail": "https://img.apmcdn.org/99cfe88d89c044db4320ef3bf990cde07ba53e9b/widescreen/ec7e6d-20250418-man-and-family-03-2000.jpg",
            "top_comments": [
                "I feel that the old, \"Ignorance of the law, is no excuse.\" should apply to the Police as well, in fact, even more so, as that's literally their only job. Enforcing laws. You'd think they'd bother to learn a couple.",
                "I just saw tribal plates for the first time last week and had to do a double take. I actually didn't realize tribal plates were a thing but I feel like cops should probably know better.",
                "SC Justice Gorsuch will eat this up, he may be a conservative but he also has a bone to pick about how state and federal government have trampled native rights in the US. It's weird.",
                "To be fair, it’s Georgia, there’s a good chance the cops were illiterate. ",
                "Where I live we see Mexico license plates sometimes. I’d think that would be pretty much the same as tribal plates. Maybe the real issue is that the Georgia officer couldn’t lookup the plate number or verify it?",
                "Kind of surprised that the cop didn't let him go after ordering him to remove the plates, then pull him over a mile later and ticket him for not having plates, since the guy argued about it.",
                "Was expecting some Sov Citizen nonsense before reading the article",
                "Reading the article, it does seem like the legality of tribal plates is questionable in the state of Georgia. Even the Red Lake lawyer cited says \"should be recognized by Georgia\", not that it is recognized. And I agree that it should be but I don't think this is a matter of \"dumb cop didn't know the law\". ",
                "In Oklahoma many of the tribes issue their own plates.  Surely they don't have these same issues driving around to other states like this?  Tribal plates aren't a new thing and police shouldn't be surprised by them at this point.  Morons.",
                "A smart lawyer should be able to get both citations dismissed before the court date. If the unusual plate is what caused the officer to begin tailing in the hope of a citation then they tacked on the speeding it may be fruit-of-the-poison-tree. If the other way around & there was an assumption of lenience on the speed except that the officer did not know how to record then it might be just dismissed."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "One day before Pope Francis’ death, U.S. Vice-President Vance received an audience on Easter Sunday",
            "external_url": "https://www.ctvnews.ca/world/article/one-day-before-pope-francis-death-us-vice-president-vance-received-an-audience-on-easter-sunday/",
            "upvotes": 506,
            "date": "04/21/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/EANVWOQYVY2KWLIARXSYD5DBE4.jpg?smart=true&auth=db8ad35d4a63bbb6c290dd755209abb4bb56545de82fd623f0ccf6ca31a1ea02&width=1200&height=630",
            "top_comments": [
                "It's like when the Queen met Liz Truss:\n\n\"I can't even with this idiot.\" *Dies*",
                "The one man that can make both Ottomans and Catholics nervous",
                "So the clear common sense logic provides us with 100% incontrovertible evidence that JD Vance murdered the Pope. Likely in a fit of rage.",
                "First Vance drops the college football national championship trophy. Now this.\n\n  \nHe's got a real medias touch, this one does.",
                "Bloody Americans, always have to be the biggest in everything.\n\nLiz Truss in the UK kills the Queen, so you guys just have to go and off the Pope? Can never let anyone else win eh?",
                "If I were religious, I too would be left a little shaken after meeting with the Antichrist’s lackey.",
                "Please have Vance meet with Putin before returning to the White House to meet with Trump immediately.",
                "JD Vance is the antichrist confirmed",
                "Seeing his face in person will take 10 years off anyones life",
                "The Vatican should detain him until we can figure out what's going on."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Homeland Security Sec Kristi Noem has purse stolen in restaurant",
            "external_url": "https://www.cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/index.html",
            "upvotes": 1277,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25099707900433.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Who carries 3000.00 in cash?\n\n  \nEdit: after 34 minutes I would like to thank all of you for some humorous responses. Let's hold them account!!",
                "What was she doing with $3000 in cash on her? Feels like possible MS13 gang activity, should probably send her to Cecot to be safe. She might even have tattoos.",
                "The incompetence of Trump's staff is staggering.  \n \nThe thief got away with Noem’s driver’s license, medication, apartment keys, passport, DHS access badge, makeup bag, blank checks, and about $3,000 in cash.",
                "Walking around with $3000 in cash while wearing a $60,000 Rolex - look at how these parasites live while our 401ks dissolve.",
                "Spycraft often happens in plain sight. Now I'm not saying this was spycraft, but of you wanted to hand off stuff with plausible deniability, play the victim.\n\nOr, you're just grossly incompetent.",
                "If she can't even keep her own purse secure...",
                "Homeland Security Secretary can’t even secure her own purse? That’s hilariously ironic",
                "Gee, I wonder how many Signal chats that thief now has access to...",
                "[deleted]",
                "Maybe if this current Trump administration works really, really hard they can eventually increase their level of security to that of Hillary Clinton's staff going into the 2016 election."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "3 dead, 2 missing as severe weather slams Oklahoma",
            "external_url": "https://abcnews.go.com/US/easter-weather-severe-flooding/story?id=120986219",
            "upvotes": 585,
            "date": "04/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7ea3a3d2-bc68-4cb4-8b66-423bb0b3b250/koco-moore-2_1745128717433_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I recently started watching some extreme weather channels and man Oklahoma really has some horrible shit to deal with. Tornados and flooding that would make the End Times blush.",
                "Thank God for FEMA...... Oh, never mind.... I doubt they'll even be sending bootstraps at this point",
                "I don't think I could every live in Oklahoma because I think the skies have it out for them.",
                "I'm curious to know if they had any warning with how the NOAA is being gutted.",
                "Donnie’s FEMA will take care of them",
                "I hope everyone involved gets what they voted for",
                "FEMA will fix it!\n\nOH WAIT-",
                "You're on your own Oklahoma; call your leader and thank him for making your life great."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 49825,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm glad he made it out of the hospital, anyway. He died in his own bed.",
                "Must have been holding out for one last Easter",
                "Gone the day after Easter. Idk, is there anything more... Catholic? May he rest in eternal peace far from the trials and tribulations of Earth.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "> Francis appointed nearly 80% of the cardinal electors who will choose the next pope, increasing the possibility that his successor will continue his progressive policies, despite the strong pushback from traditionalists.\n\n\nThis will provide some hope.",
                "I was a closeted teenager in Catholic school when he was elected, and as he preached compassion over the years I felt like I could tangibly sense the people around me change their viewpoints on queerness. So many of my family members, including my godfather, changed their minds without knowing at the time that I was queer. I think it made me feel a lot more secure in my self when I did decide to start coming out a few years ago.\n\nI'm not Catholic anymore, but I think it would have taken me a lot longer to get on my own path if not for him. I'll always appreciate him for that. I hope he knows that he helped a little lesbian feel a bit more loved.\n\nEdit - OH MY GOD thank you guys for the awards!!!!!!",
                "Damn, the guy clung to life for that Easter appearance, probably because he knew that it would mean a lot to a lot of people and then he just let go. \n\nRest in Peace, Francis. You were actually a good Pope. \n\nI hope we can find someone similar, especially in these insane times.",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "We gonna get another conclave boys.",
                "At least he lived past Easter and lived long enough to make that impact standing."
            ],
            "aggregate_sentiment": 85.0
        }
    ],
    "last_updated": "04/21/2025 20:10:15 UTC"
}