{
    "posts": [
        {
            "category": "HOT",
            "title": "US Defense Secretary Hegseth to slash senior-most ranks of military",
            "external_url": "https://www.reuters.com/world/us/pentagon-reduce-4-star-positions-by-20-official-says-2025-05-05/",
            "upvotes": 26549,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This includes removing the Chairman of the Joint Chiefs of Staff, the Navy's top admiral and other senior flag officers from their positions.",
                "Genuinely troubling. These are the few people most likely to stand up against an unconstitutional order.",
                "You gotta remove the guys who won’t do fascism for you, y’know?",
                "Imagine achieving the highest rank in the military over a lifetime of excellence & devotion ... only to be fired by this chode.",
                "For all the noise conservatives make when democratic presidents are in charge, screeching about tyranny... I've never been more afraid of the government than I have been the last four months. And it is getting worse every day.  Something has got to give. The mid terms need to be fucking tidal wave\n\nEdit: yeah, yeah, I get it, \"there won't be midterms\"... Well what the fuck are you doing, then?  You got a militia I can join? Otherwise, propose a fucking solution. Because I'll be phone banking, donating, knocking on doors and doing the best my household can to democratically pull this shit back.",
                "The cleanup after this administration will be monumental and take decades. America is in the process of learning an intensely painful lesson.",
                "Yeah, so when they stage the coup for the third term there is no one at the top to defy them.",
                "*\"More generals and admirals does not lead to more success,\" Hegseth said in a video posted on X.*\n\nThis is coming from a Fox News weekend TV host - someone with absolutely zero experience to say something like that. \n…\n\n*\"This is not a slash and burn exercise meant to punish high ranking officers, nothing could be further from the truth,\" he said.*\n\nSooooo, it’s a slash and burn exercise meant to punish high ranking officers.",
                "Getting rid of any military leaders who swore allegiance to the US Constitution, and not Trump before they are deployed to oppress Americans.",
                "I can’t imagine being a general and having this hot dog fire you. After leaking literal war plans in multiple group chats."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration bars Harvard from new federal research funding",
            "external_url": "https://www.politico.com/news/2025/05/05/trump-bars-harvard-new-federal-research-funding-00330059",
            "upvotes": 3882,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yet another thing Harvard can sue him for and win.\n\n\nTrump is so bad at this villainous consolidation thing.",
                "Trump just showing the way Liberty University can be denied federal funding through their students.",
                "Just a waste of everyone's resources and time. Fuckwad and his crew have no intentions on actually doing anything that will help the average American",
                "12 Nobel Prize-winning scientists have active research programs at the Harvard Biological Labs.  Trump is attempting to cut off funding to some of the most important and impactful research on the planet, research that has and will save lives and make people's lives better, all because he's in a snit. \n\nAnd I say this as someone who did my PhD at a rival institution,  and devoutly believes that Harvard can gargle my testicles.  It's hard to argue with their results.",
                "Fascists doing fascist shit.",
                "He’s going to decimate America’s leadership in various areas of research over his bruised ego, and the Republican Congress won’t challenge him. This is a team effort.",
                "He's gonna hamstring the brightest minds in the United States from conducting research that may help us all some day? Great.",
                "He’s really not up to speed on what Universities can achieve, is he?\n\nManchester University isolating Graphene being just one example…",
                "Man, Donnie really hates America",
                "I wonder what a great America looks like to Trump. He guts NASA, the greatest space research institution in the world. He guts the NIH, the greatest medical research institution in the world. He guts the CDC, the greatest public health organization in the world. And now he targets Harvard, one of the greatest universities in the world. These are the things that, to me, make America \"great.\"\n\nDoes he think a great America is just a place with the most sweat shops in the world? He really seems to prefer America makes brake pads than revolutionary medical breakthroughs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 1939,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Oh dear, how sad meme",
                "Not a good sign for the military parade",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "Keep up the work Ukraine ! ! !",
                "I came to Reddit for some p0rn inspo but no longer needed…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 7794,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                "I thought this was about ICE and am now disappointed.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "from the click through.. of course this wasnt the only incident with her\n\n>During protective order hearings over the course of several months, Ethridge testified about the March 2020 incident and several previous instances in which he said Stary beat the children, forced them to sleep outside on the porch and abandoned one of their daughters on the side of the road during a drive back from Colorado.\n\n>The kids called the police for help at least six times, and Child Protective Services was contacted at least five times, according to court records.\n\n>After interviews with the children, a Harris County district court judge went a step further — she issued a lifetime protective order. Stary would not be allowed to see or directly contact her kids indefinitely.\n\nthe kids calling for help 11 times.. FFS and what happened with abandoning one on the drive from colorado to texas. Sounds like she should have had kids taken away a long time ago.",
                "Obviously doesn't apply to citizens at the border. ",
                "Unless it's ICE doing it.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump orders the reopening of Alcatraz prison",
            "external_url": "https://www.reuters.com/world/us/trump-directs-bureau-prisons-reopen-alcatraz-2025-05-04/",
            "upvotes": 16012,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I bet he just watched The Rock last weekend.",
                "Such a worthless idea, there is no reason to have a prison there and terrible from a cost efficiency standpoint, people escaping from maximum security prisons isn’t the concern it used to be",
                "Step 1: insist on reopening a long abandoned prison with enormous costs associated in order to divert attention.\n\nStep 2: announce reopening will cost $45B.\n\nStep 3: announce that we will not reopen the prison citing budgetary reasons.\n\nStep 4: claim to have saved the federal government $45B & gives friends the \"savings\". MAGA spikes the football.\n\nThis is Trump math, y'all.",
                "We literally have incredible supermax prisons on the mainland. The rock was built during a time when modern supermax didn't really exist and the natural island/water barrier was useful. But now ... This is more of a visual move. Alcatraz is infamous and legendary, Trump wants to tie its reopening to him. It's symbolic and moronic.",
                "Honest question is this even legally allowed? I assume Alcatraz was set up as National Park via legislation? This would need budget correct?",
                "This is a distraction from more important things, like him saying he doesn't know if he has to uphold the constitution or if people are guaranteed due process. Let's keep the focus there.",
                "Swear to God he watched fucking Escape from Alcatraz the other night, thought Clint was cool, and came up with this bullshit about reopening the prison and tariffs on movies.",
                "All I know about Alcatraz I learned from Tony Hawk’s Pro Skater 4",
                "isn't it a museum now? whats the plan? bulldoze the tourist attraction?",
                "Donald Trump has, on more than on occasion, compared himself to Al Capone.\n\nAlcatraz is where Al Capone first got any sort of treatment for his festering syphilis. Though it was an outdated treatment, even for its time. His condition worsened and his mental capacity greatly diminished during his incarceration there."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Young woman's strip search at festival akin to 'sexual assault', court told",
            "external_url": "https://www.abc.net.au/news/2025-05-05/young-woman-strip-search-sexual-assault-court-nsw-police/105253220",
            "upvotes": 18221,
            "date": "05/05/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef1b6cfe6b1f485eed0fc526fe9abc97?impolicy=wcms_watermark_news&cropH=1447&cropW=2573&xPos=0&yPos=134&width=862&height=485&imformat=generic",
            "top_comments": [
                "Showing your butthole to security should not be a part of going to a festival. How the fuck did it get to that point where the people performing the searches think this is OK?",
                "Police in Sydney routinely conduct invasive strip searches at music festivals. We’re talking completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began today, hence the article.\n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "\"Parliament had made it clear strip searches were only supposed to be used \"in the most extreme of circumstances\", but that was not the way they were being executed by NSW Police.\"\n\nI know why, it's because you have perverts in positions of power and are abusing it for their own pleasure. \n\nShe was asked to strip, expose all parts of her body, drop her breasts, bend over and expose her anus and vagina, also ordering her to bend over while naked and remove a tampon. AND, a male police officer walked into the cubicle unannounced and observed the plaintiff in this position. Putting a woman through that because a cop had a \"hunch\"? Right. \n\nThose cops got off on it. Just disgusting behavior that should have consequences. This is not the kind of people you want in the police force.",
                "People that put these policies in place should have to go through this stuff themselves in a public space and then decide if the \"problem\" they think they're solving is worth the solution they've decided upon.",
                "Over 1500 of them were children: https://rlc.org.au/news-and-media/media-releases/nsw-police-strip-searched-1546-children-seven-years",
                "I wonder if those cops would do that to their own family, how they'd react if they heard that happened to their kids. Seems like a lack of humanity being experienced here by these individuals. When you're the one committing heinous acts, are you the protector anymore or are you the problem that needs to be solved?",
                "I really try not to think the worst of people but \"drug dog sniffed in her direction\" sounds like a cover up of  \"wanted to see the attractive festival goer naked and needed some kinda probable cause\" yuck.",
                "Not akin to sexual assault... this is sexual assault.",
                "That sounds worse than the airport controls. Is this procedure really common in Australia?",
                "So music festivals in Sydney are sex fetish festival for police?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "DoorDash driver shot in the back in New York’s Orange County, police say",
            "external_url": "https://www.nbcnewyork.com/new-york/orange-county-arrest-doordash-shooting/6251075/",
            "upvotes": 1967,
            "date": "05/05/2025",
            "thumbnail": "https://media.nbcnewyork.com/2019/09/nysp-generic.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Police in New York said a town official was arrested over the weekend for shooting a DoorDash delivery driver who was lost and trying to find the right address.\n\nState police said John Reilly, the highway superintendent for the Town of Chester, was arrested on Saturday, the day after allegedly shooting the delivery driver in front of his home. The 48-year-old faces charges of felony assault and weapons possession.\n\nThe shooting happened around 10 p.m. Friday night on Valerie Drive. According to police, the DoorDash driver had become lost and could not locate the correct delivery address.\n\nThe DoorDash worker went door-to-door, asking for directions in hopes of tracking down the correct home, police said. He eventually made it to Reilly's home, where the 48-year-old instructed the man to get off his property.\n\nAfter turning to leave, police allege that Reilly fired \"multiple shots\" at the delivery man. One of the bullets struck him in the back, \"causing seriously physical injuries.\"\n\nDoorDash shared a statement with The New York Times, saying the company would work with law enforcement following this \"tragic incident.\"\n\n“We’re devastated by this senseless act of violence, and we’re wishing the Dasher a full and speedy recovery,” the statement read.\n\nReilly is scheduled to appear in court Friday morning in the Town of Chester Court. Contact information for his attorney was not immediately known.\n\nAccording to police, Reilly is a federally licensed firearms dealer.",
                "These types of loonies are all over apps like Neighbors, posting videos of \"trespassers\" who are \"casing their street\" with a food delivery bag in hand.",
                "*The DoorDash worker went door-to-door, asking for directions in hopes of tracking down the correct home, police said. He eventually made it to Reilly's home, where the 48-year-old instructed the man to get off his property.  After turning to leave, police allege that Reilly fired \"multiple shots\" at the delivery man. One of the bullets struck him in the back, \"causing seriously physical injuries.\"*\n\nThis act is equally as heinous as a very similar recent upstate NY shooting when a young woman who was turning around in a driveway because of an incorrect address was shot to death by the property's owner. (the Dasher driver is luckily still alive)",
                "Can't wait to hear this loser say he was scared for his life because of the person who was leaving his property",
                "Send the piece of shit irresponsible gun owner to prison and revoke all of his licenses.",
                "Shooting someone in the back doesn't support self defense but the jerk's lawyer will probably try that. \n\nPretty sure if the jerk's social media is examined you'd find exactly what you'd expect.",
                "Most attempted robberies by criminals usually start with a food bag in their hand!\n\n\n/s",
                "How afraid of the world are you that just someone coming to your door asking for directions makes you snap?",
                "IT's clear that this falls into the category of \"just laying in wait\" shooters, who are looking for any excuse to murder people. I wonder what the race of both of these individuals are, as that often plays into these stories quite heavily.\n\nThere is not a small number of people in this nation who have firearms and can't wait to unload into anyone who 'fits the profile'. We've seen this play out in town after town, people ask for directions, and get filled with lead for the crime of being on someone's' property. Sometimes they claim self defense, and not a few times they have gotten away with it.\n\nLets' see how this one plays out. But you can't help but feel \"here we go again\" after all the repeated incidents of this we see year after year.",
                "Another case of paranoid Fox News brain.  That county and that town are very red so it's full of people like that."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Romania PM resigns after far-right wins first-round of president vote",
            "external_url": "https://www.reuters.com/world/europe/romania-pm-resigns-after-far-right-wins-first-round-president-vote-2025-05-05/",
            "upvotes": 3001,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I need a TL;DR on the strategy here. I can't make heads or tails of it in the Reuters article. Is the idea that if the PM resigns and his party puts their support behind the centrists it makes a far-right win less likely?",
                "Can someone give local context?",
                "Is this why Andrew Taint went back? Thought he could have an advantage there now?",
                "Let me be optimistic. There is a second, ballot round. Please friends from Romania be smart..",
                "Neat.\n\nIf only Eastern Europeans had a recent history of failed authoritarian rule to learn from.",
                "Fake news. Correct title: \nRomanian PM resigns after his coalition candidate failed to secure second place and enter the final round.",
                "OMG the next idiot gets elected.... Do people not learn?",
                "I guess they didn’t get enough abuse from the last dictator ahole.",
                "He basically washed his hands of the political disaster his party caused, made sure his rats got fed off the state good enough, and now let's other people deal with the situation.",
                "Romania looking for their fascist Nicolae Ceaușescu. People learn to make the same mistakes in new ways."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Portugal announces the expulsion of 18,000 foreigners ahead of a national election",
            "external_url": "https://apnews.com/article/portugal-immigration-election-c491f01613bab2f5342118d288c2903e",
            "upvotes": 1877,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "18,000 notifications to people in the country illegally to leave. The minister said officials will begin next week by asking some 4,500 foreigners to leave voluntarily within 20 days.",
                "Leaving aside the merits of expelling these people, it’s interesting that a caretaker government is doing something that could sway the outcome of the election. Im assuming the caretaker conventions in Portugal differ from other countries?",
                "18000 in the country without permission. It sounds like those on visas, right to remain, and naturalized are all staying where they are.",
                "Is this any different than what countries do everyday? Why is this news exactly?",
                "What happens if they dont leave ?",
                "mass deportation light?",
                "oficial numbers 1,5 million foreigners in portugal thats 15% of the population",
                "I can’t wait for the US Democratic party and other left leaning political parties in the West to condemn this blatantly racist & nationalistic action!\n\nHow dare Portugal protect its sovereignty!!",
                "[deleted]",
                "Amazing how many people in this discussion are ok with Nazi policies and inhumanities based on \n\n\"Illegal\".\n\n\nYou should be ashamed and I'm ashamed you live in the same country as I"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Rachel Morin's children sue grandmother over GoFundMe proceeds",
            "external_url": "https://www.thebaltimorebanner.com/community/criminal-justice/rachel-morin-patty-morin-lawsuit-gofundme-GIAJYPNWW5ESRPIHI5QGOAXTYI/",
            "upvotes": 768,
            "date": "05/06/2025",
            "thumbnail": "https://www.thebaltimorebanner.com/resizer/v2/XJK5FCBMHFA6LENWVJWZET5D4Q.jpg?auth=c3a399caa2c4db3108d932b8820c42938748d4cc6aa75e877b9a46a50a296086&width=900&smart=true&quality=85",
            "top_comments": [
                "What’s that old saying about there being a special place in Hell? Probably applies here regardless of the amount involved.",
                ">…claiming that the two have not released to the (five) children any of the $54,000 collected through a GoFundMe campaign…\n\nThe money was also meant to go towards funeral expenses. After taxes and attorney fees, I can’t imagine that each child will be getting that much.",
                "Exploiting her daughter in death.",
                "This is why I don’t participate in these Go Fund Me campaigns.  They are ripe for fraud.  I don’t donate money at the register“round up” begging schemes.",
                "Go figure the scamming members of the family are trump supporters….",
                "Another great example of a GOP brained moron. Can't even help herself to profit after a death in the family.",
                "US citizens stealing money from a dead woman's kids.  It's always the citizens who can't be deported that cause the most trouble, am I right?",
                "Finally found a pair that deserves to be in Trump's El Salvador prison. The mother and the murderer.",
                "Love coed behind a paywall for me, anyone have a better link?",
                "Ah yes, when there is money, someone feels entitled to it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Peru suspends gold mining in north after massacre",
            "external_url": "https://www.dw.com/en/peru-suspends-gold-mining-in-north-after-massacre/a-72443414",
            "upvotes": 127,
            "date": "05/06/2025",
            "thumbnail": "https://static.dw.com/image/72443254_6.jpg",
            "top_comments": [
                "The suspension only applies to \"informal miners\". The licenced mining companies are unaffected. This suspension should have very little effect on overall gold production.",
                "I read things like this from the US and have to wonder what the real crime rate and frequency are in Mexico and South America. As for statistics, it’s hard for me to gauge as I’ve seen the many ways they’re convoluted and gamed to show more/less crime as it benefits people.\n\nBeing in the US, sure we have bad neighborhoods. We have bad areas in cities. But mostly you’re safe unless you’re engaging in illegal/illicit behavior. Most crimes are not committed against innocent bystanders. \n\nIs the same true for down there?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 1943,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Oh dear, how sad meme",
                "Not a good sign for the military parade",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "Keep up the work Ukraine ! ! !",
                "I came to Reddit for some p0rn inspo but no longer needed…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "AI-generated porn site Mr. Deepfakes shuts down after service provider pulls support",
            "external_url": "https://www.cbsnews.com/news/ai-generated-porn-site-mr-deepfakes-shuts-down/",
            "upvotes": 481,
            "date": "05/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/06/c156411b-333f-4edb-b3b5-e7099edf11d0/thumbnail/1200x630/3084baa6060ceb6f9499827feb0ebbcc/gettyimages-2192524685.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The shutdown comes just days after Congress passed the \"Take It Down Act,\" which makes it a federal crime to post nonconsensual sexual imagery, including explicit deepfakes. The legislation, backed by first lady Melania Trump, requires social media platforms and other websites to remove images and videos within 48 hours after a victim's request. \n\nWell, there's your answer. They're getting ahead of the law. Probably spent all the money on blackjack and hookers and didn't have any in reserve for lawyers. I wonder if the ACLU would have considered taking the case on Free Speech grounds.",
                "*The site allowed users to upload and view deepfake porn videos created using artificial intelligence. Forums on the site allowed users to buy and sell custom nonconsensual deepfake content, as well as discuss practices for making deepfakes.  The owner of the site remains unknown.* \n\nAll nonconsensual sex online should be taken down--no way in hell that it's \"free speech.\" In fact, quite the opposite. The fact the owner of this site is \"unknown,\" says it all.",
                "It's not actually AI right? It's deepfake tech which is worse, in a way, because it has more user input.",
                "How will Elon musk react",
                "OP really missed the chance to add the word \"out\" after \"pulls\" on this one."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Astronomers spot possible Planet Nine in data spanning 23 years",
            "external_url": "https://www.techspot.com/news/107802-astronomers-spot-possible-planet-nine-data-spanning-23.html",
            "upvotes": 595,
            "date": "05/06/2025",
            "thumbnail": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-05-image-18.jpg",
            "top_comments": [
                "Any millennials remember Planet X?",
                "It must be Pluto again :)",
                "If you zoom in on the planet it says MS 13. It’s the real deal. /s",
                "King Gizz gonna write a song about this",
                "Tariffs incoming in 3...2...",
                "Nibiru has returned and the Anunnaki will liberate us.\n\n\n...lol oh man it's been awhile",
                "> Planet Nine\n\nGus inconsolable",
                "[what Happened To Planet X?](https://youtu.be/wy8fi77t8zU?si=5HrlKc0wIzPQYRGu)",
                "I thought we found planet nine 95 years ago???",
                "I'd laugh if it's on this massive eliptical orbit and just comes around once every few million years to fuck shit up"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Rachel Morin's children sue grandmother over GoFundMe proceeds",
            "external_url": "https://www.thebaltimorebanner.com/community/criminal-justice/rachel-morin-patty-morin-lawsuit-gofundme-GIAJYPNWW5ESRPIHI5QGOAXTYI/",
            "upvotes": 767,
            "date": "05/06/2025",
            "thumbnail": "https://www.thebaltimorebanner.com/resizer/v2/XJK5FCBMHFA6LENWVJWZET5D4Q.jpg?auth=c3a399caa2c4db3108d932b8820c42938748d4cc6aa75e877b9a46a50a296086&width=900&smart=true&quality=85",
            "top_comments": [
                "What’s that old saying about there being a special place in Hell? Probably applies here regardless of the amount involved.",
                ">…claiming that the two have not released to the (five) children any of the $54,000 collected through a GoFundMe campaign…\n\nThe money was also meant to go towards funeral expenses. After taxes and attorney fees, I can’t imagine that each child will be getting that much.",
                "Exploiting her daughter in death.",
                "This is why I don’t participate in these Go Fund Me campaigns.  They are ripe for fraud.  I don’t donate money at the register“round up” begging schemes.",
                "Go figure the scamming members of the family are trump supporters….",
                "Another great example of a GOP brained moron. Can't even help herself to profit after a death in the family.",
                "US citizens stealing money from a dead woman's kids.  It's always the citizens who can't be deported that cause the most trouble, am I right?",
                "Finally found a pair that deserves to be in Trump's El Salvador prison. The mother and the murderer.",
                "Love coed behind a paywall for me, anyone have a better link?",
                "Ah yes, when there is money, someone feels entitled to it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump to continue Biden's court defense of abortion drug mifepristone",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-continue-bidens-court-defense-abortion-drug-mifepristone-2025-05-05/",
            "upvotes": 698,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s noteworthy that the Trump administration is continuing the legal defense of mifepristone access initiated under President Biden. Given Trump’s previous statements about not planning to ban or restrict the drug, this move aligns with his earlier position. However, with ongoing legal challenges from Republican-led states like Missouri, Kansas, and Idaho, the future of mifepristone’s accessibility remains uncertain.\n\n“Last year, the U.S. Supreme Court rejected a bid by anti-abortion groups and doctors to restrict access to the drug, finding that they lacked legal standing to challenge the FDA regulations.\n\nThose plaintiffs dropped their case after the high court ruling, but U.S. District Judge Matthew Kacsmaryk, a Trump appointee, allowed the states to intervene and continue to pursue the lawsuit.”",
                "This news literally does not signal any change in political stance on the future of medication abortion in the US, unlike what some people are saying. The bottom line is, Trump doesn’t need this lawsuit to succeed, since he can accomplish what the conservative plaintiff states want by simply directing his FDA to take steps to remove the drug. See Josh Hawley’s recent statements about a bogus new “study” of the drug, teeing up the pretext for RFK Jr to order new FDA reviews. Trump can also just order his DOJ to enforce the Comstock Act to prevent distribution of the pill. But abandoning the jurisdictional arguments in this case could create other issues—one of which is if the red states succeed in keeping this case alive, then it could result in precedent in the 5th circuit that could benefit blue state plaintiffs that want to bring future suits on the same standing and venue grounds. If anything, this filing shows Trump’s DOJ lawyers aren’t ready to completely ignore the judiciary and legal precedent, just yet anyway.",
                "I hear the sound of MAGA heads exploding…",
                "Hm, no this doesn't make sense. Let's wait another 36 hours.",
                "Democrats and Republicans, hand in hand, fighting for the American people at last...",
                "AidAcess - Advanced Provision. Get it while you still can.",
                "Bullshit, this man has no spine.  If the bill were brought to his desk to sign he’d be like “the people have spoken!”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Japan, China, South Korea, ASEAN enhance regional financial safety net",
            "external_url": "https://www.reuters.com/sustainability/boards-policy-regulation/japan-china-south-korea-asean-enhance-regional-financial-safety-net-2025-05-05/",
            "upvotes": 81,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*Japan, China, South Korea and the 10 ASEAN countries agreed to enhance their regional financial safety net by launching a new lending facility aimed at swiftly responding to crises caused by pandemics and natural disasters.*\n\nThis is called cooperation between regional governments--remember that?  While the U.S. punishes its closest neighbors with heavy tariffs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration offers $1,000 to undocumented immigrants to leave US | Trump administration | The Guardian",
            "external_url": "https://www.theguardian.com/us-news/2025/may/05/trump-1000-dollars-undocumented-immigrants",
            "upvotes": 241,
            "date": "05/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b30daa5349b6c0965fc1f79886c2e33aa98c58ea/418_315_5161_3097/master/5161.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=636f9dbba005324c803ca901864b25ae",
            "top_comments": [
                "Come on in! Just step into that blacked-out cargo van and get your check.",
                "Yes, I'll take \"Things that will never actually pay out\" for $100 please Alex. ",
                "Laughable, Trump never pays, hes fuckin lying.",
                "Money allocated for Americans? Nah fuck you, cut that shit.\n\nMoney to pay illegals to leave? A military parade? Tax cuts for the rich?  All day long baby, money printer goes brrrrr",
                "In other news, the weapons systems on the new deathstar are still inoperable, and the imperial fleet is definitely out of hyperspace range from the third moon of Endor.",
                "Isn't this incentivizing people to enter the country illegally so they can leave and collect $1000? Or better yet, just downloading the app and claim to have been in the US and left and collect $1000 without even stepping foot into the US",
                "If any of them fall for such an obvious scam I suppose they deserve to be deported (back to their country, not the El Salvador death camp).",
                "You get 1000 or a free taco salad at a Trump owned property (restrictions apply)",
                "I'm sure an administration that ignores a unanimous Supreme Court decision is totally not going to disappear you into an off off-site prison. /s",
                "That's some Looney Tunes, carrot under a propped up box, level bs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New York Times wins 4 Pulitzers, New Yorker 3; Washington Post wins for coverage of Trump shooting",
            "external_url": "https://apnews.com/article/pulitzer-prize-journalism-trump-2025-5da30d83667654d3663a7c432d91da4c",
            "upvotes": 0,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "NYT is spineless trash. Washington Post isn't much better. Lots of people still doing good work there, but awards in a time of MSM complicity in a fascist takeover of the US isn't very interesting.",
                "Coverage of a lethal PR stunt...",
                "I expect a 3 am toilet rant about how Trump was the bravest boy and should have those awards."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Messaging app used by Trump official suspends operations after reported hack",
            "external_url": "https://www.cnbc.com/2025/05/05/signal-telemessage-hack-trump-waltz.html",
            "upvotes": 452,
            "date": "05/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108141145-1746470406294-gettyimages-2212888293-ah706861_fao6jef6.jpeg?v=1746470424&w=1920&h=1080",
            "top_comments": [
                "2016 - Republicans lose their minds because Hilary Clinton had classified documents on a private email server.\n\n2025 - Republicans use publicly available app to chat about classified briefings, invite people without security clearances into said chat, and continue to use said app until it literally closes down due to hacking problem.",
                "Must be hard being a maga in the military, knowing how important classified information is while also supporting the buffoons openly fumbling national security like it were all a trolly joke.",
                "Incompetence and unforced errors seem to be the only things this administration is capable of. In this case their efforts to avoid accountability and archiving of their communications has lead to security breaches and wild leaks. \n\nPure incompetence.",
                "Oh no, what will they use now? Facebook? X?",
                "Ridiculous. The US is a joke. And these people are using this app to hide their communications which is in opposition of the records act and communication doctrine.",
                "And whatever they replace it with will become public and become target #1.",
                "It's idiots all the way down.",
                "So some intelligence service  has everything?",
                "Lets hope the hacker is on the side of good and not Project 2025."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 1938,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Oh dear, how sad meme",
                "Not a good sign for the military parade",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "Keep up the work Ukraine ! ! !",
                "I came to Reddit for some p0rn inspo but no longer needed…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration bars Harvard from new federal research funding",
            "external_url": "https://www.politico.com/news/2025/05/05/trump-bars-harvard-new-federal-research-funding-00330059",
            "upvotes": 3883,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yet another thing Harvard can sue him for and win.\n\n\nTrump is so bad at this villainous consolidation thing.",
                "Trump just showing the way Liberty University can be denied federal funding through their students.",
                "Just a waste of everyone's resources and time. Fuckwad and his crew have no intentions on actually doing anything that will help the average American",
                "12 Nobel Prize-winning scientists have active research programs at the Harvard Biological Labs.  Trump is attempting to cut off funding to some of the most important and impactful research on the planet, research that has and will save lives and make people's lives better, all because he's in a snit. \n\nAnd I say this as someone who did my PhD at a rival institution,  and devoutly believes that Harvard can gargle my testicles.  It's hard to argue with their results.",
                "Fascists doing fascist shit.",
                "He’s going to decimate America’s leadership in various areas of research over his bruised ego, and the Republican Congress won’t challenge him. This is a team effort.",
                "He's gonna hamstring the brightest minds in the United States from conducting research that may help us all some day? Great.",
                "He’s really not up to speed on what Universities can achieve, is he?\n\nManchester University isolating Graphene being just one example…",
                "Man, Donnie really hates America",
                "I wonder what a great America looks like to Trump. He guts NASA, the greatest space research institution in the world. He guts the NIH, the greatest medical research institution in the world. He guts the CDC, the greatest public health organization in the world. And now he targets Harvard, one of the greatest universities in the world. These are the things that, to me, make America \"great.\"\n\nDoes he think a great America is just a place with the most sweat shops in the world? He really seems to prefer America makes brake pads than revolutionary medical breakthroughs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "AI-generated porn site Mr. Deepfakes shuts down after service provider pulls support",
            "external_url": "https://www.cbsnews.com/news/ai-generated-porn-site-mr-deepfakes-shuts-down/",
            "upvotes": 478,
            "date": "05/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/06/c156411b-333f-4edb-b3b5-e7099edf11d0/thumbnail/1200x630/3084baa6060ceb6f9499827feb0ebbcc/gettyimages-2192524685.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The shutdown comes just days after Congress passed the \"Take It Down Act,\" which makes it a federal crime to post nonconsensual sexual imagery, including explicit deepfakes. The legislation, backed by first lady Melania Trump, requires social media platforms and other websites to remove images and videos within 48 hours after a victim's request. \n\nWell, there's your answer. They're getting ahead of the law. Probably spent all the money on blackjack and hookers and didn't have any in reserve for lawyers. I wonder if the ACLU would have considered taking the case on Free Speech grounds.",
                "*The site allowed users to upload and view deepfake porn videos created using artificial intelligence. Forums on the site allowed users to buy and sell custom nonconsensual deepfake content, as well as discuss practices for making deepfakes.  The owner of the site remains unknown.* \n\nAll nonconsensual sex online should be taken down--no way in hell that it's \"free speech.\" In fact, quite the opposite. The fact the owner of this site is \"unknown,\" says it all.",
                "It's not actually AI right? It's deepfake tech which is worse, in a way, because it has more user input.",
                "How will Elon musk react",
                "OP really missed the chance to add the word \"out\" after \"pulls\" on this one."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "OpenAI says nonprofit will retain control of company, bowing to outside pressure",
            "external_url": "https://www.cnbc.com/2025/05/05/openai-says-nonprofit-retain-control-of-company-bowing-to-pressure.html",
            "upvotes": 324,
            "date": "05/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108100801-17392942582025-02-11t171547z_1131262777_rc2fscaca6mb_rtrmadp_0_ai-summit.jpeg?v=1745356356&w=1920&h=1080",
            "top_comments": [
                "*Article Text by Hayden Field:*\n\nOpenAI has bowed to pressure from civic leaders and ex-employees, announcing in a blog post on Monday that its nonprofit would retain control of the company even as it restructures into a public benefit corporation.\n\nThe company, which is backed by Microsoft\n and was recently valued at $300 billion in a funding round led by SoftBank, said it made the decision after discussing the matter with the attorneys general of California and Delaware.\n\n“With the structure we’re contemplating, the not-for-profit will remain in control of OpenAI,” Bret Taylor, OpenAI’s board chairman, said in a video call with reporters. “We will be converting the limited liability company, that is a subsidiary of that nonprofit, to a public benefit corporation. By doing so, it will change the equity structure of that company so that employees, investors and the not-for-profit can own equity in that PBC.”\n\nTaylor said OpenAI had commissioned outside financial advisors to consult on the recapitalization. He declined to share how much of a stake the nonprofit would have in the company, though it will be a majority.\n\nOpenAI CEO Sam Altman said on the call that he was “very happy that the nonprofit and the PBC will have the same mission.” He said the board and stakeholders agreed with the decision.\n\nOpenAI is currently engulfed in a heated legal battle with Elon Musk, who co-founded the group as a nonprofit research lab in 2015. Musk is trying to keep OpenAI from converting into a for-profit company as he competes in the generative AI market with his own startup, xAI.\n\nAltman was asked about the dispute on Monday’s call.\n\n“We are obsessed with our mission and what it takes to fulfill that,” he said. “You all are obsessed with Elon, that’s your job — like, more power to you. But we are here to think about our mission and figure out how to enable that. And that mission has not changed.”\n\nLed by Altman, OpenAI has been commercializing products in recent years, most notably its viral ChatGPT chatbot, which was launched in late 2022. The company is still overseen by a nonprofit parent and has faced significant hurdles in its goal to restructure into a for-profit, due largely to Musk. A Musk-led group offered to buy OpenAI in February for $97.4 billion, a bid that was swiftly rejected. \n\nOpenAI’s hybrid structure has included a capped-profit limited partnership that was created in 2019. The original nonprofit is the controlling shareholder and would have been spun out as an independent entity if OpenAI had succeeded in its efforts. With that change no longer taking place, OpenAI’s investors receive convertible notes that will turn into equity.\n\nA group of ex-OpenAI employees, Nobel laureates, law professors and civil society organizations sent a letter last month to attorneys general in California and Delaware requesting that they halt the startup’s restructuring efforts out of safety concerns.\n\nIn the letter, which was delivered to OpenAI’s board, the group wrote that restructuring to a for-profit entity would “subvert OpenAI’s charitable purpose,” and “remove nonprofit control and eliminate critical governance safeguards.”\n\nPage Hedley, OpenAI’s former policy and ethics advisor — and lead organizer of Not For Private Gain, the group that wrote the letter — said in a statement that while it’s a positive step that the company is listening to concerns, “crucial questions remain.” One is around whether OpenAI’s commercial goals will “continue to be legally subordinate to its charitable mission,” and another is, “Who will own the technology that OpenAI develops?” said Hedley, who is lead organizer of the group that wrote the letter.\n\nTaylor said on the call with reporters that OpenAI’s current structure includes the nonprofit board and subsidiary, but that the nonprofit board is really the sole governing body. Taylor shared what he called a “technical detail” about the board makeup after restructuring\n\nThere will be a separate board for the public benefit corporation, but the nonprofit will appoint those directors, and “on day one, we plan on having the same directors for both,” Taylor said.\n\n“From a governance standpoint, the mission comes first, because the fiduciary duty of the not-for-profit board is exclusively to that mission,” Taylor said. He said that was one “one of the main pieces of feedback” from recent conversations.\n\nIn a letter to employees that was part of Monday’s blog post, Altman said that OpenAI remains committed to ensuring that artificial general intelligence (AGI), which rivals or surpasses human intelligence, “benefits all of humanity.” But a lot has changed in the nine years since he co-founded the lab, he said.\n\n“When we started OpenAI, we did not have a detailed sense for how we were going to accomplish our mission,” Altman wrote. “We could not contemplate the direct benefits of AI being used for medical advice, learning, productivity, and much more, or the needs for hundreds of billions of dollars of compute to train models and serve users.”\n\nAltman said OpenAI may still need to pull in trillions of dollars for the resources necessary to “make our services broadly available to all of humanity.”",
                "This is fantastic news, assuming there's something in the PBC's charter that it can't just change later. The question now is, does that mean they'll move toward going open source and focus on value adding to the product.",
                "Chat lives, for the time being...",
                "The only thing stopping OpenAI from becoming a for-profit are the billionaire vultures fighting over the money. We need to stop letting them act like they caved under the pressure of morality or public pressure. They’re playing the long game.",
                "Headline should read: “OpenAI not anywhere near profitable yet and promising hypergrowth is not an option right now”\n\nAlso think the Public Benefit Company designation is to open the doors for that sweet sweet government money."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump to continue Biden's court defense of abortion drug mifepristone",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-continue-bidens-court-defense-abortion-drug-mifepristone-2025-05-05/",
            "upvotes": 693,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It’s noteworthy that the Trump administration is continuing the legal defense of mifepristone access initiated under President Biden. Given Trump’s previous statements about not planning to ban or restrict the drug, this move aligns with his earlier position. However, with ongoing legal challenges from Republican-led states like Missouri, Kansas, and Idaho, the future of mifepristone’s accessibility remains uncertain.\n\n“Last year, the U.S. Supreme Court rejected a bid by anti-abortion groups and doctors to restrict access to the drug, finding that they lacked legal standing to challenge the FDA regulations.\n\nThose plaintiffs dropped their case after the high court ruling, but U.S. District Judge Matthew Kacsmaryk, a Trump appointee, allowed the states to intervene and continue to pursue the lawsuit.”",
                "This news literally does not signal any change in political stance on the future of medication abortion in the US, unlike what some people are saying. The bottom line is, Trump doesn’t need this lawsuit to succeed, since he can accomplish what the conservative plaintiff states want by simply directing his FDA to take steps to remove the drug. See Josh Hawley’s recent statements about a bogus new “study” of the drug, teeing up the pretext for RFK Jr to order new FDA reviews. Trump can also just order his DOJ to enforce the Comstock Act to prevent distribution of the pill. But abandoning the jurisdictional arguments in this case could create other issues—one of which is if the red states succeed in keeping this case alive, then it could result in precedent in the 5th circuit that could benefit blue state plaintiffs that want to bring future suits on the same standing and venue grounds. If anything, this filing shows Trump’s DOJ lawyers aren’t ready to completely ignore the judiciary and legal precedent, just yet anyway.",
                "I hear the sound of MAGA heads exploding…",
                "Hm, no this doesn't make sense. Let's wait another 36 hours.",
                "Democrats and Republicans, hand in hand, fighting for the American people at last...",
                "AidAcess - Advanced Provision. Get it while you still can.",
                "Bullshit, this man has no spine.  If the bill were brought to his desk to sign he’d be like “the people have spoken!”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Astronomers spot possible Planet Nine in data spanning 23 years",
            "external_url": "https://www.techspot.com/news/107802-astronomers-spot-possible-planet-nine-data-spanning-23.html",
            "upvotes": 599,
            "date": "05/06/2025",
            "thumbnail": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-05-image-18.jpg",
            "top_comments": [
                "Any millennials remember Planet X?",
                "It must be Pluto again :)",
                "If you zoom in on the planet it says MS 13. It’s the real deal. /s",
                "King Gizz gonna write a song about this",
                "Tariffs incoming in 3...2...",
                "Nibiru has returned and the Anunnaki will liberate us.\n\n\n...lol oh man it's been awhile",
                "> Planet Nine\n\nGus inconsolable",
                "[what Happened To Planet X?](https://youtu.be/wy8fi77t8zU?si=5HrlKc0wIzPQYRGu)",
                "I thought we found planet nine 95 years ago???",
                "I'd laugh if it's on this massive eliptical orbit and just comes around once every few million years to fuck shit up"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 7791,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                "I thought this was about ICE and am now disappointed.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "from the click through.. of course this wasnt the only incident with her\n\n>During protective order hearings over the course of several months, Ethridge testified about the March 2020 incident and several previous instances in which he said Stary beat the children, forced them to sleep outside on the porch and abandoned one of their daughters on the side of the road during a drive back from Colorado.\n\n>The kids called the police for help at least six times, and Child Protective Services was contacted at least five times, according to court records.\n\n>After interviews with the children, a Harris County district court judge went a step further — she issued a lifetime protective order. Stary would not be allowed to see or directly contact her kids indefinitely.\n\nthe kids calling for help 11 times.. FFS and what happened with abandoning one on the drive from colorado to texas. Sounds like she should have had kids taken away a long time ago.",
                "Obviously doesn't apply to citizens at the border. ",
                "Unless it's ICE doing it.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Rachel Morin's children sue grandmother over GoFundMe proceeds",
            "external_url": "https://www.thebaltimorebanner.com/community/criminal-justice/rachel-morin-patty-morin-lawsuit-gofundme-GIAJYPNWW5ESRPIHI5QGOAXTYI/",
            "upvotes": 768,
            "date": "05/06/2025",
            "thumbnail": "https://www.thebaltimorebanner.com/resizer/v2/XJK5FCBMHFA6LENWVJWZET5D4Q.jpg?auth=c3a399caa2c4db3108d932b8820c42938748d4cc6aa75e877b9a46a50a296086&width=900&smart=true&quality=85",
            "top_comments": [
                "What’s that old saying about there being a special place in Hell? Probably applies here regardless of the amount involved.",
                ">…claiming that the two have not released to the (five) children any of the $54,000 collected through a GoFundMe campaign…\n\nThe money was also meant to go towards funeral expenses. After taxes and attorney fees, I can’t imagine that each child will be getting that much.",
                "Exploiting her daughter in death.",
                "This is why I don’t participate in these Go Fund Me campaigns.  They are ripe for fraud.  I don’t donate money at the register“round up” begging schemes.",
                "Go figure the scamming members of the family are trump supporters….",
                "Another great example of a GOP brained moron. Can't even help herself to profit after a death in the family.",
                "US citizens stealing money from a dead woman's kids.  It's always the citizens who can't be deported that cause the most trouble, am I right?",
                "Finally found a pair that deserves to be in Trump's El Salvador prison. The mother and the murderer.",
                "Love coed behind a paywall for me, anyone have a better link?",
                "Ah yes, when there is money, someone feels entitled to it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Messaging app used by Trump official suspends operations after reported hack",
            "external_url": "https://www.cnbc.com/2025/05/05/signal-telemessage-hack-trump-waltz.html",
            "upvotes": 453,
            "date": "05/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108141145-1746470406294-gettyimages-2212888293-ah706861_fao6jef6.jpeg?v=1746470424&w=1920&h=1080",
            "top_comments": [
                "2016 - Republicans lose their minds because Hilary Clinton had classified documents on a private email server.\n\n2025 - Republicans use publicly available app to chat about classified briefings, invite people without security clearances into said chat, and continue to use said app until it literally closes down due to hacking problem.",
                "Must be hard being a maga in the military, knowing how important classified information is while also supporting the buffoons openly fumbling national security like it were all a trolly joke.",
                "Incompetence and unforced errors seem to be the only things this administration is capable of. In this case their efforts to avoid accountability and archiving of their communications has lead to security breaches and wild leaks. \n\nPure incompetence.",
                "Oh no, what will they use now? Facebook? X?",
                "Ridiculous. The US is a joke. And these people are using this app to hide their communications which is in opposition of the records act and communication doctrine.",
                "And whatever they replace it with will become public and become target #1.",
                "It's idiots all the way down.",
                "So some intelligence service  has everything?",
                "Lets hope the hacker is on the side of good and not Project 2025."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Dakota students weigh protest against university honors for homeland security chief Noem",
            "external_url": "https://apnews.com/article/dakota-state-university-noem-student-protest-dafc535890e1df72a0e27e6f4bbcdf35",
            "upvotes": 1561,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's a good article. Dakota State University is granting an honorary doctorate to Homeland Security Secretary Kristi Noem, and she is giving a commencement speech. Many students are opposed but are afraid to speak out (especially international students). Some students fear for their future job prospects if they openly protest.",
                "Deport Noem to El Salvador",
                "She killed a puppy because she didn't like how it was acting. What more can anyone say?",
                "What an honor. \n\nAn honorary degree from the 12th best college in the Dakotas.",
                "Happy to see she’s getting dogged and hounded.",
                "Students don't use your voices, use your bodies. When she says something reprehensible, pick up your chair and turn it around so your back will be toward her.",
                "Some more local coverage:\n\n(paywalls) https://www.argusleader.com/story/news/politics/2025/04/21/noem-offered-honorary-doctorate-dakota-state-university-over-student-faculty-wishes/83171671007/ \n\nhttps://www.argusleader.com/story/news/education/2025/04/29/petition-call-for-dakota-state-to-rescind-kristi-noem-honorary-degree-nomination/83342940007/\n\nDSU is one of the leading cybersecurity schools in the nation, and curiously, the university president was with Noem at a major conference last week talking about leading national cybersecurity efforts.",
                "Students should award her an honorary dog hunting trophy, a best dressed leo cosplay certificate, and a what-a-Trojan-covers honorarium.         \nDSU President and *noem/trump fluffer* José-Marie Griffiths can fuck right off.         \nThe fact that students are terrified of having their lives ruined if they protest tells you everything you need to know about the political state of our country.",
                "Oh look, DEI is okay after all",
                "Kristi Noem is the poster child of botched cosmetic surgeries. \n\nPlease call the puppy killer what she is."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/06/2025 04:11:41 UTC"
}