{
    "posts": [
        {
            "category": "HOT",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 41530,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/ssstwitter.com_1746820692383.00_00_52_27.still003.jpg?ve=1&tl=1",
            "top_comments": [
                "\"Witnesses said the arrest came after Baraka attempted to join a scheduled tour of the facility with three members of New Jersey’s congressional delegation, Reps. Robert Menendez, LaMonica McIver, and Bonnie Watson Coleman.\n\nWhen federal officials blocked his entry, a heated argument broke out, according to Viri Martinez, an activist with the New Jersey Alliance for Immigrant Justice. It continued even after Baraka returned to the public side of the gates.\n\n. . . \n\nIn video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not join a tour of the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who informed him: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property, they can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded Baraka and others on the public side of the gate. As protesters cried out, “Shame,” Baraka was dragged back through the security gate in handcuffs.\"",
                "Wow surprising, they are all masked.",
                "Alina Habba is a fucking US ATTORNEY?\n\nI guess I shouldn’t be surprised…\nWhat a fucking joke\n\nDemocrats need to aggressively oppose this gestapo shit AND offer a lawful and humane immigration solution",
                "Something’s going to give in this country. All this is already happening and Trump has only been in power 100 days and some change. Can’t even imagine how much worse things are going to get.",
                "What I don't understand is how ICE was able to arrest him. If this is criminal trespass, and it is committed by a citizen, then local police had jurisdiction.",
                "Gestapo doin Gestapo shit.",
                "It is not mistake. It is blatant racism. \n\n\"An ICE attorney in Dallas, James “Jim” Joseph Rodden, is under scrutiny following allegations that he operated a white supremacist account on X (formerly Twitter) under the handle u/GlomarResponder\".\n\n[https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/](https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/)",
                "ICE is a rogue paramilitary unit. Fuck ICE",
                "Arresting judges and elected officials. Don't overreact. Totally normal....in places like Nazi Germany.",
                "This administration is disgusting"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 5893,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "One thousand cases. In 2025. This should not be happening.",
                "I’d put money on it being underreported.",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "Man, if only we could find a way to prevent this from happening…",
                "It's awful, especially considering a nutjob is currently health secretary. \n\n\nIt's not better in Europe though. Sadly we also have a bunch of anti-vaxx nutjobs here. Here in Germany we had 555 cases of measles last year, and we only have a fourth of the US population. Even worse in the UK, there they had almost 3000 cases last year and they only have a fifth of the US population.",
                "Texas should be sued for this",
                "Unfortunately, it's a bad year for measles worldwide.\n\nhttps://www.cdc.gov/global-measles-vaccination/data-research/global-measles-outbreaks/index.html\n\n\nHopefully, the U.S. truce with the Houthis in Yemen will stabilize things enough there for them to get their measles situation better controlled. They're worse off than anyone right now.\n\nIndia and Pakistan are next on the list and the growing instability in those countries will surely not be making things better.\n\nOther reports.\n\nhttps://www.theguardian.com/world/2025/may/07/measles-cases-hit-six-year-high-in-south-korea-amid-outbreaks-across-south-east-asia\n\nThis article is from a tabloid but it looks, for the most part, legit.\n\nhttps://www.thesun.co.uk/health/34852628/holiday-hotspots-measles-disability-causing-summer/",
                "Those are rookie numbers, Ontario sits at 1,440 since October. Why we picked this contest to win, I'll never know."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "USDA, DOGE demand states hand over personal data about food stamp recipients",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration",
            "upvotes": 3006,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4903x2758+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F3c%2Fa416e52d42e999ab925de6861ce7%2Fgettyimages-2200077442.jpg",
            "top_comments": [
                "Just putting together lists of people we've claimed are drains on society and subhuman for years, nothing to worry about. Oh, also we're getting rid of Habeas Corpus. But don't worry, we're *totally* just doing that to immigrants, we promise.",
                "Putting together the lists of people who will be sent to the camps next year.",
                "> Including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR by an official who was not allowed to speak publicly.\n\nYeah, there's nothing alarming about that. /S Just like creating a database of autistic people is supposed to be a \"good\" thing. This administration is sorting people into categories it deems inferior.",
                "No. Go fuck yourselves you fascist assholes. There's only one good kind of fascist. I can't say which kind because Reddit will ban me since they're a bunch of sympathizers at this point.",
                "When you pass a trillion dollar military budget, cutting fractions of a percent makes no impact on debt reduction at all\n\nAll this does is bring pain and suffering to those that need help the most",
                "Hey DOGE.... Eat Shit!",
                "The legal response should simply say,  “Eat a dick.”",
                "You know a great way to save tax dollars concerning food stamps? Raise the minimum wage. Our taxes supplement Walmart profits. These corporations need to pay up.",
                "We are at the useless eaters point .\n\nGood luck neighbours.",
                "They're gonna be super fucking bummed when they realize the majority of people are white people that live in rural communities."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 3928,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "#SAVE USPS!\n\n\"Neither snow nor rain nor heat nor gloom of night stays these couriers from the swift completion of their appointed rounds\"\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster. Connecting America",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "Never forget the lesson that one single corrupt president can bring ruin to hundreds of years of progress. No election in a democratic country is meaningless. If you failed to vote last November, or if you voted for Trump, you are partially responsible for this.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 5621,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "\"Trump regime\" finally we see news outlets say it out loud. Now we need US major outlets to do the same. There's nothing \"administration\" about fascism.",
                "OMG time to arrest Trump",
                "Like that matters. The administration is ignoring the unanimous orders from the supreme court and you think they will listen to this? The Supreme Court needs to reverse their decision giving Trump immunity. They can revisit it at any time and they didn't follow the rule of law when they gave Trump immunity so you shouldn't have any issue fixing it.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "Every time I see trump talk, I think of the videos of Libyans dragging Muammar Gaddafi and beating him/shooting him to his death.",
                "> Immigration attorneys moved swiftly on Wednesday to block the effort, filing an emergency request in federal court. “Multiple credible sources report that flights are preparing to immediately depart the United States carrying class members for removal to Libya,” they wrote in a court filing.\n\nThey are trying to do the El Salvador thing all over again because not a single person has been held in contempt for that shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US grants asylum to 54 white Afrikaner South Africans, reports say",
            "external_url": "https://www.theguardian.com/world/2025/may/09/us-grants-asylum-to-54-white-afrikaner-south-africans",
            "upvotes": 12318,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1d1c99da998b4f59038b80221c689beeec347fd1/938_14_4562_3651/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=835b1fe072a557dab0a80aef9adaec52",
            "top_comments": [
                ">On Thursday, US officials were trying to arrange a charter flight to land at Dulles international airport, with commercial flights being assessed as an alternative, NPR reported, citing unnamed sources.\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nI just don't know where to begin. They may, in fact, face discrimination. Maybe even violence. And that's terrible. But rolling out the red carpet for these people while Donald Trump, all by himself, cancelled 100,000 asylum claims is beyond the pale.",
                "I thought they hated giving free handouts to migrants. If what the NY Times found is true then what's all this:\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nThe fucking hypocrisy.",
                "Meanwhile We abandoned Afghans, many of whom assisted the US military, who are literally IN HIDING?\n\nhttps://apnews.com/article/afghanistan-refugees-qatar-trump-immigration-refugee-ban-006240c5700fa7a95e4c2f2dcf66ad4f\n\n\nQuestion- How many Afrikaner/White South Africans immigrate to the US per year normally? \n\nThis reminds me of the case of the German family who applied for US asylum because they homeschooled and that is/was illegal in Germany.\n\nBTW- It usually takes years of waiting and vetting to be granted asylum. This. is. a. joke.",
                "💯  Elon Musk and Peter Thiel,  fucking nazis",
                "I didn't think we needed more obvious evidence that this country has been hijacked by white supremacists but here we are.",
                "This administration is a joke. These white people were handed asylum and are getting \"government handouts\" like housing. Yet POC who lived in \"shithole\" countries who were already in the process of being granted citizenship are sent to a concentration camp in El Salvador. Pathetic",
                "It was never about legal versus illegal immigration.\n\nIt has always been about racism.",
                "So let me get this straight, when it's POC looking for asylum in America its bad. But when it's white people, its good? And not to mention all the free shit their getting as well? Hypocrisy of the highest order.",
                "Literally can’t make this shit up 💀\n\n-asylum seekers from Mexico: NOO 😡 NOT CITIZENSS😠🤬GET OUT😤\n\n-white asylum seekers from South Africa: oh no! 😥 my sweet poor babies 😩 let me welcome you with open arms 🤗",
                "So to summerize:\n\nHe asked the Supreme Court to allow him to deport 100,000 South American asylum seekers who have already been living here while simultaneously bending over backward to allow 54 *white* afrikaners from South Africa to come reside in the United States? Absolutely no one can convince me that this administration isn't racist as fuck."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mayor Baraka of Newark, New Jersey, arrested at immigration detention center he has been protesting",
            "external_url": "https://apnews.com/article/immigration-protest-ice-newark-mayor-arrested-5a2b3fefd7da563c48d2f85831cf2194",
            "upvotes": 684,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not enter the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who said: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property. They can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded him and others on the public side. As protesters cried out, “Shame,” Baraka was dragged back through the gate in handcuffs.<\n\nHe did what they asked of him, they are trying to make an example of him because he has spoken out against the facility since its opening.",
                "It’s a coup. The fact that my mother doesn’t see it,… it honestly hurts at this point. Im a 52 yr old redneck guy.",
                "They are waiting for protesters to start showing up with guns so they can declare martial law. Pudgy-ass Nazis",
                "I saw “no one is above the law!” was trending, a few months after all the jan. 6 people were pardoned\n\nIf they charge him with trespassing, I don’t care, but that response was comical"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "India says it is committed to non-escalation if Pakistan reciprocates",
            "external_url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
            "upvotes": 391,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "ITT: Nationalist beefing \n\nI know it's not high traffic hours for Europe and morning for Americans when this was posted, so I understand why.\n\nI just think it's funny that everyone's posting known nationalist news sources to prove one side is \"wrong\", like this hasn't been escalated by both parties.",
                "recap:  \n🗓 **April 2**2 – A terrorist attack in Pahalgam kills 26 civilians; TRF claims responsibility, prompting Indian outrage and allegations against Pakistan.  \n🗓 **April 23–2**5 – India suspends the Indus Waters Treaty, expels Pakistani diplomats, and shuts down the Wagah-Attari border.  \n🗓 **May 7 (Morning**) – India launches **Operation Sindoo**r, striking 9 terrorist targets in Pakistan-administered areas with UAVs and Rafale jets.  \n🗓 **May 7 (Evening**) – Pakistan retaliates with artillery attacks on Poonch, Rajouri, and Uri sectors, killing 15 and injuring 40  \n🗓 **May 7–**8 – Pakistani drones and missiles hit 15 Indian military sites; India activates S-400 systems and intercepts most threats.  \n🗓 **May 8 (Night**) – India retaliates using Heron and Tapas drones, destroying Pakistani artillery sites and one radar.  \n🗓 **May 8–9 (Overnight**) – Pakistan violates Indian airspace with 300–400 drones across 36 locations; India intercepts many and strikes 4 Pakistani air defense sites.  \n🗓 **May 9 (Early Morning**) – A Pakistani UAV and commando raid near Jammu fails; multiple intruders are neutralized.  \n🗓 **May 9 (Night**) – Pakistan launches a widespread drone and missile assault on 26 Indian locations including Baramulla, Jammu, Pathankot, and Ferozpur.  \n🗓 **May 10 (Morning**) – Pakistan officially announces **Operation Bunyan ul Marsoo**s, launches further drones and a Fatah-II missile (intercepted near Sirsa).\n\nPak calls meeting of Nuclear team",
                "so India launches missiles into Pakistan and is now committed to non-escalation?",
                "Lol at India.  Firstly, they accuse Pakistan of their involvement in the attack without any neutral inquiry into the issue. Followed up with a few diplomatic manoeuvres, e.g., IWT. Then, they carried out military actions and ended up losing at least 2 aircraft's. And now, when Pakistan starts retaliating with its operation, India comes out with the realisation that it's time to stop escalating the issue. \n\n\nIt could have solved this. All of this, with just direct communication from the very start. Unnecessary loss of lives.\n\n\nEdit: Downvotes do not mean it is false. Hope you Indians open up to the reality of your war-mongering government a.k.a Modi.",
                "When your best air defense s400 get destroyed, you want to de escalate 😂",
                "This is not only about the religiously motivated Pahalgam attack, the culprits of the 26/11 attack, the indian parliament attack, all are hiding in Pakistan ( they're even living a good life, lol ), what Pakistan does about those, absolutely nothing, you can believe a \" blacklisted terrorist\" country"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Radar screens at Newark airport went black again overnight",
            "external_url": "https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395",
            "upvotes": 4755,
            "date": "05/09/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/87c6775c-47c9-4a16-b499-2c93dab9fdaf/newark-gty-jef-250509_1746799790340_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "at this point, I'm waiting to wake up to the headline of a massive tragedy happening at the airport. seems like things are getting dire if there is pressure getting pushed to get this fixed; as it should be. I hope someone get's their head out of their ass and gets this prioritized a week ago.",
                "Statistics say its probably ok, but I still just changed my upcoming flight so I don't have to connect through Newark.",
                "> Transportation Secretary Sean Duffy said he hopes to have the system built in the next three to four years.\n  \nThat's the timeframe for fixing this problem?",
                "Huh, I remember the last president wanting to spend billions on reinvesting on FAA infrastructure. It even got bipartisan support... Odd they can't just use the money that is already promised to help with this",
                "\n\nThe Daily had a good episode on this a few days ago. Boils down to latency and lack of backup when their systems do go down and how easy it is for someone to just unplug these systems with no oversight. These systems are also old and need to be upgraded. Newark ATC employees were based in Long Island but FAA moved them to Philadelphia but kept the transmissions still going through Long Island and relaying to Philadelphia",
                "I'm flying out of Newark twice in the next two weeks. Can't wait to roll the dice with my life lol.",
                "Just a preview of the problems we can expect when you take a wrecking ball to government with minimal to no planning. Who cares about infrastructure when you can have tax cuts.",
                "Republicans have blocked funding for this for 20 years.",
                "Time to blame the previous administration for requesting **more** staff and modernization updates to prevent this happening.  Clearly that's the issue, not firing air traffic controllers and staff that keeps things running.",
                "Natural result of deferring upkeep of infrastructure maintenance in the chase of budget cuts.  Expect more of this as long as the conservative/libertarian ideology is making decisions.\n\nFifty years of the destructive meme that government needs to get out of the way of free enterprise.  You trust that your planes will fly, food & drugs will be safe, etc because of the regulatory state."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Holocaust survivor Margot Friedländer dies at 103",
            "external_url": "https://www.dw.com/en/holocaust-survivor-margot-friedl%C3%A4nder-dies-at-103/a-72496380",
            "upvotes": 1784,
            "date": "05/09/2025",
            "thumbnail": "https://static.dw.com/image/72496843_6.jpg",
            "top_comments": [
                "“There is no Christian blood, there is no Muslim blood, there is no Jewish blood, there is only human blood.”\n\n - Margot Friedlander",
                "May her memory be a blessing.",
                "\"Friedländer died in Berlin, the same day she was expected to receive the German Order of Merit\".\n\nwild.",
                "Another voice is silent. Let's not forget what she had to say.",
                "'Everybody knew about it, and they looked away'",
                "May she rest in peace",
                "I often think about being a German in Germany during the Nazi regime. I would love to think that I would not look the other way and I would protect my Jewish friends and neighbors and then I think about losing my family as a result. It’s really hard to place blame on people who did what it took to survive. RIP, Margot.",
                "May her memory be a blessing.",
                "May she rest peacefully. She survived a horrific time that is emerging once again.",
                "I’m sorry she didn’t live to see trump thrown out of office. I hope the rest of us do very soon.  She was an important voice in these dark times."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 7,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Terror group supporters posted on Tiktok from site targeted in Indian Airstrikes",
            "external_url": "https://news.sky.com/story/terror-group-supporters-posted-on-tiktok-from-site-targeted-in-indian-airstrikes-13363716",
            "upvotes": 60,
            "date": "05/10/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-india-pakistan-teaser_6910817.jpg?20250509085412",
            "top_comments": [
                "to those who are incapable of going to article  and reading \n\n>The caption of the video reads 'we are little soldiers, and we fight the non-believers'. It uses the hashtag '313'.\n\n>The caption uses the hashtag #جہاد313, which translates to '313' jihad.\n\n>**'313' appears to refer to the 313 Brigade, a proscribed terror organisation in Pakistan.**\n\n>In a TikTok video posted to the Google page for Markaz Taiba Mosque in Muridke, a man can be seen walking along the street with a gun.",
                "It's always a nice reminder that brown people are just as awful as white people.\n\nSee= this entire post.",
                "Great! Their “civilians” have made these videos. Great, can’t blame it on media now. \n\nProof’s here, Pakistan",
                "I'm starting to suspect Pakistan may not be as anti-terror as they claim.",
                "The audacity!\nHere is your proof, Pakistan! Here are your “civilians” carrying guns and declaration to fight infidels.",
                "Man these are the same kinds of articles we had in the early 2000's trying to convince us in the states war in the middle east was justified.",
                "We all know 'Pakistan is a rough terrorist blacklisted nation/organisation '",
                "Seems like the same hoax as 'weapons of mass destruction'",
                "lol. Imagine going to war over a TikTok video.",
                "That would be an awesome (and highly profitable) TikTok video one from POV of terrorist and the other of his cave being vaporized from the air. It is better to chose a life of medicine and engineering as others do, and you live longer. Being a hunted military target is not an honorable life. But we can make social media millions on his death. Making money on others bad choices is the way to success. Reminds me of this: \n\nhttps://youtu.be/a1QyddpXeqg?si=S0cKw7sheqFXufDH"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India says it is committed to non-escalation if Pakistan reciprocates",
            "external_url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
            "upvotes": 395,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "ITT: Nationalist beefing \n\nI know it's not high traffic hours for Europe and morning for Americans when this was posted, so I understand why.\n\nI just think it's funny that everyone's posting known nationalist news sources to prove one side is \"wrong\", like this hasn't been escalated by both parties.",
                "recap:  \n🗓 **April 2**2 – A terrorist attack in Pahalgam kills 26 civilians; TRF claims responsibility, prompting Indian outrage and allegations against Pakistan.  \n🗓 **April 23–2**5 – India suspends the Indus Waters Treaty, expels Pakistani diplomats, and shuts down the Wagah-Attari border.  \n🗓 **May 7 (Morning**) – India launches **Operation Sindoo**r, striking 9 terrorist targets in Pakistan-administered areas with UAVs and Rafale jets.  \n🗓 **May 7 (Evening**) – Pakistan retaliates with artillery attacks on Poonch, Rajouri, and Uri sectors, killing 15 and injuring 40  \n🗓 **May 7–**8 – Pakistani drones and missiles hit 15 Indian military sites; India activates S-400 systems and intercepts most threats.  \n🗓 **May 8 (Night**) – India retaliates using Heron and Tapas drones, destroying Pakistani artillery sites and one radar.  \n🗓 **May 8–9 (Overnight**) – Pakistan violates Indian airspace with 300–400 drones across 36 locations; India intercepts many and strikes 4 Pakistani air defense sites.  \n🗓 **May 9 (Early Morning**) – A Pakistani UAV and commando raid near Jammu fails; multiple intruders are neutralized.  \n🗓 **May 9 (Night**) – Pakistan launches a widespread drone and missile assault on 26 Indian locations including Baramulla, Jammu, Pathankot, and Ferozpur.  \n🗓 **May 10 (Morning**) – Pakistan officially announces **Operation Bunyan ul Marsoo**s, launches further drones and a Fatah-II missile (intercepted near Sirsa).\n\nPak calls meeting of Nuclear team",
                "so India launches missiles into Pakistan and is now committed to non-escalation?",
                "Lol at India.  Firstly, they accuse Pakistan of their involvement in the attack without any neutral inquiry into the issue. Followed up with a few diplomatic manoeuvres, e.g., IWT. Then, they carried out military actions and ended up losing at least 2 aircraft's. And now, when Pakistan starts retaliating with its operation, India comes out with the realisation that it's time to stop escalating the issue. \n\n\nIt could have solved this. All of this, with just direct communication from the very start. Unnecessary loss of lives.\n\n\nEdit: Downvotes do not mean it is false. Hope you Indians open up to the reality of your war-mongering government a.k.a Modi.",
                "When your best air defense s400 get destroyed, you want to de escalate 😂",
                "This is not only about the religiously motivated Pahalgam attack, the culprits of the 26/11 attack, the indian parliament attack, all are hiding in Pakistan ( they're even living a good life, lol ), what Pakistan does about those, absolutely nothing, you can believe a \" blacklisted terrorist\" country"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mayor Baraka of Newark, New Jersey, arrested at immigration detention center he has been protesting",
            "external_url": "https://apnews.com/article/immigration-protest-ice-newark-mayor-arrested-5a2b3fefd7da563c48d2f85831cf2194",
            "upvotes": 682,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not enter the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who said: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property. They can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded him and others on the public side. As protesters cried out, “Shame,” Baraka was dragged back through the gate in handcuffs.<\n\nHe did what they asked of him, they are trying to make an example of him because he has spoken out against the facility since its opening.",
                "It’s a coup. The fact that my mother doesn’t see it,… it honestly hurts at this point. Im a 52 yr old redneck guy.",
                "They are waiting for protesters to start showing up with guns so they can declare martial law. Pudgy-ass Nazis",
                "I saw “no one is above the law!” was trending, a few months after all the jan. 6 people were pardoned\n\nIf they charge him with trespassing, I don’t care, but that response was comical"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A failed Soviet-era spacecraft that aimed for Venus is expected to crash back to Earth tonight",
            "external_url": "https://www.cnn.com/2025/05/09/science/soviet-spacecraft-crash-kosmos-482",
            "upvotes": 585,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/pia00271-large.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Shoot for Venus. If you miss you’ll land among the, um, Earth. ",
                "I hope it doesn’t crash through my roof!",
                "*Article Excerpt from Jackie Wattles (CNN):*\n\nA Soviet-era spacecraft that was designed to make a soft landing on Venus — but instead remained trapped in Earth orbit for decades — is slated to fall from the sky Friday night or early Saturday, according to the latest estimates from experts.\n\nThe object, referred to as Cosmos 482 or Kosmos 482, is believed to be a capsule launched by the Soviet Union in March 1972 that failed en route to a transfer orbit that would have taken it to Venus to study its environment.\n\nIn the decades since, the object has circled Earth aimlessly as it was slowly dragged back toward home.\n\nAstronomers and space traffic experts have had their eyes on the object for years now as its orbital path has slowly reached lower and lower altitudes, a result of the subtle atmospheric drag that exists even hundreds of miles away from Earth.\n\nThe cylinder-shaped craft, which is about 3 feet (1 meter) in diameter, is now predicted to crash back to Earth overnight. Cosmos 482 is on track to hit the ground or ocean roughly between 10 p.m. and 6:30 a.m. ET, according to four analyses of the object from various institutions, including the European Space Agency and the federally funded US research group Aerospace Corporation.\n\nThat guidance is still in line with predictions issued by space traffic experts earlier this week. The estimated time frame of the vehicle’s final descent will narrow as the event approaches.\n\nBecause of the sheer complexity of spaceflight and unpredictable factors, such as space weather, it can be extremely difficult to pinpoint exactly when or where an object will fall out of orbit.\n\nThis particular piece of space junk likely won’t pose a risk to people on the ground.\n\n“This object was designed to survive reentering Venus, so there’s fair odds that it’ll survive coming back (to Earth) in one piece,” said Marlon Sorge, a space debris expert with The Aerospace Corporation, on Monday. “That actually makes the risk less … because it would stay intact.”",
                "from the article:\n“What to do if you spot debris:\n\nWhile a landing on dry ground is unlikely, it’s not impossible. The Cosmos 482 object’s trajectory shows it could hit anywhere within a broad swath of land that includes “the whole of Africa, South America, Australia, the USA, parts of Canada, parts of Europe, and parts of Asia,” said Marco Langbroek, a lecturer and space traffic expert at Delft Technical University in the Netherlands, via email.\n\nSorge emphasized that if Cosmos 482 hits the ground after its final descent tonight, onlookers are advised to keep their distance. The aged spacecraft could leak dangerous fuels or pose other risks to people and property.\n“Contact the authorities,” Sorge urged. “Please don’t mess with it.”",
                "Isn't this what caused the zombie outbreak in the original \"Night of the Living Dead?\"",
                "So in summary a 3 foot long piece of invincible space debris traveling at terminal velocity will land somewhere in “the whole of Africa, South America, Australia, the USA, parts of Canada, parts of Europe, and parts of Asia” or the ocean. Cool, cool. That is completely unconcerning except for the random ball of death that could kill anyone or no one sometime in the next day or so.",
                ">This particular piece of space junk likely won’t pose a risk to people on the ground\n\nLike, rationally I get that the odds of it hitting anything of significance are low, but on the off chance that some poor bastard gets nailed by a 3-foot metal dildo going Mach fuck…",
                "God it would be infinitely funny if it hit Putin.",
                "I think I remember Taco Bell putting a target out in the Pacific one of these times. I believe if the satellite hit the target, everyone in the US would get a free taco. \n\n\nIt didn't hit. The odds were astronomical.",
                "I'm totally going to mess with it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India intercepts Pakistan drone strikes in Jammu, complete blackout in several Indian cities",
            "external_url": "https://thesouthfirst.com/news/india-intercepts-pakistan-drone-strikes-in-jammu-complete-blackout-in-several-indian-cities/",
            "upvotes": 15,
            "date": "05/09/2025",
            "thumbnail": "https://s3.ap-south-1.amazonaws.com/media.thesouthfirst.com/wp-content/uploads/2025/05/Missile.jpg",
            "top_comments": [
                "Already tired of this conflict and how people seem to think any side is justified."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pakistan Army's spokesman claims India fired ballistic missiles that fell into Indian territory",
            "external_url": "https://www.reuters.com/world/asia-pacific/pakistan-armys-spokesman-claims-india-fired-ballistic-missiles-that-fell-into-2025-05-09/",
            "upvotes": 48,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " 6 airbases destroyed at Pakistan side and these clawns running fake news here",
                "And another cycle of their lies and propaganda begins!",
                "Pakistan claims uyghur muslims are treated well in China. They cant stand with their own, how can anyone trust whatever they say?",
                "Already tired of this conflict and how people seem to think any side is justified.",
                "***Way too many Westerners are sleeping on this one.***\n\nThe animosity here is both ***religious & national***.  It's a straight up holy war for both sides in addition to being a massive game of tug-of-war over issues like Kashmir that date back to the partitioning of India and frankly long before that.  Throw in the nuclear angle and you've got a debacle that could inflict damage on a scale not seen since WWII.  \n  \n  \n....and the potential for China, US & Russia to get involved is not exactly lost here especially given China's proximity to both.\n\n  \nThe only good news is there's far, far more to lose for both sides than there is to gain and the relative effectiveness of asymmetric warfare as being fought in Ukraine demonstrated that even a large scale mechanized invasion by either nation is going to be a fools errand in the long run with high fatalities  and few defenses against small short-distance drones",
                "[deleted]",
                "Given enough time, it's inevitable that nuclear weapons are again used in warfare.   This of course would be a horrible event.  However, in a pragmatic sense, a silver lining would be that this horror would be like a dash of cold water to the face of other states considering their own use of nukes.  To be perfectly blunt, a few used in a conflict between second-tier powers is preferable to a MAD scenario between two superpowers.  \n\nIn other words, nuclear strikes between India and Pakistan could be an event that ends the world, or it could be an event that saves it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Biden created Chuckwalla monument in the California desert. A lawsuit aims to undo it",
            "external_url": "https://www.latimes.com/environment/story/2025-05-09/lawsuit-to-undo-chuckwalla-national-monument-california-desert-biden",
            "upvotes": 765,
            "date": "05/10/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/e72a251/2147483647/strip/true/crop/3000x1575+0+338/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F65%2Fec%2Ff5490b7c47b9b2e026b52808308f%2F1489478-me-0107-chuckwalla-3000-rcg.jpg",
            "top_comments": [
                "I hope this stupid lawsuit is thrown out or better they lose the lawsuit. Wouldn't want a important piece of land being destroyed by greedy corporations and miners.",
                ">A lawsuit filed in federal court is seeking to undo the 624,000-acre Chuckwalla National Monument in the Southern California desert, claiming President Biden overstepped his authority by setting aside such a vast swath of land days before leaving office.\n\n>Plaintiffs represented by an Austin, Texas-based conservative think tank claim Biden abused the Antiquities Act, a 1906 law that allows presidents to create national monuments. The suit brought against the Interior Department highlights that the law mandates monuments be limited to the “smallest area compatible with proper care and management of the objects to be protected.”\n\n>“If you look at the history, it was supposed to be limited to, let’s say, 100 acres, maybe 1,000 acres. But it certainly wasn’t the kind of expansion that we’ve seen in recent years,” said Matt Miller, senior attorney for the Texas Public Policy Foundation, which filed the suit.\n\n>Supporters of Chuckwalla, which sits south of Joshua Tree National Park, point out that the law has long been used by presidents to protect large land masses — including the designation of the Grand Canyon by Theodore Roosevelt in 1908. On Jan. 14,[ Biden created Chuckwall](https://www.latimes.com/environment/story/2025-01-14/biden-creates-two-national-monuments-in-california-chuckwalla-sattitla-highlands)a to safeguard land sacred to tribes as well as important wildlife habitat and military sites.\n\n>On May 1, the foundation [filed the suit](https://www.texaspolicy.com/wp-content/uploads/2025/05/Chuckwalla-Case-Complaint-Torongo-v.-Burgum.pdf) against the U.S. Department of the Interior in U.S. District Court for the Eastern District of Michigan on behalf of a resident of the state with mining claims in the footprint of the monument and the BlueRibbon Coalition, a nonprofit that advocates for recreation access.\n\n>According to the lawsuit, Daniel Torongo, whose family began mining in the region in 1978, and members of the BlueRibbon Coalition, will be prevented from using the land in ways they previously enjoyed because of the monument designation.\n\n>Torongo, of Brighton, Mich., will face onerous restrictions to maintaining his claim and will not be able to expand it as he planned, potentially threatening his retirement plan to spend more time mining there with his family, according to the suit.\n\n>“Although Mr. Torongo and his family have invested time and money in acquiring claims, equipment and relevant knowledge, the dream of expanding their operation beyond its current size is no longer possible,” the suit states.\n\n>BlueRibbon Coalition members, meanwhile, which include off-roaders and dirt bikers, fear they’ll also face restrictions because of the “goal of maintaining the undeveloped character of the land,” according to the suit.\n\n>The Interior Department hasn’t yet responded to the suit and spokeswoman J. Elizabeth Peace said department policy is not to comment on litigation.\n\nApparently the miners, off-roaders and dirtbikers feel the designation is infringing on their enjoyment of these beautiful lands, and they have people with deep pockets working to overturn it.",
                "I hope they fucking cry more. “Messing with his retirement plans” go fuck yourself clownshoes asswipe.",
                "Conservatives: why we can’t have nice things.",
                "Biden derangement syndrome?",
                "Biden created prosperity out of a global pandemic and trump undid it, why not also a dumb monument?",
                "Call out those by name in this ‘think tank’ shame them, protest at their homes and places of work.",
                "The guy that mines in area can still mine, he’s just upset he can’t acquire more land to mine 🤦🏻‍♂️",
                "anyone who identifies themselves as a conservative, i hope only negativity comes to you. nothing but sadness and pain.",
                "Chuckwalla isn't even on the top 10 list of largest national monuments, with legal precedent going back over a century."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "USDA, DOGE demand states hand over personal data about food stamp recipients",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration",
            "upvotes": 3014,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4903x2758+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F3c%2Fa416e52d42e999ab925de6861ce7%2Fgettyimages-2200077442.jpg",
            "top_comments": [
                "Just putting together lists of people we've claimed are drains on society and subhuman for years, nothing to worry about. Oh, also we're getting rid of Habeas Corpus. But don't worry, we're *totally* just doing that to immigrants, we promise.",
                "Putting together the lists of people who will be sent to the camps next year.",
                "> Including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR by an official who was not allowed to speak publicly.\n\nYeah, there's nothing alarming about that. /S Just like creating a database of autistic people is supposed to be a \"good\" thing. This administration is sorting people into categories it deems inferior.",
                "No. Go fuck yourselves you fascist assholes. There's only one good kind of fascist. I can't say which kind because Reddit will ban me since they're a bunch of sympathizers at this point.",
                "When you pass a trillion dollar military budget, cutting fractions of a percent makes no impact on debt reduction at all\n\nAll this does is bring pain and suffering to those that need help the most",
                "Hey DOGE.... Eat Shit!",
                "The legal response should simply say,  “Eat a dick.”",
                "You know a great way to save tax dollars concerning food stamps? Raise the minimum wage. Our taxes supplement Walmart profits. These corporations need to pay up.",
                "We are at the useless eaters point .\n\nGood luck neighbours.",
                "They're gonna be super fucking bummed when they realize the majority of people are white people that live in rural communities."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Air traffic controllers lose radar and radio contact with planes approaching and departing Newark for 90 seconds – again",
            "external_url": "https://edition.cnn.com/us/controllers-handling-flights-around-newark-liberty-international-airport-experience-another-outage",
            "upvotes": 391,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213276640-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "In a recent interview with an ATC at Newark, the controller warned the public “not to fly into Newark” whatever you do. So… Just keep that in mind people.",
                "Thank you to everyone who voted for Trump or sat out.",
                "Does this make 3 or 4 blackouts? Legit question as I could have sworn I saw a pot about another short blackout yesterday.",
                "They should probably hire some people...",
                "It's only a matter of time before we have yet another disaster in the air."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mayor Baraka of Newark, New Jersey, arrested at immigration detention center he has been protesting",
            "external_url": "https://apnews.com/article/immigration-protest-ice-newark-mayor-arrested-5a2b3fefd7da563c48d2f85831cf2194",
            "upvotes": 678,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not enter the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who said: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property. They can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded him and others on the public side. As protesters cried out, “Shame,” Baraka was dragged back through the gate in handcuffs.<\n\nHe did what they asked of him, they are trying to make an example of him because he has spoken out against the facility since its opening.",
                "It’s a coup. The fact that my mother doesn’t see it,… it honestly hurts at this point. Im a 52 yr old redneck guy.",
                "They are waiting for protesters to start showing up with guns so they can declare martial law. Pudgy-ass Nazis",
                "I saw “no one is above the law!” was trending, a few months after all the jan. 6 people were pardoned\n\nIf they charge him with trespassing, I don’t care, but that response was comical"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "India says it is committed to non-escalation if Pakistan reciprocates",
            "external_url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
            "upvotes": 388,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "ITT: Nationalist beefing \n\nI know it's not high traffic hours for Europe and morning for Americans when this was posted, so I understand why.\n\nI just think it's funny that everyone's posting known nationalist news sources to prove one side is \"wrong\", like this hasn't been escalated by both parties.",
                "recap:  \n🗓 **April 2**2 – A terrorist attack in Pahalgam kills 26 civilians; TRF claims responsibility, prompting Indian outrage and allegations against Pakistan.  \n🗓 **April 23–2**5 – India suspends the Indus Waters Treaty, expels Pakistani diplomats, and shuts down the Wagah-Attari border.  \n🗓 **May 7 (Morning**) – India launches **Operation Sindoo**r, striking 9 terrorist targets in Pakistan-administered areas with UAVs and Rafale jets.  \n🗓 **May 7 (Evening**) – Pakistan retaliates with artillery attacks on Poonch, Rajouri, and Uri sectors, killing 15 and injuring 40  \n🗓 **May 7–**8 – Pakistani drones and missiles hit 15 Indian military sites; India activates S-400 systems and intercepts most threats.  \n🗓 **May 8 (Night**) – India retaliates using Heron and Tapas drones, destroying Pakistani artillery sites and one radar.  \n🗓 **May 8–9 (Overnight**) – Pakistan violates Indian airspace with 300–400 drones across 36 locations; India intercepts many and strikes 4 Pakistani air defense sites.  \n🗓 **May 9 (Early Morning**) – A Pakistani UAV and commando raid near Jammu fails; multiple intruders are neutralized.  \n🗓 **May 9 (Night**) – Pakistan launches a widespread drone and missile assault on 26 Indian locations including Baramulla, Jammu, Pathankot, and Ferozpur.  \n🗓 **May 10 (Morning**) – Pakistan officially announces **Operation Bunyan ul Marsoo**s, launches further drones and a Fatah-II missile (intercepted near Sirsa).\n\nPak calls meeting of Nuclear team",
                "so India launches missiles into Pakistan and is now committed to non-escalation?",
                "Lol at India.  Firstly, they accuse Pakistan of their involvement in the attack without any neutral inquiry into the issue. Followed up with a few diplomatic manoeuvres, e.g., IWT. Then, they carried out military actions and ended up losing at least 2 aircraft's. And now, when Pakistan starts retaliating with its operation, India comes out with the realisation that it's time to stop escalating the issue. \n\n\nIt could have solved this. All of this, with just direct communication from the very start. Unnecessary loss of lives.\n\n\nEdit: Downvotes do not mean it is false. Hope you Indians open up to the reality of your war-mongering government a.k.a Modi.",
                "When your best air defense s400 get destroyed, you want to de escalate 😂",
                "This is not only about the religiously motivated Pahalgam attack, the culprits of the 26/11 attack, the indian parliament attack, all are hiding in Pakistan ( they're even living a good life, lol ), what Pakistan does about those, absolutely nothing, you can believe a \" blacklisted terrorist\" country"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "A failed Soviet-era spacecraft that aimed for Venus is expected to crash back to Earth tonight",
            "external_url": "https://www.cnn.com/2025/05/09/science/soviet-spacecraft-crash-kosmos-482",
            "upvotes": 581,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/pia00271-large.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Shoot for Venus. If you miss you’ll land among the, um, Earth. ",
                "I hope it doesn’t crash through my roof!",
                "*Article Excerpt from Jackie Wattles (CNN):*\n\nA Soviet-era spacecraft that was designed to make a soft landing on Venus — but instead remained trapped in Earth orbit for decades — is slated to fall from the sky Friday night or early Saturday, according to the latest estimates from experts.\n\nThe object, referred to as Cosmos 482 or Kosmos 482, is believed to be a capsule launched by the Soviet Union in March 1972 that failed en route to a transfer orbit that would have taken it to Venus to study its environment.\n\nIn the decades since, the object has circled Earth aimlessly as it was slowly dragged back toward home.\n\nAstronomers and space traffic experts have had their eyes on the object for years now as its orbital path has slowly reached lower and lower altitudes, a result of the subtle atmospheric drag that exists even hundreds of miles away from Earth.\n\nThe cylinder-shaped craft, which is about 3 feet (1 meter) in diameter, is now predicted to crash back to Earth overnight. Cosmos 482 is on track to hit the ground or ocean roughly between 10 p.m. and 6:30 a.m. ET, according to four analyses of the object from various institutions, including the European Space Agency and the federally funded US research group Aerospace Corporation.\n\nThat guidance is still in line with predictions issued by space traffic experts earlier this week. The estimated time frame of the vehicle’s final descent will narrow as the event approaches.\n\nBecause of the sheer complexity of spaceflight and unpredictable factors, such as space weather, it can be extremely difficult to pinpoint exactly when or where an object will fall out of orbit.\n\nThis particular piece of space junk likely won’t pose a risk to people on the ground.\n\n“This object was designed to survive reentering Venus, so there’s fair odds that it’ll survive coming back (to Earth) in one piece,” said Marlon Sorge, a space debris expert with The Aerospace Corporation, on Monday. “That actually makes the risk less … because it would stay intact.”",
                "from the article:\n“What to do if you spot debris:\n\nWhile a landing on dry ground is unlikely, it’s not impossible. The Cosmos 482 object’s trajectory shows it could hit anywhere within a broad swath of land that includes “the whole of Africa, South America, Australia, the USA, parts of Canada, parts of Europe, and parts of Asia,” said Marco Langbroek, a lecturer and space traffic expert at Delft Technical University in the Netherlands, via email.\n\nSorge emphasized that if Cosmos 482 hits the ground after its final descent tonight, onlookers are advised to keep their distance. The aged spacecraft could leak dangerous fuels or pose other risks to people and property.\n“Contact the authorities,” Sorge urged. “Please don’t mess with it.”",
                "Isn't this what caused the zombie outbreak in the original \"Night of the Living Dead?\"",
                "So in summary a 3 foot long piece of invincible space debris traveling at terminal velocity will land somewhere in “the whole of Africa, South America, Australia, the USA, parts of Canada, parts of Europe, and parts of Asia” or the ocean. Cool, cool. That is completely unconcerning except for the random ball of death that could kill anyone or no one sometime in the next day or so.",
                ">This particular piece of space junk likely won’t pose a risk to people on the ground\n\nLike, rationally I get that the odds of it hitting anything of significance are low, but on the off chance that some poor bastard gets nailed by a 3-foot metal dildo going Mach fuck…",
                "God it would be infinitely funny if it hit Putin.",
                "I think I remember Taco Bell putting a target out in the Pacific one of these times. I believe if the satellite hit the target, everyone in the US would get a free taco. \n\n\nIt didn't hit. The odds were astronomical.",
                "I'm totally going to mess with it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Biden created Chuckwalla monument in the California desert. A lawsuit aims to undo it",
            "external_url": "https://www.latimes.com/environment/story/2025-05-09/lawsuit-to-undo-chuckwalla-national-monument-california-desert-biden",
            "upvotes": 774,
            "date": "05/10/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/e72a251/2147483647/strip/true/crop/3000x1575+0+338/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F65%2Fec%2Ff5490b7c47b9b2e026b52808308f%2F1489478-me-0107-chuckwalla-3000-rcg.jpg",
            "top_comments": [
                "I hope this stupid lawsuit is thrown out or better they lose the lawsuit. Wouldn't want a important piece of land being destroyed by greedy corporations and miners.",
                ">A lawsuit filed in federal court is seeking to undo the 624,000-acre Chuckwalla National Monument in the Southern California desert, claiming President Biden overstepped his authority by setting aside such a vast swath of land days before leaving office.\n\n>Plaintiffs represented by an Austin, Texas-based conservative think tank claim Biden abused the Antiquities Act, a 1906 law that allows presidents to create national monuments. The suit brought against the Interior Department highlights that the law mandates monuments be limited to the “smallest area compatible with proper care and management of the objects to be protected.”\n\n>“If you look at the history, it was supposed to be limited to, let’s say, 100 acres, maybe 1,000 acres. But it certainly wasn’t the kind of expansion that we’ve seen in recent years,” said Matt Miller, senior attorney for the Texas Public Policy Foundation, which filed the suit.\n\n>Supporters of Chuckwalla, which sits south of Joshua Tree National Park, point out that the law has long been used by presidents to protect large land masses — including the designation of the Grand Canyon by Theodore Roosevelt in 1908. On Jan. 14,[ Biden created Chuckwall](https://www.latimes.com/environment/story/2025-01-14/biden-creates-two-national-monuments-in-california-chuckwalla-sattitla-highlands)a to safeguard land sacred to tribes as well as important wildlife habitat and military sites.\n\n>On May 1, the foundation [filed the suit](https://www.texaspolicy.com/wp-content/uploads/2025/05/Chuckwalla-Case-Complaint-Torongo-v.-Burgum.pdf) against the U.S. Department of the Interior in U.S. District Court for the Eastern District of Michigan on behalf of a resident of the state with mining claims in the footprint of the monument and the BlueRibbon Coalition, a nonprofit that advocates for recreation access.\n\n>According to the lawsuit, Daniel Torongo, whose family began mining in the region in 1978, and members of the BlueRibbon Coalition, will be prevented from using the land in ways they previously enjoyed because of the monument designation.\n\n>Torongo, of Brighton, Mich., will face onerous restrictions to maintaining his claim and will not be able to expand it as he planned, potentially threatening his retirement plan to spend more time mining there with his family, according to the suit.\n\n>“Although Mr. Torongo and his family have invested time and money in acquiring claims, equipment and relevant knowledge, the dream of expanding their operation beyond its current size is no longer possible,” the suit states.\n\n>BlueRibbon Coalition members, meanwhile, which include off-roaders and dirt bikers, fear they’ll also face restrictions because of the “goal of maintaining the undeveloped character of the land,” according to the suit.\n\n>The Interior Department hasn’t yet responded to the suit and spokeswoman J. Elizabeth Peace said department policy is not to comment on litigation.\n\nApparently the miners, off-roaders and dirtbikers feel the designation is infringing on their enjoyment of these beautiful lands, and they have people with deep pockets working to overturn it.",
                "I hope they fucking cry more. “Messing with his retirement plans” go fuck yourself clownshoes asswipe.",
                "Conservatives: why we can’t have nice things.",
                "Biden derangement syndrome?",
                "Biden created prosperity out of a global pandemic and trump undid it, why not also a dumb monument?",
                "Call out those by name in this ‘think tank’ shame them, protest at their homes and places of work.",
                "The guy that mines in area can still mine, he’s just upset he can’t acquire more land to mine 🤦🏻‍♂️",
                "anyone who identifies themselves as a conservative, i hope only negativity comes to you. nothing but sadness and pain.",
                "Chuckwalla isn't even on the top 10 list of largest national monuments, with legal precedent going back over a century."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 41519,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/ssstwitter.com_1746820692383.00_00_52_27.still003.jpg?ve=1&tl=1",
            "top_comments": [
                "\"Witnesses said the arrest came after Baraka attempted to join a scheduled tour of the facility with three members of New Jersey’s congressional delegation, Reps. Robert Menendez, LaMonica McIver, and Bonnie Watson Coleman.\n\nWhen federal officials blocked his entry, a heated argument broke out, according to Viri Martinez, an activist with the New Jersey Alliance for Immigrant Justice. It continued even after Baraka returned to the public side of the gates.\n\n. . . \n\nIn video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not join a tour of the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who informed him: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property, they can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded Baraka and others on the public side of the gate. As protesters cried out, “Shame,” Baraka was dragged back through the security gate in handcuffs.\"",
                "Wow surprising, they are all masked.",
                "Alina Habba is a fucking US ATTORNEY?\n\nI guess I shouldn’t be surprised…\nWhat a fucking joke\n\nDemocrats need to aggressively oppose this gestapo shit AND offer a lawful and humane immigration solution",
                "Something’s going to give in this country. All this is already happening and Trump has only been in power 100 days and some change. Can’t even imagine how much worse things are going to get.",
                "What I don't understand is how ICE was able to arrest him. If this is criminal trespass, and it is committed by a citizen, then local police had jurisdiction.",
                "Gestapo doin Gestapo shit.",
                "It is not mistake. It is blatant racism. \n\n\"An ICE attorney in Dallas, James “Jim” Joseph Rodden, is under scrutiny following allegations that he operated a white supremacist account on X (formerly Twitter) under the handle u/GlomarResponder\".\n\n[https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/](https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/)",
                "ICE is a rogue paramilitary unit. Fuck ICE",
                "Arresting judges and elected officials. Don't overreact. Totally normal....in places like Nazi Germany.",
                "This administration is disgusting"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 5888,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "One thousand cases. In 2025. This should not be happening.",
                "I’d put money on it being underreported.",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "Man, if only we could find a way to prevent this from happening…",
                "It's awful, especially considering a nutjob is currently health secretary. \n\n\nIt's not better in Europe though. Sadly we also have a bunch of anti-vaxx nutjobs here. Here in Germany we had 555 cases of measles last year, and we only have a fourth of the US population. Even worse in the UK, there they had almost 3000 cases last year and they only have a fifth of the US population.",
                "Texas should be sued for this",
                "Unfortunately, it's a bad year for measles worldwide.\n\nhttps://www.cdc.gov/global-measles-vaccination/data-research/global-measles-outbreaks/index.html\n\n\nHopefully, the U.S. truce with the Houthis in Yemen will stabilize things enough there for them to get their measles situation better controlled. They're worse off than anyone right now.\n\nIndia and Pakistan are next on the list and the growing instability in those countries will surely not be making things better.\n\nOther reports.\n\nhttps://www.theguardian.com/world/2025/may/07/measles-cases-hit-six-year-high-in-south-korea-amid-outbreaks-across-south-east-asia\n\nThis article is from a tabloid but it looks, for the most part, legit.\n\nhttps://www.thesun.co.uk/health/34852628/holiday-hotspots-measles-disability-causing-summer/",
                "Those are rookie numbers, Ontario sits at 1,440 since October. Why we picked this contest to win, I'll never know."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "USDA, DOGE demand states hand over personal data about food stamp recipients",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration",
            "upvotes": 3005,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4903x2758+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F3c%2Fa416e52d42e999ab925de6861ce7%2Fgettyimages-2200077442.jpg",
            "top_comments": [
                "Just putting together lists of people we've claimed are drains on society and subhuman for years, nothing to worry about. Oh, also we're getting rid of Habeas Corpus. But don't worry, we're *totally* just doing that to immigrants, we promise.",
                "Putting together the lists of people who will be sent to the camps next year.",
                "> Including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR by an official who was not allowed to speak publicly.\n\nYeah, there's nothing alarming about that. /S Just like creating a database of autistic people is supposed to be a \"good\" thing. This administration is sorting people into categories it deems inferior.",
                "No. Go fuck yourselves you fascist assholes. There's only one good kind of fascist. I can't say which kind because Reddit will ban me since they're a bunch of sympathizers at this point.",
                "When you pass a trillion dollar military budget, cutting fractions of a percent makes no impact on debt reduction at all\n\nAll this does is bring pain and suffering to those that need help the most",
                "Hey DOGE.... Eat Shit!",
                "The legal response should simply say,  “Eat a dick.”",
                "You know a great way to save tax dollars concerning food stamps? Raise the minimum wage. Our taxes supplement Walmart profits. These corporations need to pay up.",
                "We are at the useless eaters point .\n\nGood luck neighbours.",
                "They're gonna be super fucking bummed when they realize the majority of people are white people that live in rural communities."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 3933,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "#SAVE USPS!\n\n\"Neither snow nor rain nor heat nor gloom of night stays these couriers from the swift completion of their appointed rounds\"\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster. Connecting America",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "Never forget the lesson that one single corrupt president can bring ruin to hundreds of years of progress. No election in a democratic country is meaningless. If you failed to vote last November, or if you voted for Trump, you are partially responsible for this.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 5625,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "\"Trump regime\" finally we see news outlets say it out loud. Now we need US major outlets to do the same. There's nothing \"administration\" about fascism.",
                "OMG time to arrest Trump",
                "Like that matters. The administration is ignoring the unanimous orders from the supreme court and you think they will listen to this? The Supreme Court needs to reverse their decision giving Trump immunity. They can revisit it at any time and they didn't follow the rule of law when they gave Trump immunity so you shouldn't have any issue fixing it.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "Every time I see trump talk, I think of the videos of Libyans dragging Muammar Gaddafi and beating him/shooting him to his death.",
                "> Immigration attorneys moved swiftly on Wednesday to block the effort, filing an emergency request in federal court. “Multiple credible sources report that flights are preparing to immediately depart the United States carrying class members for removal to Libya,” they wrote in a court filing.\n\nThey are trying to do the El Salvador thing all over again because not a single person has been held in contempt for that shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US grants asylum to 54 white Afrikaner South Africans, reports say",
            "external_url": "https://www.theguardian.com/world/2025/may/09/us-grants-asylum-to-54-white-afrikaner-south-africans",
            "upvotes": 12316,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1d1c99da998b4f59038b80221c689beeec347fd1/938_14_4562_3651/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=835b1fe072a557dab0a80aef9adaec52",
            "top_comments": [
                ">On Thursday, US officials were trying to arrange a charter flight to land at Dulles international airport, with commercial flights being assessed as an alternative, NPR reported, citing unnamed sources.\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nI just don't know where to begin. They may, in fact, face discrimination. Maybe even violence. And that's terrible. But rolling out the red carpet for these people while Donald Trump, all by himself, cancelled 100,000 asylum claims is beyond the pale.",
                "I thought they hated giving free handouts to migrants. If what the NY Times found is true then what's all this:\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nThe fucking hypocrisy.",
                "Meanwhile We abandoned Afghans, many of whom assisted the US military, who are literally IN HIDING?\n\nhttps://apnews.com/article/afghanistan-refugees-qatar-trump-immigration-refugee-ban-006240c5700fa7a95e4c2f2dcf66ad4f\n\n\nQuestion- How many Afrikaner/White South Africans immigrate to the US per year normally? \n\nThis reminds me of the case of the German family who applied for US asylum because they homeschooled and that is/was illegal in Germany.\n\nBTW- It usually takes years of waiting and vetting to be granted asylum. This. is. a. joke.",
                "💯  Elon Musk and Peter Thiel,  fucking nazis",
                "I didn't think we needed more obvious evidence that this country has been hijacked by white supremacists but here we are.",
                "This administration is a joke. These white people were handed asylum and are getting \"government handouts\" like housing. Yet POC who lived in \"shithole\" countries who were already in the process of being granted citizenship are sent to a concentration camp in El Salvador. Pathetic",
                "It was never about legal versus illegal immigration.\n\nIt has always been about racism.",
                "So let me get this straight, when it's POC looking for asylum in America its bad. But when it's white people, its good? And not to mention all the free shit their getting as well? Hypocrisy of the highest order.",
                "Literally can’t make this shit up 💀\n\n-asylum seekers from Mexico: NOO 😡 NOT CITIZENSS😠🤬GET OUT😤\n\n-white asylum seekers from South Africa: oh no! 😥 my sweet poor babies 😩 let me welcome you with open arms 🤗",
                "So to summerize:\n\nHe asked the Supreme Court to allow him to deport 100,000 South American asylum seekers who have already been living here while simultaneously bending over backward to allow 54 *white* afrikaners from South Africa to come reside in the United States? Absolutely no one can convince me that this administration isn't racist as fuck."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/10/2025 12:14:18 UTC"
}