{
    "posts": [
        {
            "category": "HOT",
            "title": "DOJ to seek death penalty for Luigi Mangione in CEO murder case",
            "external_url": "https://www.cnbc.com/2025/04/01/luigi-mangione-death-penalty-brian-thompson.html",
            "upvotes": 18567,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124291-1743523094454-108124291-17435230372025-04-01t154224z_1209086563_rc22zca5958d_rtrmadp_0_unitedhealth-ceo.jpg?v=1743523101&w=1920&h=1080",
            "top_comments": [
                "Not surprising. Do I think the jury is going to recommend the death penalty? My gut says no, but I think life is still on the table ",
                "I still don't understand why the DoJ is even involved. This shouldn't be a federal case. It should be handled by the state of New York",
                "The Parkland school shooter killed 17 people and wasn’t sentenced to death. \n\nThis is a politically driven punishment. \n\nEdit: I’ve learned the prosecutors in the Parkland shooting trial did try for the death penalty but the jury was not unanimous in agreement so the shooter avoided that punishment. Thanks for those who gave me some learning in the child comments. ",
                "Kinda wild to announce this, playing up the whole “Luigi killed a father” thing, on the same day that you sent a father to die in El Salvador.",
                "This is basically just the modern day equivalent of a head on a spike. The oligarchy is scared and wants to send a message through their government servants that any resistance to their chokehold on society will be punished.",
                "Sure, make him a martyr. Go ahead.",
                "What a surprise.\n\nAnd the execution will probably be streamed pay per view on X.",
                "Oh they’re scared scared. \n\nMaking him a martyr is the worst possible thing these cowards could do. Good luck with all that.",
                "Why is this a federal case at all to begin with? A private citizen killed another private citizen in NYC...\n\nStates are really allowing this kind of federal overreach these days?",
                "This very administration is against abortion and will prosecute a woman for miscarrying but is open to the death penalty for a case taking place in a state that abolished it years ago. The hypocrisy is LOUD."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 7830,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "How long until states get border checks where you cant leave without state visa or minors cant leave without parental permission and minors becomes boosted to under 25s. But i feel like they'd go for trying to get a national ban on abortion instead. They wont stop trying find a win",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "Alabama in a couple years: \"We gave you a speeding ticket for exceeding the posted speed limit in Iowa.\"",
                "\"Alabama [bans abortion](https://www.cnn.com/2019/05/15/politics/alabama-governor-signs-bill/index.html) at any stage of pregnancy with no exceptions for rape and incest.\"\n\nDumb Fucks.",
                "Can we prosecute the people stalking and reporting women who they suspect have had an abortion?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "White House considering roughly 20% tariff on most imports, report says",
            "external_url": "https://www.cnbc.com/2025/04/01/white-house-considering-roughly-20percent-tariff-on-most-imports-report-says.html",
            "upvotes": 6007,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118511-1742409766231-gettyimages-2196938554-AFP_36X27B7.jpeg?v=1743506915&w=1920&h=1080",
            "top_comments": [
                "This guy goes to sleep at night with little gremlins whispering chaos in his ear so he'll act on it the next day. Seriously, there is no method to this madness.\n\nHe'll bankrupt the country just like he did with his casino. Honestly, who bankrupts a casino?",
                "The plan is simple.\n\n1. Let US consumers pay 20% extra for imported goods.\n2. Use that income to lower the taxes for billionaires.",
                "\"White House considering destroying US economy and working class in favoring of fully embracing modern feudalism and American oligarchy.\"",
                "fuck yeah, ive always wanted a 23% increase in cost of literally everything to happen overnight.",
                "Brilliant. I love that our country is being run by morons and yes men.",
                "Do it or don't. We are tired of hearing about it.",
                "Is the plan to get us to a regressive tax system?\n\nThese are basically a flat consumption tax. It is invariably going to hurt low income households the most.\n\nThe rich get richer, the poor get poorer, those of us in the middle manage to varying degrees.",
                "When do countries start calling their bluff and just go \"fine, pay more if you want.\"",
                "People need to realise that this is really just an extra tax they pay on basically everything. How many things are made in America from materials produced solely in America? And because of reciprocal tariffs, any company that sells overseas is now disadvantaged as well.",
                "Societies are strange things.\n\nYou'd think that after 236 years of being a democratically run republic, a society would have progressively chosen better and better people to run the country/government offices.\n\nBut in some weird comedic dystopian twist after all these generations we now have Trump as the Commander in Chief with a rat looking slimeball Lutnick as his pawn.\n\nIt's like a computer program, designed to learn how to play a game and complete it as efficiently as possible and it's progressing bit by bit, edging ever closer to the finishing level.\n\nBut for some reason at every attempt at a completely arbitrary point, it decides to just jump down a hole to its death."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 13453,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "I fucking hate it here.",
                "Remind me what the point of all this is?  If they were serious about saving money, they've already failed.  The IRS has already said that they were kneecapped to the tune of $500B.  Nothing Elon or Trump have done will make up for that loss.  They're complete and utter failures.",
                "Funny how \"the government spends too much, we need to save money\" always means cutting the programs that help people instead of ordering fewer fighter jets at the Pentagon.",
                "It’s a coup. Has always been a coup.",
                "If you don't count the cases there is no disease! June 15, 2020 “When you test, you create cases.” President Donald J. Trump.\n\nSomehow, Americans voted again to have the guy as President.",
                "And you thought what was in Taco Bell was mystery meat before…"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 6532,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "As a non-white living in the US, I am terrified for my family. We’re all US citizens but these people aren’t even checking anymore",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "[CNN] Hooters files for bankruptcy",
            "external_url": "https://www.cnn.com/2025/03/31/business/hooters-restaurant-bankruptcy?cid=ios_app",
            "upvotes": 4390,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202903609.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can’t keep posting these types of things on April fools.",
                "I hope that doesn't screw up Sid's 5 year plan.",
                "Going out for wings at this point costs almost as much as steak.   I didn't mind hooters wings so much, but they were only worth about half what they cost lately. Typical private equity firms trying to squeeze customers until the business breaks.",
                "Some would say they've went tits up...",
                "In case you were wondering, they are owned by Private Equity.",
                "The fact they’re still around is surprising.",
                "NOT an April Fool's item. Obviously. How this brand survived as long as it has is a mystery of history.",
                "Never been to one but from the anecdotes I've read here on reddit you could easily go to any random strip club and be served better food and booze while seeing more skin and skimpy outfits for the same price.",
                "Thanks for the mammaries!",
                "Private Equity strikes again\n\nNot that they were some fabulous enterprise before they got involved but its pretty clear that once a PE Firm gets involved in your business theyre going to strangle it to death as they squeeze every last single drop out of it before they chop it uo and sell it for parts"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 1762,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lawyers doing what they can with lawsuits in system thats already being undermined. But its up to general public to call representatives and join protests to show how unpopular these cuts are",
                "For the sake of the American people, let's hope they win.\n\nContact your Congressional reps.  Tell them you are unhappy that your, your friend's and your family's health are being put in jeopardy",
                "STATE OF COLORADO; STATE OF RHODE ISLAND; STATE OF CALIFORNIA; STATE OF\nMINNESOTA; STATE OF WASHINGTON; STATE\nOF ARIZONA; STATE OF CONNECTICUT;\nSTATE OF DELAWARE; DISTRICT OF\nCOLUMBIA; STATE OF HAWAI‘I; STATE OF\nILLINOIS; OFFICE OF THE GOVERNOR ex rel.\nAndy Beshear, in his official capacity as Governor of the COMMONWEALTH OF KENTUCKY;STATE OF MAINE; STATE OF MARYLAND; COMMONWEALTH OF MASSACHUSETTS; STATE OF MICHIGAN; STATE OF NEVADA;STATE OF NEW JERSEY; STATE OF NEW MEXICO; STATE OF NEW YORK; STATE OF NORTH CAROLINA; STATE OF OREGON; JOSH SHAPIRO, in his official capacity as Governor of the COMMONWEALTH OF PENNSYLVANIA;\nand STATE OF WISCONSIN\n\nThere’s the list after clicking 3 links so you don’t have to",
                "Are any of those states republican states?",
                "SUE HIM? How about impeach him?\n\nEdit and this time remove his ass.",
                "This is the plan. Tie up the Justice system with all of this stupid trump crap.",
                "I do not have any faith that our judiciary will check or balance anything the Trump admin does. There will be some judges that stand up, but they’ll just be removed, silenced, ignored, or overruled by the wildly corrupt Supreme Court."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Measles cases in Texas and New Mexico rise to 470, state health departments say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-new-mexico-rise-470-state-health-departments-say-2025-04-01/",
            "upvotes": 1062,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've lost hope for control of this outbreak ever since the parents who had their child die said measles \"was not that bad\".  I truly wish those two a miserable life.",
                "Remember when we used to have a CDC that functioned?",
                "Republicans dismissal of basic science has turned the US into a 3rd world country.",
                "Robert Kennedy Jr., dumb, dumb, dumb, dumb, dumb.",
                "This update adds 22 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 78 cases. Last Tuesday’s update added 18 cases. The previous Friday's update added 30 cases.\n\nOne new hospitalization (up to 42 from 41) was reported, while no new deaths were reported for Texas.",
                "If only there were a simple and easy way to prevent this. A shot maybe, that you could be given at a very young age which will protect you for the remainder of your life.",
                "And, as usual, it'll be children who suffer.\n\n  \nYou would think that they'd want their ~~child slave force~~ future workforce to be healthy enough to slave away.",
                "Feel bad for the kids, not for the parents. I hope this decision derails your lives. Besides immuno-compromised decisions, you had a choice and now you get to see the repercussions of choosing to not believing in science.",
                "New Mexico added 4 new cases today to their total reported case count (up to 48 from 44) for this outbreak.\n\nOklahoma hasn’t posted today’s update yet. Currently, they have reported 9 total cases.\n\nKansas updates on Wednesdays. They’re currently at 23 cases that are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "Everything is bigger in Texas, except brains"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Putin begins biggest Russian military call-up in years",
            "external_url": "https://www.bbc.co.uk/news/articles/c36718p52eyo",
            "upvotes": 1613,
            "date": "04/01/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/155e/live/f670c2c0-0f0a-11f0-9021-b1661f716c64.jpg",
            "top_comments": [
                "It looks like Trump didn't end this war in one day like he promised on the campaign trail. Oh well, his supporters will never notice because facts aren't important to them.",
                "How many of these people will run away or not even get a gun?",
                "From where? Hasn't he already killed off something like 500,000 of his own men?",
                "24 hours to end the war btw.",
                "No shortage of natural sunflower fertilizer is how I look at it.",
                "President poopy pants said 24 hours!!!! I thought he would mother fucking art of the deal this war, but he shit the bed. Figuratively this time. He literally does it nightly.",
                "Surrender early, so you don't die right away.",
                "This isn't really news. The draft happens every year, twice a year, and always did, even before the war. It's a regular occurence. It *not* happening would've been news.        \nSure, the conscripts face more dubious fates than before the war, but framing it like this is a bit sensationalized.",
                "A lot of twitter bot/MAGA folks are going to be busy soon then!",
                "Poopy pants is realizing his mortality and doing everything he can to make himself look powerful."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "China holds military drills around Taiwan, calling its president a 'parasite'",
            "external_url": "https://www.nbcnews.com/news/world/china-holds-military-drills-taiwan-calling-president-parasite-rcna198998",
            "upvotes": 1932,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-taiwan-mb-0744-e72a4d.jpg",
            "top_comments": [
                "I doubt anyone will see this or it will get downvoted, but this is actually normal. I have been on 4 deployments in this exact region and we always watched China doing their drills, while we did ours farther south and then they would follow us.\n\nThe reason we’re seeing this article tells me that the Navy MCs are doing their job and getting the right propaganda to our media. China does it too, clearly.\n\nI strongly dislike China’s foreign policy and aggressive stance in the region, but this is not the start of WWIII, it happens all the time. We just don’t typically hear about it.",
                "Typical authoritarian rhetoric. Escalating aggression and then blaming it on their victims.",
                "Meanwhile their biggest \"ally\" is too busy performing the bathroom scene from \"Liar Liar\"",
                "I believe Taiwan has measures in place to blow up all the semiconductor plants if PRC takes over.  It will be a pyrrhic victory if PRC wins.",
                "Everything indicates that the world is preparing for World War III....",
                "I swear to god if the orange motherfucker sets us back 10 years in semiconductor technology...",
                "It seems to be a universal trait of authoritarian governments and rulers that they have no sense of irony. We in the US should know.",
                "That sounds exactly like what Trump would say.",
                "Where were you when World War 3 started?",
                "Can countries please chill \nI hate this goddamn timeline enough already"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Palestinian paramedics shot by Israeli forces had hands tied, eyewitnesses say",
            "external_url": "https://www.theguardian.com/world/2025/apr/01/palestinian-paramedics-shot-by-israeli-forces-had-hands-tied-eyewitnesses-say",
            "upvotes": 152,
            "date": "04/01/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aa4b53d72572c85144df8719dd5aa383abe9b766/0_127_3362_2017/master/3362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8055f3f6c81bc54345ee4bd260ee64f1",
            "top_comments": [
                "We're so desensitized to it now Israel could literally start-up gas chambers and incinerators and people would still make excuses for them",
                "Why were the paramedics supporting terrorists?\n\n/s",
                "But if you say anything you are antisemitic as victims of a genocide they are certainly aware they are committing one. Will history look back upon both genocides the same.",
                "Yet another war that Donald Trump claimed he'd end in his first 24 hours.\n\nGot no further than riding Biden's coattails to Ceasefire Phase 1.",
                "That’s weird, how can they perform cpr with their hands tied?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Medical Student Convicted Of Raping Another Student Escapes Sentence As “He Is Young And Talented”",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/01/medical-student-convicted-of-raping-another-student-escapes-sent/",
            "upvotes": 518,
            "date": "04/01/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2025/04/01/93759d66-b14b-42bc-aa5d-8469165278ca.png",
            "top_comments": [
                ">In his summing up the judge said “It has been proven that sexual intercourse took place at a time that she was in a state that meant that she couldn’t possibly consent to it. The offence is serious and unacceptable.”\n\n>Nevertheless, the judge refrained from passing sentence. “It is undeniable that he passed the line of what is permissible. The man showed a lack of respect for the victim's physical, psychological and sexual boundaries. However, he is still young and has no criminal record. He is also a talented and committed person both in his professional and private live. By finding him guilty but not punishing him, he will be made to feel guilty and the chance of him reoffending will be prevented, without socially impairing the man”.\n\n\"Its **unacceptable**! But I won't punish him.\"",
                "Young and talented at what, raping?",
                "Unfortunately, the title must exactly match the article, so I couldn’t emphasize that the medical student is actually A GYNAECOLOGY RESIDENT!!!!!!! In other words, while the man is young and talented, the woman he raped—and the women who will be vulnerable and naked alone with him in his practice—apparently are not. :)\n\n\nA similar thing occurred a few years ago in the same belgian courthouse when white elite student club called Reuzegom left their only black member, Sanda Dia, for dead after subjecting him to hours of torture as part of an initiation ritual. He eventually died, and the perpetrators tried to cover their tracks. The verdict was the same: they were found guilty but did not receive any sentencing besides a very low fine of €400 and some community service (in Belgium, you only get a criminal record if there's an actual sentence and the fine needs to exceed X amount which wasn't the case here so they still have clean records) because they were considered “young and promising.” In reality, they were white, wealthy, and one of their fathers was a judge in the same court. A YouTuber who doxxed them was fined €20K—roughly equivalent to 22K dollars—because it is illegal to publish the names of individuals who do not have a criminal record.",
                "That's disgusting. The judge and rapist should both be in prison.",
                "It's not a bug when it happens one, two, three times. It's the system.",
                "Tends to happen when papa writes a big fat check.",
                "His medical license should be revoked.",
                "Sounds like the judge should be dismissed. Make an example. There needs to be better oversight of judges, considering it is known that even the smallest power makes some abuse it. Abuse need not be believed to be abuse by the abuser.",
                "Someone needs to look into the judge's personal connections, because there's no way for this sentence to be laid out without some sort of extreme personal bias",
                "Young and Talented? At what? Rape?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "5 People Have Already Died on Rikers This Year as Crisis Worsens",
            "external_url": "https://www.nytimes.com/2025/04/01/nyregion/rikers-death.html?unlocked_article_code=1.8U4.78fb.od6EE1qaJ1Y6&smid=url-share",
            "upvotes": 596,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The degree of civilization in a society can be judged by entering its prisons.\n\nFyodor Dostoevsky",
                "According to Wikipedia, 85 percent of inmates at Riker's are pretrial defendants. This is a big part of why bail reform is so important.",
                "It’s almost as if you over incarcerate, treat people like animals, and hire unqualified and unstable corrections officers there might be terrible consequences.",
                "That's just the death's they couldnt hide.",
                "Where Trump should be",
                "But I’m sure they’ll monitor Harvey Weinstein 24/7 so he makes it to trial",
                "The American criminal “justice” system is a crime against humanity",
                "[removed]"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Fourth missing U.S. soldier found dead in Lithuania",
            "external_url": "https://www.nbcnews.com/news/world/fourth-missing-us-soldier-found-dead-lithuania-rcna199112",
            "upvotes": 301,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-lithuania-missing-soldiers-mn-1230-832e20.jpg",
            "top_comments": [
                "Why does it say there’s 3 comments but I can’t see a single one?",
                "I'm curious to hear from a military person how severe of a fuck up this is. Was it an unforeseeable accident? Or is there somebody that should have said No to the training exercise?",
                "Since he was not with the other 3 does that mean he managed to escape the vehicle but could not escape the bog? That's truly tragic.",
                "Imagine if Biden was in office right now. He's not so this isn't a concern for MAGA.  Remember \"I don't like prisoners of war\".  Here it is.",
                "Remember, all US military personnel, your commander in chief either didn’t listen to the briefing about these soldiers, didn’t care enough to give them attention, or forgot about them immediately."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Measles cases in Texas and New Mexico rise to 470, state health departments say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-new-mexico-rise-470-state-health-departments-say-2025-04-01/",
            "upvotes": 1060,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've lost hope for control of this outbreak ever since the parents who had their child die said measles \"was not that bad\".  I truly wish those two a miserable life.",
                "Remember when we used to have a CDC that functioned?",
                "Republicans dismissal of basic science has turned the US into a 3rd world country.",
                "Robert Kennedy Jr., dumb, dumb, dumb, dumb, dumb.",
                "This update adds 22 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 78 cases. Last Tuesday’s update added 18 cases. The previous Friday's update added 30 cases.\n\nOne new hospitalization (up to 42 from 41) was reported, while no new deaths were reported for Texas.",
                "If only there were a simple and easy way to prevent this. A shot maybe, that you could be given at a very young age which will protect you for the remainder of your life.",
                "And, as usual, it'll be children who suffer.\n\n  \nYou would think that they'd want their ~~child slave force~~ future workforce to be healthy enough to slave away.",
                "Feel bad for the kids, not for the parents. I hope this decision derails your lives. Besides immuno-compromised decisions, you had a choice and now you get to see the repercussions of choosing to not believing in science.",
                "New Mexico added 4 new cases today to their total reported case count (up to 48 from 44) for this outbreak.\n\nOklahoma hasn’t posted today’s update yet. Currently, they have reported 9 total cases.\n\nKansas updates on Wednesdays. They’re currently at 23 cases that are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "Everything is bigger in Texas, except brains"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin teen killed mother and stepfather and lived with corpses for weeks, prosecutors say",
            "external_url": "https://www.nbcnews.com/news/us-news/wisconsin-teen-killed-mother-stepfather-lived-corpses-weeks-prosecutor-rcna198903",
            "upvotes": 548,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250305-waukesha-bodies-found-mn-1540-934ba3.png",
            "top_comments": [
                "I can't even relax knowing there's a dead insect in my room. How some people can live with corpses blows my mind.",
                "Why is it always Waukesha???",
                "How long til Netflix makes a special?",
                "SPECULATION: Twenty years from now, we'll find out that the parents were abusing him and school & family knew but did nothing.",
                "That’s some Elon musk level creepy. ",
                "“Wisconsin: Come for the year-round Friday night fish fry; Stay for our serial killers!”",
                "Wisconsin, the Florida of the Midwest.",
                "American horror story Cult vibes right there",
                "Disturbing. Guaranteed the teen had a rough time in the household at the hands of the stepfather...",
                "April Fools right? Right?!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "White House considering roughly 20% tariff on most imports, report says",
            "external_url": "https://www.cnbc.com/2025/04/01/white-house-considering-roughly-20percent-tariff-on-most-imports-report-says.html",
            "upvotes": 6008,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118511-1742409766231-gettyimages-2196938554-AFP_36X27B7.jpeg?v=1743506915&w=1920&h=1080",
            "top_comments": [
                "This guy goes to sleep at night with little gremlins whispering chaos in his ear so he'll act on it the next day. Seriously, there is no method to this madness.\n\nHe'll bankrupt the country just like he did with his casino. Honestly, who bankrupts a casino?",
                "The plan is simple.\n\n1. Let US consumers pay 20% extra for imported goods.\n2. Use that income to lower the taxes for billionaires.",
                "\"White House considering destroying US economy and working class in favoring of fully embracing modern feudalism and American oligarchy.\"",
                "fuck yeah, ive always wanted a 23% increase in cost of literally everything to happen overnight.",
                "Brilliant. I love that our country is being run by morons and yes men.",
                "Do it or don't. We are tired of hearing about it.",
                "Is the plan to get us to a regressive tax system?\n\nThese are basically a flat consumption tax. It is invariably going to hurt low income households the most.\n\nThe rich get richer, the poor get poorer, those of us in the middle manage to varying degrees.",
                "When do countries start calling their bluff and just go \"fine, pay more if you want.\"",
                "People need to realise that this is really just an extra tax they pay on basically everything. How many things are made in America from materials produced solely in America? And because of reciprocal tariffs, any company that sells overseas is now disadvantaged as well.",
                "Societies are strange things.\n\nYou'd think that after 236 years of being a democratically run republic, a society would have progressively chosen better and better people to run the country/government offices.\n\nBut in some weird comedic dystopian twist after all these generations we now have Trump as the Commander in Chief with a rat looking slimeball Lutnick as his pawn.\n\nIt's like a computer program, designed to learn how to play a game and complete it as efficiently as possible and it's progressing bit by bit, edging ever closer to the finishing level.\n\nBut for some reason at every attempt at a completely arbitrary point, it decides to just jump down a hole to its death."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 1763,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lawyers doing what they can with lawsuits in system thats already being undermined. But its up to general public to call representatives and join protests to show how unpopular these cuts are",
                "For the sake of the American people, let's hope they win.\n\nContact your Congressional reps.  Tell them you are unhappy that your, your friend's and your family's health are being put in jeopardy",
                "STATE OF COLORADO; STATE OF RHODE ISLAND; STATE OF CALIFORNIA; STATE OF\nMINNESOTA; STATE OF WASHINGTON; STATE\nOF ARIZONA; STATE OF CONNECTICUT;\nSTATE OF DELAWARE; DISTRICT OF\nCOLUMBIA; STATE OF HAWAI‘I; STATE OF\nILLINOIS; OFFICE OF THE GOVERNOR ex rel.\nAndy Beshear, in his official capacity as Governor of the COMMONWEALTH OF KENTUCKY;STATE OF MAINE; STATE OF MARYLAND; COMMONWEALTH OF MASSACHUSETTS; STATE OF MICHIGAN; STATE OF NEVADA;STATE OF NEW JERSEY; STATE OF NEW MEXICO; STATE OF NEW YORK; STATE OF NORTH CAROLINA; STATE OF OREGON; JOSH SHAPIRO, in his official capacity as Governor of the COMMONWEALTH OF PENNSYLVANIA;\nand STATE OF WISCONSIN\n\nThere’s the list after clicking 3 links so you don’t have to",
                "Are any of those states republican states?",
                "SUE HIM? How about impeach him?\n\nEdit and this time remove his ass.",
                "This is the plan. Tie up the Justice system with all of this stupid trump crap.",
                "I do not have any faith that our judiciary will check or balance anything the Trump admin does. There will be some judges that stand up, but they’ll just be removed, silenced, ignored, or overruled by the wildly corrupt Supreme Court."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "DOJ to seek death penalty for Luigi Mangione in CEO murder case",
            "external_url": "https://www.cnbc.com/2025/04/01/luigi-mangione-death-penalty-brian-thompson.html",
            "upvotes": 18559,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124291-1743523094454-108124291-17435230372025-04-01t154224z_1209086563_rc22zca5958d_rtrmadp_0_unitedhealth-ceo.jpg?v=1743523101&w=1920&h=1080",
            "top_comments": [
                "Not surprising. Do I think the jury is going to recommend the death penalty? My gut says no, but I think life is still on the table ",
                "I still don't understand why the DoJ is even involved. This shouldn't be a federal case. It should be handled by the state of New York",
                "The Parkland school shooter killed 17 people and wasn’t sentenced to death. \n\nThis is a politically driven punishment. \n\nEdit: I’ve learned the prosecutors in the Parkland shooting trial did try for the death penalty but the jury was not unanimous in agreement so the shooter avoided that punishment. Thanks for those who gave me some learning in the child comments. ",
                "Kinda wild to announce this, playing up the whole “Luigi killed a father” thing, on the same day that you sent a father to die in El Salvador.",
                "This is basically just the modern day equivalent of a head on a spike. The oligarchy is scared and wants to send a message through their government servants that any resistance to their chokehold on society will be punished.",
                "Sure, make him a martyr. Go ahead.",
                "What a surprise.\n\nAnd the execution will probably be streamed pay per view on X.",
                "Oh they’re scared scared. \n\nMaking him a martyr is the worst possible thing these cowards could do. Good luck with all that.",
                "Why is this a federal case at all to begin with? A private citizen killed another private citizen in NYC...\n\nStates are really allowing this kind of federal overreach these days?",
                "This very administration is against abortion and will prosecute a woman for miscarrying but is open to the death penalty for a case taking place in a state that abolished it years ago. The hypocrisy is LOUD."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 7818,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "How long until states get border checks where you cant leave without state visa or minors cant leave without parental permission and minors becomes boosted to under 25s. But i feel like they'd go for trying to get a national ban on abortion instead. They wont stop trying find a win",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "Alabama in a couple years: \"We gave you a speeding ticket for exceeding the posted speed limit in Iowa.\"",
                "\"Alabama [bans abortion](https://www.cnn.com/2019/05/15/politics/alabama-governor-signs-bill/index.html) at any stage of pregnancy with no exceptions for rape and incest.\"\n\nDumb Fucks.",
                "Can we prosecute the people stalking and reporting women who they suspect have had an abortion?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 1768,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lawyers doing what they can with lawsuits in system thats already being undermined. But its up to general public to call representatives and join protests to show how unpopular these cuts are",
                "For the sake of the American people, let's hope they win.\n\nContact your Congressional reps.  Tell them you are unhappy that your, your friend's and your family's health are being put in jeopardy",
                "STATE OF COLORADO; STATE OF RHODE ISLAND; STATE OF CALIFORNIA; STATE OF\nMINNESOTA; STATE OF WASHINGTON; STATE\nOF ARIZONA; STATE OF CONNECTICUT;\nSTATE OF DELAWARE; DISTRICT OF\nCOLUMBIA; STATE OF HAWAI‘I; STATE OF\nILLINOIS; OFFICE OF THE GOVERNOR ex rel.\nAndy Beshear, in his official capacity as Governor of the COMMONWEALTH OF KENTUCKY;STATE OF MAINE; STATE OF MARYLAND; COMMONWEALTH OF MASSACHUSETTS; STATE OF MICHIGAN; STATE OF NEVADA;STATE OF NEW JERSEY; STATE OF NEW MEXICO; STATE OF NEW YORK; STATE OF NORTH CAROLINA; STATE OF OREGON; JOSH SHAPIRO, in his official capacity as Governor of the COMMONWEALTH OF PENNSYLVANIA;\nand STATE OF WISCONSIN\n\nThere’s the list after clicking 3 links so you don’t have to",
                "Are any of those states republican states?",
                "SUE HIM? How about impeach him?\n\nEdit and this time remove his ass.",
                "This is the plan. Tie up the Justice system with all of this stupid trump crap.",
                "I do not have any faith that our judiciary will check or balance anything the Trump admin does. There will be some judges that stand up, but they’ll just be removed, silenced, ignored, or overruled by the wildly corrupt Supreme Court."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 7825,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "How long until states get border checks where you cant leave without state visa or minors cant leave without parental permission and minors becomes boosted to under 25s. But i feel like they'd go for trying to get a national ban on abortion instead. They wont stop trying find a win",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "Alabama in a couple years: \"We gave you a speeding ticket for exceeding the posted speed limit in Iowa.\"",
                "\"Alabama [bans abortion](https://www.cnn.com/2019/05/15/politics/alabama-governor-signs-bill/index.html) at any stage of pregnancy with no exceptions for rape and incest.\"\n\nDumb Fucks.",
                "Can we prosecute the people stalking and reporting women who they suspect have had an abortion?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Medical Student Convicted Of Raping Another Student Escapes Sentence As “He Is Young And Talented”",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/01/medical-student-convicted-of-raping-another-student-escapes-sent/",
            "upvotes": 518,
            "date": "04/01/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2025/04/01/93759d66-b14b-42bc-aa5d-8469165278ca.png",
            "top_comments": [
                ">In his summing up the judge said “It has been proven that sexual intercourse took place at a time that she was in a state that meant that she couldn’t possibly consent to it. The offence is serious and unacceptable.”\n\n>Nevertheless, the judge refrained from passing sentence. “It is undeniable that he passed the line of what is permissible. The man showed a lack of respect for the victim's physical, psychological and sexual boundaries. However, he is still young and has no criminal record. He is also a talented and committed person both in his professional and private live. By finding him guilty but not punishing him, he will be made to feel guilty and the chance of him reoffending will be prevented, without socially impairing the man”.\n\n\"Its **unacceptable**! But I won't punish him.\"",
                "Young and talented at what, raping?",
                "Unfortunately, the title must exactly match the article, so I couldn’t emphasize that the medical student is actually A GYNAECOLOGY RESIDENT!!!!!!! In other words, while the man is young and talented, the woman he raped—and the women who will be vulnerable and naked alone with him in his practice—apparently are not. :)\n\n\nA similar thing occurred a few years ago in the same belgian courthouse when white elite student club called Reuzegom left their only black member, Sanda Dia, for dead after subjecting him to hours of torture as part of an initiation ritual. He eventually died, and the perpetrators tried to cover their tracks. The verdict was the same: they were found guilty but did not receive any sentencing besides a very low fine of €400 and some community service (in Belgium, you only get a criminal record if there's an actual sentence and the fine needs to exceed X amount which wasn't the case here so they still have clean records) because they were considered “young and promising.” In reality, they were white, wealthy, and one of their fathers was a judge in the same court. A YouTuber who doxxed them was fined €20K—roughly equivalent to 22K dollars—because it is illegal to publish the names of individuals who do not have a criminal record.",
                "That's disgusting. The judge and rapist should both be in prison.",
                "It's not a bug when it happens one, two, three times. It's the system.",
                "Tends to happen when papa writes a big fat check.",
                "His medical license should be revoked.",
                "Sounds like the judge should be dismissed. Make an example. There needs to be better oversight of judges, considering it is known that even the smallest power makes some abuse it. Abuse need not be believed to be abuse by the abuser.",
                "Someone needs to look into the judge's personal connections, because there's no way for this sentence to be laid out without some sort of extreme personal bias",
                "Young and Talented? At what? Rape?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles cases in Texas and New Mexico rise to 470, state health departments say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-new-mexico-rise-470-state-health-departments-say-2025-04-01/",
            "upvotes": 1058,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've lost hope for control of this outbreak ever since the parents who had their child die said measles \"was not that bad\".  I truly wish those two a miserable life.",
                "Remember when we used to have a CDC that functioned?",
                "Republicans dismissal of basic science has turned the US into a 3rd world country.",
                "Robert Kennedy Jr., dumb, dumb, dumb, dumb, dumb.",
                "This update adds 22 cases to the number of reported cases in Texas associated with the outbreak. Friday’s update added 78 cases. Last Tuesday’s update added 18 cases. The previous Friday's update added 30 cases.\n\nOne new hospitalization (up to 42 from 41) was reported, while no new deaths were reported for Texas.",
                "If only there were a simple and easy way to prevent this. A shot maybe, that you could be given at a very young age which will protect you for the remainder of your life.",
                "And, as usual, it'll be children who suffer.\n\n  \nYou would think that they'd want their ~~child slave force~~ future workforce to be healthy enough to slave away.",
                "Feel bad for the kids, not for the parents. I hope this decision derails your lives. Besides immuno-compromised decisions, you had a choice and now you get to see the repercussions of choosing to not believing in science.",
                "New Mexico added 4 new cases today to their total reported case count (up to 48 from 44) for this outbreak.\n\nOklahoma hasn’t posted today’s update yet. Currently, they have reported 9 total cases.\n\nKansas updates on Wednesdays. They’re currently at 23 cases that are reported as probably connected to this outbreak concentrated in Mennonite communities.",
                "Everything is bigger in Texas, except brains"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 6540,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "As a non-white living in the US, I am terrified for my family. We’re all US citizens but these people aren’t even checking anymore",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Fourth missing U.S. soldier found dead in Lithuania",
            "external_url": "https://www.nbcnews.com/news/world/fourth-missing-us-soldier-found-dead-lithuania-rcna199112",
            "upvotes": 301,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-lithuania-missing-soldiers-mn-1230-832e20.jpg",
            "top_comments": [
                "Why does it say there’s 3 comments but I can’t see a single one?",
                "I'm curious to hear from a military person how severe of a fuck up this is. Was it an unforeseeable accident? Or is there somebody that should have said No to the training exercise?",
                "Since he was not with the other 3 does that mean he managed to escape the vehicle but could not escape the bog? That's truly tragic.",
                "Imagine if Biden was in office right now. He's not so this isn't a concern for MAGA.  Remember \"I don't like prisoners of war\".  Here it is.",
                "Remember, all US military personnel, your commander in chief either didn’t listen to the briefing about these soldiers, didn’t care enough to give them attention, or forgot about them immediately."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "White House considering roughly 20% tariff on most imports, report says",
            "external_url": "https://www.cnbc.com/2025/04/01/white-house-considering-roughly-20percent-tariff-on-most-imports-report-says.html",
            "upvotes": 6003,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118511-1742409766231-gettyimages-2196938554-AFP_36X27B7.jpeg?v=1743506915&w=1920&h=1080",
            "top_comments": [
                "This guy goes to sleep at night with little gremlins whispering chaos in his ear so he'll act on it the next day. Seriously, there is no method to this madness.\n\nHe'll bankrupt the country just like he did with his casino. Honestly, who bankrupts a casino?",
                "The plan is simple.\n\n1. Let US consumers pay 20% extra for imported goods.\n2. Use that income to lower the taxes for billionaires.",
                "\"White House considering destroying US economy and working class in favoring of fully embracing modern feudalism and American oligarchy.\"",
                "fuck yeah, ive always wanted a 23% increase in cost of literally everything to happen overnight.",
                "Brilliant. I love that our country is being run by morons and yes men.",
                "Do it or don't. We are tired of hearing about it.",
                "Is the plan to get us to a regressive tax system?\n\nThese are basically a flat consumption tax. It is invariably going to hurt low income households the most.\n\nThe rich get richer, the poor get poorer, those of us in the middle manage to varying degrees.",
                "When do countries start calling their bluff and just go \"fine, pay more if you want.\"",
                "People need to realise that this is really just an extra tax they pay on basically everything. How many things are made in America from materials produced solely in America? And because of reciprocal tariffs, any company that sells overseas is now disadvantaged as well.",
                "Societies are strange things.\n\nYou'd think that after 236 years of being a democratically run republic, a society would have progressively chosen better and better people to run the country/government offices.\n\nBut in some weird comedic dystopian twist after all these generations we now have Trump as the Commander in Chief with a rat looking slimeball Lutnick as his pawn.\n\nIt's like a computer program, designed to learn how to play a game and complete it as efficiently as possible and it's progressing bit by bit, edging ever closer to the finishing level.\n\nBut for some reason at every attempt at a completely arbitrary point, it decides to just jump down a hole to its death."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "5 People Have Already Died on Rikers This Year as Crisis Worsens",
            "external_url": "https://www.nytimes.com/2025/04/01/nyregion/rikers-death.html?unlocked_article_code=1.8U4.78fb.od6EE1qaJ1Y6&smid=url-share",
            "upvotes": 593,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The degree of civilization in a society can be judged by entering its prisons.\n\nFyodor Dostoevsky",
                "According to Wikipedia, 85 percent of inmates at Riker's are pretrial defendants. This is a big part of why bail reform is so important.",
                "It’s almost as if you over incarcerate, treat people like animals, and hire unqualified and unstable corrections officers there might be terrible consequences.",
                "That's just the death's they couldnt hide.",
                "Where Trump should be",
                "But I’m sure they’ll monitor Harvey Weinstein 24/7 so he makes it to trial",
                "The American criminal “justice” system is a crime against humanity",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "DOJ to seek death penalty for Luigi Mangione in CEO murder case",
            "external_url": "https://www.cnbc.com/2025/04/01/luigi-mangione-death-penalty-brian-thompson.html",
            "upvotes": 18604,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124291-1743523094454-108124291-17435230372025-04-01t154224z_1209086563_rc22zca5958d_rtrmadp_0_unitedhealth-ceo.jpg?v=1743523101&w=1920&h=1080",
            "top_comments": [
                "Not surprising. Do I think the jury is going to recommend the death penalty? My gut says no, but I think life is still on the table ",
                "I still don't understand why the DoJ is even involved. This shouldn't be a federal case. It should be handled by the state of New York",
                "The Parkland school shooter killed 17 people and wasn’t sentenced to death. \n\nThis is a politically driven punishment. \n\nEdit: I’ve learned the prosecutors in the Parkland shooting trial did try for the death penalty but the jury was not unanimous in agreement so the shooter avoided that punishment. Thanks for those who gave me some learning in the child comments. ",
                "Kinda wild to announce this, playing up the whole “Luigi killed a father” thing, on the same day that you sent a father to die in El Salvador.",
                "This is basically just the modern day equivalent of a head on a spike. The oligarchy is scared and wants to send a message through their government servants that any resistance to their chokehold on society will be punished.",
                "Sure, make him a martyr. Go ahead.",
                "What a surprise.\n\nAnd the execution will probably be streamed pay per view on X.",
                "Oh they’re scared scared. \n\nMaking him a martyr is the worst possible thing these cowards could do. Good luck with all that.",
                "Why is this a federal case at all to begin with? A private citizen killed another private citizen in NYC...\n\nStates are really allowing this kind of federal overreach these days?",
                "This very administration is against abortion and will prosecute a woman for miscarrying but is open to the death penalty for a case taking place in a state that abolished it years ago. The hypocrisy is LOUD."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin teen killed mother and stepfather and lived with corpses for weeks, prosecutors say",
            "external_url": "https://www.nbcnews.com/news/us-news/wisconsin-teen-killed-mother-stepfather-lived-corpses-weeks-prosecutor-rcna198903",
            "upvotes": 550,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250305-waukesha-bodies-found-mn-1540-934ba3.png",
            "top_comments": [
                "I can't even relax knowing there's a dead insect in my room. How some people can live with corpses blows my mind.",
                "Why is it always Waukesha???",
                "How long til Netflix makes a special?",
                "SPECULATION: Twenty years from now, we'll find out that the parents were abusing him and school & family knew but did nothing.",
                "That’s some Elon musk level creepy. ",
                "“Wisconsin: Come for the year-round Friday night fish fry; Stay for our serial killers!”",
                "Wisconsin, the Florida of the Midwest.",
                "American horror story Cult vibes right there",
                "Disturbing. Guaranteed the teen had a rough time in the household at the hands of the stepfather...",
                "April Fools right? Right?!"
            ],
            "aggregate_sentiment": 28.0
        }
    ],
    "last_updated": "04/01/2025 20:10:03 UTC"
}