{
    "posts": [
        {
            "category": "HOT",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 13609,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "Rapist Russell Brand charged with trying to be comedian",
                "Insane he made it to 2025. Him making it through the me too era is like getting an rpg past TSA in your backpack",
                "I'm actually more shocked by the headline calling him a comedian than the rest of it.",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 8493,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "I’m sure the comments and discourse will be very positive",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "I'm still on the fence about the whole thing.",
                "So I feel like this needs to be added, for the 'obviously Sullivan had an unfair advantage' crowd.\n\nI think [this](https://member.usafencing.org/details/tournaments/9012) was the event (fits the time and location).  Specifically in the Division IA Women's Foil, I don't see Sullivan's name in any other event.  \n\nSullivan ended up 24th out of 39, with Turner being 39th as DNF.\n\nIf Sullivan had an advantage, it appears to have been marginal at best.  If you are worried about the 'Majesty of competition', I should note that it does not appear the national news gave a damn about this competition until there was culture war content to be made out of the proceedings.",
                "Name one professional fencer off the top of your head."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "China to impose 34% retaliatory tariff on all goods imported from the U.S.",
            "external_url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 25914,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080",
            "top_comments": [
                "Conservatives - Fall 2024 - “Eggs are too damn high.”\n\nConservatives - Apr 2025 - “New taxes on almost everything…sounds good.”",
                "Has any country in history ever started a trade war with the entire planet and won?",
                "aaaaand there goes the American farmer exports...",
                "China has the largest manufacturing base in the world - naïve to expect they wouldn’t hit back.",
                "So uh..... farmers fucked?",
                "What DT has done will be chronicled in history books not only for how he manipulated data to serve his interests, but also for how he influenced collective minds through falsehoods, expecting other political actors to fall into his trap. Fortunately, most of the world is no longer willing to dance to his tune or validate his tactics.",
                "The republican base will see this and believe its “growing pains”. There is no amount of pain they can suffer before it’s Trumps fault \n\nNo matter what happens in the next 4 years, it will always be Biden and the democrats fault",
                "“Things are going great!”\n\n-every Trump supporter with their head in the sand desperately trying not to believe their lying eyes. ",
                "This is possibly one of the biggest self owns the US has ever thrown out.  It's unbelievable.  Stock market was hitting its highest highs.  Unemployment at historically low levels.  The world in general, on a path of improvement.  And along comes this ONE asshole and just shits over the whole thing.  And we are all just letting him do it.",
                "American dollar stores are going to have to become $1.34 stores."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 1762,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "Republicans would call this judicial overreach",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "Good ruling...absolutely disgraceful how this played out.",
                "If there’s no lawsuit stemming from this I’d be very surprised.",
                "\n\nWell if he is in San Salvador prison chances are he is coming back with severe physical injuries are worse and Trump and Maga could careless. ",
                "Who knew that selling prisoners to a foreign work camp with no due process could lead to these kinds of mistakes?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "C.E.O. Choked Man Who Danced Barefoot on Cruise Ship, U.S. Says",
            "external_url": "https://www.nytimes.com/2025/04/03/us/ceo-choking-virgin-cruise.html?unlocked_article_code=1.9E4.lCTP.l-u2TGKPZe2C&smid=re-share",
            "upvotes": 3311,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Thought he was Tony Soprano telling that guy to take off his hat",
                "The White Lotus writers just got an idea for season 4",
                "Can’t handle someone dancing barefoot? Don’t go on a cruise. Better yet, don’t leave your house",
                "Passanger: \"I'm having such a great time on my vacation.\"\n\nCEO: \"I'LL FUCKING KILL YOU!\"",
                "Well he is rich so we all know the eventual outcome",
                "Is everyone going crazy!",
                "It’s weird to me this guy is going on a cruise with all the poors. Doesn’t he have his own yacht?",
                "The CEO can’t handle what to do when hearing “no,” or “f*** you,” or a middle finger. Because he surrounds himself with yes men at work, he expects the rest of his life to follow.",
                "So let me get this straight; dude was just vibing out then the perpetrator's wife, who can't mind their own fucking business, comes over to tell him to put on his shoes. He's like nah and gives her the bird then perp is like \"Know what's a really good idea? Fuck everyone's whole vibe up and attempt to kill someone.\" Yeah nah lock his ass up like anyone else would be. I don't give a flying fuck what company he leads.",
                "\"The altercation began shortly after Mr. DeGiorgio’s wife had confronted the man about barefoot dancing, telling him, “Look, we are all grown-ups here — can you put your shoes on?” Mr. DeGiorgio’s wife told investigators that the man had made a crude remark to her, and the security video showed him giving her the middle finger, according to the F.B.I.\n\nSo that was all it took for DeGiorgio to choke this man and threaten to kill him?  Because his shitty wife was ordering people to do what she wanted?   Oh fuck no.  Have fun in federal court, dickface."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump to grant TikTok another extension to avoid a U.S. ban",
            "external_url": "https://www.nbcnews.com/politics/politics-news/trump-tiktok-ban-extension-rcna199394",
            "upvotes": 1046,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tiktok-phone-ew-531p-f41d63.jpg",
            "top_comments": [
                "I'm old enough to remember when [Trump signed an EO to ban Tiktok](https://www.npr.org/2020/08/06/900019185/trump-signs-executive-order-that-will-effectively-ban-use-of-tiktok-in-the-u-s.).",
                "Did they agree to shove maga content on our fyp because that’s all I get now, ad naseum.",
                "Not that anyone cares about this kinda silly stuff, but the TikTok ban law doesn't actually allow him to do this.",
                "General reminder that these \"extensions\" are just Trump pinkie promising not to charge them for violating the law.\n\nMeaning either Trump or the next US President could at any moment go \"Sucks to be you I changed my mind\" and they would be absolutely screwed.",
                "Is that actually legal? I mean it clearly doesn't matter at this point but I still have to ask the question",
                "The year is 2028.  Trump has decided to give TikTok another extension.",
                "This is blatantly illegal. The law allowed one extension. Jesus fucking Christ Congress do your fucking jobs",
                "This is going to be Trump 2's version of the student loan payment pause during the pandemic. He's going to kick the can down the road for as long as he can on this since it's not something he can just repeal by EO.",
                "enjoy your bread and circus tiktokers",
                "lol China isn’t selling anything and with the love note they sent along with the retaliatory tariffs 🥭 had no leverage with them rn. He’s going to keep extending this his entire term."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "HOT",
            "title": "Palestinian man tortured to death by Hamas militants after criticizing group and attending protests, family says",
            "external_url": "https://www.cnn.com/2025/04/01/middleeast/uday-rabie-palestinian-tortured-hamas-intl-latam/index.html",
            "upvotes": 1542,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/whatsapp-image-2025-04-01-at-4-45-29-pm.jpeg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " Hamas has literally posted videos of themselves torturing or killing Palestinians who protested against them.  They used the ceasefire to settle old scores.\n\nThey post all these videos themselves in order to intimidate the opposition.  I won't post them because they are NSFL and I'd probably catch a ban but if anyone sends me a DM I will send you the links to the videos on other social media.  Again they are NSFL so don't say I didn't warn you",
                "I've said it before, you can support both Israel and Palestine. That is logically consistent.\n\nWhat you can't do is support both Hamas and Palestine. That is logically *inconsistent*.",
                "Reasonable people can say “Hamas commits atrocities and also Israeli govt is also doing other atrocities”",
                "Free Palestine …from Hamas.",
                "Does not fit the preferred narrative. Please downplay and ignore.",
                "[deleted]",
                "UN will report isreal did it",
                "Still wondering why Bibi had so much cash smuggled to Hamas back in the day and why the Israelis aren't crucifying him for it.",
                "Netanyahu kills tens of thousands of Palestinians, primarily women and children, but we get a news story about one Palestinian killed by Hamas. I'm so glad I decided against becoming a journalist.",
                "Just want to point everyones attention to israel actively murdering children, babies, and innocent civilians in palestine. Israel is the real terrorist"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "US NSA director Timothy Haugh fired, Washington Post reports",
            "external_url": "https://www.reuters.com/world/us/us-nsa-director-timothy-haugh-fired-washington-post-reports-2025-04-04/",
            "upvotes": 11965,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He testified at the senate hearing that there were risks to using Signal. When the team cheats but you don't, you get benched for not being a team player.",
                "Wonder if this is related to Laura Loomer's visit to the Oval Office yesterday that led to the firing of three NSC officials.",
                "The director and the No. 2 official at the National Security Agency were ousted from their positions Thursday, according to a defense official and three sources with knowledge of the matter.\n\nIt was not immediately clear why Air Force Gen. Timothy Haugh and his deputy were dismissed, the sources said.",
                "They have purged most of the military and intelligence agency leadership. Scary stuff. ",
                "He must have been too competent and not a toady.",
                "Oh, we're changing NSA oversight after a far right meeting with the president.\n\nYeah that sounds safe and in no way concerning.",
                "New NSA director will be hulk hogan mmw",
                "Because they were not \"loyal\"? How did this insidious concept creep into the administration vernacular without sounding alarm bells? People have forgotten how democracy works. Everyone isn't supposed to just agree with the President and do whatever he says.",
                "Reading up on him his studies were Russia related.  Can’t have a career intelligence officer that knows the in and out of Russia be the top spy.",
                "Trump is almost finished dismantling our intelligence apparatus.  Putin must be proud."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Sell-off worsens for markets worldwide after China retaliates against Trump's tariffs",
            "external_url": "https://apnews.com/article/market-rates-trump-tariffs-d86db525c370e9da834e6dfb76e23b86",
            "upvotes": 1359,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm amazed by how one man can do so much damage to the world. The power of the US President is astounding. And the best part is the US elected an old senile clown and gave him this power.",
                "I fear the global economy is about to fall off a precipise.",
                "If only Congress would do their job.\n\nBut maybe the other oligarchs will tire of this and force their hand.",
                "~~3200~~ ~~3500~~ 3800 off the Dow since Trump Liberated us.  I truly am tired of so much winning.\n\nBut hey, after today we'll be a whole 5% done with his Term.\n\n^^Is ^^10am ^^too ^^early ^^to ^^drink ^^an ^^entire ^^bottle ^^of ^^Jameson? ^^Asking ^^for ^^a ^^friend.\n\n*Edit *Edit",
                ">So far there are few, if any winners, in financial markets from the trade war.\n\nI bet Trumps billionaire buddies who had the inside info and shorted the market are making out like bandits.",
                "Hey Trump voters, are we winning yet?",
                "Not a peep about it on Fox News site. It really is a cancer on society.",
                "[deleted]",
                "So far I’ve been liberated from about 5 years of retirement. I’m tired of winning boss. ",
                "To get to FDR from Hoover, it took years of absolute misery for the electorate. Middle class people resorted to prostitution and theft. Poor people living in Hoovervilles larger then the small towns they left. Children starving to death on public roads begging for food. Old people dying alone in tents and hovels because of no money and government help. \n\n20-25% Unemployment. \n\nI fear to get from Trump to anyone sane will take a similar amount of time, and Trump and the people working him know his. That's why they are doing everything possible to make elections *impossible for anyone but the ruling party to win*. This is how it works in Russia and other Dictator/Oligarchic led countries. You can be pissed and angry at their actions all you want, all that matters is that come election day you either don't show up, the party in power makes it illegal for anyone supporting the opposition to vote, or the people counting the votes lie about the results.\n\nSo cry today if you like, but if what is happening now is pissing you off, remember that in a year and half there are ***midterms***, where you can register your anger. Don't let a single clown with an (R) by their name slide by. Challenge them everywhere, even in places where you have been told it's pointless.\n\nIf you were one of those people that thought nothing would actually change, or that both parties are the same, remember today... looking at your retirement savings as they drop through the floor. If you work at a business where people are now fearful of contracts, and jobs being cancelled... or wondering if you might be fired. Remember the panic and the fear and anger. Remember that when reasonable intelligent people warned you that you didn't listen, and then do something about it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 20582,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.\n\n>Kennedy said that the elimination of the Centers for Disease Control and Prevention’s **entire Lead Poisoning Prevention and Surveillance Branch** was among the mistakes.",
                "Award for the most incompetent government of all time?",
                "They fired thousands of employees trying to get a public relations win. Thats it.\n\nPathetic, amateur shit.",
                "The incompetence of this administration is just mind blowing...",
                "Everything the current administration does is a mistake",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them.",
                "How do you accidentally lay off people?",
                ">\"Personnel that should not have been cut, were cut. We're reinstating them. **And that was always the plan. Part of the DOGE, we talked about this from the beginning, is we're going to do 80% cuts, but 20% of those are going to have to be reinstated, because we'll make mistakes**,\" Kennedy said, speaking to reporters at a stop in Virginia.\n\nSo they purposely decided to be reckless and fuck with the lives and livelihoods of what, tens of thousands of people unnecessarily? Not to mention completely eliminating entire agencies that they will now have to hope they can somehow put back together again?\n\nWHAT THE FUCK WAS THE RUSH? Why did they try to speed run a four year term in four weeks? How is it a \"mistake\" when you purposely fuck shit up?? You literally cannot *plan to make a mistake*. They just planned to be destructive because they could. It's like Elon completely lapsed into insanity and smeared shit on the walls for weeks, and now Robert F. Kennedy of all people has to try to clean it up.\n\nHow can anyone, no matter how batshit crazy they are, stand there and expect what he is saying to be ok or seem normal to anyone?",
                "They're seriously just firing people to fire people. It's the dumbest concept in the world.\n\nIt's fine if it's your tech bro company, but not when it's the goddamn US government that the people of this country rely on."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 10,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Meta's content moderation contractor to cut 2,000 jobs in Barcelona",
            "external_url": "https://www.reuters.com/technology/metas-content-moderation-contractor-cuts-2000-jobs-barcelona-2025-04-04/",
            "upvotes": 9,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 1767,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "Republicans would call this judicial overreach",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "Good ruling...absolutely disgraceful how this played out.",
                "If there’s no lawsuit stemming from this I’d be very surprised.",
                "\n\nWell if he is in San Salvador prison chances are he is coming back with severe physical injuries are worse and Trump and Maga could careless. ",
                "Who knew that selling prisoners to a foreign work camp with no due process could lead to these kinds of mistakes?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Prosecutor Appeals Lack of Sentence in Student Rape Case",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/03/prosecutor-appeals-lack-of-sentence-in-student-rape-case/",
            "upvotes": 60,
            "date": "04/04/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2019/03/06/ebdd4a23-3ffb-11e9-abcc-02b7b76bf47f.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump to grant TikTok another extension to avoid a U.S. ban",
            "external_url": "https://www.nbcnews.com/politics/politics-news/trump-tiktok-ban-extension-rcna199394",
            "upvotes": 1048,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tiktok-phone-ew-531p-f41d63.jpg",
            "top_comments": [
                "I'm old enough to remember when [Trump signed an EO to ban Tiktok](https://www.npr.org/2020/08/06/900019185/trump-signs-executive-order-that-will-effectively-ban-use-of-tiktok-in-the-u-s.).",
                "Did they agree to shove maga content on our fyp because that’s all I get now, ad naseum.",
                "Not that anyone cares about this kinda silly stuff, but the TikTok ban law doesn't actually allow him to do this.",
                "General reminder that these \"extensions\" are just Trump pinkie promising not to charge them for violating the law.\n\nMeaning either Trump or the next US President could at any moment go \"Sucks to be you I changed my mind\" and they would be absolutely screwed.",
                "Is that actually legal? I mean it clearly doesn't matter at this point but I still have to ask the question",
                "The year is 2028.  Trump has decided to give TikTok another extension.",
                "This is blatantly illegal. The law allowed one extension. Jesus fucking Christ Congress do your fucking jobs",
                "This is going to be Trump 2's version of the student loan payment pause during the pandemic. He's going to kick the can down the road for as long as he can on this since it's not something he can just repeal by EO.",
                "enjoy your bread and circus tiktokers",
                "lol China isn’t selling anything and with the love note they sent along with the retaliatory tariffs 🥭 had no leverage with them rn. He’s going to keep extending this his entire term."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "NC Court of Appeals gives over 60,000 challenged voters 15 days to prove eligibility",
            "external_url": "https://www.newsobserver.com/news/politics-government/article302923039.html",
            "upvotes": 231,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm sure they will try real hard to contact all those voters",
                "The only way Republicans win is by cheating, and they're about to enfranchise cheating",
                "Straight up banana republic stuff, the NC Republican party is going to steal a Supreme Court seat over the will of voters.",
                "This is 100% stealing an election. These voters all voted, with ID. They're being challenged for procedural / clerical issues in their registration files (missing drivers license numbers or last four of social), but they were all verified as registered voters and presented ID when they did vote.",
                "Guilty until proven innocent. Got it.",
                "Republicans can just go fuck themselves.",
                "Why is onus on the voters to prove that they are eligible?  Shouldn't it be up to the challenger?  Are they saying the people who registered to vote aren't eligible?  In what grounds?  I think the accusers should bring forth their evidence and not just challenge and if there are evidences, they should be validated before getting people to come forth and 2 weeks is ridiculously short amount of time.",
                "Achtung! You vill show me your papers first!",
                "Republicans have been using vote challenges to try and steal elections since at least 2004. In the 2004 election they tried to stop me from voting with a vote Republican challenger at my polling location in Traverse City, Michigan. A lawyer hired by the Democratic party to keep an eye on such things overheard the situation and helped clear the challenge when I showed ID (again) to prove I was eligible to vote. I haven't voted for a Republican since. Seems they are still at it only now doing it after the fact so it's harder to remedy their pathetic attempts at undermining democracy and the will of the voters.",
                "And how, prey tell, does one \"prove\" their eligibility? The Republicans in charge of this can simply say any documentation provided is forged, or otherwise insufficient."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "At least 14 people killed and dozens injured in Russian missile attack on Ukrainian city Kryvyi Rih, local officials say",
            "external_url": "https://www.bbc.com/news/articles/c3wxe5g4z9yo",
            "upvotes": 100,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7a26/live/1aaa4a30-117c-11f0-b234-07dc7691c360.png",
            "top_comments": [
                "“We’re testing to see if the Russians are interested in peace,” Marco Rubio told journalists in Brussels after talks with Nato allies. “Their actions – not their words, their actions – will determine whether they’re serious or not, and we intend to find that out sooner rather than later.\n\nDid they fail the test already?",
                "A children's playground, a ballistic missile with a cluster warhead.  \n\nThis is what Russia does.",
                "russians are terrorists!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Tift County district attorney drops charges in fetus case",
            "external_url": "https://www.walb.com/2025/04/04/tift-county-district-attorney-drops-charges-fetus-case/",
            "upvotes": 265,
            "date": "04/04/2025",
            "thumbnail": "https://gray-walb-prod.gtv-cdn.com/resizer/v2/RNTOZKPKTBEWPIDJQWLILMUFFU.png?auth=870410d9e21a85185018ed4435941f1308624bff9e1db93e2c0679bfad30a1ce&width=1200&height=600&smart=true",
            "top_comments": [
                "> While law enforcement acted in good faith and responded to a very difficult and emotional situation, it’s now clear that no criminal law was violated\n\nHow is it acting in good faith if those in charge of enforcing the law don’t actually know the laws they’re supposed to be enforcing and subsequently wrongfully arrest people based on that? \n\nIf your job is literally enforcing laws, being ignorant of said laws should not be a viable defense nor should it be considered “acting in good faith”.",
                "Can she sue for wrongful arrest or something? Imagine going through the trauma of a miscarriage and then arrested and nationally harassed on top of everything.",
                "what a horrible situation to be in for her.",
                "They keep stressing \"the way she handled\" the remains of the contents of her uterus. What did they want her to do with it? Spontaneous abortions are usually flushed down the toilet, is a trash receptacle really worse?",
                "\"But my duty is not to punish what feels wrong — it is to uphold the law with fairness and integrity\"\n\nBullshit. She was arrested because it felt wrong to them. How about they do their investigations first before arresting her, running her name through the mud and posting her mugshot online.\n\nMy wife mad a miscarriage. She was devastated and so was I. Do you know would have made things worse? Arresting her and putting her in jail. The experience of a miscarriage both mentally and physically is absolutely horrendous. Then to have to deal with jail, lawyers, legal fees, etc. Not to mention the amount of resources, time and money spent on the \"investigation\" and autopsy.  \n\nOn top of that, they don't even have laws or guidelines on what to do with a miscarried fetus in the first place. \"He added that there is no specific Georgia statute or case law that addresses an individual’s choice to dispose of a naturally miscarried, non-viable fetus\"\n\nNow her name will be what comes up in Google for the rest of her life. Unbelievable. I hope she gets paid enough money so she can move out of Georgia."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Ex-Green Beret's wife accused of killing and dismembering him after he revealed divorce plans",
            "external_url": "https://www.nbcnews.com/news/us-news/ex-green-berets-wife-accused-killing-dismembering-revealed-divorce-pla-rcna199413",
            "upvotes": 503,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-clint-bonnell-mn-1955-94ac98.jpg",
            "top_comments": [
                ">Cloud’s attorney, James McRae Jr., told reporters that she is innocent and looks forward to her day in court.\n\nI know that's probably just something everyone says but when their school and(sigh) girlfriend report him missing but his wife who knew his vehicle was at home but couldn't find him didn't, it sure doesn't look like a good place to start.\n\nOn the other hand if I wanted to off someone doing it after they told their wife they were leaving them for their girlfriend would be a great way to do it. Imagine if in an irony if it was the girlfriend, nobody would see that coming.",
                "On Signal, I'm guessing",
                "Wow. Didn't want to give up the Tricare? Or did being a military spouse for 20+ years break her?",
                "Hell hath no fury like a woman scorned.",
                "[His wife](https://m.youtube.com/watch?v=8Tkkpfhd07s&t=7s)",
                "There are so many jokes I want to make but I won't because I'm better than this.",
                "Whatever gets that money, because SS is dead, right?!?  \nCAPITALISM!!",
                "[deleted]"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Sean 'Diddy' Combs latest: Federal prosecutors file 3rd superseding indictment",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-latest-federal-prosecutors-file-3rd/story?id=120488472&cid=social_twitter_abcn",
            "upvotes": 693,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/109e14c9-c718-4fb7-b6ce-283ef43d148b/sean-diddy-combs-ap-jef-250404_1743777196047_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“The new indictment against Combs adds an additional charge of sex trafficking and an additional charge of transportation to engage in prostitution, exposing Combs to the possibility of additional prison time if convicted.”\n\nTrial set to start May5th. Can’t imagine the horrific shit that will be exposed through trial.",
                "People like Diddy have no place in society. It’s unfortunate that this will likely be dragged out with victims old traumas being revisited. I hope they get paid and some sort of closure with it all.",
                "You have to be a complete piece of shit when federal prosecutors in both the Biden and Trump Administrations are nailing you to the wall.",
                "Bet anyone here $100 that Puffy eventually gets a pardon from Trump. ",
                "\"Fall of diddy\" is going to need another episode soon",
                "Thought I told you that we don’t stop, thought I told you that we don’t stop! 🎶",
                "Trump pardon incoming",
                "Send him soap on a rope",
                "If the government is even remotely close to having the same occult practices as hollywood and the music industry, he'll get off so they can keep the system \"in check.\"",
                "Who gives a shit. World economy is in shambles and you think I care about some old ass bullshit they’re gonna drag on for ages to distract from the chaos. Oh, hey! Did you hear about Russell Brand!??? Yeah, did, I don’t give a shit! Really, who the fuck does?? Oh no they won’t be showing Get Him To The Greek on Tubi anymore…jeez"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 1762,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "Republicans would call this judicial overreach",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "Good ruling...absolutely disgraceful how this played out.",
                "If there’s no lawsuit stemming from this I’d be very surprised.",
                "\n\nWell if he is in San Salvador prison chances are he is coming back with severe physical injuries are worse and Trump and Maga could careless. ",
                "Who knew that selling prisoners to a foreign work camp with no due process could lead to these kinds of mistakes?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "NC Court of Appeals gives over 60,000 challenged voters 15 days to prove eligibility",
            "external_url": "https://www.newsobserver.com/news/politics-government/article302923039.html",
            "upvotes": 232,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm sure they will try real hard to contact all those voters",
                "The only way Republicans win is by cheating, and they're about to enfranchise cheating",
                "Straight up banana republic stuff, the NC Republican party is going to steal a Supreme Court seat over the will of voters.",
                "This is 100% stealing an election. These voters all voted, with ID. They're being challenged for procedural / clerical issues in their registration files (missing drivers license numbers or last four of social), but they were all verified as registered voters and presented ID when they did vote.",
                "Guilty until proven innocent. Got it.",
                "Republicans can just go fuck themselves.",
                "Why is onus on the voters to prove that they are eligible?  Shouldn't it be up to the challenger?  Are they saying the people who registered to vote aren't eligible?  In what grounds?  I think the accusers should bring forth their evidence and not just challenge and if there are evidences, they should be validated before getting people to come forth and 2 weeks is ridiculously short amount of time.",
                "Achtung! You vill show me your papers first!",
                "Republicans have been using vote challenges to try and steal elections since at least 2004. In the 2004 election they tried to stop me from voting with a vote Republican challenger at my polling location in Traverse City, Michigan. A lawyer hired by the Democratic party to keep an eye on such things overheard the situation and helped clear the challenge when I showed ID (again) to prove I was eligible to vote. I haven't voted for a Republican since. Seems they are still at it only now doing it after the fact so it's harder to remedy their pathetic attempts at undermining democracy and the will of the voters.",
                "And how, prey tell, does one \"prove\" their eligibility? The Republicans in charge of this can simply say any documentation provided is forged, or otherwise insufficient."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump to grant TikTok another extension to avoid a U.S. ban",
            "external_url": "https://www.nbcnews.com/politics/politics-news/trump-tiktok-ban-extension-rcna199394",
            "upvotes": 1047,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tiktok-phone-ew-531p-f41d63.jpg",
            "top_comments": [
                "I'm old enough to remember when [Trump signed an EO to ban Tiktok](https://www.npr.org/2020/08/06/900019185/trump-signs-executive-order-that-will-effectively-ban-use-of-tiktok-in-the-u-s.).",
                "Did they agree to shove maga content on our fyp because that’s all I get now, ad naseum.",
                "Not that anyone cares about this kinda silly stuff, but the TikTok ban law doesn't actually allow him to do this.",
                "General reminder that these \"extensions\" are just Trump pinkie promising not to charge them for violating the law.\n\nMeaning either Trump or the next US President could at any moment go \"Sucks to be you I changed my mind\" and they would be absolutely screwed.",
                "Is that actually legal? I mean it clearly doesn't matter at this point but I still have to ask the question",
                "The year is 2028.  Trump has decided to give TikTok another extension.",
                "This is blatantly illegal. The law allowed one extension. Jesus fucking Christ Congress do your fucking jobs",
                "This is going to be Trump 2's version of the student loan payment pause during the pandemic. He's going to kick the can down the road for as long as he can on this since it's not something he can just repeal by EO.",
                "enjoy your bread and circus tiktokers",
                "lol China isn’t selling anything and with the love note they sent along with the retaliatory tariffs 🥭 had no leverage with them rn. He’s going to keep extending this his entire term."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Palestinian man tortured to death by Hamas militants after criticizing group and attending protests, family says",
            "external_url": "https://www.cnn.com/2025/04/01/middleeast/uday-rabie-palestinian-tortured-hamas-intl-latam/index.html",
            "upvotes": 1546,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/whatsapp-image-2025-04-01-at-4-45-29-pm.jpeg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " Hamas has literally posted videos of themselves torturing or killing Palestinians who protested against them.  They used the ceasefire to settle old scores.\n\nThey post all these videos themselves in order to intimidate the opposition.  I won't post them because they are NSFL and I'd probably catch a ban but if anyone sends me a DM I will send you the links to the videos on other social media.  Again they are NSFL so don't say I didn't warn you",
                "I've said it before, you can support both Israel and Palestine. That is logically consistent.\n\nWhat you can't do is support both Hamas and Palestine. That is logically *inconsistent*.",
                "Reasonable people can say “Hamas commits atrocities and also Israeli govt is also doing other atrocities”",
                "Free Palestine …from Hamas.",
                "Does not fit the preferred narrative. Please downplay and ignore.",
                "[deleted]",
                "UN will report isreal did it",
                "Still wondering why Bibi had so much cash smuggled to Hamas back in the day and why the Israelis aren't crucifying him for it.",
                "Netanyahu kills tens of thousands of Palestinians, primarily women and children, but we get a news story about one Palestinian killed by Hamas. I'm so glad I decided against becoming a journalist.",
                "Just want to point everyones attention to israel actively murdering children, babies, and innocent civilians in palestine. Israel is the real terrorist"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Ex-Green Beret's wife accused of killing and dismembering him after he revealed divorce plans",
            "external_url": "https://www.nbcnews.com/news/us-news/ex-green-berets-wife-accused-killing-dismembering-revealed-divorce-pla-rcna199413",
            "upvotes": 508,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-clint-bonnell-mn-1955-94ac98.jpg",
            "top_comments": [
                ">Cloud’s attorney, James McRae Jr., told reporters that she is innocent and looks forward to her day in court.\n\nI know that's probably just something everyone says but when their school and(sigh) girlfriend report him missing but his wife who knew his vehicle was at home but couldn't find him didn't, it sure doesn't look like a good place to start.\n\nOn the other hand if I wanted to off someone doing it after they told their wife they were leaving them for their girlfriend would be a great way to do it. Imagine if in an irony if it was the girlfriend, nobody would see that coming.",
                "On Signal, I'm guessing",
                "Wow. Didn't want to give up the Tricare? Or did being a military spouse for 20+ years break her?",
                "Hell hath no fury like a woman scorned.",
                "[His wife](https://m.youtube.com/watch?v=8Tkkpfhd07s&t=7s)",
                "There are so many jokes I want to make but I won't because I'm better than this.",
                "Whatever gets that money, because SS is dead, right?!?  \nCAPITALISM!!",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Sean 'Diddy' Combs latest: Federal prosecutors file 3rd superseding indictment",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-latest-federal-prosecutors-file-3rd/story?id=120488472&cid=social_twitter_abcn",
            "upvotes": 691,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/109e14c9-c718-4fb7-b6ce-283ef43d148b/sean-diddy-combs-ap-jef-250404_1743777196047_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“The new indictment against Combs adds an additional charge of sex trafficking and an additional charge of transportation to engage in prostitution, exposing Combs to the possibility of additional prison time if convicted.”\n\nTrial set to start May5th. Can’t imagine the horrific shit that will be exposed through trial.",
                "People like Diddy have no place in society. It’s unfortunate that this will likely be dragged out with victims old traumas being revisited. I hope they get paid and some sort of closure with it all.",
                "You have to be a complete piece of shit when federal prosecutors in both the Biden and Trump Administrations are nailing you to the wall.",
                "Bet anyone here $100 that Puffy eventually gets a pardon from Trump. ",
                "\"Fall of diddy\" is going to need another episode soon",
                "Thought I told you that we don’t stop, thought I told you that we don’t stop! 🎶",
                "Trump pardon incoming",
                "Send him soap on a rope",
                "If the government is even remotely close to having the same occult practices as hollywood and the music industry, he'll get off so they can keep the system \"in check.\"",
                "Who gives a shit. World economy is in shambles and you think I care about some old ass bullshit they’re gonna drag on for ages to distract from the chaos. Oh, hey! Did you hear about Russell Brand!??? Yeah, did, I don’t give a shit! Really, who the fuck does?? Oh no they won’t be showing Get Him To The Greek on Tubi anymore…jeez"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Colleges say the Trump administration is using new tactics to expel international students",
            "external_url": "https://apnews.com/article/college-international-student-f1-visa-ice-trump-7a1d186c06a5fdb2f64506dcf208105a",
            "upvotes": 1267,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR: student visas are getting revoked for unclear reasons, or for things that normally wouldn’t invite scrutiny, like traffic violations, without any clear connections to any protests whatsoever.\n\nEdit: oh yeah, they are getting legal status removed immediately as well, which previously wasn’t the case either",
                "Isolationism is just a standard part of the fascist authoritarian movement.",
                "As someone who's been an international student twice in my life--and been friends to countless ones in my home country--if I were an international student in the US right now I'd be trying my best to get out of the country ASAP.\n\n\nRight now the deportations seem to be mostly related to the war in Gaza so I'm sure many students think \"that has nothing to do with me; I'm safe,\" but what will the new reason be next month? And the month after that? The administration is straight-up anti-immigration and I guarantee that things are going to get worse, not better.",
                "Stupidity is the point. Colleges are Americans engaged in manufacturing Education ... and you should be happy foreigners are paying good money to buy our degrees. \n\nIsn't this one of the industries we should be growing for export?",
                "They’re sending their worst, most dangerous, most criminal…. Doctoral candidates. \n\nRepublicans sure do love a good brain drain.",
                "This is literally what we've been saying and were told we were making it up.",
                "The student in Alabama had a speeding ticket. This is ridiculous.",
                "Well it's a good thing universities aren't increasingly relying on international students for money. ",
                "Trump is just peanut butter and jelly because they got into school on their own merit. ",
                "If you wanted to destroy American colleges (especially public schools), you would prevent them from being able to get tuition from foreign students.  This will have terrible consequences for higher ed in the US (which is probably the point)."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 8493,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "I’m sure the comments and discourse will be very positive",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "I'm still on the fence about the whole thing.",
                "So I feel like this needs to be added, for the 'obviously Sullivan had an unfair advantage' crowd.\n\nI think [this](https://member.usafencing.org/details/tournaments/9012) was the event (fits the time and location).  Specifically in the Division IA Women's Foil, I don't see Sullivan's name in any other event.  \n\nSullivan ended up 24th out of 39, with Turner being 39th as DNF.\n\nIf Sullivan had an advantage, it appears to have been marginal at best.  If you are worried about the 'Majesty of competition', I should note that it does not appear the national news gave a damn about this competition until there was culture war content to be made out of the proceedings.",
                "Name one professional fencer off the top of your head."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Sell-off worsens for markets worldwide after China retaliates against Trump's tariffs",
            "external_url": "https://apnews.com/article/market-rates-trump-tariffs-d86db525c370e9da834e6dfb76e23b86",
            "upvotes": 1361,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm amazed by how one man can do so much damage to the world. The power of the US President is astounding. And the best part is the US elected an old senile clown and gave him this power.",
                "I fear the global economy is about to fall off a precipise.",
                "If only Congress would do their job.\n\nBut maybe the other oligarchs will tire of this and force their hand.",
                "~~3200~~ ~~3500~~ 3800 off the Dow since Trump Liberated us.  I truly am tired of so much winning.\n\nBut hey, after today we'll be a whole 5% done with his Term.\n\n^^Is ^^10am ^^too ^^early ^^to ^^drink ^^an ^^entire ^^bottle ^^of ^^Jameson? ^^Asking ^^for ^^a ^^friend.\n\n*Edit *Edit",
                ">So far there are few, if any winners, in financial markets from the trade war.\n\nI bet Trumps billionaire buddies who had the inside info and shorted the market are making out like bandits.",
                "Hey Trump voters, are we winning yet?",
                "Not a peep about it on Fox News site. It really is a cancer on society.",
                "[deleted]",
                "So far I’ve been liberated from about 5 years of retirement. I’m tired of winning boss. ",
                "To get to FDR from Hoover, it took years of absolute misery for the electorate. Middle class people resorted to prostitution and theft. Poor people living in Hoovervilles larger then the small towns they left. Children starving to death on public roads begging for food. Old people dying alone in tents and hovels because of no money and government help. \n\n20-25% Unemployment. \n\nI fear to get from Trump to anyone sane will take a similar amount of time, and Trump and the people working him know his. That's why they are doing everything possible to make elections *impossible for anyone but the ruling party to win*. This is how it works in Russia and other Dictator/Oligarchic led countries. You can be pissed and angry at their actions all you want, all that matters is that come election day you either don't show up, the party in power makes it illegal for anyone supporting the opposition to vote, or the people counting the votes lie about the results.\n\nSo cry today if you like, but if what is happening now is pissing you off, remember that in a year and half there are ***midterms***, where you can register your anger. Don't let a single clown with an (R) by their name slide by. Challenge them everywhere, even in places where you have been told it's pointless.\n\nIf you were one of those people that thought nothing would actually change, or that both parties are the same, remember today... looking at your retirement savings as they drop through the floor. If you work at a business where people are now fearful of contracts, and jobs being cancelled... or wondering if you might be fired. Remember the panic and the fear and anger. Remember that when reasonable intelligent people warned you that you didn't listen, and then do something about it."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Tift County district attorney drops charges in fetus case",
            "external_url": "https://www.walb.com/2025/04/04/tift-county-district-attorney-drops-charges-fetus-case/",
            "upvotes": 264,
            "date": "04/04/2025",
            "thumbnail": "https://gray-walb-prod.gtv-cdn.com/resizer/v2/RNTOZKPKTBEWPIDJQWLILMUFFU.png?auth=870410d9e21a85185018ed4435941f1308624bff9e1db93e2c0679bfad30a1ce&width=1200&height=600&smart=true",
            "top_comments": [
                "> While law enforcement acted in good faith and responded to a very difficult and emotional situation, it’s now clear that no criminal law was violated\n\nHow is it acting in good faith if those in charge of enforcing the law don’t actually know the laws they’re supposed to be enforcing and subsequently wrongfully arrest people based on that? \n\nIf your job is literally enforcing laws, being ignorant of said laws should not be a viable defense nor should it be considered “acting in good faith”.",
                "Can she sue for wrongful arrest or something? Imagine going through the trauma of a miscarriage and then arrested and nationally harassed on top of everything.",
                "what a horrible situation to be in for her.",
                "They keep stressing \"the way she handled\" the remains of the contents of her uterus. What did they want her to do with it? Spontaneous abortions are usually flushed down the toilet, is a trash receptacle really worse?",
                "\"But my duty is not to punish what feels wrong — it is to uphold the law with fairness and integrity\"\n\nBullshit. She was arrested because it felt wrong to them. How about they do their investigations first before arresting her, running her name through the mud and posting her mugshot online.\n\nMy wife mad a miscarriage. She was devastated and so was I. Do you know would have made things worse? Arresting her and putting her in jail. The experience of a miscarriage both mentally and physically is absolutely horrendous. Then to have to deal with jail, lawyers, legal fees, etc. Not to mention the amount of resources, time and money spent on the \"investigation\" and autopsy.  \n\nOn top of that, they don't even have laws or guidelines on what to do with a miscarried fetus in the first place. \"He added that there is no specific Georgia statute or case law that addresses an individual’s choice to dispose of a naturally miscarried, non-viable fetus\"\n\nNow her name will be what comes up in Google for the rest of her life. Unbelievable. I hope she gets paid enough money so she can move out of Georgia."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/04/2025 20:09:48 UTC"
}