{
    "posts": [
        {
            "category": "HOT",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 7748,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "Funny how \"the government spends too much, we need to save money\" always means cutting the programs that help people instead of ordering fewer fighter jets at the Pentagon.",
                "I fucking hate it here.",
                "Remind me what the point of all this is?  If they were serious about saving money, they've already failed.  The IRS has already said that they were kneecapped to the tune of $500B.  Nothing Elon or Trump have done will make up for that loss.  They're complete and utter failures.",
                "It’s a coup. Has always been a coup.",
                "And you thought what was in Taco Bell was mystery meat before…",
                "If you don't count the cases there is no disease! June 15, 2020 “When you test, you create cases.” President Donald J. Trump.\n\nSomehow, Americans voted again to have the guy as President."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "[CNN] Hooters files for bankruptcy",
            "external_url": "https://www.cnn.com/2025/03/31/business/hooters-restaurant-bankruptcy?cid=ios_app",
            "upvotes": 2624,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202903609.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can’t keep posting these types of things on April fools.",
                "I hope that doesn't screw up Sid's 5 year plan.",
                "Going out for wings at this point costs almost as much as steak.   I didn't mind hooters wings so much, but they were only worth about half what they cost lately. Typical private equity firms trying to squeeze customers until the business breaks.",
                "Some would say they've went tits up...",
                "In case you were wondering, they are owned by Private Equity.",
                "The fact they’re still around is surprising.",
                "NOT an April Fool's item. Obviously. How this brand survived as long as it has is a mystery of history.",
                "Thanks for the mammaries!",
                "Never been to one but from the anecdotes I've read here on reddit you could easily go to any random strip club and be served better food and booze while seeing more skin and skimpy outfits for the same price.",
                "Meh. Never understood how they stayed in business anyway. Got dragged their once by a coworker because \"they have the best wings.\"\n\nSpoiler: they did not.\n\nMeh beer, meh food, and, as an ex-waiter, the whole concept of waiting and being *expected* to flirt is abhorrent."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 2107,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt.",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "Wow. What a fucking shithole country"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 725,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "Yeah the law very clearly violated state laws regarding freedom of travel. States, for example, cant implement tariffs on goods imported to the state.",
                "And que Cons freaking out about activist judges.",
                "I can’t wait for the new country song to drop. They finally have new material."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "China holds military drills around Taiwan, calling its president a 'parasite'",
            "external_url": "https://www.nbcnews.com/news/world/china-holds-military-drills-taiwan-calling-president-parasite-rcna198998",
            "upvotes": 1275,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-taiwan-mb-0744-e72a4d.jpg",
            "top_comments": [
                "Typical authoritarian rhetoric. Escalating aggression and then blaming it on their victims.",
                "Meanwhile their biggest \"ally\" is too busy performing the bathroom scene from \"Liar Liar\"",
                "I believe Taiwan has measures in place to blow up all the semiconductor plants if PRC takes over.  It will be a pyrrhic victory if PRC wins.",
                "I swear to god if the orange motherfucker sets us back 10 years in semiconductor technology...",
                "Everything indicates that the world is preparing for World War III....",
                "It seems to be a universal trait of authoritarian governments and rulers that they have no sense of irony. We in the US should know.",
                "Where were you when World War 3 started?",
                "looks like another war",
                "That sounds exactly like what Trump would say.",
                "Can countries please chill \nI hate this goddamn timeline enough already"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Putin begins biggest Russian military call-up in years",
            "external_url": "https://www.bbc.co.uk/news/articles/c36718p52eyo",
            "upvotes": 568,
            "date": "04/01/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/155e/live/f670c2c0-0f0a-11f0-9021-b1661f716c64.jpg",
            "top_comments": [
                "How many of these people will run away or not even get a gun?",
                "It looks like Trump didn't end this war in one day like he promised on the campaign trail. Oh well, his supporters will never notice because facts aren't important to them.",
                "From where? Hasn't he already killed off something like 500,000 of his own men?",
                "Surrender early, so you don't die right away.",
                "24 hours to end the war btw.",
                "No shortage of natural sunflower fertilizer is how I look at it.",
                "Poopy pants is realizing his mortality and doing everything he can to make himself look powerful.",
                "President poopy pants said 24 hours!!!! I thought he would mother fucking art of the deal this war, but he shit the bed. Figuratively this time. He literally does it nightly.",
                "Putin calling all his tools to help.\n\nJD, Donald -- master awaits you.",
                "Except now even the guarantee you will only serve in country doesn’t protect you from getting your shit blasted by a drone"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "SEC continuing $150 million lawsuit against Elon Musk over Twitter purchase",
            "external_url": "https://abcnews.go.com/US/sec-continuing-150-million-lawsuit-elon-musk-twitter/story?id=120343524",
            "upvotes": 46124,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e6250cc-4123-4551-b325-04f24c8dc133/elon-musk-5-gty-gmh-250324_1742835839454_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unless they bump that up to 150 billion, this is a symbolic gesture at best.  Dude spent 150 million on election tampering in the past week.",
                "It's.... depressing.. that I even have to ask if the SEC is one of the things Musk is using DOGE to gut, because it's one of the places that is a check on him.\n\nI'm going to say ehhhh.... probably. Probably it is. That's our timeline.",
                "Sounds like doge will be making another round of cuts at the SEC.",
                "Didn't he just pay himself $43 billion to buy his own company?",
                "150 million to a billionaire is the equivalent to $150 to a thousandaire.\n150 million to a half-trillionaire is about 30 cents by the same scale. \nOnce a fine hits a certain threshold, mandatory jail time needs to be included because the numbers are just meaningless at that point.",
                "How much is that translated to normal people money, let’s say with an income of 50k a year? About $20?",
                "In other news, the FBI has raided the SEC and locked them out of their own buildings permanently.",
                "Remember, any law that can be paid with a fine less than the amount stolen is not a law at all.",
                "*\"They spend their time on s--- like this when there are so many actual crimes that go unpunished,\" Musk said on X in January in response to the SEC's suit.*\n\nThe flimflam man himself. He spends all his time breaking into critical govt agencies, running roughshod over people's privacy, and leeching off (his businesses) govt subsidies, grants, and other freebies  Lock him up",
                "So he's going to fire the SEC now I take it? Canadian here. I'm sure you're going to say he can't do that, and I'm going to counter with look what he's done already. Anything is possible. There are no more laws in the US."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Stocks close out their worst quarter since 2022 amid tariff uncertainty",
            "external_url": "https://www.nbcnews.com/business/markets/stocks-close-worst-quarter-2022-tariff-uncertainty-rcna198956",
            "upvotes": 7114,
            "date": "03/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250331-nyse-se-352p-94b957.jpg",
            "top_comments": [
                "Elect someone who bankrupted businesses including a casino, what could possibly go wrong?",
                "Worst quarter so far. We are heading for stagflation or recession.",
                "Worst part about this: It’s ENTIRELY self-inflicted.",
                "And MAGA cheers like the cult they are",
                "Dude gets an absolute full mushroom knowing he can fuck with the global economy, he doesn’t give a shit about the destruction he creates, lives ruined along the way. He is literally the absolute worst person to sit as chief of the USA. This is all self inflicted and completely unnecessary. He is the antichrist, at least until the anti christ comes. \n\nIt's a mess, aint it Sheriff? If it aint it'll do till a mess gets here.” Cormac McCarthy, No Country for Old Men…",
                "Instead of the title saying *amid tariff uncertainty* it should have said *amid unnecessary tariffs*.",
                "Homer Simpson with hand on the shoulder of a depressed looking Bart.\n\nWorst quarter since 2022 so far!",
                "I may not be able to tell you what Trump will do next, but I can tell you, with certainty, that it will be something stupid.",
                "No way to have predicted this says only nation where this routinely happens.",
                "Right-wingers blamed Biden for that in ‘22 and are now dead silent about Trump’s impact on the market. I guess when the economy’s bad, it’s only actually bad if a person you don’t like is President at the time"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Musk’s Doge gains access to federal payroll system despite staff warnings",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doge-musk-federal-payroll-system",
            "upvotes": 11647,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e3f43e9cc78633a9e49656eb6107bb486b02293e/0_3_2576_1547/master/2576.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=534e11295e837b3697e20ffbe4f23a49",
            "top_comments": [
                "- The memo, reviewed by the Times, stated that “such elevated access to critical high-value asset systems is rare with respect to individual systems and no single [Department of Interior] official presently has access to all HR, payroll and credentialing systems.”\n\n- The memo emphasized that gaining administrative access to the system “typically requires training and certification”.\n\n- “Without formal qualifications, the Department may experience significant failure because of operator error,” the memo said.\n\nNothing to see here, everything is fine folks. I'm sure these professionals are more than qualified to safeguard almost 275k personnel records. I'm sure nothing bad will ever come of this.",
                "Musk is a threat to all americans.\n\nEdit: musk is a threat to all people.",
                "Facts:\n\n1. Elon Musk is a bitch.\n\n2. Fuck that guy\n\n3. Elon Musk is a threat to America\n\n4. Elon Musk is a huge bitch.",
                "*With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers, according to the Times, citing the two people with knowledge who spoke with the newspaper on condition of anonymity due to fear of retribution.*\n\n\"Fear of retribution\" makes sense because this group of henchmen are all about reprisals and power.",
                "How are republicans spinning this one?",
                "We are living a Bond film, where the villain is incompetent, yet with no Bond to stop him, he just ruins a country.  This is such an unbelievable fucking nightmare.",
                "This is such bullshit. The lawless administration thinks they can do whatever they damn well please.",
                "I believe, also, despite court orders. I wonder when the media is just going to start calling them grifters, like they are.",
                "> In a statement, a spokesperson for the interior department said: “We are working to execute the President’s directive to cut costs and make the government more efficient for the American people and have taken actions to implement President Trump’s Executive Orders.”\n\nThese people are fucking cowards.",
                "Remember only about a month ago when our politicians agreed DOGE shouldn't have access to this info nor have the power to fire people? \n\n\n\nPaychecks have already been delayed. Yet another grim reminder that our democracy is actively being dismantled from the inside while elected officials on BOTH sides cosign this circus."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says",
            "external_url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/",
            "upvotes": 34569,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It speaks volumes when you get China, Japan and South Korea to unite and agree on something.",
                "Trump successfully uniting the world, against the United States.",
                "America truly unites the world.",
                "It's going to be one hot, long and memorable summer here in America.",
                "Congratulations Republicans, you got our biggest allies against China to team up with China! So much winning!",
                "All three countries are vital to US business as suppliers.\n\nDo the anti-globalists even care that world wide trade made the US the wealthiest country in the world?",
                "What the fuck…. He got South Korea and Japan to work together. With CHINA. To make a statement against the US.\n\nIf it wasn’t so fucking sad and terrifying, I’d almost be impressed.",
                "List of allies we have alienated in less than 3 months:\n\n* Canada\n* Mexico\n* Japan\n* South Korea\n* Ukraine\n* France\n* Denmark\n* Great Britain\n\nDid I miss anyone? Australia?\n\nEDIT: Italy, Spain with the wine tax.\n\nEDIT2: Yeah, all of Europe minus Russia.",
                "Wow it took Donald Trump to get China and South Korea to get over their disdain of Japan and work together.\n\nTrump should get the Nobel Peace Prize.",
                "We’ve somehow managed to unite the trio of hatred between these countries into hating us. It’s actually fucking impressive"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Atlanta Fed GDPNOW -3.7% Q1 2025 Estimate",
            "external_url": "https://www.atlantafed.org/cqer/research/gdpnow",
            "upvotes": 2,
            "date": "04/01/2025",
            "thumbnail": "https://www.atlantafed.org/-/media/Images/cqer/research/gdpnow/specific/desktop/gallery.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 17,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "DOJ to seek death penalty for Luigi Mangione in CEO murder case",
            "external_url": "https://www.cnbc.com/2025/04/01/luigi-mangione-death-penalty-brian-thompson.html",
            "upvotes": 37,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105896-1740169753823-gettyimages-2200303541-AFP_36YC6PW.jpeg?v=1740169967&w=1920&h=1080",
            "top_comments": [
                "I still don't understand why the DoJ is even involved. This shouldn't be a federal case. It should be handled by the state of New York",
                "Never going to happen, this administration is so performative",
                "And the story is buried",
                "What a surprise.\n\nAnd the execution will probably be streamed pay per view on X.",
                "Here’s to you, Nikola and Bart  ",
                "Surely the American public will take this calmly.",
                "Not surprising. Do I think the jury is going to recommend the death penalty? My gut says no, but I think life is still on the table "
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 728,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "Yeah the law very clearly violated state laws regarding freedom of travel. States, for example, cant implement tariffs on goods imported to the state.",
                "And que Cons freaking out about activist judges.",
                "I can’t wait for the new country song to drop. They finally have new material."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Putin begins biggest Russian military call-up in years",
            "external_url": "https://www.bbc.co.uk/news/articles/c36718p52eyo",
            "upvotes": 572,
            "date": "04/01/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/155e/live/f670c2c0-0f0a-11f0-9021-b1661f716c64.jpg",
            "top_comments": [
                "How many of these people will run away or not even get a gun?",
                "It looks like Trump didn't end this war in one day like he promised on the campaign trail. Oh well, his supporters will never notice because facts aren't important to them.",
                "From where? Hasn't he already killed off something like 500,000 of his own men?",
                "Surrender early, so you don't die right away.",
                "24 hours to end the war btw.",
                "No shortage of natural sunflower fertilizer is how I look at it.",
                "Poopy pants is realizing his mortality and doing everything he can to make himself look powerful.",
                "President poopy pants said 24 hours!!!! I thought he would mother fucking art of the deal this war, but he shit the bed. Figuratively this time. He literally does it nightly.",
                "Putin calling all his tools to help.\n\nJD, Donald -- master awaits you.",
                "Except now even the guarantee you will only serve in country doesn’t protect you from getting your shit blasted by a drone"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "[CNN] Hooters files for bankruptcy",
            "external_url": "https://www.cnn.com/2025/03/31/business/hooters-restaurant-bankruptcy?cid=ios_app",
            "upvotes": 2625,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202903609.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can’t keep posting these types of things on April fools.",
                "I hope that doesn't screw up Sid's 5 year plan.",
                "Going out for wings at this point costs almost as much as steak.   I didn't mind hooters wings so much, but they were only worth about half what they cost lately. Typical private equity firms trying to squeeze customers until the business breaks.",
                "Some would say they've went tits up...",
                "In case you were wondering, they are owned by Private Equity.",
                "The fact they’re still around is surprising.",
                "NOT an April Fool's item. Obviously. How this brand survived as long as it has is a mystery of history.",
                "Thanks for the mammaries!",
                "Never been to one but from the anecdotes I've read here on reddit you could easily go to any random strip club and be served better food and booze while seeing more skin and skimpy outfits for the same price.",
                "Meh. Never understood how they stayed in business anyway. Got dragged their once by a coworker because \"they have the best wings.\"\n\nSpoiler: they did not.\n\nMeh beer, meh food, and, as an ex-waiter, the whole concept of waiting and being *expected* to flirt is abhorrent."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 2104,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt.",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "Wow. What a fucking shithole country"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Amish buggies targeted in armed robberies: Police",
            "external_url": "https://abcnews.go.com/US/amish-buggies-targeted-armed-robberies-police/story?id=120327640",
            "upvotes": 140,
            "date": "04/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/39362953-9010-4615-9a31-331dd4395366/amish-horse-buggy-gty-jef-250331_1743441122520_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Most Amish avoid debt and prefer to pay with cash. Only around 20% have a credit card. Many use checking accounts and debit cards. This all varies depending on the specific community and individual.",
                "From a Robin Williams interview on Bravo years ago:\n\nQ. What goes \"Klop-Klop-Klop-BANG\"  A: An Amish drive-by shooting\n\nQ: What do you call an Amish man with his arm up a horse's butt?   A:A mechanic",
                "Wasn't there a show awhile back about some Amish Mafia?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "China holds military drills around Taiwan, calling its president a 'parasite'",
            "external_url": "https://www.nbcnews.com/news/world/china-holds-military-drills-taiwan-calling-president-parasite-rcna198998",
            "upvotes": 1275,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-taiwan-mb-0744-e72a4d.jpg",
            "top_comments": [
                "Typical authoritarian rhetoric. Escalating aggression and then blaming it on their victims.",
                "Meanwhile their biggest \"ally\" is too busy performing the bathroom scene from \"Liar Liar\"",
                "I believe Taiwan has measures in place to blow up all the semiconductor plants if PRC takes over.  It will be a pyrrhic victory if PRC wins.",
                "I swear to god if the orange motherfucker sets us back 10 years in semiconductor technology...",
                "Everything indicates that the world is preparing for World War III....",
                "It seems to be a universal trait of authoritarian governments and rulers that they have no sense of irony. We in the US should know.",
                "Where were you when World War 3 started?",
                "looks like another war",
                "That sounds exactly like what Trump would say.",
                "Can countries please chill \nI hate this goddamn timeline enough already"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 7742,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "Funny how \"the government spends too much, we need to save money\" always means cutting the programs that help people instead of ordering fewer fighter jets at the Pentagon.",
                "I fucking hate it here.",
                "Remind me what the point of all this is?  If they were serious about saving money, they've already failed.  The IRS has already said that they were kneecapped to the tune of $500B.  Nothing Elon or Trump have done will make up for that loss.  They're complete and utter failures.",
                "It’s a coup. Has always been a coup.",
                "And you thought what was in Taco Bell was mystery meat before…",
                "If you don't count the cases there is no disease! June 15, 2020 “When you test, you create cases.” President Donald J. Trump.\n\nSomehow, Americans voted again to have the guy as President."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 734,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "Yeah the law very clearly violated state laws regarding freedom of travel. States, for example, cant implement tariffs on goods imported to the state.",
                "And que Cons freaking out about activist judges.",
                "I can’t wait for the new country song to drop. They finally have new material."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 2112,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt.",
                "But I was told things like this wouldn’t happen!?",
                "They will use the same arguments when they start shipping US citizens into CECOT",
                "Wow. What a fucking shithole country"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 7763,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "Funny how \"the government spends too much, we need to save money\" always means cutting the programs that help people instead of ordering fewer fighter jets at the Pentagon.",
                "I fucking hate it here.",
                "Remind me what the point of all this is?  If they were serious about saving money, they've already failed.  The IRS has already said that they were kneecapped to the tune of $500B.  Nothing Elon or Trump have done will make up for that loss.  They're complete and utter failures.",
                "It’s a coup. Has always been a coup.",
                "And you thought what was in Taco Bell was mystery meat before…",
                "If you don't count the cases there is no disease! June 15, 2020 “When you test, you create cases.” President Donald J. Trump.\n\nSomehow, Americans voted again to have the guy as President."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Putin begins biggest Russian military call-up in years",
            "external_url": "https://www.bbc.co.uk/news/articles/c36718p52eyo",
            "upvotes": 570,
            "date": "04/01/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/155e/live/f670c2c0-0f0a-11f0-9021-b1661f716c64.jpg",
            "top_comments": [
                "How many of these people will run away or not even get a gun?",
                "It looks like Trump didn't end this war in one day like he promised on the campaign trail. Oh well, his supporters will never notice because facts aren't important to them.",
                "From where? Hasn't he already killed off something like 500,000 of his own men?",
                "Surrender early, so you don't die right away.",
                "24 hours to end the war btw.",
                "No shortage of natural sunflower fertilizer is how I look at it.",
                "Poopy pants is realizing his mortality and doing everything he can to make himself look powerful.",
                "President poopy pants said 24 hours!!!! I thought he would mother fucking art of the deal this war, but he shit the bed. Figuratively this time. He literally does it nightly.",
                "Putin calling all his tools to help.\n\nJD, Donald -- master awaits you.",
                "Except now even the guarantee you will only serve in country doesn’t protect you from getting your shit blasted by a drone"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "[CNN] Hooters files for bankruptcy",
            "external_url": "https://www.cnn.com/2025/03/31/business/hooters-restaurant-bankruptcy?cid=ios_app",
            "upvotes": 2628,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202903609.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can’t keep posting these types of things on April fools.",
                "I hope that doesn't screw up Sid's 5 year plan.",
                "Going out for wings at this point costs almost as much as steak.   I didn't mind hooters wings so much, but they were only worth about half what they cost lately. Typical private equity firms trying to squeeze customers until the business breaks.",
                "Some would say they've went tits up...",
                "In case you were wondering, they are owned by Private Equity.",
                "The fact they’re still around is surprising.",
                "NOT an April Fool's item. Obviously. How this brand survived as long as it has is a mystery of history.",
                "Thanks for the mammaries!",
                "Never been to one but from the anecdotes I've read here on reddit you could easily go to any random strip club and be served better food and booze while seeing more skin and skimpy outfits for the same price.",
                "Meh. Never understood how they stayed in business anyway. Got dragged their once by a coworker because \"they have the best wings.\"\n\nSpoiler: they did not.\n\nMeh beer, meh food, and, as an ex-waiter, the whole concept of waiting and being *expected* to flirt is abhorrent."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China holds military drills around Taiwan, calling its president a 'parasite'",
            "external_url": "https://www.nbcnews.com/news/world/china-holds-military-drills-taiwan-calling-president-parasite-rcna198998",
            "upvotes": 1278,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-taiwan-mb-0744-e72a4d.jpg",
            "top_comments": [
                "Typical authoritarian rhetoric. Escalating aggression and then blaming it on their victims.",
                "Meanwhile their biggest \"ally\" is too busy performing the bathroom scene from \"Liar Liar\"",
                "I believe Taiwan has measures in place to blow up all the semiconductor plants if PRC takes over.  It will be a pyrrhic victory if PRC wins.",
                "I swear to god if the orange motherfucker sets us back 10 years in semiconductor technology...",
                "Everything indicates that the world is preparing for World War III....",
                "It seems to be a universal trait of authoritarian governments and rulers that they have no sense of irony. We in the US should know.",
                "Where were you when World War 3 started?",
                "looks like another war",
                "That sounds exactly like what Trump would say.",
                "Can countries please chill \nI hate this goddamn timeline enough already"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "SEC continuing $150 million lawsuit against Elon Musk over Twitter purchase",
            "external_url": "https://abcnews.go.com/US/sec-continuing-150-million-lawsuit-elon-musk-twitter/story?id=120343524",
            "upvotes": 46130,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e6250cc-4123-4551-b325-04f24c8dc133/elon-musk-5-gty-gmh-250324_1742835839454_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unless they bump that up to 150 billion, this is a symbolic gesture at best.  Dude spent 150 million on election tampering in the past week.",
                "It's.... depressing.. that I even have to ask if the SEC is one of the things Musk is using DOGE to gut, because it's one of the places that is a check on him.\n\nI'm going to say ehhhh.... probably. Probably it is. That's our timeline.",
                "Sounds like doge will be making another round of cuts at the SEC.",
                "Didn't he just pay himself $43 billion to buy his own company?",
                "150 million to a billionaire is the equivalent to $150 to a thousandaire.\n150 million to a half-trillionaire is about 30 cents by the same scale. \nOnce a fine hits a certain threshold, mandatory jail time needs to be included because the numbers are just meaningless at that point.",
                "How much is that translated to normal people money, let’s say with an income of 50k a year? About $20?",
                "In other news, the FBI has raided the SEC and locked them out of their own buildings permanently.",
                "Remember, any law that can be paid with a fine less than the amount stolen is not a law at all.",
                "*\"They spend their time on s--- like this when there are so many actual crimes that go unpunished,\" Musk said on X in January in response to the SEC's suit.*\n\nThe flimflam man himself. He spends all his time breaking into critical govt agencies, running roughshod over people's privacy, and leeching off (his businesses) govt subsidies, grants, and other freebies  Lock him up",
                "So he's going to fire the SEC now I take it? Canadian here. I'm sure you're going to say he can't do that, and I'm going to counter with look what he's done already. Anything is possible. There are no more laws in the US."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Stocks close out their worst quarter since 2022 amid tariff uncertainty",
            "external_url": "https://www.nbcnews.com/business/markets/stocks-close-worst-quarter-2022-tariff-uncertainty-rcna198956",
            "upvotes": 7107,
            "date": "03/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250331-nyse-se-352p-94b957.jpg",
            "top_comments": [
                "Elect someone who bankrupted businesses including a casino, what could possibly go wrong?",
                "Worst quarter so far. We are heading for stagflation or recession.",
                "Worst part about this: It’s ENTIRELY self-inflicted.",
                "And MAGA cheers like the cult they are",
                "Dude gets an absolute full mushroom knowing he can fuck with the global economy, he doesn’t give a shit about the destruction he creates, lives ruined along the way. He is literally the absolute worst person to sit as chief of the USA. This is all self inflicted and completely unnecessary. He is the antichrist, at least until the anti christ comes. \n\nIt's a mess, aint it Sheriff? If it aint it'll do till a mess gets here.” Cormac McCarthy, No Country for Old Men…",
                "Instead of the title saying *amid tariff uncertainty* it should have said *amid unnecessary tariffs*.",
                "Homer Simpson with hand on the shoulder of a depressed looking Bart.\n\nWorst quarter since 2022 so far!",
                "I may not be able to tell you what Trump will do next, but I can tell you, with certainty, that it will be something stupid.",
                "No way to have predicted this says only nation where this routinely happens.",
                "Right-wingers blamed Biden for that in ‘22 and are now dead silent about Trump’s impact on the market. I guess when the economy’s bad, it’s only actually bad if a person you don’t like is President at the time"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Musk’s Doge gains access to federal payroll system despite staff warnings",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doge-musk-federal-payroll-system",
            "upvotes": 11640,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e3f43e9cc78633a9e49656eb6107bb486b02293e/0_3_2576_1547/master/2576.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=534e11295e837b3697e20ffbe4f23a49",
            "top_comments": [
                "- The memo, reviewed by the Times, stated that “such elevated access to critical high-value asset systems is rare with respect to individual systems and no single [Department of Interior] official presently has access to all HR, payroll and credentialing systems.”\n\n- The memo emphasized that gaining administrative access to the system “typically requires training and certification”.\n\n- “Without formal qualifications, the Department may experience significant failure because of operator error,” the memo said.\n\nNothing to see here, everything is fine folks. I'm sure these professionals are more than qualified to safeguard almost 275k personnel records. I'm sure nothing bad will ever come of this.",
                "Musk is a threat to all americans.\n\nEdit: musk is a threat to all people.",
                "Facts:\n\n1. Elon Musk is a bitch.\n\n2. Fuck that guy\n\n3. Elon Musk is a threat to America\n\n4. Elon Musk is a huge bitch.",
                "*With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers, according to the Times, citing the two people with knowledge who spoke with the newspaper on condition of anonymity due to fear of retribution.*\n\n\"Fear of retribution\" makes sense because this group of henchmen are all about reprisals and power.",
                "How are republicans spinning this one?",
                "We are living a Bond film, where the villain is incompetent, yet with no Bond to stop him, he just ruins a country.  This is such an unbelievable fucking nightmare.",
                "This is such bullshit. The lawless administration thinks they can do whatever they damn well please.",
                "I believe, also, despite court orders. I wonder when the media is just going to start calling them grifters, like they are.",
                "> In a statement, a spokesperson for the interior department said: “We are working to execute the President’s directive to cut costs and make the government more efficient for the American people and have taken actions to implement President Trump’s Executive Orders.”\n\nThese people are fucking cowards.",
                "Remember only about a month ago when our politicians agreed DOGE shouldn't have access to this info nor have the power to fire people? \n\n\n\nPaychecks have already been delayed. Yet another grim reminder that our democracy is actively being dismantled from the inside while elected officials on BOTH sides cosign this circus."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says",
            "external_url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/",
            "upvotes": 34571,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It speaks volumes when you get China, Japan and South Korea to unite and agree on something.",
                "Trump successfully uniting the world, against the United States.",
                "America truly unites the world.",
                "It's going to be one hot, long and memorable summer here in America.",
                "Congratulations Republicans, you got our biggest allies against China to team up with China! So much winning!",
                "All three countries are vital to US business as suppliers.\n\nDo the anti-globalists even care that world wide trade made the US the wealthiest country in the world?",
                "What the fuck…. He got South Korea and Japan to work together. With CHINA. To make a statement against the US.\n\nIf it wasn’t so fucking sad and terrifying, I’d almost be impressed.",
                "List of allies we have alienated in less than 3 months:\n\n* Canada\n* Mexico\n* Japan\n* South Korea\n* Ukraine\n* France\n* Denmark\n* Great Britain\n\nDid I miss anyone? Australia?\n\nEDIT: Italy, Spain with the wine tax.\n\nEDIT2: Yeah, all of Europe minus Russia.",
                "Wow it took Donald Trump to get China and South Korea to get over their disdain of Japan and work together.\n\nTrump should get the Nobel Peace Prize.",
                "We’ve somehow managed to unite the trio of hatred between these countries into hating us. It’s actually fucking impressive"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/01/2025 16:09:46 UTC"
}