{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 14560,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "This ruling won't last long, but the damage sure will",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "Our country is a fucking joke",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US corporate profits decrease sharply in first quarter",
            "external_url": "https://www.reuters.com/world/us/us-corporate-profits-decrease-sharply-first-quarter-2025-05-29/",
            "upvotes": 5568,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gee, wonder why people didn't want to spend so much money? Guess we'll never know.",
                "Wonder how much longer the corporations are going to let TACO eat them for lunch.",
                "Wharton should lose all accreditation and prestige. I don't know how they are considered one of the top business schools when they allowed Trump to graduate with a economics degree.",
                "I am *so* shocked. No one could have seen this coming..",
                "Tariffs create artificial pressure to not do business?  Who knew!!",
                "We must fire the  Bureau of Economic Analysis immediately to prevent this from happening.",
                "Cue the stock market irrationally going up tomorrow.",
                "Have you tried rapidly flicking the tariff switch off and on a few times?",
                "[deleted]",
                "All I know is that since rump took office, something like 50% of the labor hours at my company have gone into trying to find loopholes and workarounds to help us skirt the tariffs. I imagine that most US companies that manufacture internationally are in a similar position. \n\n\n What projects has your company had to put on hold while everyone tries to just figure out how to do business in this environment? So much effort just to try to stay afloat. Forget about advancement, development, innovation, etc. \n\n\n Such a waste."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 2074,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "Are we surprised? No, not at all.",
                "A government so small it can take your land and rights on a whim.",
                "Another day older and deeper in debt",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society.",
                "FAFO. \nThey voted for this.",
                "How is this not eminent domain?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 8186,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "“I need you to be activist judges to stop the activist judges”",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court.",
                "Why are they activist judges.  Jesus why can’t people tone down on the rhetoric.  They’re judges following the rule of law.  The congress is supposed to control taxation not the president."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 7155,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "This literally made my stomach turn. Wtaf?!",
                "[removed]",
                ">”A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.”\n\nSick freaks"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 2935,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing.",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!",
                "It has Harvard, illegal, and embryo in the title. It’s a MAGA wet dream."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
            "external_url": "https://apnews.com/article/election-officials-threat-colorado-years-prison-a50f82a9fbad6ebf72eafef189a06f38",
            "upvotes": 1351,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It wasn’t my fault - I listened to people who claimed they’re the party of personal responsibility- how can *I* be blamed for my actions?”",
                "Online threats are literally how MAGA is controlling the GOP - any Republican member of the house or Senate that steps out of line gets called out by name and tagged on Twitter by Trump's dirtbag propagandist influencers. They are quickly brigaded by legions of maga Twitter incels and bots, replies filled with hate and threats until they bend the knee. This is how they go after judges too. I'm telling you, Twitter needs to be fucking purged entirely, along with its owner.",
                "Trump will pardon him.  As long as he broke the law to protect the fascist state trump will pardon him.",
                ">A judge sentenced a man who blamed exposure to far-right extremist content for motivating his online threats to kill Democratic election officials in Colorado and Arizona to three years in prison Thursday, saying the penalty for such “keyboard terrorism” needed to be serious enough to deter others from doing the same.\n\n>U.S. District Judge S. Kato Crews said that threats against election and other government officials are on the rise and people need to remember that differences need to be worked out through the democratic process, not violence.\n\n>“The public must not accept this as the norm,” he said in handing down the sentence for Teak Ty Brockbank.\n\n>Brockbank pleaded guilty in October to making threats between September 2021 and August 2022 against Colorado Secretary of State Jena Griswold and former Arizona Secretary of State Katie Hobbs, who is now governor. He also threatened a Colorado judge and federal agents.\n\n>Brockbank apologized in court for his “ugly posts” and said he has turned away from the fear, hate and anger that he found online that derailed his life.\n\n>Federal prosecutors sought three years in prison for Brockbank. He asked for leniency, saying he made the posts when he was drinking heavily, socially isolated and spending his evenings consuming conspiracy theories online. Jonathan Jacobson, a Washington-based trial attorney for the Justice Department’s public integrity section, pointed out that the threats continued during a period when Brockbank wasn’t drinking.\n\n>Brockbank posted online that Colorado’s top election official should “Hang by the neck” and her former counterpart in Arizona should also be put to death.\n\nKeyboard warrior or not, the nutcase deserves what he got, and then some.",
                "If you watch even a little Fox News (nevermind Newsmax or some of the other arguably more extreme sources of \"news\") you'll quickly see that they are definitely trying to make their viewers angry and, yes, even violent. \n\nWhen I was growing up the news was just an anchor telling you what happened that day. No emotion, very few adjectives even. A plane crashed. A war ended. A politician was indicted. Mostly just raw information.\n\nContrast that with Janine Pirro red-faced calling the Left \"DemonRats\" at the top of her lungs on her program or any of the many times Fox News (the most watched \"news\" in America) basically told their viewers that liberals were coming in the night to take their guns, turn their kids gay, abolish christianity, etc\n\nThey distort and lie and rile up their viewers, then practically *dare* their audience not to take matters into their own hands. \n\nThe Right's media apparatus in the US is responsible for more psychological damage and American suffering than Tokyo Rose could have ever hoped for",
                "\"I was allowed to believe things that weren't true\" - Marjorie Taylor Greene",
                "What do cigarettes, liquor, and claw hammers have in common? Warning labels. Time for warning labels at Foxic Noise.",
                "I’m sure he will be pardoned, just like the people that beat police officers down with American flags. I can’t believe this stupid ass country let the worst of us win the last election. Truly embarrassing",
                "Uh huh, and Ted Bundy blamed porn for his killing spree.\n\nFor him, it was a last-ditch attempt to deflect blame from where it lied - him. And this fella?",
                "Wait - so the brownshirts fighting to replace democracy with fascism get a free pass?\n\n\nI've been saying conservatism is a mental illness for years - I should have realised that fact would be exploited eventually. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 1466,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "In other news, his great grandson is alive and well.",
                "Harrison was 96, a fuckin kid",
                "One of the all time great history oddities! \nRIP Harrison",
                "I hope he didn't tip a canoe."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 2641,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Boy who cried wolf, eaten by wolves.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "If this goes to the Supreme Court, will they favor Trump again?",
                "It's pretty telling how poor of a decision it was to impose tariffs when markets rise back up after that decision is rolled back. Again, for those who thought Trump was fit for office because he's a businessman - just because you do business, does not mean you are good at it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israel announces major expansion of settlements in occupied West Bank",
            "external_url": "https://www.bbc.com/news/articles/c1j5954edlno",
            "upvotes": 2043,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/321e/live/0cfc3ea0-3c85-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Apparently you can rename ethnic cleansing \"settlement\" and get away with it scot-free",
                "When Russia does it it's an invasion. When Israel does it it's a \"settlement\".",
                "[If I don't steal it, someone else is gonna steal it](https://youtu.be/KNqozQ8uaV8?si)",
                "More illegal expansion, if only people knew this was coming for years.  Oh, wait…",
                "I'm sure this will make Israel safer and will result in no action taken by Palestinians and their sympathizers. Fortunately we know that Israel is an incredibly moral country whose one and only concern is counter-terrorism and keeping the population safe from the inherently evil Palestinians in a completely reasonable manner where every casualty taken by Palestinians is their fault.\n\nThat's what the WorldNews sub tells me anyway!",
                "to the surprise of absolutely no one.",
                "They're really trying to eliminate any pathways towards peace.",
                "Let's not sanitize the facts, shall we?\n\n\"Isreal announces major expansion to invasion of West Bank and theft of Palestinian homes and belongings\" is much more accurate.",
                "Anyone else hearing Echoes of Lebensraum in this policy?",
                "\"Settlement\" \n\nThat's an invasion. That there paving the way for with genocide and mass displacement."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 2090,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "Are we surprised? No, not at all.",
                "A government so small it can take your land and rights on a whim.",
                "Another day older and deeper in debt",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society.",
                "FAFO. \nThey voted for this.",
                "How is this not eminent domain?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "19 Black Americans' skulls return to New Orleans after 150 years for memorial service",
            "external_url": "https://www.nbcnews.com/news/nbcblk/black-americans-skulls-returned-new-orleans-memorial-service-rcna209516",
            "upvotes": 112,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-dillard-univrsity-Repatriation-1-ew-608p-b1e097.jpg",
            "top_comments": [
                ">More than 150 years after their heads were severed from their bodies and shipped to Germany for “research,” the craniums of 19 Black people, which were recently returned, will be memorialized Saturday during a sacred ceremony in New Orleans.\n\n>Dillard University President Monique Guillory said at a news conference Wednesday that the memorial will be “about confronting a dark chapter in medical and scientific history while choosing a path of justice, honor and remembrance.”\n\n>Those who will be honored died in the city’s Charity Hospital in 1872. Their heads were severed and shipped to Leipzig University in Germany to be studied — a common practice at the time, as[ researchers](https://www.washingtonpost.com/local/a-brief-history-of-the-enduring-phony-science-that-perpetuates-white-supremacy/2019/04/29/20e6aef0-5aeb-11e9-a00e-050dc7b82693_story.html) sought to confirm their unfounded theory that Black people’s brains were smaller than those of other races, therefore making them inferior.\n\n>“They were stripped of their dignity,” Guillory said, over “a practice rooted in racism and exploitation. They were people with names. They were people with stories and histories. Some of them had families, mothers, fathers, daughters, sons, human beings.” They were not specimens, she continued, “not numbers.”\n\n>The heads were returned to New Orleans about a week ago after a two-year journey, said Eva Baham, a retired Dillard professor. Representatives from Leipzig contacted the city in 2023 about their existence in Germany, where the university houses a skull collection dating to the 1800s. The school is in the process of repatriating or sending back skulls to their original locations. That initial call set in motion the creation of the Cultural Repatriation Committee, led by Baham.\n\n>“We are not talking about them as if they are skeletal remains,” Baham said at the news conference. “We want to honor them by calling them the individuals that they are.”\n\n>Dillard, one of two historically Black universities in New Orleans, along with Xavier University of Louisiana, welcomed the opportunity to be part of “this very sensitive acknowledgment of our people, that they are here,” Guillory told NBC News. A visitation will take place Saturday at Dillard’s Lawless Memorial Chapel with a service.\n\n>Laid to rest will be the remains of **Adam Grant, Isaak Bell, Hiram Smith, William Pierson, Henry Williams, John Brown, Hiram Malone, William Roberts, Alice Brown, Prescilla Hatchet, Marie Louise, Mahala, Samuel Prince, John Tolman, Henry Allen, Moses Willis and Henry Anderson.**\n\n>The two other people could not be identified.\n\nIt's all kinds of messed up that these people were cut up and their heads sent to Germany for eugenic cranial research, and just left there. And of course it was all done without permission.\n\nIt's 150 years after the fact, but at least they've finally been laid to rest and given some dignity back.",
                "*Those who will be honored died in the city’s Charity Hospital in 1872. Their heads were severed and shipped to Leipzig University in Germany to be studied — a common practice at the time, as*[ *researchers*](https://www.washingtonpost.com/local/a-brief-history-of-the-enduring-phony-science-that-perpetuates-white-supremacy/2019/04/29/20e6aef0-5aeb-11e9-a00e-050dc7b82693_story.html) *sought to confirm their unfounded theory that Black people’s brains were smaller than those of other races, therefore making them inferior.*\n\nSmaller brain size have been used to promote and rationalize racism, slavery, and sexism."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court endorses narrow environmental reviews in challenge to Utah railroad project",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-endorses-narrow-environmental-reviews-challenge-utah-rai-rcna199149?featureFlagAix=false",
            "upvotes": 87,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-utah-oil-railway-2023-ac-1142p-0d6b0b.jpg",
            "top_comments": [
                "All that complaining about chemicals being transported on the railroads and they just keep approving more."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US corporate profits decrease sharply in first quarter",
            "external_url": "https://www.reuters.com/world/us/us-corporate-profits-decrease-sharply-first-quarter-2025-05-29/",
            "upvotes": 5576,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gee, wonder why people didn't want to spend so much money? Guess we'll never know.",
                "Wonder how much longer the corporations are going to let TACO eat them for lunch.",
                "Wharton should lose all accreditation and prestige. I don't know how they are considered one of the top business schools when they allowed Trump to graduate with a economics degree.",
                "I am *so* shocked. No one could have seen this coming..",
                "Tariffs create artificial pressure to not do business?  Who knew!!",
                "We must fire the  Bureau of Economic Analysis immediately to prevent this from happening.",
                "Cue the stock market irrationally going up tomorrow.",
                "Have you tried rapidly flicking the tariff switch off and on a few times?",
                "[deleted]",
                "All I know is that since rump took office, something like 50% of the labor hours at my company have gone into trying to find loopholes and workarounds to help us skirt the tariffs. I imagine that most US companies that manufacture internationally are in a similar position. \n\n\n What projects has your company had to put on hold while everyone tries to just figure out how to do business in this environment? So much effort just to try to stay afloat. Forget about advancement, development, innovation, etc. \n\n\n Such a waste."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Wolves continue remarkable comeback with 3 new packs confirmed in NorCal",
            "external_url": "https://www.sfgate.com/bayarea/article/3-wolf-packs-confirmed-northern-california-20349821.php",
            "upvotes": 115,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wolves are my favorite animal.  This is great news"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Market Basket CEO Arthur T. Demoulas suspended. He calls it a \"hostile takeover.\"",
            "external_url": "https://www.cbsnews.com/boston/news/market-basket-suspends-ceo-arthur-t-demoulas-investigation/",
            "upvotes": 303,
            "date": "05/29/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/28/360102c4-4fcb-4243-87a5-9419ba714d63/thumbnail/1200x630/1869b81a6c982df87a1faa66235ff644/demoulas.jpg?v=15603985a4508c8e7bc83d8e4e73c5d0",
            "top_comments": [
                "“The board said they're concerned over how employees will take the news but do not fear a repeat of the 2014 protests.”\n\nThe board seems to have only considered the “fuck around” portion of the equation",
                "We stand with Artie T.",
                "There is history to this. The family, the business model, a strike years ago, and I’d assume a possible one upcoming. Regionally, this store is incredibly important- low prices, employee focused (SO many people’s first job-> careers, cashier and bagger usually in every lane), and non public… those locally know all of this, and it’s a story played out over time in many different sectors… with the customer almost exclusively losing out.",
                "This is so sickening to read. This place sounds amazing and we need more companies like this. The article reads like the board is unhappy the workers got a bonus which the board probably wanted for themselves.",
                ">Demoulas was known for his ability to remember his employees' names, birthdays, and milestones, attending many of their weddings and funerals, checking in on ill employees, and asking about the spouses and children of his workers.\n\nOh I see. So, he was behaving like a human and that's not allowed in business anymore. By the way: That's why their company is successful, so it's guaranteed to do worse if he leaves or they navigate off that path.\n\nI would describe the business people who don't think that stuff is important as, \"that's what criminals always say.\"\n\nYeah everybody, why do things that are important to people matter when they can just steal money from them? /s",
                "For those unfamiliar what happened the last time Arthur T's shitbag family tried to remove him: https://en.wikipedia.org/wiki/Market_Basket_protests",
                "> \"Those are things we have tried for years to manage with him. It has been resisted, let's just say that,\" said Hachigian.\n\nLet’s not actually. Let’s explain instead",
                "We need MB to keep food prices competitive in New England. If the crappy side of the Demoulas family gets their way, we will all pay more to eat",
                "It so funny that this got to the news sub.  We stand with artie.  His sister trying to succession him will not be taken lightly \n\nThis is the man that keeps the prices low",
                "If he bought the company back and he only owns 28 percent , who owns the rest?  His sisters?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
            "external_url": "https://apnews.com/article/election-officials-threat-colorado-years-prison-a50f82a9fbad6ebf72eafef189a06f38",
            "upvotes": 1355,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It wasn’t my fault - I listened to people who claimed they’re the party of personal responsibility- how can *I* be blamed for my actions?”",
                "Online threats are literally how MAGA is controlling the GOP - any Republican member of the house or Senate that steps out of line gets called out by name and tagged on Twitter by Trump's dirtbag propagandist influencers. They are quickly brigaded by legions of maga Twitter incels and bots, replies filled with hate and threats until they bend the knee. This is how they go after judges too. I'm telling you, Twitter needs to be fucking purged entirely, along with its owner.",
                "Trump will pardon him.  As long as he broke the law to protect the fascist state trump will pardon him.",
                ">A judge sentenced a man who blamed exposure to far-right extremist content for motivating his online threats to kill Democratic election officials in Colorado and Arizona to three years in prison Thursday, saying the penalty for such “keyboard terrorism” needed to be serious enough to deter others from doing the same.\n\n>U.S. District Judge S. Kato Crews said that threats against election and other government officials are on the rise and people need to remember that differences need to be worked out through the democratic process, not violence.\n\n>“The public must not accept this as the norm,” he said in handing down the sentence for Teak Ty Brockbank.\n\n>Brockbank pleaded guilty in October to making threats between September 2021 and August 2022 against Colorado Secretary of State Jena Griswold and former Arizona Secretary of State Katie Hobbs, who is now governor. He also threatened a Colorado judge and federal agents.\n\n>Brockbank apologized in court for his “ugly posts” and said he has turned away from the fear, hate and anger that he found online that derailed his life.\n\n>Federal prosecutors sought three years in prison for Brockbank. He asked for leniency, saying he made the posts when he was drinking heavily, socially isolated and spending his evenings consuming conspiracy theories online. Jonathan Jacobson, a Washington-based trial attorney for the Justice Department’s public integrity section, pointed out that the threats continued during a period when Brockbank wasn’t drinking.\n\n>Brockbank posted online that Colorado’s top election official should “Hang by the neck” and her former counterpart in Arizona should also be put to death.\n\nKeyboard warrior or not, the nutcase deserves what he got, and then some.",
                "If you watch even a little Fox News (nevermind Newsmax or some of the other arguably more extreme sources of \"news\") you'll quickly see that they are definitely trying to make their viewers angry and, yes, even violent. \n\nWhen I was growing up the news was just an anchor telling you what happened that day. No emotion, very few adjectives even. A plane crashed. A war ended. A politician was indicted. Mostly just raw information.\n\nContrast that with Janine Pirro red-faced calling the Left \"DemonRats\" at the top of her lungs on her program or any of the many times Fox News (the most watched \"news\" in America) basically told their viewers that liberals were coming in the night to take their guns, turn their kids gay, abolish christianity, etc\n\nThey distort and lie and rile up their viewers, then practically *dare* their audience not to take matters into their own hands. \n\nThe Right's media apparatus in the US is responsible for more psychological damage and American suffering than Tokyo Rose could have ever hoped for",
                "\"I was allowed to believe things that weren't true\" - Marjorie Taylor Greene",
                "What do cigarettes, liquor, and claw hammers have in common? Warning labels. Time for warning labels at Foxic Noise.",
                "I’m sure he will be pardoned, just like the people that beat police officers down with American flags. I can’t believe this stupid ass country let the worst of us win the last election. Truly embarrassing",
                "Uh huh, and Ted Bundy blamed porn for his killing spree.\n\nFor him, it was a last-ditch attempt to deflect blame from where it lied - him. And this fella?",
                "Wait - so the brownshirts fighting to replace democracy with fascism get a free pass?\n\n\nI've been saying conservatism is a mental illness for years - I should have realised that fact would be exploited eventually. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Smokey Robinson sues former housekeepers for defamation over rape allegations",
            "external_url": "https://www.ctvnews.ca/entertainment/article/smokey-robinson-sues-former-housekeepers-for-defamation-over-rape-allegations/",
            "upvotes": 126,
            "date": "05/29/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/WKGO26AOXMPIW4HIRBJRW3OYNA.jpg?smart=true&auth=e6ee7c1bacdd81a6670d168464ff64a19645d3b9717d5d495509a7cec1675a68&width=1200&height=630",
            "top_comments": [
                ">The filing says the women “stayed with the Robinsons year after year,” vacationed with them, celebrated holidays with them, exchanged gifts with them, asked for tickets to his concerts, and sought and received help from them including money for dental surgery, financial support for a disabled family member, and “even a car.”\n\nYeah because an alleged predator never, ever had duplicitous behavior or acted generously toward one of their victims.",
                "\"This is not what the Smoke Man would want.\" -Ryan Howard",
                ">One woman said she was assaulted at least 20 times while working for Robinson from 2012 until 2024. Another said she worked for him from 2014 until 2020 and was assaulted at least 23 times. \n\nWhen I first heard about the rape allegations, the time line always bothered me. The first rape accusations were linked with allegations of poor pay, bad work conditions, and were secondary to the labor allegations. In fact the first reporting indicated that they hadn’t even filed a police complaint yet. At the time I thought if he was paying them less than minimum wages, why not just quit and find another job. I mean if they had a work history of 12 years working for one family how hard would it be to find another job. Again the sexual assault was secondary in the reporting and they weren’t pressing for criminal charges. Also if I recall correctly there were only two housekeepers at the time. Also it was hard to get a sense of when the rapes occurred. Was it 4 a year for the period between 2014-2020, or 2 a year for the period between 2012-2024 or did they all happen in 2019. A very confusing situation and as in most of these cases the reporting and reality may bear little relation to each other. So wait and see.",
                "A*ttorneys for the former housekeepers, said in a statement that the defamation suit “is nothing more than an attempt to silence and intimidate the survivors of Mr. Robinson’s sexual battery and assault. It is a baseless and vindictive legal maneuver designed to re-victimize, shift blame and discourage others from coming forward*.”\n\nThe Robinsons counter-suit is just a way to silence people who sue. Robinson's spending money on these housekeepers has zero to do with proving himself innocent of sexual assaults,  That's just more bull.",
                "I don't have strong feelings either way about Smokey Robinson (don't know much about him) but I'd be curious what their evidence is, if they have any other than their claims. It does sort of feel like they want to cash in before he dies. But I saw mention some of them are not citizens and immigrants are easy to take advantage of, so who knows.\n\nFrom what I understand, they wanted big money and he wouldn't pay, so then they filed a police complaint to force an investigation. With 4 victims, I feel like the police will be able to find any obvious inconsistencies in their stories.\n\nEven if you assume he is innocent, I'm never sure how I feel about the strategy of counter suing. I doubt they have any money if you win, and you're just keeping the story in the headlines.",
                "[deleted]",
                "Smoky Robinson is a rapist and Donald J Fucking Trump is the twice elected POTUS. I love my children but I'm starting to regret having offspring in this fucked up weird reality. Smoky Robinson being a rapist is like a fish stealing water."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 1467,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "In other news, his great grandson is alive and well.",
                "Harrison was 96, a fuckin kid",
                "One of the all time great history oddities! \nRIP Harrison",
                "I hope he didn't tip a canoe."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 14558,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "This ruling won't last long, but the damage sure will",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "Our country is a fucking joke",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 2077,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "Are we surprised? No, not at all.",
                "A government so small it can take your land and rights on a whim.",
                "Another day older and deeper in debt",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society.",
                "FAFO. \nThey voted for this.",
                "How is this not eminent domain?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US corporate profits decrease sharply in first quarter",
            "external_url": "https://www.reuters.com/world/us/us-corporate-profits-decrease-sharply-first-quarter-2025-05-29/",
            "upvotes": 5574,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gee, wonder why people didn't want to spend so much money? Guess we'll never know.",
                "Wonder how much longer the corporations are going to let TACO eat them for lunch.",
                "Wharton should lose all accreditation and prestige. I don't know how they are considered one of the top business schools when they allowed Trump to graduate with a economics degree.",
                "I am *so* shocked. No one could have seen this coming..",
                "Tariffs create artificial pressure to not do business?  Who knew!!",
                "We must fire the  Bureau of Economic Analysis immediately to prevent this from happening.",
                "Cue the stock market irrationally going up tomorrow.",
                "Have you tried rapidly flicking the tariff switch off and on a few times?",
                "[deleted]",
                "All I know is that since rump took office, something like 50% of the labor hours at my company have gone into trying to find loopholes and workarounds to help us skirt the tariffs. I imagine that most US companies that manufacture internationally are in a similar position. \n\n\n What projects has your company had to put on hold while everyone tries to just figure out how to do business in this environment? So much effort just to try to stay afloat. Forget about advancement, development, innovation, etc. \n\n\n Such a waste."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
            "external_url": "https://apnews.com/article/election-officials-threat-colorado-years-prison-a50f82a9fbad6ebf72eafef189a06f38",
            "upvotes": 1352,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It wasn’t my fault - I listened to people who claimed they’re the party of personal responsibility- how can *I* be blamed for my actions?”",
                "Online threats are literally how MAGA is controlling the GOP - any Republican member of the house or Senate that steps out of line gets called out by name and tagged on Twitter by Trump's dirtbag propagandist influencers. They are quickly brigaded by legions of maga Twitter incels and bots, replies filled with hate and threats until they bend the knee. This is how they go after judges too. I'm telling you, Twitter needs to be fucking purged entirely, along with its owner.",
                "Trump will pardon him.  As long as he broke the law to protect the fascist state trump will pardon him.",
                ">A judge sentenced a man who blamed exposure to far-right extremist content for motivating his online threats to kill Democratic election officials in Colorado and Arizona to three years in prison Thursday, saying the penalty for such “keyboard terrorism” needed to be serious enough to deter others from doing the same.\n\n>U.S. District Judge S. Kato Crews said that threats against election and other government officials are on the rise and people need to remember that differences need to be worked out through the democratic process, not violence.\n\n>“The public must not accept this as the norm,” he said in handing down the sentence for Teak Ty Brockbank.\n\n>Brockbank pleaded guilty in October to making threats between September 2021 and August 2022 against Colorado Secretary of State Jena Griswold and former Arizona Secretary of State Katie Hobbs, who is now governor. He also threatened a Colorado judge and federal agents.\n\n>Brockbank apologized in court for his “ugly posts” and said he has turned away from the fear, hate and anger that he found online that derailed his life.\n\n>Federal prosecutors sought three years in prison for Brockbank. He asked for leniency, saying he made the posts when he was drinking heavily, socially isolated and spending his evenings consuming conspiracy theories online. Jonathan Jacobson, a Washington-based trial attorney for the Justice Department’s public integrity section, pointed out that the threats continued during a period when Brockbank wasn’t drinking.\n\n>Brockbank posted online that Colorado’s top election official should “Hang by the neck” and her former counterpart in Arizona should also be put to death.\n\nKeyboard warrior or not, the nutcase deserves what he got, and then some.",
                "If you watch even a little Fox News (nevermind Newsmax or some of the other arguably more extreme sources of \"news\") you'll quickly see that they are definitely trying to make their viewers angry and, yes, even violent. \n\nWhen I was growing up the news was just an anchor telling you what happened that day. No emotion, very few adjectives even. A plane crashed. A war ended. A politician was indicted. Mostly just raw information.\n\nContrast that with Janine Pirro red-faced calling the Left \"DemonRats\" at the top of her lungs on her program or any of the many times Fox News (the most watched \"news\" in America) basically told their viewers that liberals were coming in the night to take their guns, turn their kids gay, abolish christianity, etc\n\nThey distort and lie and rile up their viewers, then practically *dare* their audience not to take matters into their own hands. \n\nThe Right's media apparatus in the US is responsible for more psychological damage and American suffering than Tokyo Rose could have ever hoped for",
                "\"I was allowed to believe things that weren't true\" - Marjorie Taylor Greene",
                "What do cigarettes, liquor, and claw hammers have in common? Warning labels. Time for warning labels at Foxic Noise.",
                "I’m sure he will be pardoned, just like the people that beat police officers down with American flags. I can’t believe this stupid ass country let the worst of us win the last election. Truly embarrassing",
                "Uh huh, and Ted Bundy blamed porn for his killing spree.\n\nFor him, it was a last-ditch attempt to deflect blame from where it lied - him. And this fella?",
                "Wait - so the brownshirts fighting to replace democracy with fascism get a free pass?\n\n\nI've been saying conservatism is a mental illness for years - I should have realised that fact would be exploited eventually. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 2934,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing.",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!",
                "It has Harvard, illegal, and embryo in the title. It’s a MAGA wet dream."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 1467,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "In other news, his great grandson is alive and well.",
                "Harrison was 96, a fuckin kid",
                "One of the all time great history oddities! \nRIP Harrison",
                "I hope he didn't tip a canoe."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 14562,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "This ruling won't last long, but the damage sure will",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "Our country is a fucking joke",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Market Basket CEO Arthur T. Demoulas suspended. He calls it a \"hostile takeover.\"",
            "external_url": "https://www.cbsnews.com/boston/news/market-basket-suspends-ceo-arthur-t-demoulas-investigation/",
            "upvotes": 310,
            "date": "05/29/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/28/360102c4-4fcb-4243-87a5-9419ba714d63/thumbnail/1200x630/1869b81a6c982df87a1faa66235ff644/demoulas.jpg?v=15603985a4508c8e7bc83d8e4e73c5d0",
            "top_comments": [
                "“The board said they're concerned over how employees will take the news but do not fear a repeat of the 2014 protests.”\n\nThe board seems to have only considered the “fuck around” portion of the equation",
                "We stand with Artie T.",
                "There is history to this. The family, the business model, a strike years ago, and I’d assume a possible one upcoming. Regionally, this store is incredibly important- low prices, employee focused (SO many people’s first job-> careers, cashier and bagger usually in every lane), and non public… those locally know all of this, and it’s a story played out over time in many different sectors… with the customer almost exclusively losing out.",
                "This is so sickening to read. This place sounds amazing and we need more companies like this. The article reads like the board is unhappy the workers got a bonus which the board probably wanted for themselves.",
                ">Demoulas was known for his ability to remember his employees' names, birthdays, and milestones, attending many of their weddings and funerals, checking in on ill employees, and asking about the spouses and children of his workers.\n\nOh I see. So, he was behaving like a human and that's not allowed in business anymore. By the way: That's why their company is successful, so it's guaranteed to do worse if he leaves or they navigate off that path.\n\nI would describe the business people who don't think that stuff is important as, \"that's what criminals always say.\"\n\nYeah everybody, why do things that are important to people matter when they can just steal money from them? /s",
                "For those unfamiliar what happened the last time Arthur T's shitbag family tried to remove him: https://en.wikipedia.org/wiki/Market_Basket_protests",
                "> \"Those are things we have tried for years to manage with him. It has been resisted, let's just say that,\" said Hachigian.\n\nLet’s not actually. Let’s explain instead",
                "We need MB to keep food prices competitive in New England. If the crappy side of the Demoulas family gets their way, we will all pay more to eat",
                "It so funny that this got to the news sub.  We stand with artie.  His sister trying to succession him will not be taken lightly \n\nThis is the man that keeps the prices low",
                "If he bought the company back and he only owns 28 percent , who owns the rest?  His sisters?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 8182,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "“I need you to be activist judges to stop the activist judges”",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court.",
                "Why are they activist judges.  Jesus why can’t people tone down on the rhetoric.  They’re judges following the rule of law.  The congress is supposed to control taxation not the president."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 2644,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Boy who cried wolf, eaten by wolves.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "If this goes to the Supreme Court, will they favor Trump again?",
                "It's pretty telling how poor of a decision it was to impose tariffs when markets rise back up after that decision is rolled back. Again, for those who thought Trump was fit for office because he's a businessman - just because you do business, does not mean you are good at it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Haribo recalls bags of sweets in Netherlands after cannabis found",
            "external_url": "https://www.bbc.com/news/articles/c5yx2lynznpo",
            "upvotes": 656,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/02af/live/3944f7e0-3c8a-11f0-bd8d-df41784e9c1e.jpg",
            "top_comments": [
                ">It is not clear whether the contaminated products are genuine Haribo bags or fake.\n\nKinda important",
                "Oh no! Where have these bags been delivered to? Gotta know how to avoid them at any cost. \n\nI really gotta know.",
                ">Several people, including multiple members of one family, reported feeling unwell after eating from a 1kg pack of Haribo Happy Cola F!ZZ.\n\nHappy Cola F!ZZ is the only gummy I really like.",
                "Before reading the article: “is this only in the Netherlands?”\n\nAfter reading article: “Damn it…”",
                "I know everyone is gonna make jokes but even if you smoke weed accidentally taking a large edible dose when you don't expect to will easily ruin a day. If you are not used to canabis it can def be traumatic to be dosed like that.",
                "This is crazy depending on dosage it will really fuck unknowing people up.\n\nFor reference I used to smoke a LOT but not anymore due to smoking giving me anxiety when the high hits.\n\nSo now I use edibles so I can gradually get high to not get the all at once rush like smoking does. I have 0 tolerance because I don't do it that much.\n\n1 gummie bear I buy usually contains 50mg THC this is a fuckload for someone who doesn't have a tolerance it will put you on your ass. I was a mess the first time I ordered them thinking I could handle it, I could not it was intense but I was familiar with what was going on.\n\nI now cut the gummies into quarters and it's nice and relaxing.\n\nImagine if you were an unsuspecting person whos never known the effects of THC and now you are doing said 50mg. You would be fucked and think you are dying. This is a crazy fuck up.\n\n\nTldr: if you've never tried thc and think damn I wish I got some, that would be cool, no you'd probably be comatose or worse have a panic attack and end up in the emergency room.",
                "I wish Haribo made cannabis gummies I could get! The edible market is really hit and miss in the Midwest.",
                "Recalled because there's not enough in them.",
                "Any idea where they are for sale( asking for a friend)",
                "Astoundingly, not the worst thing ever found in a bag of Haribo gummies / colon cleansing sugar free spawn of Satan bears."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/30/2025 00:43:58 UTC"
}