{
    "posts": [
        {
            "category": "HOT",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 17986,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "I clicked this expecting to see that an intrepid journalist did some deep investigation to find proof of the flight change.\n\nBut no, this idiot just went on a radio show and announced it.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "Safe for me, but not for thee! Some of you may die, but that is a sacrifice I am willing to make.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "Messing with airports is a popular way for autocrats to consolidate control because it allows them to lead with fear.",
                "Okay, but what about her emails?",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 2931,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "Out with the Flouride, In with the Flourine!",
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Delicious forever chemicals just what I needed.",
                "Thank God, we're getting something to replace Fluoride.",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Conservatism is well known to be incompatible with many things- prosperity, liberty, equality, democracy, science, rule of law, progress- and we can add simple decency of respecting the safety and value of the ordinary persons well being",
                "Environmental Pollution Agency",
                "Veritassium just pushed a video about PFAS\n\nhttps://youtu.be/SC2eSujzrUY"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
            "external_url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
            "upvotes": 7768,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We are deporting students and importing cartels.",
                "Why is this not the top story on every news site?",
                "They must have bought one of Trump's immigration golden tickets.",
                "Ok lemme get this straight. Kids with cancer, Americans, veterans and immigrant with green cards are being deported to a country they’ve never been to BUT Mexican cartel members are being literally invited in? America is beyond fucked.",
                "Another day, another absolute “fuck you” to the American public…",
                "So letting actual violent foreigners in and deporting grad students and working parents",
                "$5 million dollars folks. And you get one of those fancy trump visas.",
                "Trump selling citizenships to cartel families and South African racists.",
                "Trump probably made money off of this. Plain and simple.  It's all transactional for him.",
                "TRUMP selling America to anybody that will pay him."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "18-year-old girl escapes captivity from New Jersey home where she was allegedly forced to live in dog crate and abused",
            "external_url": "https://www.nbcnews.com/news/us-news/girl-escapes-new-jersey-home-dog-crate-rcna206746",
            "upvotes": 1304,
            "date": "05/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250514-gloucester-township-police-ew-102p-3c05cf.jpg",
            "top_comments": [
                ">A New Jersey couple has been charged after an 18-year-old escaped their residence and said she was forced to live in a dog crate for a year, given a bucket to use as a bathroom and sexually abused.\n\n>Brenda Spencer, 38, and Branndon Mosley, 41, of Gloucester Township, were charged with kidnapping and Mosley with additional counts of sexual assault, The Camden County Prosecutor’s Office and Gloucester Township Police announced Wednesday. \n\n>The 18-year-old female had escaped the home on May 8, assisted by a neighbor, prosecutors and police said in a [news release.](https://camdencountypros.org/news/article/2236?fbclid=IwY2xjawKRp_9leHRuA2FlbQIxMABicmlkETFCY3MzQWJNSDJMSFlrOVNnAR4GzMVmBE9KiKriuG3mfkneWSdhLhN9kX6JEAHEGSzpvMUKbpV3oi2ZlPEk1Q_aem_LxPQvRGtmwszP5CpKS2Hwg) The abuse was then reported to police on Saturday.\n\n>The victim said Spencer and Mosley had abused her since 2018.\n\n>Around that time, she was removed from school when she was in the sixth grade “at Spencer’s discretion and confined to her home,” officials said. The victim said shortly after she was pulled out of school, she was “forced to live in a dog crate for approximately one year and was let out periodically,” the release said. \n\n>Later, she was forced to live in a padlocked bathroom and was chained up. She told police she would be let out of the bathroom when family visited the home. At other times she lived in a bare room with a bucket to use as a toilet.\n\n>The victim told police the room had an alarm system that would “alert Spencer and Mosley if she tried to leave.” The victim also reported being beaten with a belt and sexually abused by Mosley, officials stated.\n\nIt's a horrific story, with more details including a 13-year-old who also lived there as well as the kids being pulled out of school years before. How this couple (assuming they are parents but it doesn't specifically say so) could do that do another human being is unfathomable. The law better come down hard on them, with them never seeing the outside of a prison ever again.",
                "This whole “kids were removed from school by parents discretion” thing is one of the things that makes me so uneasy about homeschooling. I know this isn’t that, but the idea that a parent can lock a child away from the world is terrifying.",
                "What the absolute fuck.\n\nI hope the two girls are getting the help they need. Put the monsters where monsters belong.",
                "It’s horrible what people do to kids",
                "Yeah, if someone gets homeschooled there should be regular wellness checks",
                "There are some absolute garbage people in this world, hope those girls can get help and try to live a life they deserve",
                "Today was not a good day to be able to read.\n\nThere is true evil in the world. I hope those girls get the help they need.",
                "So El Salvador for these folks? Were they not saying for the worst of the worst even if you are American.",
                "Ah jeez they live next to my old neighborhood. It's right near an elementary school. There needs to be regular welfare checks for home schooled children in an effort to prevent horrible shit like this from happening.",
                "Another New Jersey crime story where a meetup at Wawa is involved.\n\nWawa is like the cultural marketplace of New Jersey. And honestly their coffee is better than any other chain in the state including Dunkin and Starbucks so I can see why."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Robert F. Kennedy Jr. submerges in creek with high bacteria levels, including E. coli",
            "external_url": "https://abcnews.go.com/Politics/robert-kennedy-jr-swimming-park-water-high-bacteria/story?id=121734979",
            "upvotes": 3383,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/abf2ddd9-061c-4cef-a5ef-bb4850246c54/robert-kennedy-1-gty-gmh-250512_1747058965848_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Brain worm’s got some competition now",
                "Swimming in literal shit. And this is the guy controlling the health decisions for the country. I hope he (also literally) shits his brains out.",
                ">\"Mother's Day hike in Dumbarton Oaks Park with Amaryllis, Bobby, Kick, and Jackson, and a swim with my grandchildren, Bobcat and Cassius in Rock Creek,\"\n\nthese names...",
                "Swimming in the swamp is very on brand for this administration.",
                "I love this manly traditional nature loving persona he tries to have, but can't even go further from the city to swim in non polluted water.\n\nSo fluoride in city water = bad\n\nThe city's sewage in swimming water = fine",
                "What amazes me is that he was doing this with his grandchildren. His own daughter described the situation where he cut the head off of a dead whale and tied it to the roof of the car. She was splashed with disgusting fluids from it as they were driving home. The parents of those grandchildren know what he is like and yet allowed them to be in his care",
                "This dude worships Nurgle.",
                "I just hope this speeds up the inevitable, the faster the better.",
                "My wife got E Coli just after we started dating.\nFit, 25 year old personal trainer, they almost died. \n\nFingers crossed.",
                "Does everyone in this administration HAVE to go so out of their way to be ASBOLUTELY BATSHIT FUCKING NUTS"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "California Governor Newsom seeks to scale back free healthcare for migrants",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/california-governor-newsom-seeks-scale-back-free-healthcare-migrants-2025-05-14/",
            "upvotes": 1008,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IMHO this prob has more to do with the insane budget problems MediCal currently faces.",
                "He’s gunning for the moderate republican path to the white house",
                "Democrats: \"running presidential candidates who try to court the center right may have gotten us our shit kicked in twice now....what if we try it again, but with a man?\"",
                "I wish more people would read the article before commenting.",
                "I don’t understand why we’re paying for migrant’s healthcare when there’s a huge percentage of Americans who can’t afford their own care and aren’t seeing a subsidy.   To get Medicaid, you have to be poor.  To afford quality healthcare when needed, you have to be an upper middle class or higher.  Everyone else in between can’t afford their own healthcare needs.",
                "We’re gonna get another Hillary Clinton with this one.",
                "Why is this seen as a bad thing? \n\nLike legit people can just pop in illegally and get free healthcare?\n\nThen why would all the actual citizenry bother paying for healthcare?",
                "Free health care for migrants? Did they run out of citizens needing free health care? If so, that’s awesome.",
                "In a country where tax paying citizens don’t get free healthcare, this seems like common sense",
                ">Newsom’s office said that the governor will call for undocumented adults to pay $100 monthly premiums to receive Medi-Cal healthcare coverage. He would also call to block all new adult applicants for the program starting on January 1, 2026. Coverage for children will not be affected by these changes, nor would “limited-scope coverage” of things like emergency and pregnancy services.\nThose changes would save the state $5.4 billion through 2028-2029, the governor’s office said. The program providing free healthcare for all low-income migrants began on January 1, 2024.\n\nSo $100/month coverage for those already enrolled in this new program, sunset new applicants starting next year, and the most common uses of healthcare (ED and pregnancy services) are untouched. I don’t see this as an overly cruel change to what is pretty damn close to what free healthcare looks like in the US."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Uruguay's José Mujica, world's 'poorest president', dies",
            "external_url": "https://www.bbc.com/news/articles/c0j71402z58o",
            "upvotes": 2046,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c871/live/51e9ec90-302a-11f0-9c4d-7b4728612d5d.jpg",
            "top_comments": [
                "Truly an inspiring person.",
                "Probably world's most honest and genuinely loved president as well. ",
                "You can judge a man's character when he has power. And this gentleman is a classy person who wants to serve\n\nRIP and hopefully more leaders will learn humility from this man",
                "Truly, he is one person who probably deserved to live forever.",
                "RIP. We lost a good one.",
                "The president should not be a billionaire",
                "Truly a leader from the people",
                "He was a good person and great president. Que en paz descanse",
                "Such a mensch. His memory for a blessing.",
                "Such an amazing story!"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
            "external_url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
            "upvotes": 1368,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "great news.  And we need more good news these days",
                "Surely this is something that health groups trying to limit drug access and stop overdoses can take credit for and not just one person who wasn’t even in office last year, right?",
                "Going to go up now that MAGA took away Narcan funding",
                "Trump will say it’s his border control while MAGA fucks simultaneously reduce access to life saving medical equipment and procedures.",
                "Turns out harm reduction works better than criminalizing drug use or trying to shame people out of it",
                "I think it is because of legal weed and fear of bad drugs. I know some people who have turned to weed to successfully stop harder stuff.",
                "Seems like a great time to stop providing narcan /s",
                "Trump to claim credit in 3...2...",
                "Well, that went well. Too bad this admin is trashing the programs that helped.",
                "This certainly underscores the need for all of these illegal emergency power grabs by the Trump administration, doesn't it?\n\n\n>Increased availability of the overdose-reversing drug naloxone.\n\n\n>Expanded addiction treatment.\n\n\n>The growing impact of billions of dollars in opioid lawsuit settlement money.\n\n\nAnd it's a good thing the Trump administration is going to continue supporting these initiatives that have helped with the decline."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 498,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                "And they say parents aren't involved in their kids educations these days.",
                "I mean - I try to be supportive of my children's interests - but this is taking it too far.",
                "There is something deeply wrong with this country.",
                "I read this out loud and a Uvalde cop sprinted in the opposite direction.",
                "Blue hair and face tattoos...nope, no wild assumptions will be made about this person by the broader public AT ALL.\n\n>She also found an \"improvised explosive device\" -- a mortar-style firework wrapped in duct tape -- among the boy's belongings, the affidavit noted. The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nOh great, and those assumptions will seemingly be WAY off. Even BETTER.\n\nI fucking hate this planet.",
                "Thanks god for that grandmother."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 348,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "That’s an interesting point to strike over. When my wife worked at Starbucks many years ago the dress code was far more strict!! No visible tattoos, limited piercings, and iirc ONLY black shirts",
                "I'm not sure black top with khaki, black, or blue denim bottoms is a lot to ask.",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong.",
                "Another reminder to get your caffeine from independent coffee shops. Support local small business.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "Starbucks is providing each person a clothing stipend right? Right? ",
                "Some things are worth fighting over. This does not seem like one of them.."
            ],
            "aggregate_sentiment": 13.0
        },
        {
            "category": "NEW",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 345,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "That’s an interesting point to strike over. When my wife worked at Starbucks many years ago the dress code was far more strict!! No visible tattoos, limited piercings, and iirc ONLY black shirts",
                "I'm not sure black top with khaki, black, or blue denim bottoms is a lot to ask.",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong.",
                "Another reminder to get your caffeine from independent coffee shops. Support local small business.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "Starbucks is providing each person a clothing stipend right? Right? ",
                "Some things are worth fighting over. This does not seem like one of them.."
            ],
            "aggregate_sentiment": 53.0
        },
        {
            "category": "NEW",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 502,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                "And they say parents aren't involved in their kids educations these days.",
                "I mean - I try to be supportive of my children's interests - but this is taking it too far.",
                "There is something deeply wrong with this country.",
                "I read this out loud and a Uvalde cop sprinted in the opposite direction.",
                "Blue hair and face tattoos...nope, no wild assumptions will be made about this person by the broader public AT ALL.\n\n>She also found an \"improvised explosive device\" -- a mortar-style firework wrapped in duct tape -- among the boy's belongings, the affidavit noted. The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nOh great, and those assumptions will seemingly be WAY off. Even BETTER.\n\nI fucking hate this planet.",
                "Thanks god for that grandmother."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "NEW",
            "title": "HIV patient testing falls in South Africa after US aid cuts, data shows",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/hiv-patient-testing-falls-south-africa-after-us-aid-cuts-data-shows-2025-05-14/",
            "upvotes": 54,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well, less people will test positive for HIV if we test less people. Epidemic solved!",
                "“MAGA”: Well those are just black lives, and we’ve admitted those those matter^to^us .”\n\nAlso MAGA: We’re good Christians and everyone should follow Jesus (except the part about being kind to people, helping the sick, etc.",
                "Trump is importing people from South Africa does that mean they aren't screening them for HIV?"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "NEW",
            "title": "California Governor Newsom seeks to scale back free healthcare for migrants",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/california-governor-newsom-seeks-scale-back-free-healthcare-migrants-2025-05-14/",
            "upvotes": 1012,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IMHO this prob has more to do with the insane budget problems MediCal currently faces.",
                "He’s gunning for the moderate republican path to the white house",
                "Democrats: \"running presidential candidates who try to court the center right may have gotten us our shit kicked in twice now....what if we try it again, but with a man?\"",
                "I wish more people would read the article before commenting.",
                "I don’t understand why we’re paying for migrant’s healthcare when there’s a huge percentage of Americans who can’t afford their own care and aren’t seeing a subsidy.   To get Medicaid, you have to be poor.  To afford quality healthcare when needed, you have to be an upper middle class or higher.  Everyone else in between can’t afford their own healthcare needs.",
                "We’re gonna get another Hillary Clinton with this one.",
                "Why is this seen as a bad thing? \n\nLike legit people can just pop in illegally and get free healthcare?\n\nThen why would all the actual citizenry bother paying for healthcare?",
                "Free health care for migrants? Did they run out of citizens needing free health care? If so, that’s awesome.",
                "In a country where tax paying citizens don’t get free healthcare, this seems like common sense",
                ">Newsom’s office said that the governor will call for undocumented adults to pay $100 monthly premiums to receive Medi-Cal healthcare coverage. He would also call to block all new adult applicants for the program starting on January 1, 2026. Coverage for children will not be affected by these changes, nor would “limited-scope coverage” of things like emergency and pregnancy services.\nThose changes would save the state $5.4 billion through 2028-2029, the governor’s office said. The program providing free healthcare for all low-income migrants began on January 1, 2024.\n\nSo $100/month coverage for those already enrolled in this new program, sunset new applicants starting next year, and the most common uses of healthcare (ED and pregnancy services) are untouched. I don’t see this as an overly cruel change to what is pretty damn close to what free healthcare looks like in the US."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Haitians face record hunger as gang violence grips country in throes of economic crisis",
            "external_url": "https://apnews.com/article/haiti-hunger-starvation-gang-violence-c5f3255aeb6a107ba0e419288bd3503c",
            "upvotes": 134,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This situation is so fucked. And nobody wants to make it their problem, so the world just ignores it. Sad as hell.",
                "Wyclef could do a charity concert",
                "*While food and potable water were commonly distributed at shelters, aid began to dwindle after the administration of U.S. President Donald Trump in late February decided to terminate* [*90% of USAID foreign aid contracts*](https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16)*.*\n\nOur Gaza.",
                "And the US will soon be deporting folks back there if they have not already started.",
                "I don't even know how you fix something like this.  Send Nigeria to clean everything up?  Support one gang over another?  Make it a company island and bring in a company to take over everything?",
                "Someone needs to discover oil or lithium deposits there quickly, then suddenly people will start caring about the fate of the people there",
                "In 2023, the UN sent in help from 6 countries to assist Haiti police. They have not been successful in pushing back the gangs."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "18-year-old girl escapes captivity from New Jersey home where she was allegedly forced to live in dog crate and abused",
            "external_url": "https://www.nbcnews.com/news/us-news/girl-escapes-new-jersey-home-dog-crate-rcna206746",
            "upvotes": 1309,
            "date": "05/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250514-gloucester-township-police-ew-102p-3c05cf.jpg",
            "top_comments": [
                ">A New Jersey couple has been charged after an 18-year-old escaped their residence and said she was forced to live in a dog crate for a year, given a bucket to use as a bathroom and sexually abused.\n\n>Brenda Spencer, 38, and Branndon Mosley, 41, of Gloucester Township, were charged with kidnapping and Mosley with additional counts of sexual assault, The Camden County Prosecutor’s Office and Gloucester Township Police announced Wednesday. \n\n>The 18-year-old female had escaped the home on May 8, assisted by a neighbor, prosecutors and police said in a [news release.](https://camdencountypros.org/news/article/2236?fbclid=IwY2xjawKRp_9leHRuA2FlbQIxMABicmlkETFCY3MzQWJNSDJMSFlrOVNnAR4GzMVmBE9KiKriuG3mfkneWSdhLhN9kX6JEAHEGSzpvMUKbpV3oi2ZlPEk1Q_aem_LxPQvRGtmwszP5CpKS2Hwg) The abuse was then reported to police on Saturday.\n\n>The victim said Spencer and Mosley had abused her since 2018.\n\n>Around that time, she was removed from school when she was in the sixth grade “at Spencer’s discretion and confined to her home,” officials said. The victim said shortly after she was pulled out of school, she was “forced to live in a dog crate for approximately one year and was let out periodically,” the release said. \n\n>Later, she was forced to live in a padlocked bathroom and was chained up. She told police she would be let out of the bathroom when family visited the home. At other times she lived in a bare room with a bucket to use as a toilet.\n\n>The victim told police the room had an alarm system that would “alert Spencer and Mosley if she tried to leave.” The victim also reported being beaten with a belt and sexually abused by Mosley, officials stated.\n\nIt's a horrific story, with more details including a 13-year-old who also lived there as well as the kids being pulled out of school years before. How this couple (assuming they are parents but it doesn't specifically say so) could do that do another human being is unfathomable. The law better come down hard on them, with them never seeing the outside of a prison ever again.",
                "This whole “kids were removed from school by parents discretion” thing is one of the things that makes me so uneasy about homeschooling. I know this isn’t that, but the idea that a parent can lock a child away from the world is terrifying.",
                "What the absolute fuck.\n\nI hope the two girls are getting the help they need. Put the monsters where monsters belong.",
                "It’s horrible what people do to kids",
                "Yeah, if someone gets homeschooled there should be regular wellness checks",
                "There are some absolute garbage people in this world, hope those girls can get help and try to live a life they deserve",
                "Today was not a good day to be able to read.\n\nThere is true evil in the world. I hope those girls get the help they need.",
                "So El Salvador for these folks? Were they not saying for the worst of the worst even if you are American.",
                "Ah jeez they live next to my old neighborhood. It's right near an elementary school. There needs to be regular welfare checks for home schooled children in an effort to prevent horrible shit like this from happening.",
                "Another New Jersey crime story where a meetup at Wawa is involved.\n\nWawa is like the cultural marketplace of New Jersey. And honestly their coffee is better than any other chain in the state including Dunkin and Starbucks so I can see why."
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "NEW",
            "title": "Oklahoma education standards say students must identify 2020 election 'discrepancies'",
            "external_url": "https://www.npr.org/2025/05/14/nx-s1-5384282/oklahoma-education-standards-2020-election",
            "upvotes": 511,
            "date": "05/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4639x2609+0+88/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc3%2F8e%2Ff868d977431fac66f7adec1c1297%2Fap25027772468178.jpg",
            "top_comments": [
                "But I bet you can’t teach them the accurate and comprehensive history about slavery, Jim Crow laws, the KKK, the Civil Rights movement..",
                "If you can’t win history, rewrite it. Right comrads?",
                "And for World History they want students to identify what went right in 1933 German politics...",
                "Honestly, as a teacher I would take this and use it to start teaching about all the discrepancies involving misinformation surrounding the election.",
                "Remember when MAGA called education indoctrination? Maybe they were right",
                "\"TULSA, Okla. — New academic standards in Oklahoma call for the teaching of \"discrepancies\" in the 2020 election results, continuing the spread of a false narrative years after it was first pushed by President Trump and his allies.\"\n\n\"The standards were enacted last month after the Republican-controlled Legislature declined to block them. And while the process to advance the standards has drawn ire from members of Oklahoma's majority party, the question of the standards' content has gotten little pushback.\"\n\n\"The new standards have been championed by Ryan Walters, the state superintendent of public instruction and a conservative firebrand.\"\n\n#  \"These new standards will ensure that kids have an accurate and comprehensive view of historical events, while also reinforcing the values that make our country great,\" Walters said at a February State Board of Education meeting.\n\n\"The new standards were [quietly introduced just hours before that February meeting](https://www.kgou.org/education/2025-04-24/oklahoma-board-of-ed-pushes-back-on-social-studies-standards-senate-gop-poised-to-reject-them), and Walters falsely told board members that to make legislative deadlines, the standards needed to be approved that day. They were.\"\n\n\"While the standards are set to go into effect next school year, a lawsuit filed by a GOP former Oklahoma attorney general could stall their implementation.\"\n\n\"But like other criticisms coming from Republicans, the lawsuit calls out problems in the approval process — not the standards themselves.\"",
                "Oklahomans weren't satisfied being ranked 49th in Education. They really want that coveted 50th spot. ",
                "Why on earth would anyone live there if they had any other option?",
                "You mean the discrepancies that resulted in the people claiming they existed losing a bunch of lawsuits because they had zero evidence to back up their claims? Those discrepancies? ",
                "GOP and Oklahoma really fighting for that bottom position when it comes to education ranking."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "NEW",
            "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
            "external_url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
            "upvotes": 1371,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "great news.  And we need more good news these days",
                "Surely this is something that health groups trying to limit drug access and stop overdoses can take credit for and not just one person who wasn’t even in office last year, right?",
                "Going to go up now that MAGA took away Narcan funding",
                "Trump will say it’s his border control while MAGA fucks simultaneously reduce access to life saving medical equipment and procedures.",
                "Turns out harm reduction works better than criminalizing drug use or trying to shame people out of it",
                "I think it is because of legal weed and fear of bad drugs. I know some people who have turned to weed to successfully stop harder stuff.",
                "Seems like a great time to stop providing narcan /s",
                "Trump to claim credit in 3...2...",
                "Well, that went well. Too bad this admin is trashing the programs that helped.",
                "This certainly underscores the need for all of these illegal emergency power grabs by the Trump administration, doesn't it?\n\n\n>Increased availability of the overdose-reversing drug naloxone.\n\n\n>Expanded addiction treatment.\n\n\n>The growing impact of billions of dollars in opioid lawsuit settlement money.\n\n\nAnd it's a good thing the Trump administration is going to continue supporting these initiatives that have helped with the decline."
            ],
            "aggregate_sentiment": 63.0
        },
        {
            "category": "NEW",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 17981,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "I clicked this expecting to see that an intrepid journalist did some deep investigation to find proof of the flight change.\n\nBut no, this idiot just went on a radio show and announced it.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "Safe for me, but not for thee! Some of you may die, but that is a sacrifice I am willing to make.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "Messing with airports is a popular way for autocrats to consolidate control because it allows them to lead with fear.",
                "Okay, but what about her emails?",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "NEW",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 2927,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "Out with the Flouride, In with the Flourine!",
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Delicious forever chemicals just what I needed.",
                "Thank God, we're getting something to replace Fluoride.",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Conservatism is well known to be incompatible with many things- prosperity, liberty, equality, democracy, science, rule of law, progress- and we can add simple decency of respecting the safety and value of the ordinary persons well being",
                "Environmental Pollution Agency",
                "Veritassium just pushed a video about PFAS\n\nhttps://youtu.be/SC2eSujzrUY"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 349,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "That’s an interesting point to strike over. When my wife worked at Starbucks many years ago the dress code was far more strict!! No visible tattoos, limited piercings, and iirc ONLY black shirts",
                "I'm not sure black top with khaki, black, or blue denim bottoms is a lot to ask.",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong.",
                "Another reminder to get your caffeine from independent coffee shops. Support local small business.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "Starbucks is providing each person a clothing stipend right? Right? ",
                "Some things are worth fighting over. This does not seem like one of them.."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 503,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                "And they say parents aren't involved in their kids educations these days.",
                "I mean - I try to be supportive of my children's interests - but this is taking it too far.",
                "There is something deeply wrong with this country.",
                "I read this out loud and a Uvalde cop sprinted in the opposite direction.",
                "Blue hair and face tattoos...nope, no wild assumptions will be made about this person by the broader public AT ALL.\n\n>She also found an \"improvised explosive device\" -- a mortar-style firework wrapped in duct tape -- among the boy's belongings, the affidavit noted. The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nOh great, and those assumptions will seemingly be WAY off. Even BETTER.\n\nI fucking hate this planet.",
                "Thanks god for that grandmother."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "18-year-old girl escapes captivity from New Jersey home where she was allegedly forced to live in dog crate and abused",
            "external_url": "https://www.nbcnews.com/news/us-news/girl-escapes-new-jersey-home-dog-crate-rcna206746",
            "upvotes": 1312,
            "date": "05/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250514-gloucester-township-police-ew-102p-3c05cf.jpg",
            "top_comments": [
                ">A New Jersey couple has been charged after an 18-year-old escaped their residence and said she was forced to live in a dog crate for a year, given a bucket to use as a bathroom and sexually abused.\n\n>Brenda Spencer, 38, and Branndon Mosley, 41, of Gloucester Township, were charged with kidnapping and Mosley with additional counts of sexual assault, The Camden County Prosecutor’s Office and Gloucester Township Police announced Wednesday. \n\n>The 18-year-old female had escaped the home on May 8, assisted by a neighbor, prosecutors and police said in a [news release.](https://camdencountypros.org/news/article/2236?fbclid=IwY2xjawKRp_9leHRuA2FlbQIxMABicmlkETFCY3MzQWJNSDJMSFlrOVNnAR4GzMVmBE9KiKriuG3mfkneWSdhLhN9kX6JEAHEGSzpvMUKbpV3oi2ZlPEk1Q_aem_LxPQvRGtmwszP5CpKS2Hwg) The abuse was then reported to police on Saturday.\n\n>The victim said Spencer and Mosley had abused her since 2018.\n\n>Around that time, she was removed from school when she was in the sixth grade “at Spencer’s discretion and confined to her home,” officials said. The victim said shortly after she was pulled out of school, she was “forced to live in a dog crate for approximately one year and was let out periodically,” the release said. \n\n>Later, she was forced to live in a padlocked bathroom and was chained up. She told police she would be let out of the bathroom when family visited the home. At other times she lived in a bare room with a bucket to use as a toilet.\n\n>The victim told police the room had an alarm system that would “alert Spencer and Mosley if she tried to leave.” The victim also reported being beaten with a belt and sexually abused by Mosley, officials stated.\n\nIt's a horrific story, with more details including a 13-year-old who also lived there as well as the kids being pulled out of school years before. How this couple (assuming they are parents but it doesn't specifically say so) could do that do another human being is unfathomable. The law better come down hard on them, with them never seeing the outside of a prison ever again.",
                "This whole “kids were removed from school by parents discretion” thing is one of the things that makes me so uneasy about homeschooling. I know this isn’t that, but the idea that a parent can lock a child away from the world is terrifying.",
                "What the absolute fuck.\n\nI hope the two girls are getting the help they need. Put the monsters where monsters belong.",
                "It’s horrible what people do to kids",
                "Yeah, if someone gets homeschooled there should be regular wellness checks",
                "There are some absolute garbage people in this world, hope those girls can get help and try to live a life they deserve",
                "Today was not a good day to be able to read.\n\nThere is true evil in the world. I hope those girls get the help they need.",
                "So El Salvador for these folks? Were they not saying for the worst of the worst even if you are American.",
                "Ah jeez they live next to my old neighborhood. It's right near an elementary school. There needs to be regular welfare checks for home schooled children in an effort to prevent horrible shit like this from happening.",
                "Another New Jersey crime story where a meetup at Wawa is involved.\n\nWawa is like the cultural marketplace of New Jersey. And honestly their coffee is better than any other chain in the state including Dunkin and Starbucks so I can see why."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "California Governor Newsom seeks to scale back free healthcare for migrants",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/california-governor-newsom-seeks-scale-back-free-healthcare-migrants-2025-05-14/",
            "upvotes": 1024,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IMHO this prob has more to do with the insane budget problems MediCal currently faces.",
                "He’s gunning for the moderate republican path to the white house",
                "Democrats: \"running presidential candidates who try to court the center right may have gotten us our shit kicked in twice now....what if we try it again, but with a man?\"",
                "I wish more people would read the article before commenting.",
                "I don’t understand why we’re paying for migrant’s healthcare when there’s a huge percentage of Americans who can’t afford their own care and aren’t seeing a subsidy.   To get Medicaid, you have to be poor.  To afford quality healthcare when needed, you have to be an upper middle class or higher.  Everyone else in between can’t afford their own healthcare needs.",
                "We’re gonna get another Hillary Clinton with this one.",
                "Why is this seen as a bad thing? \n\nLike legit people can just pop in illegally and get free healthcare?\n\nThen why would all the actual citizenry bother paying for healthcare?",
                "Free health care for migrants? Did they run out of citizens needing free health care? If so, that’s awesome.",
                "In a country where tax paying citizens don’t get free healthcare, this seems like common sense",
                ">Newsom’s office said that the governor will call for undocumented adults to pay $100 monthly premiums to receive Medi-Cal healthcare coverage. He would also call to block all new adult applicants for the program starting on January 1, 2026. Coverage for children will not be affected by these changes, nor would “limited-scope coverage” of things like emergency and pregnancy services.\nThose changes would save the state $5.4 billion through 2028-2029, the governor’s office said. The program providing free healthcare for all low-income migrants began on January 1, 2024.\n\nSo $100/month coverage for those already enrolled in this new program, sunset new applicants starting next year, and the most common uses of healthcare (ED and pregnancy services) are untouched. I don’t see this as an overly cruel change to what is pretty damn close to what free healthcare looks like in the US."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
            "external_url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
            "upvotes": 1369,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "great news.  And we need more good news these days",
                "Surely this is something that health groups trying to limit drug access and stop overdoses can take credit for and not just one person who wasn’t even in office last year, right?",
                "Going to go up now that MAGA took away Narcan funding",
                "Trump will say it’s his border control while MAGA fucks simultaneously reduce access to life saving medical equipment and procedures.",
                "Turns out harm reduction works better than criminalizing drug use or trying to shame people out of it",
                "I think it is because of legal weed and fear of bad drugs. I know some people who have turned to weed to successfully stop harder stuff.",
                "Seems like a great time to stop providing narcan /s",
                "Trump to claim credit in 3...2...",
                "Well, that went well. Too bad this admin is trashing the programs that helped.",
                "This certainly underscores the need for all of these illegal emergency power grabs by the Trump administration, doesn't it?\n\n\n>Increased availability of the overdose-reversing drug naloxone.\n\n\n>Expanded addiction treatment.\n\n\n>The growing impact of billions of dollars in opioid lawsuit settlement money.\n\n\nAnd it's a good thing the Trump administration is going to continue supporting these initiatives that have helped with the decline."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "Oklahoma education standards say students must identify 2020 election 'discrepancies'",
            "external_url": "https://www.npr.org/2025/05/14/nx-s1-5384282/oklahoma-education-standards-2020-election",
            "upvotes": 512,
            "date": "05/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4639x2609+0+88/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc3%2F8e%2Ff868d977431fac66f7adec1c1297%2Fap25027772468178.jpg",
            "top_comments": [
                "But I bet you can’t teach them the accurate and comprehensive history about slavery, Jim Crow laws, the KKK, the Civil Rights movement..",
                "If you can’t win history, rewrite it. Right comrads?",
                "And for World History they want students to identify what went right in 1933 German politics...",
                "Honestly, as a teacher I would take this and use it to start teaching about all the discrepancies involving misinformation surrounding the election.",
                "Remember when MAGA called education indoctrination? Maybe they were right",
                "\"TULSA, Okla. — New academic standards in Oklahoma call for the teaching of \"discrepancies\" in the 2020 election results, continuing the spread of a false narrative years after it was first pushed by President Trump and his allies.\"\n\n\"The standards were enacted last month after the Republican-controlled Legislature declined to block them. And while the process to advance the standards has drawn ire from members of Oklahoma's majority party, the question of the standards' content has gotten little pushback.\"\n\n\"The new standards have been championed by Ryan Walters, the state superintendent of public instruction and a conservative firebrand.\"\n\n#  \"These new standards will ensure that kids have an accurate and comprehensive view of historical events, while also reinforcing the values that make our country great,\" Walters said at a February State Board of Education meeting.\n\n\"The new standards were [quietly introduced just hours before that February meeting](https://www.kgou.org/education/2025-04-24/oklahoma-board-of-ed-pushes-back-on-social-studies-standards-senate-gop-poised-to-reject-them), and Walters falsely told board members that to make legislative deadlines, the standards needed to be approved that day. They were.\"\n\n\"While the standards are set to go into effect next school year, a lawsuit filed by a GOP former Oklahoma attorney general could stall their implementation.\"\n\n\"But like other criticisms coming from Republicans, the lawsuit calls out problems in the approval process — not the standards themselves.\"",
                "Oklahomans weren't satisfied being ranked 49th in Education. They really want that coveted 50th spot. ",
                "Why on earth would anyone live there if they had any other option?",
                "You mean the discrepancies that resulted in the people claiming they existed losing a bunch of lawsuits because they had zero evidence to back up their claims? Those discrepancies? ",
                "GOP and Oklahoma really fighting for that bottom position when it comes to education ranking."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Uruguay's José Mujica, world's 'poorest president', dies",
            "external_url": "https://www.bbc.com/news/articles/c0j71402z58o",
            "upvotes": 2046,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c871/live/51e9ec90-302a-11f0-9c4d-7b4728612d5d.jpg",
            "top_comments": [
                "Truly an inspiring person.",
                "Probably world's most honest and genuinely loved president as well. ",
                "You can judge a man's character when he has power. And this gentleman is a classy person who wants to serve\n\nRIP and hopefully more leaders will learn humility from this man",
                "Truly, he is one person who probably deserved to live forever.",
                "RIP. We lost a good one.",
                "The president should not be a billionaire",
                "Truly a leader from the people",
                "He was a good person and great president. Que en paz descanse",
                "Such a mensch. His memory for a blessing.",
                "Such an amazing story!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 2932,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "Out with the Flouride, In with the Flourine!",
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Delicious forever chemicals just what I needed.",
                "Thank God, we're getting something to replace Fluoride.",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Conservatism is well known to be incompatible with many things- prosperity, liberty, equality, democracy, science, rule of law, progress- and we can add simple decency of respecting the safety and value of the ordinary persons well being",
                "Environmental Pollution Agency",
                "Veritassium just pushed a video about PFAS\n\nhttps://youtu.be/SC2eSujzrUY"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 17991,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "I clicked this expecting to see that an intrepid journalist did some deep investigation to find proof of the flight change.\n\nBut no, this idiot just went on a radio show and announced it.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "Safe for me, but not for thee! Some of you may die, but that is a sacrifice I am willing to make.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "Messing with airports is a popular way for autocrats to consolidate control because it allows them to lead with fear.",
                "Okay, but what about her emails?",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???"
            ],
            "aggregate_sentiment": 11.0
        },
        {
            "category": "RISING",
            "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
            "external_url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
            "upvotes": 7767,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We are deporting students and importing cartels.",
                "Why is this not the top story on every news site?",
                "They must have bought one of Trump's immigration golden tickets.",
                "Ok lemme get this straight. Kids with cancer, Americans, veterans and immigrant with green cards are being deported to a country they’ve never been to BUT Mexican cartel members are being literally invited in? America is beyond fucked.",
                "Another day, another absolute “fuck you” to the American public…",
                "So letting actual violent foreigners in and deporting grad students and working parents",
                "$5 million dollars folks. And you get one of those fancy trump visas.",
                "Trump selling citizenships to cartel families and South African racists.",
                "Trump probably made money off of this. Plain and simple.  It's all transactional for him.",
                "TRUMP selling America to anybody that will pay him."
            ],
            "aggregate_sentiment": 6.0
        }
    ],
    "last_updated": "05/14/2025 20:08:27 UTC"
}