{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 15135,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "The Mouse is going to be angry!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump calls for broad drug price cuts in executive order",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-says-he-will-cut-drug-prices-by-59-2025-05-12/",
            "upvotes": 1044,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It will be as effective as Michael Scott screaming, \"I declare bankruptcy.\"",
                "“White House officials said the government will give drugmakers price targets in the next 30 days, and will take further action to lower prices if those companies do not make \"significant progress\" towards those goals within six months of the order being signed”\n\nPer usual, there is always some future date. Always a delay. Nothing will happen",
                "And then the drug manufacturers will raise their prices again.",
                "After he just got rid of Biden’s work to lower prices?\n\nIt never ends with this twat",
                "He did the same thing in his first term then never followed up on it. He also removed a Biden-era law that restricted insulin prices to $30, so he literally raised prices and is now acting like he’s saving us by lowering them back to Biden-era prices",
                "“Man who turned off the overhead lights announces plan to light a candle soon.”",
                "Didn’t he claim he was going to do this his first term too?",
                "He should tariff them at 125% then lower it to 10%, then declare it a “total reset” and success, and hope nobody notices it is 10% higher than before.",
                "When I see pandering like this (geriatrics) I immediately look at what he's trying to cover up in the news cycle.  \n\n\nHe is incapable of doing good things for other people unless it benefits him personally.  \n\n\nEverything is transactional, everything is quid pro quo, everything is computer.",
                "It's the insurance companies that's the (primary)issue not the manufacturers.  He's setting this up just to tariff the hell out of all Pharma related imports, which will not help reduce pricing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "'Children handcuffed and shot' - ex-UK Special Forces break silence on war crime claims",
            "external_url": "https://www.bbc.com/news/articles/cj3j5gxgz0do",
            "upvotes": 4431,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8442/live/4af02840-2efa-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "\"Former members of UK Special Forces have broken years of silence to give BBC Panorama eyewitness accounts of alleged war crimes committed by colleagues in Iraq and Afghanistan.\n\nGiving their accounts publicly for the first time, the veterans described seeing members of the SAS murder unarmed people in their sleep and execute handcuffed detainees, including children.\n\n\"They handcuffed a young boy and shot him,\" recalled one veteran who served with the SAS in Afghanistan. \"He was clearly a child, not even close to fighting age.\"\n\nKilling of detainees \"became routine\", the veteran said. \"They'd search someone, handcuff them, then shoot them\", before cutting off the plastic handcuffs used to restrain people and \"planting a pistol\" by the body, he said.\n\n...\n\nKnowledge of the alleged crimes was not confined to small teams or individual squadrons, according to the testimony. Within the UK Special Forces command structure, \"everyone knew\" what was happening, said one veteran.\n\n...\n\n\"There was a fake grenade they'd take with them onto target, it couldn't detonate,\" said a former SAS operator. Another veteran said operators would carry AK-47 rifles which had a folding stock because they were easier to fit into their rucksacks and \"easier to bring onto a target and plant by a body\".\n\nOfficers would then help to falsify post-operational reports in order to avoid scrutiny for the actions of assault teams on the ground, according to the testimony.\n\n...\n\n\"If it looked like a shooting could represent a breach of the rules of conflict, you'd get a phone call from the legal adviser or one of the staff officers in HQ. They'd pick you up on it and help you to clarify the language. 'Do you remember someone making a sudden move?' 'Oh yeah, I do now.' That sort of thing. It was built into the way we operated.\"\n\nThe reports were \"a fiction\", another UKSF veteran said.\n\nAn intelligence officer who worked with the SBS described reports which said they had been caught in a firefight, while the photos showed bodies with \"multiple clean headshots\".\n\n...\n\nThe Afghan president was \"so consistent with his complaints about night raids, civilian casualties and detentions that there was no senior Western diplomat or military leader who would have missed the fact that this was a major irritant for him,\" said Gen Douglas Lute, a former US ambassador to Nato.\n\n...\"",
                "We are outraged when Russian troops do stuff like this, and rightly so. We should be similarly outraged when friendly forces do such things. This wasn’t a small bunch of soldiers going rogue, this was an institutionalised disregard for the ethics of warfare and established military protocol.",
                "This is horrifying. All these people should be brought to justice. No whitewashing for european armies if they behave like bloodthirsty monster on the field. \n\nAn army that behaves like a mad beast should be restrained and reformed and the leaders that allowed it should be imprisoned and be made to paid for their complicity if not outright orders to do this. For all the supposed \"responsibilities\" of command that justifiers their higher salaries and benefits, they don't seem to accept the consequences of their failed leadership when the chickens come home to roost.",
                "At this point, we should all understand that these kinds of things will be happening any time we're sending people into these sorts of situations. War makes monsters of people, or at least lets monsters thrive. Is whatever we're doing with those boots on the ground worth that price?",
                "Remember that whole late 2000s early 2010s period of media glazing special forces as super soldiers and then it turns out they're just a bunch of sociopaths who failed to achieve anything",
                "It was a blatant and abhorrent invasion from day one:\n\n1. The sorry excuse of WMD to invade a foreign country by a set of countries playing games for their own personal gains.\n2. Studies say that around 0.5 Million people died due to the invasion and many more injured.\n3. Not to mention the damage to the infrastructure, political structures and the economic impact on the country invaded.\n\nThe media is complicit in all of this as the coverage was shameful to say the least. They have parroted the official propagandized versions for so long. The UN, for what its worth did not authorize the invasion.\n\nDid any of the true decision makers face the law due to this? Is there any guilt shown at the very least? Did some of them line-up their own pockets throughout this ordeal?\n\nThis will answer why massive \"mistakes\" of this ilk are being repeated at an alarming frequency.\n\nSources:\n\n[https://www.bbc.com/news/world-middle-east-24547256](https://www.bbc.com/news/world-middle-east-24547256)\n\n[https://watson.brown.edu/costsofwar/costs/human/civilians](https://watson.brown.edu/costsofwar/costs/human/civilians)",
                "Wondered why Boris was so keen to get immunity from war crimes for the armed forces. It was a weird thing to campaign on if one's hands were clean.",
                "As humans our capacity for inhumane violence is impressive and 100% depressing.",
                "[SAS unit repeatedly killed Afghan detainees, BBC finds](https://www.bbc.co.uk/news/uk-62083196)\n\nAnd 'The Overseas Operations Bill' gives them immunity.",
                "Maybe the guys whose entire careers revolve around dehumanization and killing aren’t great people on the inside regardless of which flag patch is on their arm. The more SF guys talk about SF life, the clearer it becomes that these types are school shooters who managed to keep a lid on it for a while."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 36123,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21615401-2114540-75-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Nothing says state secrets for sale, like a free jet.",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "He's incapable of doing a single thing worthy of the office.",
                "Perhaps we should make a provision in the Constitution to prohibit this? We could call it the Emoluments Clause or something.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Turkiye discovers 20bn barrels of crude oil in Somalia",
            "external_url": "https://www.middleeastmonitor.com/20250509-turkiye-discovers-20bn-barrels-of-crude-oil-in-somalia/",
            "upvotes": 1241,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you are sick of reading a variation of the same joke in every comment and want some context:\n\n“Turkey secures rights to 90 percent of oil and gas output in Somalia deal”\n\nFull article: https://nordicmonitor.com/2025/04/turkey-secures-exceptional-rights-in-somalia-oil-agreement-documents-show/",
                "Look! I \"discovered\" 30 gallons of gasoline in my neighbor's car! Well, I *say* \"neighbor;\" he lives a few blocks down the street. Any takers?",
                "We gonna get a sequel to Black Hawk Down soon",
                "Who put all those barrels there???",
                "US \"liberation\" of Somalia in 3... 2... 1...",
                "And I'm sure the impoverished people of Somalia will be getting their share of the profits... right? Right???",
                "At $66 per barrel and assuming that after extraction costs Somalia could walk away with about 15% of that, the 20B gallons would be worth about $200B.  Spread it out over \\~15-20 years and they'd roughly double their GDP.",
                "Perfect!  Because Somalia already has war, now they have the oil to ensure it continues.",
                "This will go well for the average Somali citizen, no doubt.",
                "Nice, Erdogan can get himself another golden toilet now."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "US and China are set to drastically roll back tariffs",
            "external_url": "https://www.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk",
            "upvotes": 1670,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214092889.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "A *temporary reduction* for 90 days. This administration is going to run 3 month pump and dump cycles on the entire market for the foreseeable future.",
                "He starts a fire and waits till the house is nearly burnt down then he puts it out and expects everyone to thank him with roaring applause for putting it out.",
                "Note how it says “temporary reduction” so he’ll just pull the same shit and manipulate the stock market again in a couple months.",
                "So -- it was all political theatre  this whole time?",
                "Imagine fucking things over only to claim you fixed things and think he did something great? Fuck him. He’s trying to make himself look like some sort of savior when he created this goddamn problem.",
                "The plan all along was to hurt the American public so badly with 165% tariffs that we would meekly accept and be grateful for a 30% tariff-MAKE NO MISTAKE, this is the biggest TAX INCREASE in American history and this money is directly controlled by Trump, NOT CONGRESS, which is the ONLY branch of government allowed to levy taxes and control the budget under the Constitution.",
                "\\> 90 days pause\n\n\\>still tariffs,just cuts\n\nOh fantastic, So instead of empty shelves just  in June and July. We'll have more empty shelves in fall or winter",
                "create the problem and then pat yourself on the back for fixing it.",
                "Everything about MAGA is a performance. They are acting out what it means to do things. Then they don't do them and act as if it was effective because they stopped it from being worse, though it was worse because they did something.",
                "(Trump admin): \"We had a great meeting.  We agreed to...X, Y, Z, but...it's only temporary and we might change our minds tomorrow.\" \n\n(China): We never talked about X, Y, Z.  We don't know what they're talking about. \"\n\n(Every business): \"Holy fucking shit!  What is even going on?! We can barely break even with a +100% price increase now, and we don't even know of that will be enough come tomorrow because everything constantly changes!  Can we have an actual non-psychotic adult run this country?!  We're trying to do actual business here!\""
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Convicted killer falls to death from Milan's famed Duomo cathedral after allegedly stabbing man, reports say",
            "external_url": "https://www.cbsnews.com/news/convicted-killer-dies-duomo-cathedral-reports/",
            "upvotes": 709,
            "date": "05/12/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/12/06c6669d-46ee-4f3d-9379-a39b6247b183/thumbnail/1200x630/45ea0028decb97b2fa0eeb6e1d5516f2/gettyimages-2211700674.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "> One witness, a bar owner named Emanuele Sanità, told the outlet that De Maria landed right next to a boy who was holding a stuffed animal.\n\n> \"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said\n\nHope they get that kid some therapy.",
                "From CBS:\n\n>A convicted murderer permitted to work outside prison threw himself from Milan's famed Duomo cathedral on Sunday, killing himself, after allegedly stabbing a colleague, local news reports said.\n\n>[ANSA news agency](https://www.ansa.it/lombardia/notizie/2025/05/11/emanuele-de-maria-suicida-dal-duomo-di-milano_4b25c690-d646-44f6-8dfd-c02d80d364ec.html) and other outlets reported said the Italian man, whom they identified as Emanuele De Maria, 35, fell \"dozens of meters\" after reportedly throwing himself from the Gothic cathedral into the square below.\n\n>The area surrounding the Duomo, Milan's most famed landmark, is usually teeming with people but news reports did not cite any injuries among passersby.\n\n>Television images showed police blocking off the area surrounding one of the sides of the cathedral.\n\n>Authorities identified De Maria — who went on television last year to describe his life — from an ID in his pocket and his tattoos, according to several reports, including Milan's [Corriere della Sera daily](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml).\n\n>One witness, a bar owner named Emanuele Sanità, [told the outlet](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml) that De Maria landed right next to a boy who was holding a stuffed animal.\n\n>\"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said.\n\n>De Maria had been serving a 14-year sentence after being convicted for the 2016 murder of a woman, according to reports. He was arrested in Germany in 2018 after hiding as a fugitive in the Netherlands, Milano Today [reported](https://www.milanotoday.it/cronaca/emanuele-de-maria-suicidio-duomo.html).\n\n>But for nearly two years he had been working part-time at a hotel near Milan's central train station.\n\n>Police had been searching for him since Friday, when he allegedly stabbed a work colleague. The condition of that man, identified as a 50-year-old Italian-Egyptian, was improving Sunday after emergency surgery on his neck and chest, Milano Today reported.",
                "I hope the kid that was close get some mental health check.",
                "JFC. This sounds like a weird tragic Italian opera.",
                "Agatha Christie says everyone took turns pushing him",
                "Did he miss the haystack?",
                "Murder who went on the run and was found in the Netherlands was allowed to work outside prison. \n\nInsanity.",
                "Letting a convicted murderer (who seemed to still be serving his sentence?) work in a hotel is a major yikes.",
                "I swear I've seen this movie",
                "I'd hate to cut and run, but..."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "HOT",
            "title": "1 dead, 4 hikers rescued after heat-related emergency at Arizona's Gold Canyon",
            "external_url": "https://abcnews.go.com/US/1-dead-4-hikers-rescued-after-heat-related/story?id=121699358",
            "upvotes": 1071,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a6d67c0f-36f9-4197-987b-477c10326808/SFMD_1747008470648_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Had some co-workers in town over a weekend and said they were gonna go hike part of the Pacific Crest trail.  I hike the area a lot and knew how hot it gets in the back country, so warned them that their windows was only like 5am to 11am and their day is over....oh no, we know what we're doing, no problem.\n\n\"Remember these words when you are out there and it's killing you, \"Oppressive Heat.\"\"\n\nMonday morning, \"We almost died....omg....\"",
                "After reading news stories like this, I'm genuinely curious if/why hikers either didn't check weather or didn't care.  It seems really asinine to go hiking in the middle of nowhere in this sort of heat.",
                "Article by Tristan Maglunog and T. Michelle Murphy\n\n>One person died on Sunday afternoon after suffering a heat-related medical emergency on the Wave Cave Trail at Gold Canyon, which is located just over 40 miles east of Phoenix, officials said, noting that four others from the hiking party were rescued.\n\n>Rescue teams responded to what they described as a \"1st alarm Mountain rescue\" after receiving a call from hikers just before 1 p.m. local time.\n\n>The hikers had been on the trails for some six hours when the rescue was initiated. One of the five -- a 33-year-old man -- was experiencing a medical emergency, according to the Pinal County Sheriff's Office.\n\n>Civilians from within the hiking party attempted to initiate CPR, according to the Superstition Fire and Medical District, which serves Gold Canyon.\n\n>Rescue teams took over CPR efforts upon reaching the scene, but \"unfortunately the patient did not survive,\" SFMD said in a statement.\n\n>Temperatures in the area were close to 100 degrees on Sunday, and the medical emergency was linked to the heat.\n\n>\"No foul play is suspected,\" PCSO said. \"The Pinal County Medical Examiner will determine the cause of death.\"\n\n>\"Tragically this mountain rescue resulted in one fatality,\" SFDM said in a statement on Facebook, adding that the other four in the group were assisted down the mountain but \"refused transport to the hospital.\"\n\n>Officials encouraged people to avoid Wave Cave Trail for the remainder of the day on Sunday.\n\n>SFMD added an advisory to its social media post, saying that Arizona summers can reach upward of 110 F and \"heat exhaustion or heat stroke can occur in under an hour.\"\n\n>\"Most heat deaths happen on trails between 10 a.m. and 4 p.m., the hottest part of the day,\" the post continued.\n\n>\"If you feel dizzy, nauseous, stop sweating, or become confused, get help immediately,\" SFMD added. \"Please stay safe and plan wisely. No hike is worth your life.\"",
                "Summer is not the time to be cavorting about the hot states. There's a reason trips are cheaper in the months that might kill you.",
                "I moved from the he Midwest to AZ in the middle of July - my vehicle overheated almost the moment I drove into Phoenix lol.\n\nThe first weekend there, we climbed Camelback Mountain - after a night of drinking. We were young and I most certainly overestimated myself.  We started early enough like 8 and made it to the top - made it down ok but struggled mightily. Also placed my hand on a cactus at one point which made my hand swell up. \n\nOverall learned a very valuable lesson about how the heat can mess w your body and was always extra careful after.",
                "people dont listen. tourists come here and dont realize how AZ is different then other states.  even locals screw up sometimes.    HEAT is no joke.",
                "Usually it's the Superstition Mountains that claim hikers.",
                "I am a former Arizonan. Locals know not to hike during the day this time of year. It’s already summer. Hotels need to do a better job warning tourists of the danger they face during hot weather hikes (and how serious it is not to bring enough water when you go out).",
                "Let's go hiking in the desert!",
                "A dry heat will still kill you."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Nissan to cut over 10,000 more jobs, NHK reports",
            "external_url": "https://www.reuters.com/sustainability/nissan-cut-over-10000-more-jobs-globally-nhk-reports-2025-05-12/",
            "upvotes": 367,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well shit, wish I saw this coming…\n\n“TOKYO, May 12 (Reuters) - Nissan Motor (7201.T) will cut more than 10,000 jobs globally, bringing the number of layoffs, including those previously announced, to about 20,000 or 15% of its workforce, Japan's public broadcaster NHK reported on Monday. Japan's third-biggest automaker is striving to make its business leaner and more resilient after weak sales in China and its biggest market the United States.\n\nNissan declined to comment on the report.\n\nIt is set to announce on Tuesday results for the business year that ended in March. It warned last month it would likely book a record 700 billion yen to 750 billion yen ($4.74 billion-$5.08 billion) net loss in that year due to impairment charges. The car maker missed out on the growing popularity of hybrid models in the United States and failed to capitalise on an early lead in electric vehicles there.\n\nIt has also suffered in China, the world's biggest auto market, where it plans to launch some 10 new vehicles in the coming years to try to halt a slide in sales. CEO Ivan Espinosa, who took over from Makoto Uchida as chief executive last month, is restructuring Nissan's operations and has previously said the company was considering extra measures. Nissan, which had more than 133,000 staff as of March last year, announced plans last November to cut 9,000 jobs and reduce global capacity by 20%. Advertisement · Scroll to continue It has also said it would close a plant in Thailand by June and shut two more plants that it has not identified.\n\nOn Friday, it said it had decided to give up a plan to build a $1.1 billion factory, for which it was set to receive government subsidies, for EV batteries on Japan's southwestern island of Kyushu. Its weak performance forced it to cut its profit outlook four times for the financial year that just ended.”",
                "My brother works for Nissan and is expecting his first kid.. this makes me nervous for him",
                "Wild that they declined to merge with Honda because they wanted to be an equal brand.   What is Nissan leadership?",
                "I predict Nissan stocks dumping.",
                "[deleted]",
                " How are these guys still in business this is the slowest business collapse that I can remember."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 181,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "FYI, the other state is North Dakota",
                "Paper shields don’t stop\n\n…everything.   They don’t seem to stop much at all these days. ",
                "A Republican Government for the Corporation, Lobbied by the Corporation, and against all non-millionaire people.",
                "I wonder how much Roundup is paying them.",
                "Next RFK and republicans will claim lead in pipes kept kids from getting autisim..",
                "For all of you criticising that measure, know that this same poison is protected in EU by EU itself.",
                "Protect the corporations and wealthy at all cost!   \n\nAlso, you better have a good job if you get cancer, because we're cutting medicade"
            ],
            "aggregate_sentiment": 63.0
        },
        {
            "category": "NEW",
            "title": "Gov. Gavin Newsom urges California cities and counties to ban homeless encampments",
            "external_url": "https://apnews.com/article/california-gavin-newsom-homelessness-bc6aab893308376ceb3672945f8a13de",
            "upvotes": 26,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is there enough housing available? No. This is just criminalizing being poor. Seems he really wants to run for President. Gotta go after the not in my backyard suburbs crowd.",
                "Ok, so where are those folks supposed to go? It’s not a crime to be unhoused.",
                "I think it's a good idea. But then what? \n\n  \nYou can't ban people. Those that are living in encampments are going to have to go somewhere. Where? \n\n  \nThose that are suffering from mental illness--if that mental illness is severe, how will they even understand what the ban on encampments means? We have no real services for in-patient residential care for the mentally ill.\n\nBanning camping without a plan for what comes next is planning to fail.",
                "One WEIRD trick to solve homelessness!",
                "Good.  Lock these people up.  Force them into shelters no matter how crowded they are.  They are not entitled to spread filth and disease and crime on our streets."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 176,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "FYI, the other state is North Dakota",
                "Paper shields don’t stop\n\n…everything.   They don’t seem to stop much at all these days. ",
                "A Republican Government for the Corporation, Lobbied by the Corporation, and against all non-millionaire people.",
                "I wonder how much Roundup is paying them.",
                "Next RFK and republicans will claim lead in pipes kept kids from getting autisim..",
                "For all of you criticising that measure, know that this same poison is protected in EU by EU itself.",
                "Protect the corporations and wealthy at all cost!   \n\nAlso, you better have a good job if you get cancer, because we're cutting medicare"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "NEW",
            "title": "Kurdish PKK ends 40-year Turkey insurgency, bringing hope of regional stability",
            "external_url": "https://www.reuters.com/world/middle-east/kurdish-pkk-dissolves-after-decades-struggle-with-turkey-news-agency-close-2025-05-12/",
            "upvotes": 18,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump calls for broad drug price cuts in executive order",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-says-he-will-cut-drug-prices-by-59-2025-05-12/",
            "upvotes": 1047,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It will be as effective as Michael Scott screaming, \"I declare bankruptcy.\"",
                "“White House officials said the government will give drugmakers price targets in the next 30 days, and will take further action to lower prices if those companies do not make \"significant progress\" towards those goals within six months of the order being signed”\n\nPer usual, there is always some future date. Always a delay. Nothing will happen",
                "And then the drug manufacturers will raise their prices again.",
                "After he just got rid of Biden’s work to lower prices?\n\nIt never ends with this twat",
                "He did the same thing in his first term then never followed up on it. He also removed a Biden-era law that restricted insulin prices to $30, so he literally raised prices and is now acting like he’s saving us by lowering them back to Biden-era prices",
                "“Man who turned off the overhead lights announces plan to light a candle soon.”",
                "Didn’t he claim he was going to do this his first term too?",
                "He should tariff them at 125% then lower it to 10%, then declare it a “total reset” and success, and hope nobody notices it is 10% higher than before.",
                "When I see pandering like this (geriatrics) I immediately look at what he's trying to cover up in the news cycle.  \n\n\nHe is incapable of doing good things for other people unless it benefits him personally.  \n\n\nEverything is transactional, everything is quid pro quo, everything is computer.",
                "It's the insurance companies that's the (primary)issue not the manufacturers.  He's setting this up just to tariff the hell out of all Pharma related imports, which will not help reduce pricing."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Man files lawsuit to prevent LA Zoo from relocating two Asian elephants to animal preserve in Oklahoma",
            "external_url": "https://www.cbsnews.com/losangeles/news/lawsuit-la-zoo-relocation-asian-elephants-animal-preserve-tulsa-oklahoma/",
            "upvotes": 141,
            "date": "05/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/12/5dc907fb-d3e6-49a6-8691-a1271f2c4c77/thumbnail/1200x630/4b672f7d88201355b9827f7f9a3fabf7/free-elephants.png?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "(“Preserve” in OK is actually another zoo.  Saved you a click.)",
                "I should become a lawyer. There is a ton of work there."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Nissan to cut over 10,000 more jobs, NHK reports",
            "external_url": "https://www.reuters.com/sustainability/nissan-cut-over-10000-more-jobs-globally-nhk-reports-2025-05-12/",
            "upvotes": 366,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well shit, wish I saw this coming…\n\n“TOKYO, May 12 (Reuters) - Nissan Motor (7201.T) will cut more than 10,000 jobs globally, bringing the number of layoffs, including those previously announced, to about 20,000 or 15% of its workforce, Japan's public broadcaster NHK reported on Monday. Japan's third-biggest automaker is striving to make its business leaner and more resilient after weak sales in China and its biggest market the United States.\n\nNissan declined to comment on the report.\n\nIt is set to announce on Tuesday results for the business year that ended in March. It warned last month it would likely book a record 700 billion yen to 750 billion yen ($4.74 billion-$5.08 billion) net loss in that year due to impairment charges. The car maker missed out on the growing popularity of hybrid models in the United States and failed to capitalise on an early lead in electric vehicles there.\n\nIt has also suffered in China, the world's biggest auto market, where it plans to launch some 10 new vehicles in the coming years to try to halt a slide in sales. CEO Ivan Espinosa, who took over from Makoto Uchida as chief executive last month, is restructuring Nissan's operations and has previously said the company was considering extra measures. Nissan, which had more than 133,000 staff as of March last year, announced plans last November to cut 9,000 jobs and reduce global capacity by 20%. Advertisement · Scroll to continue It has also said it would close a plant in Thailand by June and shut two more plants that it has not identified.\n\nOn Friday, it said it had decided to give up a plan to build a $1.1 billion factory, for which it was set to receive government subsidies, for EV batteries on Japan's southwestern island of Kyushu. Its weak performance forced it to cut its profit outlook four times for the financial year that just ended.”",
                "My brother works for Nissan and is expecting his first kid.. this makes me nervous for him",
                "Wild that they declined to merge with Honda because they wanted to be an equal brand.   What is Nissan leadership?",
                "I predict Nissan stocks dumping.",
                "[deleted]",
                " How are these guys still in business this is the slowest business collapse that I can remember."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Convicted killer falls to death from Milan's famed Duomo cathedral after allegedly stabbing man, reports say",
            "external_url": "https://www.cbsnews.com/news/convicted-killer-dies-duomo-cathedral-reports/",
            "upvotes": 713,
            "date": "05/12/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/12/06c6669d-46ee-4f3d-9379-a39b6247b183/thumbnail/1200x630/45ea0028decb97b2fa0eeb6e1d5516f2/gettyimages-2211700674.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "> One witness, a bar owner named Emanuele Sanità, told the outlet that De Maria landed right next to a boy who was holding a stuffed animal.\n\n> \"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said\n\nHope they get that kid some therapy.",
                "From CBS:\n\n>A convicted murderer permitted to work outside prison threw himself from Milan's famed Duomo cathedral on Sunday, killing himself, after allegedly stabbing a colleague, local news reports said.\n\n>[ANSA news agency](https://www.ansa.it/lombardia/notizie/2025/05/11/emanuele-de-maria-suicida-dal-duomo-di-milano_4b25c690-d646-44f6-8dfd-c02d80d364ec.html) and other outlets reported said the Italian man, whom they identified as Emanuele De Maria, 35, fell \"dozens of meters\" after reportedly throwing himself from the Gothic cathedral into the square below.\n\n>The area surrounding the Duomo, Milan's most famed landmark, is usually teeming with people but news reports did not cite any injuries among passersby.\n\n>Television images showed police blocking off the area surrounding one of the sides of the cathedral.\n\n>Authorities identified De Maria — who went on television last year to describe his life — from an ID in his pocket and his tattoos, according to several reports, including Milan's [Corriere della Sera daily](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml).\n\n>One witness, a bar owner named Emanuele Sanità, [told the outlet](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml) that De Maria landed right next to a boy who was holding a stuffed animal.\n\n>\"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said.\n\n>De Maria had been serving a 14-year sentence after being convicted for the 2016 murder of a woman, according to reports. He was arrested in Germany in 2018 after hiding as a fugitive in the Netherlands, Milano Today [reported](https://www.milanotoday.it/cronaca/emanuele-de-maria-suicidio-duomo.html).\n\n>But for nearly two years he had been working part-time at a hotel near Milan's central train station.\n\n>Police had been searching for him since Friday, when he allegedly stabbed a work colleague. The condition of that man, identified as a 50-year-old Italian-Egyptian, was improving Sunday after emergency surgery on his neck and chest, Milano Today reported.",
                "I hope the kid that was close get some mental health check.",
                "JFC. This sounds like a weird tragic Italian opera.",
                "Agatha Christie says everyone took turns pushing him",
                "Did he miss the haystack?",
                "Murder who went on the run and was found in the Netherlands was allowed to work outside prison. \n\nInsanity.",
                "Letting a convicted murderer (who seemed to still be serving his sentence?) work in a hotel is a major yikes.",
                "I swear I've seen this movie",
                "I'd hate to cut and run, but..."
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "NEW",
            "title": "Residents jump from windows during Milwaukee apartment fire that kills 4",
            "external_url": "https://www.nbcnews.com/news/us-news/residents-jump-windows-milwaukee-apartment-fire-kills-4-rcna206195",
            "upvotes": 490,
            "date": "05/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250512-milwaukee-fire-mb-0923-0604d1.jpg",
            "top_comments": [
                "Sprinkler systems save lives, period.",
                "From AP:\n\n>MILWAUKEE — Residents jumped from the windows of a four-story apartment building in Milwaukee during a Mother’s Day fire that killed four people, critically injured four others and grew so intense that the blaze outmatched the first firefighters to arrive, authorities said.\n\n>Ladder trucks were used to rescue other residents from windows while some firefighters inside the burning building crawled on hands and knees to get people out, Milwaukee Fire Chief Aaron Lipski said Sunday. In all, about 30 people were rescued.\n\n>Authorities have not said how the fire might have started.\n\n>Lipski said the building did not have a sprinkler system and was built in 1968, predating a law that would have required one, according to the fire chief.\n\n>“If we had sprinklers in the buidling we would have stopped the fire very, very small. We would not of had to have people jumping out of windows,” he said.\n\n>Several other residents were treated for lesser injuries in the fire that began sometime before 8 a.m. The blaze rendered the 85-unit building uninhabitable, displacing an estimated 200 people.\n\n>James Rubinstein, a resident in the building, said he jumped to the ground floor.\n\n>“There was so much smoke. I climbed out the courtyard with my cat in my backpack,” Rubinstein told television station FOX6 Milwaukee.\n\n>Emergency operaters received calls that people were trapped and jumping to escape. The first firefighters to arrive were “far, far outmatched” by intense flames, Lipski said.\n\n>Authorities did not immediately release the identities or ages of the victims. Lipski said the fire began in a common area and spread to multiple floors.\n\n>Eddie Edwards, another resident of the building, said he also jumped to escape.\n\n>“I wasn’t thinking about nothing but getting away,” he told Milwaukee television station WISN. “Getting out and saving everyone’s life. It was a scary moment.”",
                "A fifth person has died from their injuries as of this morning 😞 https://www.tmj4.com/news/milwaukee-county/milwaukee-county-medical-examiner-called-to-the-scene-of-fatal-fire-near-27th-and-highland?fbclid=IwZXh0bgNhZW0CMTEAAR57uRCsSu-6f60g35bCe7KrFo-pcHGfyz6hScsm5b49zGK48GcmkF46Pyl_Dw_aem_vT_wUyIFy88-QNypGepi1Q",
                "A reminder that you can buy emergency fire escape ladders if you are concerned about being able to escape from an upper floor.",
                "> We would **not of had** to have people jumping out of windows,” he said.\n\nGreat job NBC news",
                "There’s an update that arson is suspected.",
                "[deleted]"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Turkiye discovers 20bn barrels of crude oil in Somalia",
            "external_url": "https://www.middleeastmonitor.com/20250509-turkiye-discovers-20bn-barrels-of-crude-oil-in-somalia/",
            "upvotes": 1240,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you are sick of reading a variation of the same joke in every comment and want some context:\n\n“Turkey secures rights to 90 percent of oil and gas output in Somalia deal”\n\nFull article: https://nordicmonitor.com/2025/04/turkey-secures-exceptional-rights-in-somalia-oil-agreement-documents-show/",
                "Look! I \"discovered\" 30 gallons of gasoline in my neighbor's car! Well, I *say* \"neighbor;\" he lives a few blocks down the street. Any takers?",
                "We gonna get a sequel to Black Hawk Down soon",
                "Who put all those barrels there???",
                "US \"liberation\" of Somalia in 3... 2... 1...",
                "And I'm sure the impoverished people of Somalia will be getting their share of the profits... right? Right???",
                "At $66 per barrel and assuming that after extraction costs Somalia could walk away with about 15% of that, the 20B gallons would be worth about $200B.  Spread it out over \\~15-20 years and they'd roughly double their GDP.",
                "Perfect!  Because Somalia already has war, now they have the oil to ensure it continues.",
                "This will go well for the average Somali citizen, no doubt.",
                "Nice, Erdogan can get himself another golden toilet now."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "1 dead, 4 hikers rescued after heat-related emergency at Arizona's Gold Canyon",
            "external_url": "https://abcnews.go.com/US/1-dead-4-hikers-rescued-after-heat-related/story?id=121699358",
            "upvotes": 1079,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a6d67c0f-36f9-4197-987b-477c10326808/SFMD_1747008470648_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Had some co-workers in town over a weekend and said they were gonna go hike part of the Pacific Crest trail.  I hike the area a lot and knew how hot it gets in the back country, so warned them that their windows was only like 5am to 11am and their day is over....oh no, we know what we're doing, no problem.\n\n\"Remember these words when you are out there and it's killing you, \"Oppressive Heat.\"\"\n\nMonday morning, \"We almost died....omg....\"",
                "After reading news stories like this, I'm genuinely curious if/why hikers either didn't check weather or didn't care.  It seems really asinine to go hiking in the middle of nowhere in this sort of heat.",
                "Article by Tristan Maglunog and T. Michelle Murphy\n\n>One person died on Sunday afternoon after suffering a heat-related medical emergency on the Wave Cave Trail at Gold Canyon, which is located just over 40 miles east of Phoenix, officials said, noting that four others from the hiking party were rescued.\n\n>Rescue teams responded to what they described as a \"1st alarm Mountain rescue\" after receiving a call from hikers just before 1 p.m. local time.\n\n>The hikers had been on the trails for some six hours when the rescue was initiated. One of the five -- a 33-year-old man -- was experiencing a medical emergency, according to the Pinal County Sheriff's Office.\n\n>Civilians from within the hiking party attempted to initiate CPR, according to the Superstition Fire and Medical District, which serves Gold Canyon.\n\n>Rescue teams took over CPR efforts upon reaching the scene, but \"unfortunately the patient did not survive,\" SFMD said in a statement.\n\n>Temperatures in the area were close to 100 degrees on Sunday, and the medical emergency was linked to the heat.\n\n>\"No foul play is suspected,\" PCSO said. \"The Pinal County Medical Examiner will determine the cause of death.\"\n\n>\"Tragically this mountain rescue resulted in one fatality,\" SFDM said in a statement on Facebook, adding that the other four in the group were assisted down the mountain but \"refused transport to the hospital.\"\n\n>Officials encouraged people to avoid Wave Cave Trail for the remainder of the day on Sunday.\n\n>SFMD added an advisory to its social media post, saying that Arizona summers can reach upward of 110 F and \"heat exhaustion or heat stroke can occur in under an hour.\"\n\n>\"Most heat deaths happen on trails between 10 a.m. and 4 p.m., the hottest part of the day,\" the post continued.\n\n>\"If you feel dizzy, nauseous, stop sweating, or become confused, get help immediately,\" SFMD added. \"Please stay safe and plan wisely. No hike is worth your life.\"",
                "Summer is not the time to be cavorting about the hot states. There's a reason trips are cheaper in the months that might kill you.",
                "I moved from the he Midwest to AZ in the middle of July - my vehicle overheated almost the moment I drove into Phoenix lol.\n\nThe first weekend there, we climbed Camelback Mountain - after a night of drinking. We were young and I most certainly overestimated myself.  We started early enough like 8 and made it to the top - made it down ok but struggled mightily. Also placed my hand on a cactus at one point which made my hand swell up. \n\nOverall learned a very valuable lesson about how the heat can mess w your body and was always extra careful after.",
                "people dont listen. tourists come here and dont realize how AZ is different then other states.  even locals screw up sometimes.    HEAT is no joke.",
                "Usually it's the Superstition Mountains that claim hikers.",
                "I am a former Arizonan. Locals know not to hike during the day this time of year. It’s already summer. Hotels need to do a better job warning tourists of the danger they face during hot weather hikes (and how serious it is not to bring enough water when you go out).",
                "Let's go hiking in the desert!",
                "A dry heat will still kill you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Nissan to cut over 10,000 more jobs, NHK reports",
            "external_url": "https://www.reuters.com/sustainability/nissan-cut-over-10000-more-jobs-globally-nhk-reports-2025-05-12/",
            "upvotes": 365,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well shit, wish I saw this coming…\n\n“TOKYO, May 12 (Reuters) - Nissan Motor (7201.T) will cut more than 10,000 jobs globally, bringing the number of layoffs, including those previously announced, to about 20,000 or 15% of its workforce, Japan's public broadcaster NHK reported on Monday. Japan's third-biggest automaker is striving to make its business leaner and more resilient after weak sales in China and its biggest market the United States.\n\nNissan declined to comment on the report.\n\nIt is set to announce on Tuesday results for the business year that ended in March. It warned last month it would likely book a record 700 billion yen to 750 billion yen ($4.74 billion-$5.08 billion) net loss in that year due to impairment charges. The car maker missed out on the growing popularity of hybrid models in the United States and failed to capitalise on an early lead in electric vehicles there.\n\nIt has also suffered in China, the world's biggest auto market, where it plans to launch some 10 new vehicles in the coming years to try to halt a slide in sales. CEO Ivan Espinosa, who took over from Makoto Uchida as chief executive last month, is restructuring Nissan's operations and has previously said the company was considering extra measures. Nissan, which had more than 133,000 staff as of March last year, announced plans last November to cut 9,000 jobs and reduce global capacity by 20%. Advertisement · Scroll to continue It has also said it would close a plant in Thailand by June and shut two more plants that it has not identified.\n\nOn Friday, it said it had decided to give up a plan to build a $1.1 billion factory, for which it was set to receive government subsidies, for EV batteries on Japan's southwestern island of Kyushu. Its weak performance forced it to cut its profit outlook four times for the financial year that just ended.”",
                "My brother works for Nissan and is expecting his first kid.. this makes me nervous for him",
                "Wild that they declined to merge with Honda because they wanted to be an equal brand.   What is Nissan leadership?",
                "I predict Nissan stocks dumping.",
                "[deleted]",
                " How are these guys still in business this is the slowest business collapse that I can remember."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump calls for broad drug price cuts in executive order",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-says-he-will-cut-drug-prices-by-59-2025-05-12/",
            "upvotes": 1049,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It will be as effective as Michael Scott screaming, \"I declare bankruptcy.\"",
                "“White House officials said the government will give drugmakers price targets in the next 30 days, and will take further action to lower prices if those companies do not make \"significant progress\" towards those goals within six months of the order being signed”\n\nPer usual, there is always some future date. Always a delay. Nothing will happen",
                "And then the drug manufacturers will raise their prices again.",
                "After he just got rid of Biden’s work to lower prices?\n\nIt never ends with this twat",
                "He did the same thing in his first term then never followed up on it. He also removed a Biden-era law that restricted insulin prices to $30, so he literally raised prices and is now acting like he’s saving us by lowering them back to Biden-era prices",
                "“Man who turned off the overhead lights announces plan to light a candle soon.”",
                "Didn’t he claim he was going to do this his first term too?",
                "He should tariff them at 125% then lower it to 10%, then declare it a “total reset” and success, and hope nobody notices it is 10% higher than before.",
                "When I see pandering like this (geriatrics) I immediately look at what he's trying to cover up in the news cycle.  \n\n\nHe is incapable of doing good things for other people unless it benefits him personally.  \n\n\nEverything is transactional, everything is quid pro quo, everything is computer.",
                "It's the insurance companies that's the (primary)issue not the manufacturers.  He's setting this up just to tariff the hell out of all Pharma related imports, which will not help reduce pricing."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Convicted killer falls to death from Milan's famed Duomo cathedral after allegedly stabbing man, reports say",
            "external_url": "https://www.cbsnews.com/news/convicted-killer-dies-duomo-cathedral-reports/",
            "upvotes": 710,
            "date": "05/12/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/12/06c6669d-46ee-4f3d-9379-a39b6247b183/thumbnail/1200x630/45ea0028decb97b2fa0eeb6e1d5516f2/gettyimages-2211700674.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "> One witness, a bar owner named Emanuele Sanità, told the outlet that De Maria landed right next to a boy who was holding a stuffed animal.\n\n> \"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said\n\nHope they get that kid some therapy.",
                "From CBS:\n\n>A convicted murderer permitted to work outside prison threw himself from Milan's famed Duomo cathedral on Sunday, killing himself, after allegedly stabbing a colleague, local news reports said.\n\n>[ANSA news agency](https://www.ansa.it/lombardia/notizie/2025/05/11/emanuele-de-maria-suicida-dal-duomo-di-milano_4b25c690-d646-44f6-8dfd-c02d80d364ec.html) and other outlets reported said the Italian man, whom they identified as Emanuele De Maria, 35, fell \"dozens of meters\" after reportedly throwing himself from the Gothic cathedral into the square below.\n\n>The area surrounding the Duomo, Milan's most famed landmark, is usually teeming with people but news reports did not cite any injuries among passersby.\n\n>Television images showed police blocking off the area surrounding one of the sides of the cathedral.\n\n>Authorities identified De Maria — who went on television last year to describe his life — from an ID in his pocket and his tattoos, according to several reports, including Milan's [Corriere della Sera daily](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml).\n\n>One witness, a bar owner named Emanuele Sanità, [told the outlet](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml) that De Maria landed right next to a boy who was holding a stuffed animal.\n\n>\"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said.\n\n>De Maria had been serving a 14-year sentence after being convicted for the 2016 murder of a woman, according to reports. He was arrested in Germany in 2018 after hiding as a fugitive in the Netherlands, Milano Today [reported](https://www.milanotoday.it/cronaca/emanuele-de-maria-suicidio-duomo.html).\n\n>But for nearly two years he had been working part-time at a hotel near Milan's central train station.\n\n>Police had been searching for him since Friday, when he allegedly stabbed a work colleague. The condition of that man, identified as a 50-year-old Italian-Egyptian, was improving Sunday after emergency surgery on his neck and chest, Milano Today reported.",
                "I hope the kid that was close get some mental health check.",
                "JFC. This sounds like a weird tragic Italian opera.",
                "Agatha Christie says everyone took turns pushing him",
                "Did he miss the haystack?",
                "Murder who went on the run and was found in the Netherlands was allowed to work outside prison. \n\nInsanity.",
                "Letting a convicted murderer (who seemed to still be serving his sentence?) work in a hotel is a major yikes.",
                "I swear I've seen this movie",
                "I'd hate to cut and run, but..."
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "RISING",
            "title": "'Children handcuffed and shot' - ex-UK Special Forces break silence on war crime claims",
            "external_url": "https://www.bbc.com/news/articles/cj3j5gxgz0do",
            "upvotes": 4427,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8442/live/4af02840-2efa-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "\"Former members of UK Special Forces have broken years of silence to give BBC Panorama eyewitness accounts of alleged war crimes committed by colleagues in Iraq and Afghanistan.\n\nGiving their accounts publicly for the first time, the veterans described seeing members of the SAS murder unarmed people in their sleep and execute handcuffed detainees, including children.\n\n\"They handcuffed a young boy and shot him,\" recalled one veteran who served with the SAS in Afghanistan. \"He was clearly a child, not even close to fighting age.\"\n\nKilling of detainees \"became routine\", the veteran said. \"They'd search someone, handcuff them, then shoot them\", before cutting off the plastic handcuffs used to restrain people and \"planting a pistol\" by the body, he said.\n\n...\n\nKnowledge of the alleged crimes was not confined to small teams or individual squadrons, according to the testimony. Within the UK Special Forces command structure, \"everyone knew\" what was happening, said one veteran.\n\n...\n\n\"There was a fake grenade they'd take with them onto target, it couldn't detonate,\" said a former SAS operator. Another veteran said operators would carry AK-47 rifles which had a folding stock because they were easier to fit into their rucksacks and \"easier to bring onto a target and plant by a body\".\n\nOfficers would then help to falsify post-operational reports in order to avoid scrutiny for the actions of assault teams on the ground, according to the testimony.\n\n...\n\n\"If it looked like a shooting could represent a breach of the rules of conflict, you'd get a phone call from the legal adviser or one of the staff officers in HQ. They'd pick you up on it and help you to clarify the language. 'Do you remember someone making a sudden move?' 'Oh yeah, I do now.' That sort of thing. It was built into the way we operated.\"\n\nThe reports were \"a fiction\", another UKSF veteran said.\n\nAn intelligence officer who worked with the SBS described reports which said they had been caught in a firefight, while the photos showed bodies with \"multiple clean headshots\".\n\n...\n\nThe Afghan president was \"so consistent with his complaints about night raids, civilian casualties and detentions that there was no senior Western diplomat or military leader who would have missed the fact that this was a major irritant for him,\" said Gen Douglas Lute, a former US ambassador to Nato.\n\n...\"",
                "We are outraged when Russian troops do stuff like this, and rightly so. We should be similarly outraged when friendly forces do such things. This wasn’t a small bunch of soldiers going rogue, this was an institutionalised disregard for the ethics of warfare and established military protocol.",
                "This is horrifying. All these people should be brought to justice. No whitewashing for european armies if they behave like bloodthirsty monster on the field. \n\nAn army that behaves like a mad beast should be restrained and reformed and the leaders that allowed it should be imprisoned and be made to paid for their complicity if not outright orders to do this. For all the supposed \"responsibilities\" of command that justifiers their higher salaries and benefits, they don't seem to accept the consequences of their failed leadership when the chickens come home to roost.",
                "At this point, we should all understand that these kinds of things will be happening any time we're sending people into these sorts of situations. War makes monsters of people, or at least lets monsters thrive. Is whatever we're doing with those boots on the ground worth that price?",
                "Remember that whole late 2000s early 2010s period of media glazing special forces as super soldiers and then it turns out they're just a bunch of sociopaths who failed to achieve anything",
                "It was a blatant and abhorrent invasion from day one:\n\n1. The sorry excuse of WMD to invade a foreign country by a set of countries playing games for their own personal gains.\n2. Studies say that around 0.5 Million people died due to the invasion and many more injured.\n3. Not to mention the damage to the infrastructure, political structures and the economic impact on the country invaded.\n\nThe media is complicit in all of this as the coverage was shameful to say the least. They have parroted the official propagandized versions for so long. The UN, for what its worth did not authorize the invasion.\n\nDid any of the true decision makers face the law due to this? Is there any guilt shown at the very least? Did some of them line-up their own pockets throughout this ordeal?\n\nThis will answer why massive \"mistakes\" of this ilk are being repeated at an alarming frequency.\n\nSources:\n\n[https://www.bbc.com/news/world-middle-east-24547256](https://www.bbc.com/news/world-middle-east-24547256)\n\n[https://watson.brown.edu/costsofwar/costs/human/civilians](https://watson.brown.edu/costsofwar/costs/human/civilians)",
                "Wondered why Boris was so keen to get immunity from war crimes for the armed forces. It was a weird thing to campaign on if one's hands were clean.",
                "As humans our capacity for inhumane violence is impressive and 100% depressing.",
                "[SAS unit repeatedly killed Afghan detainees, BBC finds](https://www.bbc.co.uk/news/uk-62083196)\n\nAnd 'The Overseas Operations Bill' gives them immunity.",
                "Maybe the guys whose entire careers revolve around dehumanization and killing aren’t great people on the inside regardless of which flag patch is on their arm. The more SF guys talk about SF life, the clearer it becomes that these types are school shooters who managed to keep a lid on it for a while."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "RISING",
            "title": "Turkiye discovers 20bn barrels of crude oil in Somalia",
            "external_url": "https://www.middleeastmonitor.com/20250509-turkiye-discovers-20bn-barrels-of-crude-oil-in-somalia/",
            "upvotes": 1240,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you are sick of reading a variation of the same joke in every comment and want some context:\n\n“Turkey secures rights to 90 percent of oil and gas output in Somalia deal”\n\nFull article: https://nordicmonitor.com/2025/04/turkey-secures-exceptional-rights-in-somalia-oil-agreement-documents-show/",
                "Look! I \"discovered\" 30 gallons of gasoline in my neighbor's car! Well, I *say* \"neighbor;\" he lives a few blocks down the street. Any takers?",
                "We gonna get a sequel to Black Hawk Down soon",
                "Who put all those barrels there???",
                "US \"liberation\" of Somalia in 3... 2... 1...",
                "And I'm sure the impoverished people of Somalia will be getting their share of the profits... right? Right???",
                "At $66 per barrel and assuming that after extraction costs Somalia could walk away with about 15% of that, the 20B gallons would be worth about $200B.  Spread it out over \\~15-20 years and they'd roughly double their GDP.",
                "Perfect!  Because Somalia already has war, now they have the oil to ensure it continues.",
                "This will go well for the average Somali citizen, no doubt.",
                "Nice, Erdogan can get himself another golden toilet now."
            ],
            "aggregate_sentiment": 83.0
        },
        {
            "category": "RISING",
            "title": "Residents jump from windows during Milwaukee apartment fire that kills 4",
            "external_url": "https://www.nbcnews.com/news/us-news/residents-jump-windows-milwaukee-apartment-fire-kills-4-rcna206195",
            "upvotes": 491,
            "date": "05/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250512-milwaukee-fire-mb-0923-0604d1.jpg",
            "top_comments": [
                "Sprinkler systems save lives, period.",
                "From AP:\n\n>MILWAUKEE — Residents jumped from the windows of a four-story apartment building in Milwaukee during a Mother’s Day fire that killed four people, critically injured four others and grew so intense that the blaze outmatched the first firefighters to arrive, authorities said.\n\n>Ladder trucks were used to rescue other residents from windows while some firefighters inside the burning building crawled on hands and knees to get people out, Milwaukee Fire Chief Aaron Lipski said Sunday. In all, about 30 people were rescued.\n\n>Authorities have not said how the fire might have started.\n\n>Lipski said the building did not have a sprinkler system and was built in 1968, predating a law that would have required one, according to the fire chief.\n\n>“If we had sprinklers in the buidling we would have stopped the fire very, very small. We would not of had to have people jumping out of windows,” he said.\n\n>Several other residents were treated for lesser injuries in the fire that began sometime before 8 a.m. The blaze rendered the 85-unit building uninhabitable, displacing an estimated 200 people.\n\n>James Rubinstein, a resident in the building, said he jumped to the ground floor.\n\n>“There was so much smoke. I climbed out the courtyard with my cat in my backpack,” Rubinstein told television station FOX6 Milwaukee.\n\n>Emergency operaters received calls that people were trapped and jumping to escape. The first firefighters to arrive were “far, far outmatched” by intense flames, Lipski said.\n\n>Authorities did not immediately release the identities or ages of the victims. Lipski said the fire began in a common area and spread to multiple floors.\n\n>Eddie Edwards, another resident of the building, said he also jumped to escape.\n\n>“I wasn’t thinking about nothing but getting away,” he told Milwaukee television station WISN. “Getting out and saving everyone’s life. It was a scary moment.”",
                "A fifth person has died from their injuries as of this morning 😞 https://www.tmj4.com/news/milwaukee-county/milwaukee-county-medical-examiner-called-to-the-scene-of-fatal-fire-near-27th-and-highland?fbclid=IwZXh0bgNhZW0CMTEAAR57uRCsSu-6f60g35bCe7KrFo-pcHGfyz6hScsm5b49zGK48GcmkF46Pyl_Dw_aem_vT_wUyIFy88-QNypGepi1Q",
                "A reminder that you can buy emergency fire escape ladders if you are concerned about being able to escape from an upper floor.",
                "> We would **not of had** to have people jumping out of windows,” he said.\n\nGreat job NBC news",
                "There’s an update that arson is suspected.",
                "[deleted]"
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "RISING",
            "title": "1 dead, 4 hikers rescued after heat-related emergency at Arizona's Gold Canyon",
            "external_url": "https://abcnews.go.com/US/1-dead-4-hikers-rescued-after-heat-related/story?id=121699358",
            "upvotes": 1071,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a6d67c0f-36f9-4197-987b-477c10326808/SFMD_1747008470648_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Had some co-workers in town over a weekend and said they were gonna go hike part of the Pacific Crest trail.  I hike the area a lot and knew how hot it gets in the back country, so warned them that their windows was only like 5am to 11am and their day is over....oh no, we know what we're doing, no problem.\n\n\"Remember these words when you are out there and it's killing you, \"Oppressive Heat.\"\"\n\nMonday morning, \"We almost died....omg....\"",
                "After reading news stories like this, I'm genuinely curious if/why hikers either didn't check weather or didn't care.  It seems really asinine to go hiking in the middle of nowhere in this sort of heat.",
                "Article by Tristan Maglunog and T. Michelle Murphy\n\n>One person died on Sunday afternoon after suffering a heat-related medical emergency on the Wave Cave Trail at Gold Canyon, which is located just over 40 miles east of Phoenix, officials said, noting that four others from the hiking party were rescued.\n\n>Rescue teams responded to what they described as a \"1st alarm Mountain rescue\" after receiving a call from hikers just before 1 p.m. local time.\n\n>The hikers had been on the trails for some six hours when the rescue was initiated. One of the five -- a 33-year-old man -- was experiencing a medical emergency, according to the Pinal County Sheriff's Office.\n\n>Civilians from within the hiking party attempted to initiate CPR, according to the Superstition Fire and Medical District, which serves Gold Canyon.\n\n>Rescue teams took over CPR efforts upon reaching the scene, but \"unfortunately the patient did not survive,\" SFMD said in a statement.\n\n>Temperatures in the area were close to 100 degrees on Sunday, and the medical emergency was linked to the heat.\n\n>\"No foul play is suspected,\" PCSO said. \"The Pinal County Medical Examiner will determine the cause of death.\"\n\n>\"Tragically this mountain rescue resulted in one fatality,\" SFDM said in a statement on Facebook, adding that the other four in the group were assisted down the mountain but \"refused transport to the hospital.\"\n\n>Officials encouraged people to avoid Wave Cave Trail for the remainder of the day on Sunday.\n\n>SFMD added an advisory to its social media post, saying that Arizona summers can reach upward of 110 F and \"heat exhaustion or heat stroke can occur in under an hour.\"\n\n>\"Most heat deaths happen on trails between 10 a.m. and 4 p.m., the hottest part of the day,\" the post continued.\n\n>\"If you feel dizzy, nauseous, stop sweating, or become confused, get help immediately,\" SFMD added. \"Please stay safe and plan wisely. No hike is worth your life.\"",
                "Summer is not the time to be cavorting about the hot states. There's a reason trips are cheaper in the months that might kill you.",
                "I moved from the he Midwest to AZ in the middle of July - my vehicle overheated almost the moment I drove into Phoenix lol.\n\nThe first weekend there, we climbed Camelback Mountain - after a night of drinking. We were young and I most certainly overestimated myself.  We started early enough like 8 and made it to the top - made it down ok but struggled mightily. Also placed my hand on a cactus at one point which made my hand swell up. \n\nOverall learned a very valuable lesson about how the heat can mess w your body and was always extra careful after.",
                "people dont listen. tourists come here and dont realize how AZ is different then other states.  even locals screw up sometimes.    HEAT is no joke.",
                "Usually it's the Superstition Mountains that claim hikers.",
                "I am a former Arizonan. Locals know not to hike during the day this time of year. It’s already summer. Hotels need to do a better job warning tourists of the danger they face during hot weather hikes (and how serious it is not to bring enough water when you go out).",
                "Let's go hiking in the desert!",
                "A dry heat will still kill you."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "US and China are set to drastically roll back tariffs",
            "external_url": "https://www.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk",
            "upvotes": 1665,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214092889.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "A *temporary reduction* for 90 days. This administration is going to run 3 month pump and dump cycles on the entire market for the foreseeable future.",
                "He starts a fire and waits till the house is nearly burnt down then he puts it out and expects everyone to thank him with roaring applause for putting it out.",
                "Note how it says “temporary reduction” so he’ll just pull the same shit and manipulate the stock market again in a couple months.",
                "So -- it was all political theatre  this whole time?",
                "Imagine fucking things over only to claim you fixed things and think he did something great? Fuck him. He’s trying to make himself look like some sort of savior when he created this goddamn problem.",
                "The plan all along was to hurt the American public so badly with 165% tariffs that we would meekly accept and be grateful for a 30% tariff-MAKE NO MISTAKE, this is the biggest TAX INCREASE in American history and this money is directly controlled by Trump, NOT CONGRESS, which is the ONLY branch of government allowed to levy taxes and control the budget under the Constitution.",
                "\\> 90 days pause\n\n\\>still tariffs,just cuts\n\nOh fantastic, So instead of empty shelves just  in June and July. We'll have more empty shelves in fall or winter",
                "create the problem and then pat yourself on the back for fixing it.",
                "Everything about MAGA is a performance. They are acting out what it means to do things. Then they don't do them and act as if it was effective because they stopped it from being worse, though it was worse because they did something.",
                "(Trump admin): \"We had a great meeting.  We agreed to...X, Y, Z, but...it's only temporary and we might change our minds tomorrow.\" \n\n(China): We never talked about X, Y, Z.  We don't know what they're talking about. \"\n\n(Every business): \"Holy fucking shit!  What is even going on?! We can barely break even with a +100% price increase now, and we don't even know of that will be enough come tomorrow because everything constantly changes!  Can we have an actual non-psychotic adult run this country?!  We're trying to do actual business here!\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 15131,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "The Mouse is going to be angry!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 36129,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21615401-2114540-75-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Nothing says state secrets for sale, like a free jet.",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "He's incapable of doing a single thing worthy of the office.",
                "Perhaps we should make a provision in the Constitution to prohibit this? We could call it the Emoluments Clause or something.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "05/12/2025 16:11:24 UTC"
}