{
    "posts": [
        {
            "category": "HOT",
            "title": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia",
            "external_url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/",
            "upvotes": 25929,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/c0560e3b-60af-44b4-9c9d-ba6be6f79b47/thumbnail/1200x630/ceffc4df08ef1c35796aa0715e3434e5/gettyimages-2199705037.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "> Witkoff arrived in Moscow shortly after noon local time on March 13, according to data from the flight tracking website FlightRadar24, and Russian state media broadcast video of his motorcade leaving Vnukovo International Airport shortly after.\n\n> During the group discussion on Signal, Goldberg reported, **Ratcliffe named an active CIA intelligence officer** in the chat at 5:24 p.m. eastern time, which was just after midnight in Russia. Witkoff’s flight did not leave Moscow until around 2 a.m. local time, and Sergei Markov, a former Putin advisor who is still close to the Russian president, said in a Telegram post that **Witkoff and Putin were meeting in the Kremlin until 1:30 a.m.**\n\n\nSeriously, what more is needed to charge these guys with whatever your equivalent of treason is?\n\nAt this point, I’m pretty sure the ‘VP’ in the chat was not the couch molester, it was Vladimir Putin (only half /s).",
                "Every single action the trump admin takes is beneficial to Russia, they are acting no differently than how an agent for the Russian government would be acting in this position.",
                "Why was a government official in Russia, meeting with Putin until 1:30 AM local time? Forget the entire Signal issue (for a moment, then don't forget it please) and try to answer that question without suggesting that this administration is completely in the pocket of Russia? You cannot do it. \n\nSomewhere, somehow, there has to be a truly patriotic Republican in Congress that will say something. Right?",
                "Republican voters decided en mass that they were pro Russia. Here we are.",
                "This just keeps getting better and better. I know Hanlon's Razor almost certainly applies here, but this is all so perfectly damaging to the administration that I can't help but wonder is some low-ranking aid didn't send that text to the journalist as a form of whistle blowing.",
                "Wonderful.  I wonder how much more fucked up this story will get….",
                "This is like Watergate level, it's gotten people jailed and killed Hillary's entire political career for 1/10th of what happened.",
                "Krasnov gonna Krasnov",
                "Whatever soil Tulsi Gabbard is standing on is technically Russian soil, so there were two.",
                "It's quite literally like they are working directly with Russia to provide state secrets."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "After living in the US for 35 years and raising 3 citizens, these parents got deported to Colombia. Their kids want them back",
            "external_url": "https://www.cnn.com/2025/03/24/us/colombia-immigrants-deported/index.html",
            "upvotes": 10307,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/88879383-1740868315540319-r.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From the article: \n\n“Gladys and Nelson came to the United States without authorization in 1989, according to an Immigration and Customs Enforcement statement dated March 14. They had no visas when they arrived, Crooms said, but were granted permission to apply for asylum. The couple was fleeing crime in their native Colombia, according to Crooms and their daughter Stephanie.\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.“\n\nThey applied for asylum, denied and ordered to come back to Columbia. \n\nWhen people applied for asylum they issued temporary SS number and work permit. \nHow did they legally worked in US for 30 years without valid SS number?",
                "As shitty as it is, this isn’t a current administration caused problem. They were told 25 years ago they had to leave.",
                "They lost their hearings and were ordered to leave and failed to do so…this one isn’t the hill to die on",
                "to be clear, they agreed to be deported, but stayed.\n\nthey did follow the agreement they made with the USCIS for check ins (for like 20 yrs of doing that), but they always knew this could happen.\n\nunfortunately, their number got called.\n\nhopefully the kids will sponsor them and they can return in 10 yrs.\n\ni wonder how many other immigrant families had this happen to them, it’s just the media picked this aesthetic family who can speak perfectly fluent english to compound the story….living in gorgeous and expensive newport beach, no less.\n\njust saying.",
                "*\"In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE*\n\n*...*\n\n*The Gonzalezes did not plan to leave the United States after the order was issued, according to Crooms, who said the couple’s attorney at the time misled them that the order could be appealed and possibly lead to eventual legalization.*\n\n*...*\n\n*The couple’s deportation officer “had not pushed for them to depart until 2018,” leveling with them that it was time to leave the country if their status couldn’t be legalized, Crooms said.\"*\n\nSeems pretty reasonable to me they needed to be deported, they've been told so since 2000, and again in 2018. Just not in handcuffs.",
                "Damn, I would be devastated if something like that happens to my parents. I hope the best for them.",
                "So, they overstayed by 25 years?\n\n>**In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order**, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.",
                "\n\n“Gladys and Nelson came to the United States without authorization in 1989\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order.”\n\nSo they entered illegally 36 years ago. Where ordered to leave 25 years ago and chose not to. I would say the US government was more then fair and consideret before deportation. They thought they were above the law. Their children can blame them not the US government.",
                "Entered illegally, informed to leave, didn't do it.\n\nWhat should happen?",
                "The headline implies that their parents were suddenly, unexpectedly deported.  \nBut in reality\n\n>In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.\n\n  \nSo they've been on notice for over TWENTY years.   \nDon't cry for me, Argentina. I mean, Columbia."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "USDA halts delivery of 600,000 pounds of food to Michigan food bank",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/03/usda-halts-delivery-of-600000-pounds-of-food-to-michigan-food-bank.html?utm_campaign=muskegonchronicle_sf&utm_medium=social&utm_source=facebook",
            "upvotes": 3771,
            "date": "03/25/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/KKKPQW4SY5BGVBJBJ7Z6BZIOO4.jpg?auth=4d01c8b21857dafa22f838c2933218e2bffca6aad56dd67a2e43f48dfcf85f49&width=1280&quality=90",
            "top_comments": [
                "After all this there's going to be billions in bailouts paid to farmers affected by these decisions. They're going to end up paying to let the food rot. ",
                "The wilful cruelty of the Trump regime astonishes me. Here in the U.K. we have had right wing governments but this is new territory. Also our worst Trump like Prime Minister only lasted 49 days before being ousted. Mind you she cost us our economy and she killed the queen so there is that.",
                "Can somebody explain to me the idea behind this?  Are they trying to disband food banks?  Is it that they want absolutely zero government aid to the general population because of anti-government ideology?  I don't understand their thinking.",
                "Even the Roman emperors knew that you had to give people bread & circuses. Does Trump think starving people will just roll over and die? Because boy is he going to be surprised.",
                "News says have empathy for poor Elon not the actual poor ",
                "I volunteer a couple times a week at a local food bank, not in Michigan. This is a goddamn shame. People don't realize that while the community donations definitely help, a lot of the food comes out of government programs or grants. When you cut that stuff you very directly hurt the people who need help eating.",
                "Keeping poor people alive that don’t contribute to society is wasteful spending /s",
                "This is a heartbreaking reminder of how fragile our food security system can be. Policies should prioritize people over logistics",
                "Ah yes, the old \"fuck you citizens\"",
                "All of Michigan's electoral votes went to Trump. He doesn't even take care of the states that supported him."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Japan court orders controversial ‘Moonies’ church to disband",
            "external_url": "https://www.bbc.com/news/articles/cge1lr7225yo.amp",
            "upvotes": 8702,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6c21/live/093e3620-0949-11f0-bdd3-f7314caa23ee.jpg",
            "top_comments": [
                "Americans might not be aware, but the Unification Church has leveraged its Japanese influence to control something like 80% of the sushi market in the US via a company called True World Foods.",
                "That assassin flat out achieved his objectives. Crazy.",
                "The order handed down by a Tokyo district court will strip the church of its tax-exempt status and require it to liquidate its assets, but it will still be allowed to operate in Japan.\n\nSo it's not really disbanded.",
                "God, I haven't heard about  the moonies for decades.\n\nI thought they already disbanded.",
                "fucking do it. tired of these ponzi schemes disguised as churches skirting the law because \"we don't want to be religiously intolerant\"",
                "A friend grew up in that cult.  The stories are fucking made of nightmares.",
                "Not so fun fact: The majority of the Unification Church's global revenue came from Japan and they diverted lots of funds to North Korea, which may or may not have went to North Korea's nuclear development and development of intercontinental ballistic missiles.",
                "This year is also the 30th anniversary of Omu Shinrikyo’s Sarin gas attack .",
                "Do Happy University and Soka Gakkai next.\n\nMaybe even Nippon Kaigi.",
                "For those, like me, who didn't follow the investigation:\n>Investigations following Abe's assassination revealed close ties between the secretive sect and many conservative ruling-party lawmakers, leading to the resignation of four ministers.\nAn internal investigation by former prime minister Fumio Kishida's Liberal Democratic Party found that 179 of its 379 lawmakers had interacted with the Unification Church.\nThe relationships ranged from attending church events to accepting donations and receiving election support.\nThe revelations about the extent and level of involvement of the controversial church and the LDP shocked the nation."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US consumer confidence tumbles for the 4th straight month as future expectations hit a 12-year low",
            "external_url": "https://apnews.com/article/consumer-confidence-economy-inflation-bd6ece8784efff205e2ab922bcb86958",
            "upvotes": 2615,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Everything that’s been occurring points to this establishment just trying to defund and destabilize America. We are being attacked from within and breaking ties with all alliances.",
                "Tariff don't need more time to prove they are not working",
                "This is the Trump effect just not the one he wants you to think about.",
                "It’s what Trump voters wanted.",
                "I don’t have a whole lot of confidence that my American dollars will be worth much after this admin intentionally crashes the economy. So this tracks.",
                "Incompetence leads to no confidence.",
                "I've stopped buying anything non-essential because I have no idea how much this shit is gonna cost 6 months from now.",
                "Every one with a brain has been preparing for a recession the moment Trump won 2024.",
                "If only this could have been prevented in November....",
                "It’s almost as if artificially turning Americans against each other is bad for every aspect of American life."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "United Airlines flight to China diverted to San Francisco after pilot forgets passport",
            "external_url": "https://www.nbcnews.com/news/us-news/united-airlines-flight-china-diverted-san-francisco-pilot-forgets-pass-rcna197942",
            "upvotes": 3811,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250325-united-plane-mb-1302-69636d.jpg",
            "top_comments": [
                "Imagine the pilot saying 'We'll be turning back… my bad, y'all.'",
                "How was he even allowed to board in the first place? Don’t they check passport at departure?\n\nI know there are crew lanes; I meant don’t they check at crew lanes?",
                "I have (sad and hilarious) nightmares about doing this.",
                "If the pilot just stayed on the plane when they landed, would it even matter? I suppose it's probably pretty unlikely that the pilot would be taking the same plane back, but in the event that they were, would they HAVE to even get off the plane once it landed and go through customs? ",
                "~~If the destination were in EU, that's 600 euros per ticket.~~\n\nEDIT: United is not an EU registered airline so you are fucked either way. Sorry for the misinformation.",
                "Article does NOT mention whether the pilot or airline were immediately transparent with their 100-300 customers who were just massively inconvenienced. \n\n\nHumans make human errors. Fine. I'm a lot more forgiving if they own up to them and apologize up front. ",
                "Would've been funny if they'd just had the pilot not deboard in China, and come back with nobody the wiser. I'm sure that would've required a new flight crew for the be trip, but it still would've been sneaky.",
                "Did I turn the stove off? Better turn back and go check. “Sorry folks”.",
                "So how long were those people on the last plane",
                "In usual cases, one's wife may kill you. In this case, every passenger, the crew, and corporate will want to kill you. Either way, just crash in front of the customs desk at the Chinese airport, and enjoy your new legendary status in United Lore. \n\nI hope the chucklefuck brought his other IDs to allow himself back into the US. And I hope he meets customs racial standards to boot."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Consumer confidence plummets to lowest level since January 2021",
            "external_url": "https://www.cnn.com/2025/03/25/economy/us-consumer-confidence-march-recession/index.html",
            "upvotes": 1604,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199175993-20250325122218314.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Since our president is actively sabotaging our economy, it's no wonder consumer confidence is tanking.",
                "*If* I buy anything beyond what I need to literally survive, so just \"for fun,\" it's going to be at a thrift store or an antique store. Not at a big-box or at the online behemoth store whose CEO actively supports this administration.\n\nI've completely cut out frivolous shopping of any kind and totally changed my financial habits since January 20th. I also cancelled all streaming services. I'm fucking done supporting rampant capitalism, and I feel just great about it. I'm enjoying the things I already have.",
                "I’m Poorer by the day and the president did a car commercial for one of the richest people in the world, commerce secretary went on Fox News and pumped up the same car company and the FBI now has a task force for vandalism against this car company. Yah I don’t have any confidence my interest are of any concern to this administration and I feel like I need to save every penny I have to ensure I can keep my home let alone afford to purchase another vehicle.",
                "I’ve cut back my spending since my grocery bill is so high. I’m nervous about how all of these government layoffs and cancelled contracts will affect the economy.",
                "Maybe that's cause idiots are in charge. But I dunno just spitballin'.",
                "Picking up right where he left off.",
                "Consumer confidence plummets to lowest level since last time Trump was in office.",
                "We are so great, you guys.",
                "Well, yeah. Inflation was already bad enough before all this mess. Now tariffs AND countless people suddenly losing their jobs? What is there possibly to be confident about as a consumer?",
                "I'm still confused as fuck why my fellow countrymen voted for this, but congratulations on getting what you wanted."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 20374,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Reuters is usually better than this. No mention of the fact that the only reason the post office loses money is because Congress made it so it must fund retirement for workers so far into the future that it covers workers not even born yet. It didn’t need DeJoy’s restructuring- it needed to be let off the hook.",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "23andMe bankruptcy filing sparks privacy fears as DNA data of millions goes up for sale",
            "external_url": "https://www.nbcnews.com/tech/security/23andme-goes-bankrupt-millions-peoples-dna-data-sale-rcna197874",
            "upvotes": 718,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-12/231204-23andMe-ew-233p-0ae51e.jpg",
            "top_comments": [
                "To all the comments talking about how privacy means you never used one of these things, you're wrong. If your parents, siblings, cousins, uncles, kids, or even grandma's sister twice removed use these things they learn about you too. With enough points of  data you can basically pinpoint anybody and guess with reasonable certainty their genetic inheritance. \n\nInsurance companies buying up databases like this to target individuals with higher premiums for certain care (like Ashkenazi Jews and breast cancer) are the problem. We need laws to prevent any use of different or preferential treatment based on genetic markings of any kind.",
                "I have 3 family members use this site. When my mother did it...it already showed she had 3 kids but we were unidentified in her tree. The other two members her brother and her brothers daughter also were mapped out.\n\nAnd she found out when grandpa went to war and left from Texas she has a half brother there who has a son my age 40 and used that site and found them.",
                "if only there were warnings about giving your DNA to an opensource. But hey, not knowing that you're .4 % Levantine would drive anyone insane.",
                "How much you want to bet someone in the health insurance business will buy this data? I'm betting they are willing to spend a lot more than anyone not in the business.",
                "My concern is if something like this is acwuired by a hostile or venture capitalist funded healthcare system or insurance agency that it would be used to increase denials and feed bad AI like the UHC AI Claim Denial of 90%+ and be used for genetic trace marking to look for, or assume, genetic predisposition for Hereditary or Genetic illnesses and use that as a basis to increase rate of denials based on knowledge a patirnt may not even be aware of.\n\nIt becomes a network of intelligence that any nation or ctiminal organization would climax over.",
                "Those of us afraid for privacy have avoided these sites like the plague.  Being afraid for privacy after you've already given out all your info isn't ideal.",
                "They already lost data to hack. Of course they are gonna sell it too.",
                "Insurance companies are salivating at this opportunity. Pre-existing condition? No, even better - genetically predisposed condition is where the gravy is, baby. Already-manifesting conditions is so early 2020s.",
                "I hate to break it to you but it was for sale before they went bankrupt, that’s how they made money. Evidently not enough money though",
                "Unlike you, your data never dies. I can think of no more valuable data than the very code that makes your existence possible."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Reports: Man and 2 children found alive on frozen Alaska lake 12 hours after their plane was reported overdue",
            "external_url": "https://www.cnn.com/2025/03/25/us/alaska-plane-crash-victims-alive-hnk/index.html",
            "upvotes": 536,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screenshot-2025-03-25-at-12-05-12-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The rescue was touted as “remarkable and good news” by National Transportation Safety Board Western Pacific Region Chief Dennis Hogenson, KTUU reported.\n\nWith the recent spate of crashes and general airplane shenaniganery, it's also really nice to see people able to walk away from most of these incidents.",
                "It's nice to see a happy ending",
                "Surviving a plane crash in Alaska for 12 hours? That’s some real-life survivor stuff right there. Glad they’re safe, but man, that’s a close call.",
                "It's amazing how many small plane accidents (and accompanying deaths) there are, and yet almost no major Airline accidents in the U.S. since the 1970s. The former have been really on the rise since 2018, and yet apart from the DC and 2003 crash, almost none in the latter."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Pentagon warned staffers against using Signal before White House chat leak",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/signal-app-leaked-war-plans",
            "upvotes": 211,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e9d13fd637f3222076970307f6bf673f887580ab/0_210_5088_3052/master/5088.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bf6968ef97f9538f9c42cdd176beff5",
            "top_comments": [
                "There is no justification for using Signal for official communications other than evading record collection laws, something Republicans used to consider literally the most important thing in the world.",
                "There is no reason that the US Government doesn't maintain it's own communication network.",
                "And again it’s worth noting not a single person in that chat said anything like “why are we discussing this here? Is this normal? This seems weird to me”\n\nNo, they all went with it. This tells me that this scenario isn’t unusual for them. They do this shit all the time, which is HIGHLY DISTURBING (and illegal) and should concern EVERYONE.",
                "Did they forget to cc the SecDef on that email?",
                "Seems like they didn't read the memo about Salt Typhoon... Gotta love it when leaders don't follow the same policy.",
                "Is the problem that group chat may not be encrypted end to end?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Florida debates lifting some child labor laws to fill jobs vacated by undocumented immigrants | CNN Business",
            "external_url": "https://www.cnn.com/2025/03/25/business/florida-child-labor-laws/index.html",
            "upvotes": 228,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1059945238.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lol teenagers aren't going to pick your strawberries out in the sun for $3 an hour.",
                "Good luck getting 14 year olds to pick oranges in the field for 12 hours a day.",
                "Ahh yes, we are going to replace lazy Mexicans with notoriously hard-working American teenagers.",
                "Nothing says \"strong economy\" quite like child labour.",
                "Can I pay them in Robux?",
                "Kids, you better not look at your teachers the wrong way or you will be sentenced to be out there in the fields for less than minimum wage.",
                "Child labor is way better than hiring undocumented immigrant.\n\n\\-Donald Trump",
                "Yes. This is the answer to the problem. \n\nEspecially night shifts.  \n\ns\n\nAmerica. WTF are you doing?",
                "This is exactly what everyone said would happen, a work shortage of people who would do the jobs that nobody wants to do.\n\nOthers said they would just pay people more, it will great for everyone.  I don't remember them saying this would be great for child labor.",
                "Yeah, lets have the children drop dead picking strawberries in the summer heat instead."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "LA-to-Shanghai United Airlines flight turns back after pilot forgets passport",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/la-shanghai-united-airlines-pilot-passport",
            "upvotes": 133,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cb43c92a195011e7168ebbc99e0ab482f006a379/0_170_5100_3060/master/5100.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e97a2f8963798f8ce60148139e19c638",
            "top_comments": [
                "If you don't cut it out, I will turn this plane around!",
                "Like forgetting your access badge when you’re driving the carpool. But worse. ",
                "Bet they wouldn't have turned around if a passenger said they didn't have their passport.",
                "Another fucking repost of this article",
                "How did he clear customs / departures?",
                "Imagine this happening when we travel to Mars 😭",
                "Someone is getting absolutely roasted in their family, work, and friend group chats 😂",
                "In the current climate, a traveler--and esp a pilot, has to be far more scrupulous in preparation--and ready for very big trouble when you err."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "23andMe bankruptcy filing sparks privacy fears as DNA data of millions goes up for sale",
            "external_url": "https://www.nbcnews.com/tech/security/23andme-goes-bankrupt-millions-peoples-dna-data-sale-rcna197874",
            "upvotes": 710,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-12/231204-23andMe-ew-233p-0ae51e.jpg",
            "top_comments": [
                "To all the comments talking about how privacy means you never used one of these things, you're wrong. If your parents, siblings, cousins, uncles, kids, or even grandma's sister twice removed use these things they learn about you too. With enough points of  data you can basically pinpoint anybody and guess with reasonable certainty their genetic inheritance. \n\nInsurance companies buying up databases like this to target individuals with higher premiums for certain care (like Ashkenazi Jews and breast cancer) are the problem. We need laws to prevent any use of different or preferential treatment based on genetic markings of any kind.",
                "I have 3 family members use this site. When my mother did it...it already showed she had 3 kids but we were unidentified in her tree. The other two members her brother and her brothers daughter also were mapped out.\n\nAnd she found out when grandpa went to war and left from Texas she has a half brother there who has a son my age 40 and used that site and found them.",
                "if only there were warnings about giving your DNA to an opensource. But hey, not knowing that you're .4 % Levantine would drive anyone insane.",
                "How much you want to bet someone in the health insurance business will buy this data? I'm betting they are willing to spend a lot more than anyone not in the business.",
                "My concern is if something like this is acwuired by a hostile or venture capitalist funded healthcare system or insurance agency that it would be used to increase denials and feed bad AI like the UHC AI Claim Denial of 90%+ and be used for genetic trace marking to look for, or assume, genetic predisposition for Hereditary or Genetic illnesses and use that as a basis to increase rate of denials based on knowledge a patirnt may not even be aware of.\n\nIt becomes a network of intelligence that any nation or ctiminal organization would climax over.",
                "Those of us afraid for privacy have avoided these sites like the plague.  Being afraid for privacy after you've already given out all your info isn't ideal.",
                "They already lost data to hack. Of course they are gonna sell it too.",
                "Insurance companies are salivating at this opportunity. Pre-existing condition? No, even better - genetically predisposed condition is where the gravy is, baby. Already-manifesting conditions is so early 2020s.",
                "I hate to break it to you but it was for sale before they went bankrupt, that’s how they made money. Evidently not enough money though",
                "Unlike you, your data never dies. I can think of no more valuable data than the very code that makes your existence possible."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Reports: Man and 2 children found alive on frozen Alaska lake 12 hours after their plane was reported overdue",
            "external_url": "https://www.cnn.com/2025/03/25/us/alaska-plane-crash-victims-alive-hnk/index.html",
            "upvotes": 536,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screenshot-2025-03-25-at-12-05-12-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The rescue was touted as “remarkable and good news” by National Transportation Safety Board Western Pacific Region Chief Dennis Hogenson, KTUU reported.\n\nWith the recent spate of crashes and general airplane shenaniganery, it's also really nice to see people able to walk away from most of these incidents.",
                "It's nice to see a happy ending",
                "Surviving a plane crash in Alaska for 12 hours? That’s some real-life survivor stuff right there. Glad they’re safe, but man, that’s a close call.",
                "It's amazing how many small plane accidents (and accompanying deaths) there are, and yet almost no major Airline accidents in the U.S. since the 1970s. The former have been really on the rise since 2018, and yet apart from the DC and 2003 crash, almost none in the latter."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia",
            "external_url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/",
            "upvotes": 26013,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/c0560e3b-60af-44b4-9c9d-ba6be6f79b47/thumbnail/1200x630/ceffc4df08ef1c35796aa0715e3434e5/gettyimages-2199705037.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "> Witkoff arrived in Moscow shortly after noon local time on March 13, according to data from the flight tracking website FlightRadar24, and Russian state media broadcast video of his motorcade leaving Vnukovo International Airport shortly after.\n\n> During the group discussion on Signal, Goldberg reported, **Ratcliffe named an active CIA intelligence officer** in the chat at 5:24 p.m. eastern time, which was just after midnight in Russia. Witkoff’s flight did not leave Moscow until around 2 a.m. local time, and Sergei Markov, a former Putin advisor who is still close to the Russian president, said in a Telegram post that **Witkoff and Putin were meeting in the Kremlin until 1:30 a.m.**\n\n\nSeriously, what more is needed to charge these guys with whatever your equivalent of treason is?\n\nAt this point, I’m pretty sure the ‘VP’ in the chat was not the couch molester, it was Vladimir Putin (only half /s).",
                "Every single action the trump admin takes is beneficial to Russia, they are acting no differently than how an agent for the Russian government would be acting in this position.",
                "Why was a government official in Russia, meeting with Putin until 1:30 AM local time? Forget the entire Signal issue (for a moment, then don't forget it please) and try to answer that question without suggesting that this administration is completely in the pocket of Russia? You cannot do it. \n\nSomewhere, somehow, there has to be a truly patriotic Republican in Congress that will say something. Right?",
                "Republican voters decided en mass that they were pro Russia. Here we are.",
                "This just keeps getting better and better. I know Hanlon's Razor almost certainly applies here, but this is all so perfectly damaging to the administration that I can't help but wonder is some low-ranking aid didn't send that text to the journalist as a form of whistle blowing.",
                "Wonderful.  I wonder how much more fucked up this story will get….",
                "This is like Watergate level, it's gotten people jailed and killed Hillary's entire political career for 1/10th of what happened.",
                "Krasnov gonna Krasnov",
                "Whatever soil Tulsi Gabbard is standing on is technically Russian soil, so there were two.",
                "It's quite literally like they are working directly with Russia to provide state secrets."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Ukraine and Russia agree to Black Sea ceasefire deal after Saudi talks",
            "external_url": "https://news.sky.com/story/ukraine-and-russia-agree-to-black-sea-ceasefire-deal-after-saudi-talks-12541713",
            "upvotes": 203,
            "date": "03/25/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-frigate-russian-ukraine_6866748.jpg?20250325155138",
            "top_comments": [
                "Yep except Russia is demanding the US drop sanctions from the US to implement the deal.",
                "I see how this helps Russia. How does it help Ukraine?",
                "Wonder how long it will take Putin to break it and blame Ukraine.",
                "BRB, I’m going to grab some lettuce. \n\nLet’s see how many Trusses this lasts…",
                "In return for trump removing sanctions on agriculture and fertilizer. But don’t worry, Russia won’t do the thing they’re largely militarily incapable of doing anymore. Art of the deal baby! You get financial relief to save your shitty nation from economic collapse, and we get one boat saved per 6 months.\n\n\nBreaking news: American national anthem replaced by sound of trump  gargling Putin’s balls",
                "And Russia breaks the ceasefire in 3…2…1…",
                "Is this an actual ceasefire deal or an Israel style ceasefire deal?",
                "That's nice but it won't be long till Russia attacks again.\n\nRussia likes war.\n\nList of countries Russia has attacked just since 1941:\n\n* Iran (1941–1946)\n* Hungary (1944)\n* Romania (1944)\n\n* Bulgaria (1944)\n* Czechoslovakia (1944)\n* Northern Norway (1944–1946) and Bornholm, Denmark (1945–1946)\n* Germany (1945)\n* Austria (1945–1955)\n* Manchuria (1945–1946)\n* Korea (1945–1948)\n* Kuril Islands (1945)\n* Czechoslovakia (1968–1989)\n* Afghanistan (1979–1989)\n* Crimean Peninsula  – (2014)\n* Ukraine – (2022)",
                "Let’s see if Russia pulls Israel and breaks this ceasefire even before it starts",
                "Trump will try to take credit for this."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "16-year-old charged with murder in killing of 15-year-old in East Oakland",
            "external_url": "https://www.cbsnews.com/sanfrancisco/news/east-oakland-teen-shooting-derbing-alvarado-16yo-murder-charge/",
            "upvotes": 212,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/b046a732-22f3-4c42-ab63-bd9d39f5b6cb/thumbnail/1200x630g4/54f1991656dd24ad1251ece76f4b9398/derbing-alvarado.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "This kid doesn’t understand the fate in store for him.  I hope it’s not true , but a life in prison is no life at all.",
                "Kid killed another kid over a damn backpack smh those poor parents",
                "How the fuck does a 16 year old get a gun?\n\nThat’s rhetorical, I’m just expressing moral outrage.",
                "[deleted]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "US consumer confidence tumbles for the 4th straight month as future expectations hit a 12-year low",
            "external_url": "https://apnews.com/article/consumer-confidence-economy-inflation-bd6ece8784efff205e2ab922bcb86958",
            "upvotes": 2622,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Everything that’s been occurring points to this establishment just trying to defund and destabilize America. We are being attacked from within and breaking ties with all alliances.",
                "Tariff don't need more time to prove they are not working",
                "This is the Trump effect just not the one he wants you to think about.",
                "It’s what Trump voters wanted.",
                "I don’t have a whole lot of confidence that my American dollars will be worth much after this admin intentionally crashes the economy. So this tracks.",
                "Incompetence leads to no confidence.",
                "I've stopped buying anything non-essential because I have no idea how much this shit is gonna cost 6 months from now.",
                "Every one with a brain has been preparing for a recession the moment Trump won 2024.",
                "If only this could have been prevented in November....",
                "It’s almost as if artificially turning Americans against each other is bad for every aspect of American life."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "USDA halts delivery of 600,000 pounds of food to Michigan food bank",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/03/usda-halts-delivery-of-600000-pounds-of-food-to-michigan-food-bank.html?utm_campaign=muskegonchronicle_sf&utm_medium=social&utm_source=facebook",
            "upvotes": 3766,
            "date": "03/25/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/KKKPQW4SY5BGVBJBJ7Z6BZIOO4.jpg?auth=4d01c8b21857dafa22f838c2933218e2bffca6aad56dd67a2e43f48dfcf85f49&width=1280&quality=90",
            "top_comments": [
                "After all this there's going to be billions in bailouts paid to farmers affected by these decisions. They're going to end up paying to let the food rot. ",
                "The wilful cruelty of the Trump regime astonishes me. Here in the U.K. we have had right wing governments but this is new territory. Also our worst Trump like Prime Minister only lasted 49 days before being ousted. Mind you she cost us our economy and she killed the queen so there is that.",
                "Can somebody explain to me the idea behind this?  Are they trying to disband food banks?  Is it that they want absolutely zero government aid to the general population because of anti-government ideology?  I don't understand their thinking.",
                "Even the Roman emperors knew that you had to give people bread & circuses. Does Trump think starving people will just roll over and die? Because boy is he going to be surprised.",
                "News says have empathy for poor Elon not the actual poor ",
                "I volunteer a couple times a week at a local food bank, not in Michigan. This is a goddamn shame. People don't realize that while the community donations definitely help, a lot of the food comes out of government programs or grants. When you cut that stuff you very directly hurt the people who need help eating.",
                "Keeping poor people alive that don’t contribute to society is wasteful spending /s",
                "This is a heartbreaking reminder of how fragile our food security system can be. Policies should prioritize people over logistics",
                "Ah yes, the old \"fuck you citizens\"",
                "All of Michigan's electoral votes went to Trump. He doesn't even take care of the states that supported him."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pentagon warned staffers against using Signal before White House chat leak",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/signal-app-leaked-war-plans",
            "upvotes": 207,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e9d13fd637f3222076970307f6bf673f887580ab/0_210_5088_3052/master/5088.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bf6968ef97f9538f9c42cdd176beff5",
            "top_comments": [
                "There is no justification for using Signal for official communications other than evading record collection laws, something Republicans used to consider literally the most important thing in the world.",
                "There is no reason that the US Government doesn't maintain it's own communication network.",
                "And again it’s worth noting not a single person in that chat said anything like “why are we discussing this here? Is this normal? This seems weird to me”\n\nNo, they all went with it. This tells me that this scenario isn’t unusual for them. They do this shit all the time, which is HIGHLY DISTURBING (and illegal) and should concern EVERYONE.",
                "Did they forget to cc the SecDef on that email?",
                "Seems like they didn't read the memo about Salt Typhoon... Gotta love it when leaders don't follow the same policy.",
                "Is the problem that group chat may not be encrypted end to end?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Florida debates lifting some child labor laws to fill jobs vacated by undocumented immigrants | CNN Business",
            "external_url": "https://www.cnn.com/2025/03/25/business/florida-child-labor-laws/index.html",
            "upvotes": 226,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1059945238.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lol teenagers aren't going to pick your strawberries out in the sun for $3 an hour.",
                "Good luck getting 14 year olds to pick oranges in the field for 12 hours a day.",
                "Ahh yes, we are going to replace lazy Mexicans with notoriously hard-working American teenagers.",
                "Nothing says \"strong economy\" quite like child labour.",
                "Can I pay them in Robux?",
                "Kids, you better not look at your teachers the wrong way or you will be sentenced to be out there in the fields for less than minimum wage.",
                "Child labor is way better than hiring undocumented immigrant.\n\n\\-Donald Trump",
                "Yes. This is the answer to the problem. \n\nEspecially night shifts.  \n\ns\n\nAmerica. WTF are you doing?",
                "This is exactly what everyone said would happen, a work shortage of people who would do the jobs that nobody wants to do.\n\nOthers said they would just pay people more, it will great for everyone.  I don't remember them saying this would be great for child labor.",
                "Yeah, lets have the children drop dead picking strawberries in the summer heat instead."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US consumer confidence tumbles for the 4th straight month as future expectations hit a 12-year low",
            "external_url": "https://apnews.com/article/consumer-confidence-economy-inflation-bd6ece8784efff205e2ab922bcb86958",
            "upvotes": 2613,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Everything that’s been occurring points to this establishment just trying to defund and destabilize America. We are being attacked from within and breaking ties with all alliances.",
                "Tariff don't need more time to prove they are not working",
                "This is the Trump effect just not the one he wants you to think about.",
                "It’s what Trump voters wanted.",
                "I don’t have a whole lot of confidence that my American dollars will be worth much after this admin intentionally crashes the economy. So this tracks.",
                "Incompetence leads to no confidence.",
                "I've stopped buying anything non-essential because I have no idea how much this shit is gonna cost 6 months from now.",
                "Every one with a brain has been preparing for a recession the moment Trump won 2024.",
                "If only this could have been prevented in November....",
                "It’s almost as if artificially turning Americans against each other is bad for every aspect of American life."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Reports: Man and 2 children found alive on frozen Alaska lake 12 hours after their plane was reported overdue",
            "external_url": "https://www.cnn.com/2025/03/25/us/alaska-plane-crash-victims-alive-hnk/index.html",
            "upvotes": 534,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screenshot-2025-03-25-at-12-05-12-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The rescue was touted as “remarkable and good news” by National Transportation Safety Board Western Pacific Region Chief Dennis Hogenson, KTUU reported.\n\nWith the recent spate of crashes and general airplane shenaniganery, it's also really nice to see people able to walk away from most of these incidents.",
                "It's nice to see a happy ending",
                "Surviving a plane crash in Alaska for 12 hours? That’s some real-life survivor stuff right there. Glad they’re safe, but man, that’s a close call.",
                "It's amazing how many small plane accidents (and accompanying deaths) there are, and yet almost no major Airline accidents in the U.S. since the 1970s. The former have been really on the rise since 2018, and yet apart from the DC and 2003 crash, almost none in the latter."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia",
            "external_url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/",
            "upvotes": 26059,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/c0560e3b-60af-44b4-9c9d-ba6be6f79b47/thumbnail/1200x630/ceffc4df08ef1c35796aa0715e3434e5/gettyimages-2199705037.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "> Witkoff arrived in Moscow shortly after noon local time on March 13, according to data from the flight tracking website FlightRadar24, and Russian state media broadcast video of his motorcade leaving Vnukovo International Airport shortly after.\n\n> During the group discussion on Signal, Goldberg reported, **Ratcliffe named an active CIA intelligence officer** in the chat at 5:24 p.m. eastern time, which was just after midnight in Russia. Witkoff’s flight did not leave Moscow until around 2 a.m. local time, and Sergei Markov, a former Putin advisor who is still close to the Russian president, said in a Telegram post that **Witkoff and Putin were meeting in the Kremlin until 1:30 a.m.**\n\n\nSeriously, what more is needed to charge these guys with whatever your equivalent of treason is?\n\nAt this point, I’m pretty sure the ‘VP’ in the chat was not the couch molester, it was Vladimir Putin (only half /s).",
                "Every single action the trump admin takes is beneficial to Russia, they are acting no differently than how an agent for the Russian government would be acting in this position.",
                "Why was a government official in Russia, meeting with Putin until 1:30 AM local time? Forget the entire Signal issue (for a moment, then don't forget it please) and try to answer that question without suggesting that this administration is completely in the pocket of Russia? You cannot do it. \n\nSomewhere, somehow, there has to be a truly patriotic Republican in Congress that will say something. Right?",
                "Republican voters decided en mass that they were pro Russia. Here we are.",
                "This just keeps getting better and better. I know Hanlon's Razor almost certainly applies here, but this is all so perfectly damaging to the administration that I can't help but wonder is some low-ranking aid didn't send that text to the journalist as a form of whistle blowing.",
                "Wonderful.  I wonder how much more fucked up this story will get….",
                "This is like Watergate level, it's gotten people jailed and killed Hillary's entire political career for 1/10th of what happened.",
                "Krasnov gonna Krasnov",
                "Whatever soil Tulsi Gabbard is standing on is technically Russian soil, so there were two.",
                "It's quite literally like they are working directly with Russia to provide state secrets."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "USDA halts delivery of 600,000 pounds of food to Michigan food bank",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/03/usda-halts-delivery-of-600000-pounds-of-food-to-michigan-food-bank.html?utm_campaign=muskegonchronicle_sf&utm_medium=social&utm_source=facebook",
            "upvotes": 3769,
            "date": "03/25/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/KKKPQW4SY5BGVBJBJ7Z6BZIOO4.jpg?auth=4d01c8b21857dafa22f838c2933218e2bffca6aad56dd67a2e43f48dfcf85f49&width=1280&quality=90",
            "top_comments": [
                "After all this there's going to be billions in bailouts paid to farmers affected by these decisions. They're going to end up paying to let the food rot. ",
                "The wilful cruelty of the Trump regime astonishes me. Here in the U.K. we have had right wing governments but this is new territory. Also our worst Trump like Prime Minister only lasted 49 days before being ousted. Mind you she cost us our economy and she killed the queen so there is that.",
                "Can somebody explain to me the idea behind this?  Are they trying to disband food banks?  Is it that they want absolutely zero government aid to the general population because of anti-government ideology?  I don't understand their thinking.",
                "Even the Roman emperors knew that you had to give people bread & circuses. Does Trump think starving people will just roll over and die? Because boy is he going to be surprised.",
                "News says have empathy for poor Elon not the actual poor ",
                "I volunteer a couple times a week at a local food bank, not in Michigan. This is a goddamn shame. People don't realize that while the community donations definitely help, a lot of the food comes out of government programs or grants. When you cut that stuff you very directly hurt the people who need help eating.",
                "Keeping poor people alive that don’t contribute to society is wasteful spending /s",
                "This is a heartbreaking reminder of how fragile our food security system can be. Policies should prioritize people over logistics",
                "Ah yes, the old \"fuck you citizens\"",
                "All of Michigan's electoral votes went to Trump. He doesn't even take care of the states that supported him."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "23andMe bankruptcy filing sparks privacy fears as DNA data of millions goes up for sale",
            "external_url": "https://www.nbcnews.com/tech/security/23andme-goes-bankrupt-millions-peoples-dna-data-sale-rcna197874",
            "upvotes": 713,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-12/231204-23andMe-ew-233p-0ae51e.jpg",
            "top_comments": [
                "To all the comments talking about how privacy means you never used one of these things, you're wrong. If your parents, siblings, cousins, uncles, kids, or even grandma's sister twice removed use these things they learn about you too. With enough points of  data you can basically pinpoint anybody and guess with reasonable certainty their genetic inheritance. \n\nInsurance companies buying up databases like this to target individuals with higher premiums for certain care (like Ashkenazi Jews and breast cancer) are the problem. We need laws to prevent any use of different or preferential treatment based on genetic markings of any kind.",
                "I have 3 family members use this site. When my mother did it...it already showed she had 3 kids but we were unidentified in her tree. The other two members her brother and her brothers daughter also were mapped out.\n\nAnd she found out when grandpa went to war and left from Texas she has a half brother there who has a son my age 40 and used that site and found them.",
                "if only there were warnings about giving your DNA to an opensource. But hey, not knowing that you're .4 % Levantine would drive anyone insane.",
                "How much you want to bet someone in the health insurance business will buy this data? I'm betting they are willing to spend a lot more than anyone not in the business.",
                "My concern is if something like this is acwuired by a hostile or venture capitalist funded healthcare system or insurance agency that it would be used to increase denials and feed bad AI like the UHC AI Claim Denial of 90%+ and be used for genetic trace marking to look for, or assume, genetic predisposition for Hereditary or Genetic illnesses and use that as a basis to increase rate of denials based on knowledge a patirnt may not even be aware of.\n\nIt becomes a network of intelligence that any nation or ctiminal organization would climax over.",
                "Those of us afraid for privacy have avoided these sites like the plague.  Being afraid for privacy after you've already given out all your info isn't ideal.",
                "They already lost data to hack. Of course they are gonna sell it too.",
                "Insurance companies are salivating at this opportunity. Pre-existing condition? No, even better - genetically predisposed condition is where the gravy is, baby. Already-manifesting conditions is so early 2020s.",
                "I hate to break it to you but it was for sale before they went bankrupt, that’s how they made money. Evidently not enough money though",
                "Unlike you, your data never dies. I can think of no more valuable data than the very code that makes your existence possible."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Consumer confidence plummets to lowest level since January 2021",
            "external_url": "https://www.cnn.com/2025/03/25/economy/us-consumer-confidence-march-recession/index.html",
            "upvotes": 1610,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199175993-20250325122218314.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Since our president is actively sabotaging our economy, it's no wonder consumer confidence is tanking.",
                "*If* I buy anything beyond what I need to literally survive, so just \"for fun,\" it's going to be at a thrift store or an antique store. Not at a big-box or at the online behemoth store whose CEO actively supports this administration.\n\nI've completely cut out frivolous shopping of any kind and totally changed my financial habits since January 20th. I also cancelled all streaming services. I'm fucking done supporting rampant capitalism, and I feel just great about it. I'm enjoying the things I already have.",
                "I’m Poorer by the day and the president did a car commercial for one of the richest people in the world, commerce secretary went on Fox News and pumped up the same car company and the FBI now has a task force for vandalism against this car company. Yah I don’t have any confidence my interest are of any concern to this administration and I feel like I need to save every penny I have to ensure I can keep my home let alone afford to purchase another vehicle.",
                "I’ve cut back my spending since my grocery bill is so high. I’m nervous about how all of these government layoffs and cancelled contracts will affect the economy.",
                "Maybe that's cause idiots are in charge. But I dunno just spitballin'.",
                "Picking up right where he left off.",
                "Consumer confidence plummets to lowest level since last time Trump was in office.",
                "We are so great, you guys.",
                "Well, yeah. Inflation was already bad enough before all this mess. Now tariffs AND countless people suddenly losing their jobs? What is there possibly to be confident about as a consumer?",
                "I'm still confused as fuck why my fellow countrymen voted for this, but congratulations on getting what you wanted."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "After living in the US for 35 years and raising 3 citizens, these parents got deported to Colombia. Their kids want them back",
            "external_url": "https://www.cnn.com/2025/03/24/us/colombia-immigrants-deported/index.html",
            "upvotes": 10311,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/88879383-1740868315540319-r.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From the article: \n\n“Gladys and Nelson came to the United States without authorization in 1989, according to an Immigration and Customs Enforcement statement dated March 14. They had no visas when they arrived, Crooms said, but were granted permission to apply for asylum. The couple was fleeing crime in their native Colombia, according to Crooms and their daughter Stephanie.\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.“\n\nThey applied for asylum, denied and ordered to come back to Columbia. \n\nWhen people applied for asylum they issued temporary SS number and work permit. \nHow did they legally worked in US for 30 years without valid SS number?",
                "As shitty as it is, this isn’t a current administration caused problem. They were told 25 years ago they had to leave.",
                "They lost their hearings and were ordered to leave and failed to do so…this one isn’t the hill to die on",
                "to be clear, they agreed to be deported, but stayed.\n\nthey did follow the agreement they made with the USCIS for check ins (for like 20 yrs of doing that), but they always knew this could happen.\n\nunfortunately, their number got called.\n\nhopefully the kids will sponsor them and they can return in 10 yrs.\n\ni wonder how many other immigrant families had this happen to them, it’s just the media picked this aesthetic family who can speak perfectly fluent english to compound the story….living in gorgeous and expensive newport beach, no less.\n\njust saying.",
                "*\"In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE*\n\n*...*\n\n*The Gonzalezes did not plan to leave the United States after the order was issued, according to Crooms, who said the couple’s attorney at the time misled them that the order could be appealed and possibly lead to eventual legalization.*\n\n*...*\n\n*The couple’s deportation officer “had not pushed for them to depart until 2018,” leveling with them that it was time to leave the country if their status couldn’t be legalized, Crooms said.\"*\n\nSeems pretty reasonable to me they needed to be deported, they've been told so since 2000, and again in 2018. Just not in handcuffs.",
                "Damn, I would be devastated if something like that happens to my parents. I hope the best for them.",
                "So, they overstayed by 25 years?\n\n>**In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order**, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.",
                "\n\n“Gladys and Nelson came to the United States without authorization in 1989\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order.”\n\nSo they entered illegally 36 years ago. Where ordered to leave 25 years ago and chose not to. I would say the US government was more then fair and consideret before deportation. They thought they were above the law. Their children can blame them not the US government.",
                "Entered illegally, informed to leave, didn't do it.\n\nWhat should happen?",
                "The headline implies that their parents were suddenly, unexpectedly deported.  \nBut in reality\n\n>In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.\n\n  \nSo they've been on notice for over TWENTY years.   \nDon't cry for me, Argentina. I mean, Columbia."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "United Airlines flight to China diverted to San Francisco after pilot forgets passport",
            "external_url": "https://www.nbcnews.com/news/us-news/united-airlines-flight-china-diverted-san-francisco-pilot-forgets-pass-rcna197942",
            "upvotes": 3806,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250325-united-plane-mb-1302-69636d.jpg",
            "top_comments": [
                "Imagine the pilot saying 'We'll be turning back… my bad, y'all.'",
                "How was he even allowed to board in the first place? Don’t they check passport at departure?\n\nI know there are crew lanes; I meant don’t they check at crew lanes?",
                "I have (sad and hilarious) nightmares about doing this.",
                "If the pilot just stayed on the plane when they landed, would it even matter? I suppose it's probably pretty unlikely that the pilot would be taking the same plane back, but in the event that they were, would they HAVE to even get off the plane once it landed and go through customs? ",
                "~~If the destination were in EU, that's 600 euros per ticket.~~\n\nEDIT: United is not an EU registered airline so you are fucked either way. Sorry for the misinformation.",
                "Article does NOT mention whether the pilot or airline were immediately transparent with their 100-300 customers who were just massively inconvenienced. \n\n\nHumans make human errors. Fine. I'm a lot more forgiving if they own up to them and apologize up front. ",
                "Would've been funny if they'd just had the pilot not deboard in China, and come back with nobody the wiser. I'm sure that would've required a new flight crew for the be trip, but it still would've been sneaky.",
                "Did I turn the stove off? Better turn back and go check. “Sorry folks”.",
                "So how long were those people on the last plane",
                "In usual cases, one's wife may kill you. In this case, every passenger, the crew, and corporate will want to kill you. Either way, just crash in front of the customs desk at the Chinese airport, and enjoy your new legendary status in United Lore. \n\nI hope the chucklefuck brought his other IDs to allow himself back into the US. And I hope he meets customs racial standards to boot."
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/25/2025 20:09:24 UTC"
}