{
    "posts": [
        {
            "category": "HOT",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 11809,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 50698,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "Yeah, because that's stopped them so far.",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Uh huh. Now fucking enforce it.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 4449,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "US bord services new motto:\n\n\"If you're brown, turn around.\""
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 4099,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "All else aside, who the hell designed that header graphic?",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "Why does it matter? They bungled the response to it anyway.",
                "Trump was President during Covid."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 7073,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "Please remember, this is the same administration that requested that the court take a recess on deciding whether to deport 239 people, and while the court was in recess, rushed those planes into the air, so they would be over international waters by the time recess was over, and then when the judge demanded that those planes stay on the ground, they said they could no longer do anything because they were already over international waters, and the judge's bench orders no longer had legal standing in international airspace.",
                "I don’t believe they heard you!  Another judicial order to be ignored until it just doesn’t make sense to bother. Then what?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US senator returns from El Salvador trip, says Abrego Garcia case is about far more than one man",
            "external_url": "https://apnews.com/article/van-hollen-abrego-garcia-el-salvador-deportation-53c7c2dc95486f5f0c4afd96dc0fb01c",
            "upvotes": 1704,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*More Democratic lawmakers have said they will fly to El Salvador to push for Abrego Garcia’s release, but the partisan pressure has yielded no results. President Donald Trump and El Salvador’s president, Nayib Bukele, have only dug in on keeping him out of the United States*\n\nT's game plan is undoubtedly to drive this case back to this Supreme Court--which will be duly pressured to reverse its original decision.",
                "\"That stance remained even after the U.S. Supreme Court called on the administration to [facilitate his return](https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470).\"\n\nWow ... the supreme court did NOT \"called on\". The supreme court issued an ORDER.",
                "Why does a Republican administration so desperately need some war to fight? Can’t we just *help out citizens and residents* by doing normal shit!?!?",
                "Trump's move to being a dictator is in full view of everybody. Which Republicans will stand up when the country needs them? I won't hold my breath.",
                "It’s for every American citizen.",
                "This is all just a pony show.",
                "Why are they so set on bringing back an MS-13 gang member who was here illegally and was/is a wife beater and was told to leave in 2019? Couldn’t find a better person to hold up as their champion?",
                "Is the one man orange because, I disagree."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "“Decades behind bars for Tesla vandalizers”, Says Pam Bondi",
            "external_url": "https://www.bbc.com/news/articles/c204yvv1eexo.amp",
            "upvotes": 1292,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b3f0/live/e816b740-05f3-11f0-9b8b-6f7f9efe4b54.png",
            "top_comments": [
                "The US doesn't have any laws that would allow \"decades behind bars\" for vandalism. So they'll have to prosecute it under some law not usually used for vandalism cases if that's their goal. And when they do they'll likely lose.\n\nAnd if they don't lose, that's going to send a pretty horrible message about rape, armed robbery, and all the other crimes that get punished less harshly than that. \n\nDon't get me wrong, vandalism is actually bad.  But there's no justification for punishing vandalism against Tesla motorcars more harshly than other vandalism.",
                "And what’s the going rate for rape these days, 3-5 years if any? Ah but surely property crime is domestic terrorism and deserves 20 years. What a fucking joke.",
                "And what is she saying about the kid that killed 2 in FL?",
                "Silly rabbit, you need to be found guilty of 34 felonies if you want to avoid prison.",
                "Gonna be completely honest, I truthfully don’t give a shit about people vandalizing Teslas when they blanket pardoned the January 6th terrorists. Free game, baby.",
                "She refused to call the guy who set Joshua Shapiro's house on fire in the middle of the night by throwing moltov cocktails in it a domestic terrorist when asked point blank. Pam Bondi can go fuck herself.",
                "Pam Bondi accepted a bribe from Trump to not prosecute Trump University. How many years did she serve behind bars for that corruption?",
                "Who’s a good little Trumper? Pam is! She’s a good little girl!",
                "And yet breaking into the Capitol and trying to kidnap the Vice President while chanting, “Hang Mike Pence” with a gallows constructed outside is pardonable.\n\nI can’t wait to wake up from this fucking fever dream.",
                "Can you even have different punishments for specific vehicle models? Like sure, it's major property destruction. But a car is a car."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Japan bus driver with 3 decades of service loses $84,000 pension after he was caught stealing $7",
            "external_url": "https://www.cbsnews.com/news/japan-bus-driver-loses-pension-for-stealing-7-dollars/",
            "upvotes": 9726,
            "date": "04/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/18/b958a561-2831-4cb5-8035-ce58469db518/thumbnail/1200x630/413cc3e4c195185d2b8eaec5d3fafe61/gettyimages-2147869596.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "> The driver had been reprimanded several times during his career over various incidents, according to the ruling.\n\nI think the $7 worth of fare stolen was what they could prove in court with evidence. There may have been far more discrepancies in terms of number of passengers versus fare collected but for some reason won’t disclose it, because otherwise this does seem extraordinarily excessive for someone that had been driving with them for that long, even for Japan.",
                "Imagine if they did this to cops",
                "Is it 84K in total or annually?\n\nSeems very low for 30 years of work.",
                "That's how much he was caught stealing, how much was stolen before it was identified?",
                "\"Despite being caught on camera, he tried to deny it during a meeting with his superior.\"\n\nSo a dishonest and idiotic liar. \n\n\"The driver had been reprimanded several times during his career over various incidents, according to the ruling.\"\n\nShould be fired long ago.",
                "This was the first time he was CAUGHT, not necessarily the first time he stole.",
                "its only 7$, but its still stealing and who knows how many times he hasnt gotten caught.",
                "Maybe $14 stolen before,  crime unsolved",
                "Japanese justice is known to not fuck around",
                "Hey atleast he lose his pension with his own power,\nSome people are losing that amount in their retirement by another man’s actions"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Russia sentences 19-year-old woman to nearly three years in a penal colony after poetic anti-war protest | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/europe/darya-kozyreva-russia-penal-colony-war-protest-intl-latam/index.html",
            "upvotes": 674,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-18t133533z-372888836-rc2a0eak3wdb-rtrmadp-3-ukraine-crisis-russia-court.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Coming soon to a state near you.",
                "Our administration wouldn't recognize poetry if it slapped them across the face, so we should be safe.",
                "*Oh bury me, then rise ye up\nAnd break your heavy chains\nAnd water with the tyrants’ blood \nThe freedom you have gained,*\n\n\nBrave woman, standing on principle. If everyone, or even just enough people, were like her, tyranny would be impossible.",
                "Trump: Write that down! Write that down!",
                "If anybody doesn't think the same thing can happen here in the US under the Trump administration they are kidding themselves.",
                "I hope I have her character once things get that bad here",
                "How long until Amerika starts to do the same under the despot tRump?",
                "She has more courage than most of the adults in her country.",
                "Sebastian Gorka wants the same for Americans in America.",
                "Did the Russians ever jail anti-war critics during their wars in Afghanistan, Chechnya, Georgia, etc."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "Measles update: State officials report 36 more cases in West Texas",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-18/measles-update-state-officials-report-36-more-cases-in-west-texas",
            "upvotes": 2431,
            "date": "04/18/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/d4986a6/2147483647/strip/true/crop/2787x1463+0+252/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2Ff8%2F0267f45f4986944eee0e903257db%2F2016-03-11t140544z-1308609988-mt1pra25799643-rtrmadp-3-pa-images.JPG",
            "top_comments": [
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 20 cases. Last Friday's update added 36 cases. Last Tuesday's update added 24 cases. The previous Friday's update added 59 cases.\n\nFour new hospitalizations were reported, up to 62 from 58. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors.",
                "Just waiting for the dept responsible for these reports is told to stand down.",
                "Rumor is that the Upshur County outbreak is at the Alert Academy in Big Sandy, Texas. People who follow the super-sized Duggar and Bates families will likely be familiar with Alert. It's part of the larger IBLP organization they're associated with.\n\nhttps://en.wikipedia.org/wiki/Institute_in_Basic_Life_Principles",
                "Imagine if they tried to get rid of measles as hard as they tried to get rid of trans athletes.",
                "The maga leadership is a deadly disease that harms American society - stop voting for these skeevy maga liars.",
                "As a lib living in Washington, man do I feel owned. \n\nI’m alive, and so are my kids, but phew! What a burn! \n\nMasterfully done.",
                "The CDC reported earlier today that the US is up to [800 cases nationwide this week](https://www.cdc.gov/measles/data-research/index.html).  That adds 88 to last week's total of 712.",
                "Saw my PCP. No chance of a booster vaccine despite being immunocompromised. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
                "Miscarriage = murderer and possibly prison\n\nLetting your child spread and die of a preventable disease in agony = Religious freedum",
                "Down in the west Texas town of El Paso\n\nThere was a germ that we thought that we’d beat\n\nTil a guy who eats bear meat said “Let it run freely”\n\nAnd the worm in his brain continued to eat"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "“Decades behind bars for Tesla vandalizers”, Says Pam Bondi",
            "external_url": "https://www.bbc.com/news/articles/c204yvv1eexo.amp",
            "upvotes": 1289,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b3f0/live/e816b740-05f3-11f0-9b8b-6f7f9efe4b54.png",
            "top_comments": [
                "The US doesn't have any laws that would allow \"decades behind bars\" for vandalism. So they'll have to prosecute it under some law not usually used for vandalism cases if that's their goal. And when they do they'll likely lose.\n\nAnd if they don't lose, that's going to send a pretty horrible message about rape, armed robbery, and all the other crimes that get punished less harshly than that. \n\nDon't get me wrong, vandalism is actually bad.  But there's no justification for punishing vandalism against Tesla motorcars more harshly than other vandalism.",
                "And what’s the going rate for rape these days, 3-5 years if any? Ah but surely property crime is domestic terrorism and deserves 20 years. What a fucking joke.",
                "And what is she saying about the kid that killed 2 in FL?",
                "Silly rabbit, you need to be found guilty of 34 felonies if you want to avoid prison.",
                "Gonna be completely honest, I truthfully don’t give a shit about people vandalizing Teslas when they blanket pardoned the January 6th terrorists. Free game, baby.",
                "She refused to call the guy who set Joshua Shapiro's house on fire in the middle of the night by throwing moltov cocktails in it a domestic terrorist when asked point blank. Pam Bondi can go fuck herself.",
                "Pam Bondi accepted a bribe from Trump to not prosecute Trump University. How many years did she serve behind bars for that corruption?",
                "Who’s a good little Trumper? Pam is! She’s a good little girl!",
                "And yet breaking into the Capitol and trying to kidnap the Vice President while chanting, “Hang Mike Pence” with a gallows constructed outside is pardonable.\n\nI can’t wait to wake up from this fucking fever dream.",
                "Can you even have different punishments for specific vehicle models? Like sure, it's major property destruction. But a car is a car."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 4453,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "US bord services new motto:\n\n\"If you're brown, turn around.\""
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Russia sentences 19-year-old woman to nearly three years in a penal colony after poetic anti-war protest | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/europe/darya-kozyreva-russia-penal-colony-war-protest-intl-latam/index.html",
            "upvotes": 680,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-18t133533z-372888836-rc2a0eak3wdb-rtrmadp-3-ukraine-crisis-russia-court.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Coming soon to a state near you.",
                "Our administration wouldn't recognize poetry if it slapped them across the face, so we should be safe.",
                "*Oh bury me, then rise ye up\nAnd break your heavy chains\nAnd water with the tyrants’ blood \nThe freedom you have gained,*\n\n\nBrave woman, standing on principle. If everyone, or even just enough people, were like her, tyranny would be impossible.",
                "Trump: Write that down! Write that down!",
                "If anybody doesn't think the same thing can happen here in the US under the Trump administration they are kidding themselves.",
                "I hope I have her character once things get that bad here",
                "How long until Amerika starts to do the same under the despot tRump?",
                "She has more courage than most of the adults in her country.",
                "Sebastian Gorka wants the same for Americans in America.",
                "Did the Russians ever jail anti-war critics during their wars in Afghanistan, Chechnya, Georgia, etc."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "US senator returns from El Salvador trip, says Abrego Garcia case is about far more than one man",
            "external_url": "https://apnews.com/article/van-hollen-abrego-garcia-el-salvador-deportation-53c7c2dc95486f5f0c4afd96dc0fb01c",
            "upvotes": 1695,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*More Democratic lawmakers have said they will fly to El Salvador to push for Abrego Garcia’s release, but the partisan pressure has yielded no results. President Donald Trump and El Salvador’s president, Nayib Bukele, have only dug in on keeping him out of the United States*\n\nT's game plan is undoubtedly to drive this case back to this Supreme Court--which will be duly pressured to reverse its original decision.",
                "\"That stance remained even after the U.S. Supreme Court called on the administration to [facilitate his return](https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470).\"\n\nWow ... the supreme court did NOT \"called on\". The supreme court issued an ORDER.",
                "Why does a Republican administration so desperately need some war to fight? Can’t we just *help out citizens and residents* by doing normal shit!?!?",
                "Trump's move to being a dictator is in full view of everybody. Which Republicans will stand up when the country needs them? I won't hold my breath.",
                "It’s for every American citizen.",
                "This is all just a pony show.",
                "Why are they so set on bringing back an MS-13 gang member who was here illegally and was/is a wife beater and was told to leave in 2019? Couldn’t find a better person to hold up as their champion?",
                "Is the one man orange because, I disagree."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 4106,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "All else aside, who the hell designed that header graphic?",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "Why does it matter? They bungled the response to it anyway.",
                "Trump was President during Covid."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "The US and Iran are set to meet for a second round of nuclear talks. Here’s what we know | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/middleeast/us-iran-nuclear-talks-what-we-know-intl/index.html",
            "upvotes": 167,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/20250415-hghghghg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Trump abandoned the deal the US had reached with Iran before \n\nTrump also abandoned his own trade deal he signed with canada \n\nWhy would anyone trust a deal made with trump\n\nHe infamously does not keep his promises and does not even follow the law of his own country",
                "Maybe, just maybe Trump shouldn't have gotten us out of the first agreement and we  wouldn't have to be doing it again right now.",
                "What we know is no agreement with Trump is worth the toilet paper it’s written on.",
                "Why? Donnie boy will just cancel it again  like he did the first time.",
                "the only reason he ripped up the original was so he could get the credit for the deal, but now he can’t even negotiate it. Unfortunately Bibi is too much of a coward now to do what needs to be done and just take out their sites already.",
                "Trump is gonna fail 3 deals next week. That's 3x the winning guys.",
                "Will definitely not be anywhere near as good as the deal Trump ripped up. Iran is also many years further along in uninterrupted nuke development.",
                "It’ll be interesting how this turns out.",
                "Surprised this is even happening given the Iran warhawks in this admin."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 11812,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 7066,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "Please remember, this is the same administration that requested that the court take a recess on deciding whether to deport 239 people, and while the court was in recess, rushed those planes into the air, so they would be over international waters by the time recess was over, and then when the judge demanded that those planes stay on the ground, they said they could no longer do anything because they were already over international waters, and the judge's bench orders no longer had legal standing in international airspace.",
                "I don’t believe they heard you!  Another judicial order to be ignored until it just doesn’t make sense to bother. Then what?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 50699,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "Yeah, because that's stopped them so far.",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Uh huh. Now fucking enforce it.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Sex toys cause fire engulfing multiple Staten Island homes: Court docs",
            "external_url": "https://www.nbcnewyork.com/local/sex-toys-cause-fire-engulfing-multiple-staten-island-homes-court-docs/6230573/",
            "upvotes": 1085,
            "date": "04/18/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/StatenIslandfireforweb_56427256_1920x1080_2422284867752.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A backyard bonfire sure is a strange way to dispose of sex toys.",
                "Articles for The Onion are writing themselves these days.",
                "They warned us to use lubrication...why didn't we listen?",
                "The dildo of consequences rarely comes lubed.",
                "best headline ever.  and of course it's staten island.",
                "Dammit Lazlo..  Or maybe it was Nadja\n\nOh, who are we kidding.  This was on Nandor.",
                "🎶You\n\nYour sex is on fire\n\nConsumed\n\nWith what's to transpire🎶",
                "This smells of Nandor and Nadja...",
                "SNL weekend update is going to have a field day with this one. ",
                "Yeah yeah yeah, ha ha funny sex toy jokes. Let us not forget ourselves that this will 100% be used as a talking point against the safety of sextoys later"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "US senator returns from El Salvador trip, says Abrego Garcia case is about far more than one man",
            "external_url": "https://apnews.com/article/van-hollen-abrego-garcia-el-salvador-deportation-53c7c2dc95486f5f0c4afd96dc0fb01c",
            "upvotes": 1699,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*More Democratic lawmakers have said they will fly to El Salvador to push for Abrego Garcia’s release, but the partisan pressure has yielded no results. President Donald Trump and El Salvador’s president, Nayib Bukele, have only dug in on keeping him out of the United States*\n\nT's game plan is undoubtedly to drive this case back to this Supreme Court--which will be duly pressured to reverse its original decision.",
                "\"That stance remained even after the U.S. Supreme Court called on the administration to [facilitate his return](https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470).\"\n\nWow ... the supreme court did NOT \"called on\". The supreme court issued an ORDER.",
                "Why does a Republican administration so desperately need some war to fight? Can’t we just *help out citizens and residents* by doing normal shit!?!?",
                "Trump's move to being a dictator is in full view of everybody. Which Republicans will stand up when the country needs them? I won't hold my breath.",
                "It’s for every American citizen.",
                "This is all just a pony show.",
                "Why are they so set on bringing back an MS-13 gang member who was here illegally and was/is a wife beater and was told to leave in 2019? Couldn’t find a better person to hold up as their champion?",
                "Is the one man orange because, I disagree."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 4462,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "US bord services new motto:\n\n\"If you're brown, turn around.\""
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Russia sentences 19-year-old woman to nearly three years in a penal colony after poetic anti-war protest | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/europe/darya-kozyreva-russia-penal-colony-war-protest-intl-latam/index.html",
            "upvotes": 671,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-18t133533z-372888836-rc2a0eak3wdb-rtrmadp-3-ukraine-crisis-russia-court.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Coming soon to a state near you.",
                "Our administration wouldn't recognize poetry if it slapped them across the face, so we should be safe.",
                "*Oh bury me, then rise ye up\nAnd break your heavy chains\nAnd water with the tyrants’ blood \nThe freedom you have gained,*\n\n\nBrave woman, standing on principle. If everyone, or even just enough people, were like her, tyranny would be impossible.",
                "Trump: Write that down! Write that down!",
                "If anybody doesn't think the same thing can happen here in the US under the Trump administration they are kidding themselves.",
                "I hope I have her character once things get that bad here",
                "How long until Amerika starts to do the same under the despot tRump?",
                "She has more courage than most of the adults in her country.",
                "Sebastian Gorka wants the same for Americans in America.",
                "Did the Russians ever jail anti-war critics during their wars in Afghanistan, Chechnya, Georgia, etc."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 4110,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "All else aside, who the hell designed that header graphic?",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "Why does it matter? They bungled the response to it anyway.",
                "Trump was President during Covid."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "“Decades behind bars for Tesla vandalizers”, Says Pam Bondi",
            "external_url": "https://www.bbc.com/news/articles/c204yvv1eexo.amp",
            "upvotes": 1292,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b3f0/live/e816b740-05f3-11f0-9b8b-6f7f9efe4b54.png",
            "top_comments": [
                "The US doesn't have any laws that would allow \"decades behind bars\" for vandalism. So they'll have to prosecute it under some law not usually used for vandalism cases if that's their goal. And when they do they'll likely lose.\n\nAnd if they don't lose, that's going to send a pretty horrible message about rape, armed robbery, and all the other crimes that get punished less harshly than that. \n\nDon't get me wrong, vandalism is actually bad.  But there's no justification for punishing vandalism against Tesla motorcars more harshly than other vandalism.",
                "And what’s the going rate for rape these days, 3-5 years if any? Ah but surely property crime is domestic terrorism and deserves 20 years. What a fucking joke.",
                "And what is she saying about the kid that killed 2 in FL?",
                "Silly rabbit, you need to be found guilty of 34 felonies if you want to avoid prison.",
                "Gonna be completely honest, I truthfully don’t give a shit about people vandalizing Teslas when they blanket pardoned the January 6th terrorists. Free game, baby.",
                "She refused to call the guy who set Joshua Shapiro's house on fire in the middle of the night by throwing moltov cocktails in it a domestic terrorist when asked point blank. Pam Bondi can go fuck herself.",
                "Pam Bondi accepted a bribe from Trump to not prosecute Trump University. How many years did she serve behind bars for that corruption?",
                "Who’s a good little Trumper? Pam is! She’s a good little girl!",
                "And yet breaking into the Capitol and trying to kidnap the Vice President while chanting, “Hang Mike Pence” with a gallows constructed outside is pardonable.\n\nI can’t wait to wake up from this fucking fever dream.",
                "Can you even have different punishments for specific vehicle models? Like sure, it's major property destruction. But a car is a car."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 7067,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "Please remember, this is the same administration that requested that the court take a recess on deciding whether to deport 239 people, and while the court was in recess, rushed those planes into the air, so they would be over international waters by the time recess was over, and then when the judge demanded that those planes stay on the ground, they said they could no longer do anything because they were already over international waters, and the judge's bench orders no longer had legal standing in international airspace.",
                "I don’t believe they heard you!  Another judicial order to be ignored until it just doesn’t make sense to bother. Then what?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 11818,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Measles update: State officials report 36 more cases in West Texas",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-18/measles-update-state-officials-report-36-more-cases-in-west-texas",
            "upvotes": 2436,
            "date": "04/18/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/d4986a6/2147483647/strip/true/crop/2787x1463+0+252/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2Ff8%2F0267f45f4986944eee0e903257db%2F2016-03-11t140544z-1308609988-mt1pra25799643-rtrmadp-3-pa-images.JPG",
            "top_comments": [
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 20 cases. Last Friday's update added 36 cases. Last Tuesday's update added 24 cases. The previous Friday's update added 59 cases.\n\nFour new hospitalizations were reported, up to 62 from 58. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors.",
                "Just waiting for the dept responsible for these reports is told to stand down.",
                "Rumor is that the Upshur County outbreak is at the Alert Academy in Big Sandy, Texas. People who follow the super-sized Duggar and Bates families will likely be familiar with Alert. It's part of the larger IBLP organization they're associated with.\n\nhttps://en.wikipedia.org/wiki/Institute_in_Basic_Life_Principles",
                "Imagine if they tried to get rid of measles as hard as they tried to get rid of trans athletes.",
                "The maga leadership is a deadly disease that harms American society - stop voting for these skeevy maga liars.",
                "As a lib living in Washington, man do I feel owned. \n\nI’m alive, and so are my kids, but phew! What a burn! \n\nMasterfully done.",
                "The CDC reported earlier today that the US is up to [800 cases nationwide this week](https://www.cdc.gov/measles/data-research/index.html).  That adds 88 to last week's total of 712.",
                "Saw my PCP. No chance of a booster vaccine despite being immunocompromised. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
                "Miscarriage = murderer and possibly prison\n\nLetting your child spread and die of a preventable disease in agony = Religious freedum",
                "Down in the west Texas town of El Paso\n\nThere was a germ that we thought that we’d beat\n\nTil a guy who eats bear meat said “Let it run freely”\n\nAnd the worm in his brain continued to eat"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 50701,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "Yeah, because that's stopped them so far.",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Uh huh. Now fucking enforce it.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Sex toys cause fire engulfing multiple Staten Island homes: Court docs",
            "external_url": "https://www.nbcnewyork.com/local/sex-toys-cause-fire-engulfing-multiple-staten-island-homes-court-docs/6230573/",
            "upvotes": 1089,
            "date": "04/18/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/StatenIslandfireforweb_56427256_1920x1080_2422284867752.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A backyard bonfire sure is a strange way to dispose of sex toys.",
                "Articles for The Onion are writing themselves these days.",
                "They warned us to use lubrication...why didn't we listen?",
                "The dildo of consequences rarely comes lubed.",
                "best headline ever.  and of course it's staten island.",
                "Dammit Lazlo..  Or maybe it was Nadja\n\nOh, who are we kidding.  This was on Nandor.",
                "🎶You\n\nYour sex is on fire\n\nConsumed\n\nWith what's to transpire🎶",
                "This smells of Nandor and Nadja...",
                "SNL weekend update is going to have a field day with this one. ",
                "Yeah yeah yeah, ha ha funny sex toy jokes. Let us not forget ourselves that this will 100% be used as a talking point against the safety of sextoys later"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/19/2025 04:10:18 UTC"
}