{
    "posts": [
        {
            "category": "HOT",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 55075,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "That brand is dead to me no matter what they do.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "He needs to rot in a cell the rest of his life.",
                "Yeah no shit they have, Elmo has overseen the stock lose 56% of its value in the last 4 months, a lot of that happening since he's started doing nazi salutes and LARPing a cosplay coup d'etait and telling the media he's been working 120 hours a week on DOGE instead to uh, to uhm, to er... cost the government more money than it would have spent if they just chose not to illegally fire tens of thousands of people than incur all the costs of the ensuing chaos, and destroy all of the country's soft power oh, and make his cars virtually unsellable overseas."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 9730,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "TLDR, they have been deprived of Habeus Corpus, even the lawyers who oversight these ICE facilities in question have no proof they are even still alive, in the country, where they are being imprisoned, nothing. Not even their fucking names. They haven't seen them, they don't know what their condition is. These are flagrant abuses of universal human rights. They could also be US Citizens. \n\nThe New Mexico ICE field office is located at 5441 Watson Drive South East Albuquerque, NM 87106 their public number is (505) 452-4700. Do they have the consent of the governed?   \n\n               ",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "How long will we wring our hands and clutch our pearls? ICE needs to be made to feel unsafe entering our communities.",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "Speed running to open Evil empire. This will no get better unless people takes it to the street and end this freak's reign."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
            "external_url": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
            "upvotes": 11708,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-02/210208-tesla-mn-0815-179d5d.jpg",
            "top_comments": [
                "These attacks aren't just happening in Vegas; they also seem to be taking place in other states. There was some incident in Kansas City where a Tesla dealership's CyberTrucks were lit up in a fire. Man it's getting crazy out there",
                "Imagine traveling back in time 6-8 years and telling someone that in 2025 there would be a group going around destroying EVs, and then trying to convince them it’s the left doing it lol",
                "It's getting kinda \"torch and pitchfork\" out there, huh?",
                "I read the Tesla vehicles are all paid actors.",
                "The stock tanking is a bigger statement IMO and I hope it goes down to pennies.",
                "[removed]",
                "EV fires are such a dangerous fire.  I feel bad for the first responders.",
                "its just locker room arson.",
                "[removed]",
                "Ahem. Use journalistic voice!\n\n\"Tesla catches fire after hitting Molotov cocktails and bullet that fell out of gun\"."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Federal judge rules DOGE's USAID dismantling likely violates the Constitution, blocking Musk from further cuts",
            "external_url": "https://apnews.com/article/usaid-federal-judge-trump-administration-bdc919a5d98eda5ab72a32fdfe2f147d?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR08wP9OXojQ8pN3mFLz88gnMNYOpMliinDgxBeBLcFPFRiCqZNXskWI2J0_aem_wTezhuydfNr_XXXvgwA5Aw",
            "upvotes": 9145,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "the most doge thing for DOGE to do is to eliminate itself",
                "Cool, now that they've made this ruling over and over, how about enforcing it?",
                "The problem is the administration doesn't think it should be held accountable by our checks and balances. You know, the ones the Founding Fathers considered a pillar of our Constitution.",
                ">\"I don't care what the judges think\"\n\n-MAGA, when judges rule against their interests.",
                "Outstanding. Now please enforce it tomorrow when they inevitably do something else unconstitutional.",
                "Shame that won't stop them in any way, they've stated the courts have no authority.",
                "\"Blocking\" Musk from doing something he *never* had the authority or legal right to do in the first place isn't going to do anything. This is a start though. Start issuing warrants.",
                "Why do they need to couch the language with \"likely\"? Just cite where in the Constitution was violated. Boom.",
                "If this ruling has judicial weight, why doesn’t it unravel everything that muskrat has done in terminating federal employees? If it was unconstitutionalfor USAID, then surely it is unconstitutional for NASA, NOAA, FDA, and more.",
                "What happened to do something illegal and go to prison?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Minnesota state Sen. Eichorn arrested on suspicion of soliciting a minor",
            "external_url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor",
            "upvotes": 18366,
            "date": "03/18/2025",
            "thumbnail": "https://img.apmcdn.org/efc0a6706dfa0131eda07e7a2398a16d17f2a111/widescreen/e36356-eichorn-arrest-2000.jpg",
            "top_comments": [
                "Wasn't this scumbag one of the guys trying to push legislation in Minnesota to make hating Trump a mental illness?",
                "They didn't state the party in the title because you already know it.",
                "Ya know. \n\n\nRepublicans constantly going on about pedophiles and protecting the children is really starting to seem like some severe projection. \n\n\nEdit: notable typo.",
                "I guess he had Trump Depravity Syndrome.",
                "[deleted]",
                "Title correction: \"**Republican** Minnesota state Sen. Eichorn...\"",
                "I'll save you all a click.  Yes it was a republican",
                "What a surprise!  He's a Republican.",
                "Party of family values, it just might be your child",
                "The GOP - Grand Old Pedophile party."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 1868,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Didn’t they just close a bunch of SS offices?",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks.",
                "Retirees who live three hours away from the nearest office are going to love this!",
                "This is how Social Security dies. They can’t end it outright, so they’ll require people to use an app that doesn’t work, then require office visits while cutting staff and removing as many locations as possible. I know they’ll just blame Democrats like always, but I hope the old MAGA voters realize they did this to themselves",
                "My god these people suck",
                "Wow, so efficient to force people who may be unable to drive or even walk to come into the office in person"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tesla board members, executive sell off over $100 million of stock in recent weeks",
            "external_url": "https://abcnews.go.com/Business/tesla-board-members-executive-sell-off-100-million/story?id=119889047&cid=social_twitter_abcn",
            "upvotes": 52364,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7d0ebdc0-95a7-4b1b-9b06-180791a83c1f/tesla-charging-station-gty-jt-250314_1741978782881_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Just fire the CEO already",
                "JP Morgan recently downgraded TSLA stock to $120/share. Elon is going to get a margin call.",
                "The fact investors thought Tesla was worth more than every established auto manufacturer combined was just stupid. Please tell me how Tesla was worth more than Toyota, Honda, Ford and VW combined.  Not to mention all the other major brands…",
                "Ah so that’s why Elon made Donald sell Teslas on the White House lawn",
                "Im sure daddy Trump will help bail musk out when this all crashes.",
                "If I had that stock I'd probably be selling too before it's worthless.",
                "Weeks? They havent bought a share in over a year.. The execs have sold 750k shares in that same time period.\n\n[https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity](https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity)",
                "Good. Get fucked, Elon.",
                "If you look into insider sales you will see that no insider has bought a singular share, they only have sold",
                "Tesla will get some fucked up bailout and then talks of how important EVs are."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 1294,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "I bet there is some interesting back story here:\n\nHowever, she told ABC she got her first visa at the San Ysidro border   \ncrossing on the advice of a Los Angeles attorney, who met her at the   \nborder, and therefore may have thought it would work a second time at   \nthat location.",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Mexico seeks to prevent US deporting Mexicans to Guantanamo Bay",
            "external_url": "https://www.reuters.com/world/americas/mexico-seeks-prevent-us-deporting-mexicans-guantanamo-bay-2025-03-18/",
            "upvotes": 2816,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"No Mexican should be sent to any other place but Mexico,\" Sheinbaum said.*\n\nNot too much to ask for.  Guantanamo or El Salvador have to be out of the question",
                "Can the news please start calling this what it is? In order to deport someone, you have to send them out of the country. Guantanamo Bay is a US military base and therefore US soil. Which means Trump is NOT deporting people, he is sending them to concentration camps. Mass internment which will inevitably lead to genocide. If the news doesn't want to call it out, they will be counted among the complicit.",
                "Why does every day with this peckerhead  have to be a what can I do to fuck shit up today ?",
                "Anyone else think it’s funny how obviously scared Trump is of the President of Mexico. He hasn’t said a peep to her!!!",
                "This camp should have never been allowed to operate or even exist and this region should be returned to Cuba. It's a disgrace that USA allies remained silent on this. This is what happens when you operate outside the law. First, terrorists and now immigrants and soon American political dissenters (don't say it can't happen because it can definitely happen). Abolishing laws always starts with the people who are hated the most. That's why everyone should be equal under the law. Even the devil should be protected by the law.",
                "There is no legal indication as to the nationality of the people being sent to the concentration camps. They say they're illegal immigrants, but they do not require proof or anything to send them there. There are no trials, nothing.",
                "Does anyone know if the Mexican consulate has advised all Mexican citizens who don’t have legal status in the United States to return to Mexico? ",
                "And what exactly is to stop Mexico from randomly picking up US citizens , simply driving them out to the middle of the desert and leaving them there for the cartels ? I mean they wouldn't even be deporting them to another jurisdiction.",
                "'Have you tried to bribe him with eggs & beef?'",
                "I don't understand why they can't deport directly to Mexico. Just put everyone on a bus and across the border. No need for camps. That's ridiculous. "
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "NASA astronauts splash down off Florida coast after nine months stuck in space",
            "external_url": "https://news.sky.com/story/nasa-astronauts-splash-down-off-florida-coast-after-nine-months-stuck-in-space-13331459",
            "upvotes": 1623,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-butch-willmore-suni-williams_6860942.jpg?20250318231508",
            "top_comments": [
                "The pod of dolphins showing up to check out the capsule is pretty cool.",
                "Imaging not having someone at home to take care of the bs. “Oh im only gone 8 days, ill pay that when i get back”",
                "Taking a crap in gravity is gonna be so sweet for these folks.",
                "I can't believe they missed the Rise and Fall of the Hawktuah Girl!",
                "\"Leave it to tomorrow to unpack my case, honey disconnect the phone\" - Beatles  \nWelcome home folks! There is beer, pizza and cake in the fridge.",
                "That’s the first time I’ve ever heard anything described as “off the coast of Tallahassee”.  That’s like if it was in the Atlantic and saying, “off the coast of Wash. DC”.",
                "I bet those two NEVER want to see each other again.",
                "Welcome back.\n\n\nThose parachutes were beautiful.\n\n\nAs was the light.",
                "They might go back to the ISS once they see all the news from the last 6 months.",
                "It’s worth noting that Butch and Suni weren’t really stranded. The capsule that brought them back has been docked to the station for the last 6 months and prior to that they had other emergency escape options. The main thing keeping them up there was logistics, bringing them home earlier would either mean spending >100 million on a dedicated mission to bring them down or leaving the station uncrewed for *months.* It’s also worth noting that while 9 months is a long ISS stay it’s not especially long. The normal crew mission to the ISS lasts 6 months and there have been people who have stayed for over a year. Now that isn’t to minimize the struggle of the astronauts, I’m sure they are happy to be finally returning home today after so long away from their families but I just wanted to provide context to their return. The media has done an especially poor job of covering the Starlinner situation and that was even for Musk and Trump made this an extremely political issue."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 1876,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Didn’t they just close a bunch of SS offices?",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks.",
                "Retirees who live three hours away from the nearest office are going to love this!",
                "This is how Social Security dies. They can’t end it outright, so they’ll require people to use an app that doesn’t work, then require office visits while cutting staff and removing as many locations as possible. I know they’ll just blame Democrats like always, but I hope the old MAGA voters realize they did this to themselves",
                "My god these people suck",
                "Wow, so efficient to force people who may be unable to drive or even walk to come into the office in person"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Death row inmate in Louisiana becomes fifth person in US to be executed using nitrogen gas",
            "external_url": "https://news.sky.com/story/death-row-inmate-in-louisiana-becomes-fifth-person-in-us-to-be-executed-using-nitrogen-gas-13331675",
            "upvotes": 404,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-louisiana-jessie-hoffman_6860148.jpg?20250318074423",
            "top_comments": [
                "Do they say “good nitrogren” before it’s administered?",
                "I have passed out from nitrogen being added to air in a medically monitored chamber for aviation training on hypoxia. It is painless.",
                "I don't see how this is a \"cruel and unusual\" argument.\n\nI would CHOOSE this death if I get the choice.",
                "I’m generally not a proponent of the death penalty, but this sounds much more humane than lethal injection. Reading about lethal injections gone wrong is really very disturbing.",
                "Of all the humane ways to kill someone, that's the most humane.  You feel nothing different for a few seconds and then you pass out.  4 minutes later you're dead of lack of oxygen.  Your organs are perfectly fine and can be harvested for donation.  Sure, the ones getting the organs might become just like the executed, but hey, at least they'll become future donors, and the cycle will keep going and going and going...^muwahahaha",
                "Jesus christ, did a teenager write this article?",
                "How much does it cost for a full respirator mask and a 15-minute tank of nitrogen?",
                "I wonder if a deathrow inmate could request helium? Might as well let them have a little fun before they die.",
                "Death penalty is always wrong and a moral crime. Trying to make it ”more humane” is just trying to alleviate the guilt. \n\nEvery governor should be required to be the executioner themselves for starters, rather than pawning off their moral burden on state employees.\n\nBefore anyone comes to these comments with ”I am against death penalty usually but in this case…” I will have you stop right there. \n\nYou aren’t actually against death penalty. You just need a high score in the revenge olympics.",
                "You know you live in a shithole country when you still have a death-penalty."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 1297,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "I bet there is some interesting back story here:\n\nHowever, she told ABC she got her first visa at the San Ysidro border   \ncrossing on the advice of a Los Angeles attorney, who met her at the   \nborder, and therefore may have thought it would work a second time at   \nthat location.",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Amazon sues government safety agency over having to recall products from other sellers",
            "external_url": "https://www.cbsnews.com/news/amazon-product-recalls-consumer-product-safety-commission/",
            "upvotes": 150,
            "date": "03/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/01/18/afc44a79-7a90-47c2-95b3-fc34dd05201b/thumbnail/1200x630/30686ad6a91b3107fc78c73cc795d493/ap24017463992288.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "There’s still a US government agency that hasn’t been dismantled?",
                "> During the proceedings, Amazon did not contest that the products presented a substantial hazard, but argued that it is not a distributor and is not responsible for protecting the public from products sold by third parties.\n\nOh, we'll happily profit from those using our platform to sell dangerous products, but don't you dare hold us responsible.",
                "They want a cut of the money without any of the responsibility.  Deregulated industry 101.",
                "It's about time they're held liable for the crap they put on the market.  I learned how to avoid 3rd party merchandise on Amazon until Amazon began misrepresenting the origin.  Navigating fair trade has seldom been more difficult.  Yes, you can return that defective merch as long as you're willing to lug it to the PO or arrange private carriers.  Disingenuous at best; criminal when you have a Prime account.\n\nEvery product/manufacturer/retailer has a market cycle and Amazon is floundering but so are other e-tailers.",
                "Because Amazon controls the entire logistics chain and is best suited to handle recalls. Amazon also controls access to that chain and the information customers can get about the products. Amazon is responsible for creating the system through which recalled products are necessary. Why does Amazon allow the sale of so many recalled products that it's a burden? Amazon is free to institute whatever recall conditions it may required between it and the sellers they freely agreed to partner with. Why wouldn't Amazon be responsible for recalls of products sold through them?",
                "*\"Amazon's suit suggests the company thinks the people of the United States would be better off without an independent, bipartisan safety agency to enforce our laws and protect consumers from dangerous products.\"*\n\nThe way the Trump Admin is operating, Amazon probably only has to wait a little longer for one more citizen protective agency to be dismantled... billionaires for billionaires.",
                "> The commission in **July 2024** ruled that Amazon was distributing products that are defective or fail to meet federal safety standards. The CPSC also said Amazon was legally responsible for the recall of more than 400,000 products, including faulty carbon monoxide detectors, hairdryers without electrocution protection and **children's sleepwear that violates federal flammability standards.** \n\nI can only imagine what Amazon founder Jeff Bezos said when he stopped the Washington Post editorial board from endorsing Kamala Harris: *\"The Democrats are trying to stop us from burning America's children to death in their sleep; we can't let their bleeding-heart, pro-child agenda win!\"* \n\n> \"The commission may issue recall orders to the manufacturers, distributors and retailers of a product, but not to third-party logistics providers who store the product in their warehouses and transport it to customers,\" Amazon stated its suit, filed on March 14 in the U.S. District Court for the District of Maryland. \n\n*\"We're not a 'distributor,' we're just a warehouser/transporter. We're not a 'retailer,' we just sell retail goods to customers.\"*",
                "And sadly they will probably get what they want because Bezos backed Trump.   \n  \nEverything is for sale in the US unfortunately",
                "It'd be a shame if the safety agency were to be dismantled. Then Amazon would need to talk to the head chief and meter maid directly",
                "Easy fix:\n\nDismantle the government safety agency.\n\nTrump/Elon logic 👍🏻"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "FDA staff return to crowded offices, broken equipment and missing chairs",
            "external_url": "https://apnews.com/article/fda-return-office-parking-lines-chaos-federal-employees-c4fa013f27f286752e7b17a6e39c52e2",
            "upvotes": 875,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My god, the efficiency is breathtaking",
                "There is one universal truth about government work. \n\nYour chair will be stolen if you leave it unattended long enough. Damn son'va bitches stealing chairs left and right up in there!",
                "We are going to break the system one way or the other.",
                "My hairdresser was just telling me that one of her clients had been working for the IRS for 5 years.   The client was forced to go to the office for the first time last week and told that they could resign or retire and be barred from ever getting another government job and get pay and benefits through the end of the year.   \n\nMeanwhile, they couldn't force enough people to retire so everyone else is required to go into the office 5 days a week.   But there aren't enough parking spaces,  chairs, desks, or cubicles for everyone.   It's a giant shitshow.",
                "Oh so when I break company equipment after I'm fired, it's not okay /s\n\nGee, why would the government break their own equipment?? Those are taxpayers dollars!",
                "Where are all the stolen items stored, let me guess? MaRa La Gooooo.",
                "Office Space 2: Electric We’reAllGonnaDieAndIt’llBeStupid-aloo",
                "Now taking someone’s office chair, putting it above my head, and scurrying away in glee sounds just like me to be honest.",
                "Family member works for USAID. They were called in about 3 weeks after this started. They also laid off the janitors… everyone had left their desks as if they’d be back the next day…"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 9726,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "TLDR, they have been deprived of Habeus Corpus, even the lawyers who oversight these ICE facilities in question have no proof they are even still alive, in the country, where they are being imprisoned, nothing. Not even their fucking names. They haven't seen them, they don't know what their condition is. These are flagrant abuses of universal human rights. They could also be US Citizens. \n\nThe New Mexico ICE field office is located at 5441 Watson Drive South East Albuquerque, NM 87106 their public number is (505) 452-4700. Do they have the consent of the governed?   \n\n               ",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "How long will we wring our hands and clutch our pearls? ICE needs to be made to feel unsafe entering our communities.",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "Speed running to open Evil empire. This will no get better unless people takes it to the street and end this freak's reign."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Woman faces attempted murder charges after Elmore County deputy shot",
            "external_url": "https://www.wsfa.com/2025/03/18/woman-faces-attempted-murder-charges-after-elmore-county-deputy-shot/",
            "upvotes": 36,
            "date": "03/18/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/MVI563LMQNGAFBFZ7ZYD3M4MMY.png?auth=6d7a9035451f1adc27efeb38c904f247ac88cc8b02437c2d0ce20f6dece379fb&width=1200&height=600&smart=true",
            "top_comments": [
                "#Alabama Woman Charged with Attempted Murder After Deputy Shot in Shocking Confrontation\n\nA routine call to investigate a theft in Elmore County, Alabama, took a dramatic and violent turn when a woman allegedly pulled a gun and shot a deputy, landing herself behind bars on attempted murder charges.\n\nThe suspect, 40-year-old Ebony Bracy from Wetumpka, had initially been speaking with officers when the situation escalated. According to Sheriff Bill Franklin, she was reportedly incoherent when deputies arrived at the scene on Dozier Road in the Redland community. As officers conducted their investigation, they discovered Bracy had outstanding warrants, though details of these were not immediately disclosed.\n\nWhen they attempted to take her into custody, she allegedly drew a firearm and opened fire, hitting one deputy in the forearm. The bullet travelled up to his bicep, wounding him. In the chaos that followed, another deputy fired back, striking Bracy in the upper torso. Though the extent of her injury was not fully detailed, the sheriff suggested she would likely need stitches. A second woman, who had been standing behind Bracy, was also caught in the crossfire, taking a bullet to the thigh.\n\nBracy is now being held at the Elmore County Jail with bail set at a staggering $2 million. The state has launched an investigation into the incident, though officials have yet to release further details.\n\nWhat started as a theft report ended with gunfire, injuries and serious charges, leaving the community rattled and authorities determined to piece together exactly what led to the shocking turn of events.",
                "You're supposed to shoot the sheriff, not the deputy! Did this woman not ever hear the song!? /s",
                "I'm honestly surprised she made it out of that alive ",
                "But what about his past? Has he ever been in trouble with speeding tickets? DUI? Probably deserved it. /s\n\nAnd why didn’t he check behind his target before opening fire? Gun safety rule #3. \nNo /s.",
                "Looks like they had one 40 watt bulb hanging from the ceiling when they to the picture."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 55085,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "That brand is dead to me no matter what they do.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "He needs to rot in a cell the rest of his life.",
                "Yeah no shit they have, Elmo has overseen the stock lose 56% of its value in the last 4 months, a lot of that happening since he's started doing nazi salutes and LARPing a cosplay coup d'etait and telling the media he's been working 120 hours a week on DOGE instead to uh, to uhm, to er... cost the government more money than it would have spent if they just chose not to illegally fire tens of thousands of people than incur all the costs of the ensuing chaos, and destroy all of the country's soft power oh, and make his cars virtually unsellable overseas."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "NASA astronauts splash down off Florida coast after nine months stuck in space",
            "external_url": "https://news.sky.com/story/nasa-astronauts-splash-down-off-florida-coast-after-nine-months-stuck-in-space-13331459",
            "upvotes": 1623,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-butch-willmore-suni-williams_6860942.jpg?20250318231508",
            "top_comments": [
                "The pod of dolphins showing up to check out the capsule is pretty cool.",
                "Imaging not having someone at home to take care of the bs. “Oh im only gone 8 days, ill pay that when i get back”",
                "Taking a crap in gravity is gonna be so sweet for these folks.",
                "I can't believe they missed the Rise and Fall of the Hawktuah Girl!",
                "\"Leave it to tomorrow to unpack my case, honey disconnect the phone\" - Beatles  \nWelcome home folks! There is beer, pizza and cake in the fridge.",
                "That’s the first time I’ve ever heard anything described as “off the coast of Tallahassee”.  That’s like if it was in the Atlantic and saying, “off the coast of Wash. DC”.",
                "I bet those two NEVER want to see each other again.",
                "Welcome back.\n\n\nThose parachutes were beautiful.\n\n\nAs was the light.",
                "They might go back to the ISS once they see all the news from the last 6 months.",
                "It’s worth noting that Butch and Suni weren’t really stranded. The capsule that brought them back has been docked to the station for the last 6 months and prior to that they had other emergency escape options. The main thing keeping them up there was logistics, bringing them home earlier would either mean spending >100 million on a dedicated mission to bring them down or leaving the station uncrewed for *months.* It’s also worth noting that while 9 months is a long ISS stay it’s not especially long. The normal crew mission to the ISS lasts 6 months and there have been people who have stayed for over a year. Now that isn’t to minimize the struggle of the astronauts, I’m sure they are happy to be finally returning home today after so long away from their families but I just wanted to provide context to their return. The media has done an especially poor job of covering the Starlinner situation and that was even for Musk and Trump made this an extremely political issue."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
            "external_url": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
            "upvotes": 11703,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-02/210208-tesla-mn-0815-179d5d.jpg",
            "top_comments": [
                "These attacks aren't just happening in Vegas; they also seem to be taking place in other states. There was some incident in Kansas City where a Tesla dealership's CyberTrucks were lit up in a fire. Man it's getting crazy out there",
                "Imagine traveling back in time 6-8 years and telling someone that in 2025 there would be a group going around destroying EVs, and then trying to convince them it’s the left doing it lol",
                "It's getting kinda \"torch and pitchfork\" out there, huh?",
                "I read the Tesla vehicles are all paid actors.",
                "The stock tanking is a bigger statement IMO and I hope it goes down to pennies.",
                "[removed]",
                "EV fires are such a dangerous fire.  I feel bad for the first responders.",
                "its just locker room arson.",
                "[removed]",
                "Ahem. Use journalistic voice!\n\n\"Tesla catches fire after hitting Molotov cocktails and bullet that fell out of gun\"."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Federal judge rules DOGE's USAID dismantling likely violates the Constitution, blocking Musk from further cuts",
            "external_url": "https://apnews.com/article/usaid-federal-judge-trump-administration-bdc919a5d98eda5ab72a32fdfe2f147d?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR08wP9OXojQ8pN3mFLz88gnMNYOpMliinDgxBeBLcFPFRiCqZNXskWI2J0_aem_wTezhuydfNr_XXXvgwA5Aw",
            "upvotes": 9149,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "the most doge thing for DOGE to do is to eliminate itself",
                "Cool, now that they've made this ruling over and over, how about enforcing it?",
                "The problem is the administration doesn't think it should be held accountable by our checks and balances. You know, the ones the Founding Fathers considered a pillar of our Constitution.",
                ">\"I don't care what the judges think\"\n\n-MAGA, when judges rule against their interests.",
                "Outstanding. Now please enforce it tomorrow when they inevitably do something else unconstitutional.",
                "Shame that won't stop them in any way, they've stated the courts have no authority.",
                "\"Blocking\" Musk from doing something he *never* had the authority or legal right to do in the first place isn't going to do anything. This is a start though. Start issuing warrants.",
                "Why do they need to couch the language with \"likely\"? Just cite where in the Constitution was violated. Boom.",
                "If this ruling has judicial weight, why doesn’t it unravel everything that muskrat has done in terminating federal employees? If it was unconstitutionalfor USAID, then surely it is unconstitutional for NASA, NOAA, FDA, and more.",
                "What happened to do something illegal and go to prison?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Minnesota state Sen. Eichorn arrested on suspicion of soliciting a minor",
            "external_url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor",
            "upvotes": 18365,
            "date": "03/18/2025",
            "thumbnail": "https://img.apmcdn.org/efc0a6706dfa0131eda07e7a2398a16d17f2a111/widescreen/e36356-eichorn-arrest-2000.jpg",
            "top_comments": [
                "Wasn't this scumbag one of the guys trying to push legislation in Minnesota to make hating Trump a mental illness?",
                "They didn't state the party in the title because you already know it.",
                "Ya know. \n\n\nRepublicans constantly going on about pedophiles and protecting the children is really starting to seem like some severe projection. \n\n\nEdit: notable typo.",
                "I guess he had Trump Depravity Syndrome.",
                "[deleted]",
                "Title correction: \"**Republican** Minnesota state Sen. Eichorn...\"",
                "I'll save you all a click.  Yes it was a republican",
                "What a surprise!  He's a Republican.",
                "Party of family values, it just might be your child",
                "The GOP - Grand Old Pedophile party."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Netanyahu says fighting has resumed in Gaza with 'full force'",
            "external_url": "https://www.bbc.com/news/live/czje23jd779t",
            "upvotes": 2978,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a17/live/0c8f2e20-0420-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "No one could have predicted this",
                "This is one of the 2 wars, Trump said 'would be over before he became president or else' to , right?  It must be fake news that they are still ongoing then.",
                "Lasted longer than I thought it would",
                "Trump sure is good at this peace stuff /s",
                "Gotta clear the land so that Trump can build his Gaza hotel.",
                "Trump won’t lift a finger to stop this fighting. He is anxious to break ground on the Trump hotel.",
                "Is it really fighting at this point? Looks more like a choreographed demolition.",
                "[removed]",
                "Turns out this Trump guy is really bad at negotiating peace.",
                "Hey, Maga Trump said there will be no more wars under his watch. So far, tariff , trade, military, and war with our allies. So....."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 55078,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "That brand is dead to me no matter what they do.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "He needs to rot in a cell the rest of his life.",
                "Yeah no shit they have, Elmo has overseen the stock lose 56% of its value in the last 4 months, a lot of that happening since he's started doing nazi salutes and LARPing a cosplay coup d'etait and telling the media he's been working 120 hours a week on DOGE instead to uh, to uhm, to er... cost the government more money than it would have spent if they just chose not to illegally fire tens of thousands of people than incur all the costs of the ensuing chaos, and destroy all of the country's soft power oh, and make his cars virtually unsellable overseas."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 9736,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "TLDR, they have been deprived of Habeus Corpus, even the lawyers who oversight these ICE facilities in question have no proof they are even still alive, in the country, where they are being imprisoned, nothing. Not even their fucking names. They haven't seen them, they don't know what their condition is. These are flagrant abuses of universal human rights. They could also be US Citizens. \n\nThe New Mexico ICE field office is located at 5441 Watson Drive South East Albuquerque, NM 87106 their public number is (505) 452-4700. Do they have the consent of the governed?   \n\n               ",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "How long will we wring our hands and clutch our pearls? ICE needs to be made to feel unsafe entering our communities.",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "Speed running to open Evil empire. This will no get better unless people takes it to the street and end this freak's reign."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
            "external_url": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
            "upvotes": 11702,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-02/210208-tesla-mn-0815-179d5d.jpg",
            "top_comments": [
                "These attacks aren't just happening in Vegas; they also seem to be taking place in other states. There was some incident in Kansas City where a Tesla dealership's CyberTrucks were lit up in a fire. Man it's getting crazy out there",
                "Imagine traveling back in time 6-8 years and telling someone that in 2025 there would be a group going around destroying EVs, and then trying to convince them it’s the left doing it lol",
                "It's getting kinda \"torch and pitchfork\" out there, huh?",
                "I read the Tesla vehicles are all paid actors.",
                "The stock tanking is a bigger statement IMO and I hope it goes down to pennies.",
                "[removed]",
                "EV fires are such a dangerous fire.  I feel bad for the first responders.",
                "its just locker room arson.",
                "[removed]",
                "Ahem. Use journalistic voice!\n\n\"Tesla catches fire after hitting Molotov cocktails and bullet that fell out of gun\"."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 1876,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Didn’t they just close a bunch of SS offices?",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks.",
                "Retirees who live three hours away from the nearest office are going to love this!",
                "This is how Social Security dies. They can’t end it outright, so they’ll require people to use an app that doesn’t work, then require office visits while cutting staff and removing as many locations as possible. I know they’ll just blame Democrats like always, but I hope the old MAGA voters realize they did this to themselves",
                "My god these people suck",
                "Wow, so efficient to force people who may be unable to drive or even walk to come into the office in person"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Tesla board members, executive sell off over $100 million of stock in recent weeks",
            "external_url": "https://abcnews.go.com/Business/tesla-board-members-executive-sell-off-100-million/story?id=119889047&cid=social_twitter_abcn",
            "upvotes": 52372,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7d0ebdc0-95a7-4b1b-9b06-180791a83c1f/tesla-charging-station-gty-jt-250314_1741978782881_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Just fire the CEO already",
                "JP Morgan recently downgraded TSLA stock to $120/share. Elon is going to get a margin call.",
                "The fact investors thought Tesla was worth more than every established auto manufacturer combined was just stupid. Please tell me how Tesla was worth more than Toyota, Honda, Ford and VW combined.  Not to mention all the other major brands…",
                "Ah so that’s why Elon made Donald sell Teslas on the White House lawn",
                "Im sure daddy Trump will help bail musk out when this all crashes.",
                "If I had that stock I'd probably be selling too before it's worthless.",
                "Weeks? They havent bought a share in over a year.. The execs have sold 750k shares in that same time period.\n\n[https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity](https://www.nasdaq.com/market-activity/stocks/tsla/insider-activity)",
                "Good. Get fucked, Elon.",
                "If you look into insider sales you will see that no insider has bought a singular share, they only have sold",
                "Tesla will get some fucked up bailout and then talks of how important EVs are."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 1297,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "I bet there is some interesting back story here:\n\nHowever, she told ABC she got her first visa at the San Ysidro border   \ncrossing on the advice of a Los Angeles attorney, who met her at the   \nborder, and therefore may have thought it would work a second time at   \nthat location.",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Mexico seeks to prevent US deporting Mexicans to Guantanamo Bay",
            "external_url": "https://www.reuters.com/world/americas/mexico-seeks-prevent-us-deporting-mexicans-guantanamo-bay-2025-03-18/",
            "upvotes": 2824,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"No Mexican should be sent to any other place but Mexico,\" Sheinbaum said.*\n\nNot too much to ask for.  Guantanamo or El Salvador have to be out of the question",
                "Can the news please start calling this what it is? In order to deport someone, you have to send them out of the country. Guantanamo Bay is a US military base and therefore US soil. Which means Trump is NOT deporting people, he is sending them to concentration camps. Mass internment which will inevitably lead to genocide. If the news doesn't want to call it out, they will be counted among the complicit.",
                "Why does every day with this peckerhead  have to be a what can I do to fuck shit up today ?",
                "Anyone else think it’s funny how obviously scared Trump is of the President of Mexico. He hasn’t said a peep to her!!!",
                "This camp should have never been allowed to operate or even exist and this region should be returned to Cuba. It's a disgrace that USA allies remained silent on this. This is what happens when you operate outside the law. First, terrorists and now immigrants and soon American political dissenters (don't say it can't happen because it can definitely happen). Abolishing laws always starts with the people who are hated the most. That's why everyone should be equal under the law. Even the devil should be protected by the law.",
                "There is no legal indication as to the nationality of the people being sent to the concentration camps. They say they're illegal immigrants, but they do not require proof or anything to send them there. There are no trials, nothing.",
                "Does anyone know if the Mexican consulate has advised all Mexican citizens who don’t have legal status in the United States to return to Mexico? ",
                "And what exactly is to stop Mexico from randomly picking up US citizens , simply driving them out to the middle of the desert and leaving them there for the cartels ? I mean they wouldn't even be deporting them to another jurisdiction.",
                "'Have you tried to bribe him with eggs & beef?'",
                "I don't understand why they can't deport directly to Mexico. Just put everyone on a bus and across the border. No need for camps. That's ridiculous. "
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "03/19/2025 04:10:27 UTC"
}