{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 11159,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "I've never seen a more insecure man than Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "The reason people with a brain do not do this is they realize their own children are going to need the very same protection. Jesus how did so many people vote for one of the dumbest fuckers on the planet.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Biden specifically EXTENDED protections for Trump's adult kids from six months to one year when he became president.  Trump is just being his typically petty bitch ass self.",
                "Good thing Democrats won't fight dirty because they want to be civil and prevent exactly the retaliatory things that are happening every day"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 13087,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 49454,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Navajo Code Talkers disappear from military websites after Trump DEI order",
            "external_url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii",
            "upvotes": 7035,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it me or is this the most insecure shit you’ve ever seen?",
                "What a colossal waste of time and tax payer's money Hegseth\n\nYou know we're going to put it all back when you're gone you dickhead",
                "Isn't this the same party that cries about \"erasing history\" when a community tries to remove Confederate monuments?",
                "This is so fucked up. These are the worst people doing the worst things to America.",
                "My grandfather was a lifelong Republican who spent decades working in the Bureau of Indian Affairs and Bureau of Land Management, serving many Navajo communities and other tribes in the Southwest US, continuing to field calls well after his retirement. Here they are undermining his life's work, the communities he and these agencies served, and utterly besmirching one of the most important, selfless, and **undeserving** contributions to our country by a community of its people.\n\nLike many people, I felt pretty hollow after the election, and for my own sanity decided to step back from political efforts. \"Americans voted for this, let them reap what they sow.\" I cannot in good conscience, maintaining civility and patience, just watch our country steer into a landslide intent on corrupting and twisting what we built. It is controversial, problematic, but nonetheless hard-earned history that we built together.\n\nI choose to resist in any way I can, so that my children may have a future and that the legacy of people who chose to serve our country will cease its diminishment and thrive. I hope you join me in the protests and whatever else is to come.",
                "https://en.m.wikipedia.org/wiki/Choctaw_code_talkers\n\nI'm the great grandson of Solomon Bond Louis\n\nMy family has always served in some unit of the military until my generation where they sat us down and warned us in 2002 that things have changed. Considering most are Vietnam vets in the Marines it made sense. Also my dad constantly reminded me as a kid that if his CO hadn't give him the leave to get married to my mom who also served(higher rank as well) he would of been in Beirut when it was bombed. \n\nAll I can say is this is fucking crazy, I'm genuinely lost for words at this point",
                "There not removing DEI related topics. They're removing any mention of women or minority achievements, regardless of how they were actually earned. \n\nThis is straight up racism. Full stop. There is no other explanation.",
                "Whitewashing of America. Another stupid effing order.",
                "Never forget victory in WWII could not have happened, (at least not as \"quickly\") without a gay man, named Alan Turing, and the Navajo code talkers.\n\nBreaking enigma combined with our own code that couldn't be deciphered were instrumental.\n\nIf the government in the 1890s had succeeded in destroying native languages and culture through ethnic cleansing and residential schools enforcing Eurocentrism, it's likely we wouldn't have had the code talkers during World War II.\n\nThe attempt by the government to completely excise native culture and the role the code talkers played are the basic cliffnotes primer anyone needs to demonstrate why racism is truly a shitty concept.\n\nThis neo McCarthyism \"war on woke/anti DEIA bullshit needs to stop, but I guess people who are ignorant of our history never learned what was actually valuable from the past they are trying to destroy",
                "DEI is just a racist and bigoted dog whistle to use on anyone who isn't a cishet, white, straight male.   \n  \nAbsolutely abhorrent. How the hell is it even DEI for NAVAJO people to use NAVAJO language to help win a war for their country? \n\nTuskegee airmen and women. The Enola Gay. Army Maj. Gen. Charles Calvin Rogers. Adm. Lisa Franchetti. Chairman, Gen. CQ Brown Jr. 14000+ active military folks being ousted because they are trans.\n\n9 million+ Veterans affected by DEI and policy change EO's...\n\nWhy the hell would ANYONE want to join the Forces now? \n\nThis shit is so wrong."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "HOT",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 4512,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "He flew so the world may be free rip",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "Thank you.\nYou will live on in my heart and head forever",
                "I remember growing up all the WW2 vets I knew. All gone now. I even knew a neighbor who told me he was in a glider when I was a teen. I never knew before about the gliders. It was amazing to learn firsthand from him."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 8332,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "Guess I’ll stop drinking that now, thanks",
                "This is the life of almost all non-alcoholic beverages. Start up the company, gain investors, work your balls off for a couple years and rack up debt in advertising and retail agreements to establish the brand with the overall goal to sell to Pepsi or Coke and cash out and go home. For some companies like Poppi, it works. For others like BioSteel who can’t find a buyer, they inevitably go bankrupt.",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "For the unaware prebiotics are basically just fiber.",
                "let the enshittification begin"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "China says Panama ports sale to BlackRock is an example of ‘economic coercion.’ Investors are spooked",
            "external_url": "https://edition.cnn.com/2025/03/18/business/hong-kong-ck-hutchison-panama-ports-sale-hnk-intl/index.html?utm_source=business_ribbon",
            "upvotes": 400,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2201491120.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So does this mean the US will stop passive aggressively declaring war on Panama?",
                "> “I would like to emphasize that China has always firmly opposed the use of economic coercion, hegemonism and bullying to infringe upon the legitimate rights and interests of other countries,”\n\nBy other countries. We don’t like competition.",
                "\"We oppose the use of...\" (by anyone but us!).",
                "This is Trump rewarding his donors, like they needed it.",
                "And the ironic part is that BlackRock is still one of the most Chinese friendly US investment firms.",
                "This article made me wonder: why does Blackrock even need partners for a 22b sale? They manage assets worth over 10 trillion dollars. It’s less than 0.2% of their managed assets to just purchase it on their own. So why even partner up?",
                "china knows a few things about coercion",
                "Seriously? This whole world is based on economic coercion. Every aspect of society",
                "Meanwhile, the Chinese are expanding the Karakoram Highway into the China-Pakistan Economic Corridor.",
                "Uyghurs, Tibetans and Hong Kong would like a word"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 9799,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "Good luck getting accepted.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "As if they'll accept someone from a family earning less than $200k",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "How does a family making $200k afford a child going to Harvard?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 14891,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "How many times has this company filed for bankruptcy?",
                "[removed]",
                "“I don’t know about you, but I’m feeling 22!”",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Not so forever anymore.",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "JCPenney store section, here they come.\n\nThese are two-story layouts in most malls. It's gonna take a lot of escape rooms, arcade, and mini golf to fill this spot.\n\nMaybe Spirit of Halloween will get bold and start renting out mall space each year.",
                "A business that depends on importing clothing during Trump tariffs is doomed."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Texas AG announces arrest of woman for allegedly illegally providing abortions in Houston",
            "external_url": "https://abcnews.go.com/US/texas-ag-announces-arrest-woman-allegedly-illegally-providing/story?id=119888542",
            "upvotes": 3945,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/553b1cdc-8add-461f-80d4-06fd20cfbc75/paxton-gty-er-250317_1742242201847_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I can't wait to hear all the details from someone other than Ken Paxton.",
                "> Abortions are banned in Texas except if the woman has a life-threatening condition or is at risk of \"substantial impairment of a major bodily function.\"\nPatients are required to make two trips, one for an in-person counseling session and then 24 hours later for the abortion, according to the Guttmacher Institute, a research group that focuses on sexual and reproductive health.\n\n\n\n\n\nNothing says amazing life saving treatment in emergency situations like giving a minimum of 24 hours to wait. ",
                "IIRC, to get a legal abortion in Texas the doctor is arrested and then must prove to the jury that it was medically necessary. You can't prove to a court and then have the court order an abortion. This was attempted early on and this AG said he would ignore any court and arrest the doctor anyway because this was the procedure. There isn't some standard to be met where a woman's life is sufficiently at risk or the fetus is nonviable. Doctor gets arrested and argues in a court of law to a jury that it was medically necessary. Remember that when one of those pro-birth anti-women people try to tell you it's a doctor's fault when a woman dies because she couldn't get an abortion.",
                "*\"In Texas, life is sacred,\" Paxton said in a statement. \"I will always do everything in my power to protect the unborn, defend our state's pro-life laws, and work to ensure that unlicensed individuals endangering the lives of women by performing illegal abortions are fully prosecuted.\"*\n\nTexas leads the country every year in executions. And this \"unlicensed individual\" is a woman helping other women, who have been denied abortion in Texas.",
                "Wow, it’s like we are moving back in time 100 years …….the Republican Party is insane ….",
                "[from another article:](https://www.texastribune.org/2025/03/17/texas-abortion-midwife-arrested/)\n\n\n>Holly Shearman, a midwife who runs Tomball Birth Center, where Rojas worked part-time providing prenatal care, said she was “shocked” by the news of her arrest. She described Rojas as a devout Catholic and skilled midwife whose clinics provided health care to a primarily Spanish-speaking, low-income community.\n\n\nWill be interested to see what they consider \"practicing medicine.\"",
                "Good thing y’all are solving the real problems deep-in-the-hearta as opposed to bullshit like the failing electrical grid or preparing for tornadoes and hurricanes. But yeah, keep those wombs ready to pump out more god-fearing white Christians 👍🏽👍🏽",
                "The man in the picture above is a human rights abuser. Evil to the core.",
                ">\"In Texas, life is sacred,\" Paxton said in a statement.\n\nIs that supposed to be a joke?  Unless the kids are dying of measles or getting shot in school, right?\n\nAh, is there even a point pointing out the hypocrisy anymore?  I wish they'd just say they want to control women and save us all the hassle of that dog & pony show.",
                "Why do all high-ranking Republicans lately look like the villain in an 80s action movie?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "More than 400 killed by Israeli air strikes on Gaza, Hamas-run ministry says, Hamas-run ministry says - live updates",
            "external_url": "https://www.bbc.com/news/live/czje23jd779t",
            "upvotes": 63,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/890b/live/1d968970-03ee-11f0-a387-437e2fb661fc.jpg",
            "top_comments": [
                "It’s very interesting comparing the reactions to these strikes on here with those of r/worldnews. \n\nThe difference is almost night and day.",
                "Putting “Hamas-run ministry” twice to try and support the murder of civilians. ",
                "Marauding and Killing with impunity.",
                "I’d prefer my tax dollars not go towards bombing and dehumanizing Arabs.",
                "Welp. Should have released more hostages. What can you do? Don’t start a war you cant possibly finish. Feel like thats pretty basic.",
                "Well you didn't vote for Biden because he kinda maybe supported Israel a little bit.  This is what you get.",
                "Remember all those Progressives like Ana Kasparian and Cenk who demonized Biden as genocide Joe and ensured that Arab Americans didn't go out and vote or those Progressives that voted for Trump cause Trump promised to end the war?\n\nWell blood is on their hands now I wonder how they feel?",
                "Already 20x more than this morning. Good thing Hamas is so reliable."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Drake's record label files motion to dismiss his lawsuit over Kendrick Lamar's 'Not Like Us'",
            "external_url": "https://www.nbcnews.com/pop-culture/pop-culture-news/universal-music-group-response-drake-lawsuit-kendrick-lamar-diss-track-rcna196788",
            "upvotes": 231,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250317-drake-kendrick-lamar-se-349p-c7852c.jpg",
            "top_comments": [
                "Drake really asked lawyers to proofread his lyrics for validity. \n\nAnd to nobody's surprise, they found them to be fraudulent and petty, and now its documented for all time in legal form.\n\nLet the record show that Drake is officially a fake gangster who makes shit up about people and lost a rap battle that he provoked.",
                "> The filing comes after a yearlong prolific diss track battle between Drake and Lamar, who spent much of 2024 dropping a slew of tracks aimed at each other. But many fans declared Lamar as the winner of the feud, with “Not Like Us” becoming the bestselling rap recording of 2024. The artist swept this year’s Grammy Awards, taking home five wins, including song of the year and record of the year. Lamar’s momentum continued as he performed at the Super Bowl halftime show in February, where the crowd loudly sang along as he performed “Not Like Us.”  \n\n**TL;DR:** Drake threw the first punch, Kendrick won Grammys, dropped the biggest hit of 2024, and took over the Super Bowl.",
                "Sounds like someone ended up not wanting to go through discovery.",
                "So now we can say that Kendrick legally won the rap war?",
                "If you told me Kendrick was helping out UMG's legal team to write this I wouldn't question it because it was a thorough slapping of Drake's face flipping his own words, calling to question his Drake persona and cooking him in the footnotes.",
                "This is the first time in my life that i see people rooting for a MUSIC COMPANY screwing over an artist.\n\nHope drake wins his case if i read correctly what hes accusing them of\n\n\nShyt is weird. \n\n( drake and kendrick are both wack to me )"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "China says Panama ports sale to BlackRock is an example of ‘economic coercion.’ Investors are spooked",
            "external_url": "https://edition.cnn.com/2025/03/18/business/hong-kong-ck-hutchison-panama-ports-sale-hnk-intl/index.html?utm_source=business_ribbon",
            "upvotes": 400,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2201491120.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So does this mean the US will stop passive aggressively declaring war on Panama?",
                "> “I would like to emphasize that China has always firmly opposed the use of economic coercion, hegemonism and bullying to infringe upon the legitimate rights and interests of other countries,”\n\nBy other countries. We don’t like competition.",
                "\"We oppose the use of...\" (by anyone but us!).",
                "This is Trump rewarding his donors, like they needed it.",
                "And the ironic part is that BlackRock is still one of the most Chinese friendly US investment firms.",
                "This article made me wonder: why does Blackrock even need partners for a 22b sale? They manage assets worth over 10 trillion dollars. It’s less than 0.2% of their managed assets to just purchase it on their own. So why even partner up?",
                "china knows a few things about coercion",
                "Seriously? This whole world is based on economic coercion. Every aspect of society",
                "Meanwhile, the Chinese are expanding the Karakoram Highway into the China-Pakistan Economic Corridor.",
                "Uyghurs, Tibetans and Hong Kong would like a word"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Israel attacks targets in Gaza as ceasefire deadlock breaks",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-military-conducts-strikes-hamas-targets-gaza-army-says-2025-03-18/",
            "upvotes": 219,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That ceasefire just spontaneously broke all by itself, did it, Reuters?",
                "Passive headline. Should be:\n\n\nIsrael breaks ceasefire with attacks on Gaza.",
                "“Israel breaks ceasefire in Gaza, resuming their genocidal campaign”",
                "If I believed in evil Israel would be it.",
                "When will this end ????????? I hate war ….",
                "No ceasefire without returning hostages!",
                "https://x.com/Shepherds4Good/status/1901824978267365726",
                "So Americans that have been paying attention to the DOJ and Trump administration rhetoric regarding a certain country just have to sit these threads out?? \"Free Speech\" baby!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 11170,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "I've never seen a more insecure man than Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "The reason people with a brain do not do this is they realize their own children are going to need the very same protection. Jesus how did so many people vote for one of the dumbest fuckers on the planet.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Biden specifically EXTENDED protections for Trump's adult kids from six months to one year when he became president.  Trump is just being his typically petty bitch ass self.",
                "Good thing Democrats won't fight dirty because they want to be civil and prevent exactly the retaliatory things that are happening every day"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Peru declares emergency as crime wave grips capital, singer shot dead | Reuters",
            "external_url": "https://www.reuters.com/world/americas/peru-declares-emergency-capital-tackle-crime-wave-2025-03-17/",
            "upvotes": 318,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This might explain why prices on trips to Peru just dropped dramatically.",
                "I went to peru last year. It was my favorite vacation ever beating Italy, Iceland, the Canadian Rockies, and the Grand Canyon.",
                "I've been there many times\n\nI love the country but never liked Lima",
                "I’d rather visit Peru than the US at the current moment. Peru seems a heck of a lot safer than the dumpster fire raging out of control that is America.",
                "Can't read the article, paywall.",
                "Coming soon to a United States close to you."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Navajo Code Talkers disappear from military websites after Trump DEI order",
            "external_url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii",
            "upvotes": 7031,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it me or is this the most insecure shit you’ve ever seen?",
                "What a colossal waste of time and tax payer's money Hegseth\n\nYou know we're going to put it all back when you're gone you dickhead",
                "Isn't this the same party that cries about \"erasing history\" when a community tries to remove Confederate monuments?",
                "This is so fucked up. These are the worst people doing the worst things to America.",
                "My grandfather was a lifelong Republican who spent decades working in the Bureau of Indian Affairs and Bureau of Land Management, serving many Navajo communities and other tribes in the Southwest US, continuing to field calls well after his retirement. Here they are undermining his life's work, the communities he and these agencies served, and utterly besmirching one of the most important, selfless, and **undeserving** contributions to our country by a community of its people.\n\nLike many people, I felt pretty hollow after the election, and for my own sanity decided to step back from political efforts. \"Americans voted for this, let them reap what they sow.\" I cannot in good conscience, maintaining civility and patience, just watch our country steer into a landslide intent on corrupting and twisting what we built. It is controversial, problematic, but nonetheless hard-earned history that we built together.\n\nI choose to resist in any way I can, so that my children may have a future and that the legacy of people who chose to serve our country will cease its diminishment and thrive. I hope you join me in the protests and whatever else is to come.",
                "https://en.m.wikipedia.org/wiki/Choctaw_code_talkers\n\nI'm the great grandson of Solomon Bond Louis\n\nMy family has always served in some unit of the military until my generation where they sat us down and warned us in 2002 that things have changed. Considering most are Vietnam vets in the Marines it made sense. Also my dad constantly reminded me as a kid that if his CO hadn't give him the leave to get married to my mom who also served(higher rank as well) he would of been in Beirut when it was bombed. \n\nAll I can say is this is fucking crazy, I'm genuinely lost for words at this point",
                "There not removing DEI related topics. They're removing any mention of women or minority achievements, regardless of how they were actually earned. \n\nThis is straight up racism. Full stop. There is no other explanation.",
                "Whitewashing of America. Another stupid effing order.",
                "Never forget victory in WWII could not have happened, (at least not as \"quickly\") without a gay man, named Alan Turing, and the Navajo code talkers.\n\nBreaking enigma combined with our own code that couldn't be deciphered were instrumental.\n\nIf the government in the 1890s had succeeded in destroying native languages and culture through ethnic cleansing and residential schools enforcing Eurocentrism, it's likely we wouldn't have had the code talkers during World War II.\n\nThe attempt by the government to completely excise native culture and the role the code talkers played are the basic cliffnotes primer anyone needs to demonstrate why racism is truly a shitty concept.\n\nThis neo McCarthyism \"war on woke/anti DEIA bullshit needs to stop, but I guess people who are ignorant of our history never learned what was actually valuable from the past they are trying to destroy",
                "DEI is just a racist and bigoted dog whistle to use on anyone who isn't a cishet, white, straight male.   \n  \nAbsolutely abhorrent. How the hell is it even DEI for NAVAJO people to use NAVAJO language to help win a war for their country? \n\nTuskegee airmen and women. The Enola Gay. Army Maj. Gen. Charles Calvin Rogers. Adm. Lisa Franchetti. Chairman, Gen. CQ Brown Jr. 14000+ active military folks being ousted because they are trans.\n\n9 million+ Veterans affected by DEI and policy change EO's...\n\nWhy the hell would ANYONE want to join the Forces now? \n\nThis shit is so wrong."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Israel launches new strikes against Hamas and promises ‘increasing military force’ after talks stall",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-17-2025-b8753b9458a44f10ab08aa9b12582780",
            "upvotes": 602,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ugh, here we go again",
                "It’s amazing how the price of eggs somehow has taken over this war’s place in nightly news coverage here in the states",
                "We know what Trump and Netanyahu want. Trump posted it to his Instagram. Mow them all down Bibi, so I can make some real estate money. This world is sick. I feel so powerless.",
                "It never works. Netanyahu just wants to stay in power. The Trump of Israel.",
                "Is Trump still claiming credit for negotiating that peace deal?",
                "well it was a couple weeks of uneasy peace but the horrific photos and videos coming from gaza from civilians are already starting to trickle in on social media again again.",
                "So they’re breaking the ceasefire again?",
                "Back to commiting genocide as the world continues to turn a blind eye",
                "Are the Israelis giving us 500billion in mineral rights?",
                "Israel has been breaking the ceasefire since the day it began, but now they've fully restarted the genocide. Just absolutely disgusting, indefensible."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 13099,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 4512,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "He flew so the world may be free rip",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "Thank you.\nYou will live on in my heart and head forever",
                "I remember growing up all the WW2 vets I knew. All gone now. I even knew a neighbor who told me he was in a glider when I was a teen. I never knew before about the gliders. It was amazing to learn firsthand from him."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Israel attacks targets in Gaza as ceasefire deadlock breaks",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-military-conducts-strikes-hamas-targets-gaza-army-says-2025-03-18/",
            "upvotes": 218,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That ceasefire just spontaneously broke all by itself, did it, Reuters?",
                "Passive headline. Should be:\n\n\nIsrael breaks ceasefire with attacks on Gaza.",
                "“Israel breaks ceasefire in Gaza, resuming their genocidal campaign”",
                "If I believed in evil Israel would be it.",
                "When will this end ????????? I hate war ….",
                "No ceasefire without returning hostages!",
                "https://x.com/Shepherds4Good/status/1901824978267365726",
                "So Americans that have been paying attention to the DOJ and Trump administration rhetoric regarding a certain country just have to sit these threads out?? \"Free Speech\" baby!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 11153,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "I've never seen a more insecure man than Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "The reason people with a brain do not do this is they realize their own children are going to need the very same protection. Jesus how did so many people vote for one of the dumbest fuckers on the planet.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Biden specifically EXTENDED protections for Trump's adult kids from six months to one year when he became president.  Trump is just being his typically petty bitch ass self.",
                "Good thing Democrats won't fight dirty because they want to be civil and prevent exactly the retaliatory things that are happening every day"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 13104,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 49444,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Navajo Code Talkers disappear from military websites after Trump DEI order",
            "external_url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii",
            "upvotes": 7033,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it me or is this the most insecure shit you’ve ever seen?",
                "What a colossal waste of time and tax payer's money Hegseth\n\nYou know we're going to put it all back when you're gone you dickhead",
                "Isn't this the same party that cries about \"erasing history\" when a community tries to remove Confederate monuments?",
                "This is so fucked up. These are the worst people doing the worst things to America.",
                "My grandfather was a lifelong Republican who spent decades working in the Bureau of Indian Affairs and Bureau of Land Management, serving many Navajo communities and other tribes in the Southwest US, continuing to field calls well after his retirement. Here they are undermining his life's work, the communities he and these agencies served, and utterly besmirching one of the most important, selfless, and **undeserving** contributions to our country by a community of its people.\n\nLike many people, I felt pretty hollow after the election, and for my own sanity decided to step back from political efforts. \"Americans voted for this, let them reap what they sow.\" I cannot in good conscience, maintaining civility and patience, just watch our country steer into a landslide intent on corrupting and twisting what we built. It is controversial, problematic, but nonetheless hard-earned history that we built together.\n\nI choose to resist in any way I can, so that my children may have a future and that the legacy of people who chose to serve our country will cease its diminishment and thrive. I hope you join me in the protests and whatever else is to come.",
                "https://en.m.wikipedia.org/wiki/Choctaw_code_talkers\n\nI'm the great grandson of Solomon Bond Louis\n\nMy family has always served in some unit of the military until my generation where they sat us down and warned us in 2002 that things have changed. Considering most are Vietnam vets in the Marines it made sense. Also my dad constantly reminded me as a kid that if his CO hadn't give him the leave to get married to my mom who also served(higher rank as well) he would of been in Beirut when it was bombed. \n\nAll I can say is this is fucking crazy, I'm genuinely lost for words at this point",
                "There not removing DEI related topics. They're removing any mention of women or minority achievements, regardless of how they were actually earned. \n\nThis is straight up racism. Full stop. There is no other explanation.",
                "Whitewashing of America. Another stupid effing order.",
                "Never forget victory in WWII could not have happened, (at least not as \"quickly\") without a gay man, named Alan Turing, and the Navajo code talkers.\n\nBreaking enigma combined with our own code that couldn't be deciphered were instrumental.\n\nIf the government in the 1890s had succeeded in destroying native languages and culture through ethnic cleansing and residential schools enforcing Eurocentrism, it's likely we wouldn't have had the code talkers during World War II.\n\nThe attempt by the government to completely excise native culture and the role the code talkers played are the basic cliffnotes primer anyone needs to demonstrate why racism is truly a shitty concept.\n\nThis neo McCarthyism \"war on woke/anti DEIA bullshit needs to stop, but I guess people who are ignorant of our history never learned what was actually valuable from the past they are trying to destroy",
                "DEI is just a racist and bigoted dog whistle to use on anyone who isn't a cishet, white, straight male.   \n  \nAbsolutely abhorrent. How the hell is it even DEI for NAVAJO people to use NAVAJO language to help win a war for their country? \n\nTuskegee airmen and women. The Enola Gay. Army Maj. Gen. Charles Calvin Rogers. Adm. Lisa Franchetti. Chairman, Gen. CQ Brown Jr. 14000+ active military folks being ousted because they are trans.\n\n9 million+ Veterans affected by DEI and policy change EO's...\n\nWhy the hell would ANYONE want to join the Forces now? \n\nThis shit is so wrong."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 4515,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "He flew so the world may be free rip",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "Thank you.\nYou will live on in my heart and head forever",
                "I remember growing up all the WW2 vets I knew. All gone now. I even knew a neighbor who told me he was in a glider when I was a teen. I never knew before about the gliders. It was amazing to learn firsthand from him."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 8331,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "Guess I’ll stop drinking that now, thanks",
                "This is the life of almost all non-alcoholic beverages. Start up the company, gain investors, work your balls off for a couple years and rack up debt in advertising and retail agreements to establish the brand with the overall goal to sell to Pepsi or Coke and cash out and go home. For some companies like Poppi, it works. For others like BioSteel who can’t find a buyer, they inevitably go bankrupt.",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "For the unaware prebiotics are basically just fiber.",
                "let the enshittification begin"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "China says Panama ports sale to BlackRock is an example of ‘economic coercion.’ Investors are spooked",
            "external_url": "https://edition.cnn.com/2025/03/18/business/hong-kong-ck-hutchison-panama-ports-sale-hnk-intl/index.html?utm_source=business_ribbon",
            "upvotes": 404,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2201491120.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So does this mean the US will stop passive aggressively declaring war on Panama?",
                "> “I would like to emphasize that China has always firmly opposed the use of economic coercion, hegemonism and bullying to infringe upon the legitimate rights and interests of other countries,”\n\nBy other countries. We don’t like competition.",
                "\"We oppose the use of...\" (by anyone but us!).",
                "This is Trump rewarding his donors, like they needed it.",
                "And the ironic part is that BlackRock is still one of the most Chinese friendly US investment firms.",
                "This article made me wonder: why does Blackrock even need partners for a 22b sale? They manage assets worth over 10 trillion dollars. It’s less than 0.2% of their managed assets to just purchase it on their own. So why even partner up?",
                "china knows a few things about coercion",
                "Seriously? This whole world is based on economic coercion. Every aspect of society",
                "Meanwhile, the Chinese are expanding the Karakoram Highway into the China-Pakistan Economic Corridor.",
                "Uyghurs, Tibetans and Hong Kong would like a word"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 9810,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "Good luck getting accepted.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "As if they'll accept someone from a family earning less than $200k",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "How does a family making $200k afford a child going to Harvard?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 14890,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "How many times has this company filed for bankruptcy?",
                "[removed]",
                "“I don’t know about you, but I’m feeling 22!”",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Not so forever anymore.",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "JCPenney store section, here they come.\n\nThese are two-story layouts in most malls. It's gonna take a lot of escape rooms, arcade, and mini golf to fill this spot.\n\nMaybe Spirit of Halloween will get bold and start renting out mall space each year.",
                "A business that depends on importing clothing during Trump tariffs is doomed."
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "03/18/2025 12:15:35 UTC"
}