{
    "posts": [
        {
            "category": "HOT",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 1690,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "Republicans are fake patriots",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Interestingly this is something we already have in parts of Canada. We have publicly funded Catholic schools in Ontario and Alberta, and in BC Catholic schools receive partial government funding.\n\nNot defending it, but pointing out this already exists in a country many progressives point to as being a better model to emulate.",
                "Just wait for the next generation of Okies to not get into any accredited colleges"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 11199,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "Stickin' it to the man... In solidarity.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "Am I still participating in May day if I use approved PTO?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "2 dead in Pennsylvania as severe weather events hit Midwest, Heartland and East",
            "external_url": "https://abcnews.go.com/US/2-dead-pennsylvania-severe-weather-events-hit-midwest/story?id=121309396",
            "upvotes": 381,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d8b8b6f3-8531-4039-bfab-afbe17a5357c/storm-3-ht-gmh-250430_1746026900253_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Pittsburgh took a rare direct hit, and most of the schools in the region are closed today due to a lack of power, in addition to a lot of people still without power. It was quite crazy and is still bad this morning since who has power and who doesn't is block by block. A lot of traffic lights are still out, making traffic quite fun.",
                "Surely we won't see an increase in deaths and injuries from storms like this moving forward, with all our cuts to the national weather service.  Those DOGE guys will be here helping with the recovery too, right? Right?",
                "Get in line behind Arkansas, hold out one hand for federal assistance and shit in the other hand, ask Arkansas which hand will fill up first and they'll use their $19,000 super podium to tell you the answer. \n\nhttps://arktimes.com/arkansas-blog/2025/04/21/sanders-says-arkansas-in-dire-need-of-federal-assistance-but-trump-says-no\n\n#💩",
                "I thought the Midwest was the heartland?\ninteresting they put it in the title like that.",
                "Several states with power outages: https://poweroutage.us/",
                "Kiss my mother loving ass\n\nAsheville.  Month and a half without power. \n\nGod speed to y’all.",
                "I got lucky with an near miss. The storm wasn't very wide yet when it passed here and the center part with the 80 mph winds passed about 10 miles north of me. Winds were probably only about 50 mph here. ",
                "it'll be fine because god will protect us\n\noh wait that's actually really fucking dumb"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 7357,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Some kids do need a leash.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "Comments in the Independent article are pathetic.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 304,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "[removed]",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "USDA withdraws plan to limit salmonella levels in raw poultry",
            "external_url": "https://www.foxla.com/news/usda-salmonella-levels-raw-poultry-usda-withdraws-plan?taid=680e9f8b3d26750001e41bef",
            "upvotes": 18793,
            "date": "04/29/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/gettyimages-1212195382.jpg?ve=1&tl=1",
            "top_comments": [
                "Wow. How is our president making America great again with this ?",
                "This is the largest disease vector experiment I have ever seen.  \n\nWhich billionaire owns the biowarfare companies?",
                "Is it good for health now?",
                "So.... USDA plans to increase salmonella levels in raw poultry?",
                "We're all about to learn why our grandparents boiled the shit out of everything",
                "It has been some time since I suspected that US elites want to kill an entire generation of adults and harvest the assets of the dead with the hope their kids would become destitute and be forced into any kind of labour relation.\n\n\nI now firmly believe that.",
                "wtf, chicken is one of the few meats some people can afford!\n\nohhhhhhhhhh,\n\nthese motherfuckers are straight up evil.",
                "And he thinks this will make other countries want to import his trash? What a moron.",
                "I, for one, will be extremely satisfied as I shit my brains out while puking into the bathroom garbage bin, knowing that America is finally, in fact, great again.",
                "And at the same time, try to bully Europe into buying that crap. \n\nAnd not incidentally, poison the Cubans with the 200k tons that gets exported there."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 167,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d3a99be451df24e0b19b83d6647c64dfdf21de30/0_2_5095_3057/master/5095.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9e1bdd9b0e91998610c047489621c89e",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Tomorrow we will see this judge arrested",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 11701,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "“Stop breaking the law asshole.”",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "This is the strategy of Trump's entire business and political career.  Do whatever you want, because the legal process takes too long for anyone to do anything. Sometimes more than 4 years if you  have good lawyers.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 6833,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "Imagine your kid dies just so you can own the libs.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "666 and they can summon RFK Jr directly",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "If only there was some way this could have been prevented.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "Nearly three times the amount of cases the entire US had last year."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 6564,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                " **\" their exploits never got the attention afforded their white counterparts\"**  \\-\n\n  Well....\n\n  I would agree that many mostly white male units have received a lot more recognition that the Six Triple Eight but I don't think anyone would argue that any mostly white mail units have received more recognition than the Six Triple Eight.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "Nice of them to wait until only two are still alive out of 800+. ",
                "That’s an awesome squad name. Six triple eight!!!!! Move out!!",
                "Meanwhile every accomplishment by women and minorities are being systematically eliminated from all public records. This one will last though. /S\nSmh"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New lawsuit argues Trump and DOGE's government overhaul is unconstitutional",
            "external_url": "https://www.npr.org/2025/04/29/nx-s1-5380783/trump-doge-lawsuit-federal-workers-cities",
            "upvotes": 2,
            "date": "04/30/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4244x2387+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fda%2F99%2F386bb5114c47aa43f9070c9864aa%2Fgettyimages-2204569362.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 165,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d3a99be451df24e0b19b83d6647c64dfdf21de30/0_2_5095_3057/master/5095.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9e1bdd9b0e91998610c047489621c89e",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Tomorrow we will see this judge arrested",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 1696,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "Republicans are fake patriots",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Interestingly this is something we already have in parts of Canada. We have publicly funded Catholic schools in Ontario and Alberta, and in BC Catholic schools receive partial government funding.\n\nNot defending it, but pointing out this already exists in a country many progressives point to as being a better model to emulate.",
                "Just wait for the next generation of Okies to not get into any accredited colleges"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 298,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "[removed]",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "2 dead in Pennsylvania as severe weather events hit Midwest, Heartland and East",
            "external_url": "https://abcnews.go.com/US/2-dead-pennsylvania-severe-weather-events-hit-midwest/story?id=121309396",
            "upvotes": 385,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d8b8b6f3-8531-4039-bfab-afbe17a5357c/storm-3-ht-gmh-250430_1746026900253_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Pittsburgh took a rare direct hit, and most of the schools in the region are closed today due to a lack of power, in addition to a lot of people still without power. It was quite crazy and is still bad this morning since who has power and who doesn't is block by block. A lot of traffic lights are still out, making traffic quite fun.",
                "Surely we won't see an increase in deaths and injuries from storms like this moving forward, with all our cuts to the national weather service.  Those DOGE guys will be here helping with the recovery too, right? Right?",
                "Get in line behind Arkansas, hold out one hand for federal assistance and shit in the other hand, ask Arkansas which hand will fill up first and they'll use their $19,000 super podium to tell you the answer. \n\nhttps://arktimes.com/arkansas-blog/2025/04/21/sanders-says-arkansas-in-dire-need-of-federal-assistance-but-trump-says-no\n\n#💩",
                "I thought the Midwest was the heartland?\ninteresting they put it in the title like that.",
                "Several states with power outages: https://poweroutage.us/",
                "Kiss my mother loving ass\n\nAsheville.  Month and a half without power. \n\nGod speed to y’all.",
                "I got lucky with an near miss. The storm wasn't very wide yet when it passed here and the center part with the 80 mph winds passed about 10 miles north of me. Winds were probably only about 50 mph here. ",
                "it'll be fine because god will protect us\n\noh wait that's actually really fucking dumb"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 11209,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "Stickin' it to the man... In solidarity.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "Am I still participating in May day if I use approved PTO?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trial date set for father of suspected Apalachee High School shooter",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/30/trial-date-set-father-suspected-apalachee-high-school-shooter/",
            "upvotes": 704,
            "date": "04/30/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/MXB3DOKMQ5BWFPQRWU3M337X5U.png?auth=edeb083875ca993bd3a4b41f052a05dfecd759fc663a1b1f0d860da781d453a6&width=1200&height=600&smart=true",
            "top_comments": [
                "Charge the parents who provide the gun every fucking time and this will happen less often",
                "Not wanting to make fun of the horror and tragedy of the situation but the 1st 4 paragraphs of the article sound word for word like a John Grisham novel",
                "In many countries, criminally incompetent buffoon parents are incapable of enabling a school shooting. But hey it's America...blame the cops who didn't see the signs, blame the venue who didn't check in on the hotel room often enough, blame the parents who didn't want to believe their precious little angels would do something like this. Blame anything but the guns.",
                "So, they don't know if the kid was the school shooter? And they're charging his dad for something? Sounds like traditional American \"justice\", all right.",
                "''Suspected High School Shooter'' has me kind of stuck. Do they not know who did it?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Iraq arrests ISIS member accused of 'inciting' Bourbon Street attack; FBI says attacker acted alone",
            "external_url": "https://www.wbrz.com/news/iraqi-officials-arrest-suspected-isis-member-accused-of-inciting-bourbon-street-attack-in-new-orleans/",
            "upvotes": 1318,
            "date": "04/29/2025",
            "thumbnail": "https://dcer237tfveol.cloudfront.net/v2/WSXSwiO6pPgiLFo98vBWLg4XUPkFbQM3kbx5AT53sPVji-Ka5Qlx19IDklplNrYQ_SCYY_InFgwSY8I6wZCuR3_OkqHH0qtGXIMmWdmcr6KQ",
            "top_comments": [
                "How can a member of ISIS \"act alone\" in a bombing.... that doesn't make any sense to me",
                "Maybe I’m just uninformed and naive, but I never expected to see a story where Iraq arrested an ISIS member, let alone one who committed crimes in the US",
                "Acted alone..? ... A lot of money changed hands",
                "Hey at least Iraq is trying to fight terrorism, something I never thought I’d say",
                "Why do local news websites make it so hard to tell where the heck this stuff happened? The text of this article doesn't mention a city or state name once. I had to go digging to figure out where the tv station was based and deduce from there.",
                "Always remember two things. 1. ISIS kills more Muslims than non Muslims. 2. ISIS has never once (verifiably) attacked Israel or defended Palestinians against Israel in their homeland.\n\nMore things to remember: ISIS leaders are / have been recuperating inside Israel hospitals. Former ISIS captives / hostages recall not seeing a single prayer mat or a holy Quran book inside the camps or areas where they were detained. They have not paid out a single dollar of zakat to the poor.  I wouldn’t be surprised if they were caught not fasting & actually drinking alcohol too."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 7348,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Some kids do need a leash.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "Comments in the Independent article are pathetic.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "A man airlifted from Japan's Mount Fuji returns to the slope days later and is rescued again",
            "external_url": "https://apnews.com/article/japan-mount-fuji-rescue-climber-student-bc1fcc11150238dee96370697944991b",
            "upvotes": 1680,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Susan Collins:\" I'm sure he's learned his lesson now.\"",
                "After I got rescued, I knew to NEVER go down that slope again. \n\n\nThankfully no airlift was involved but it was embarrassing as shit. ",
                "Those flights aren't cheap. Charge him for the cost. He can keep going until he is broke.",
                "To retrieve his phone. He should be billed for the costs of the second rescue.",
                "You may see foolishness. I see determination.",
                "This mountain is basically non-technical walk up and they force you onto the established trails. There are mountain huts with rooms, food and water like every 300m of vertical. Since your starting about half way up the actual mountain, the vertical is only about 4000ft and doable in 2 or three days. \n\nThe only reason I would think you would need an airlift would be traumatic injury, hypothermia or cerebral edema from the altitude (which is only like 12,000 ft. Many mountains in the US rockies and sierras are taller).",
                "At first you don't succeed, fail, fail, again.",
                "He just can’t get enough",
                "One time is a mistake.  Second time is rank idiocy.\n\nThey should be paying the costs associated with their rank idiocy.",
                "Like the penguin that runs to the mountains where he will certainly perish."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 1691,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "Republicans are fake patriots",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Interestingly this is something we already have in parts of Canada. We have publicly funded Catholic schools in Ontario and Alberta, and in BC Catholic schools receive partial government funding.\n\nNot defending it, but pointing out this already exists in a country many progressives point to as being a better model to emulate.",
                "Just wait for the next generation of Okies to not get into any accredited colleges"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "2 dead in Pennsylvania as severe weather events hit Midwest, Heartland and East",
            "external_url": "https://abcnews.go.com/US/2-dead-pennsylvania-severe-weather-events-hit-midwest/story?id=121309396",
            "upvotes": 382,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d8b8b6f3-8531-4039-bfab-afbe17a5357c/storm-3-ht-gmh-250430_1746026900253_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Pittsburgh took a rare direct hit, and most of the schools in the region are closed today due to a lack of power, in addition to a lot of people still without power. It was quite crazy and is still bad this morning since who has power and who doesn't is block by block. A lot of traffic lights are still out, making traffic quite fun.",
                "Surely we won't see an increase in deaths and injuries from storms like this moving forward, with all our cuts to the national weather service.  Those DOGE guys will be here helping with the recovery too, right? Right?",
                "Get in line behind Arkansas, hold out one hand for federal assistance and shit in the other hand, ask Arkansas which hand will fill up first and they'll use their $19,000 super podium to tell you the answer. \n\nhttps://arktimes.com/arkansas-blog/2025/04/21/sanders-says-arkansas-in-dire-need-of-federal-assistance-but-trump-says-no\n\n#💩",
                "I thought the Midwest was the heartland?\ninteresting they put it in the title like that.",
                "Several states with power outages: https://poweroutage.us/",
                "Kiss my mother loving ass\n\nAsheville.  Month and a half without power. \n\nGod speed to y’all.",
                "I got lucky with an near miss. The storm wasn't very wide yet when it passed here and the center part with the 80 mph winds passed about 10 miles north of me. Winds were probably only about 50 mph here. ",
                "it'll be fine because god will protect us\n\noh wait that's actually really fucking dumb"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 300,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "[removed]",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 11205,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "Stickin' it to the man... In solidarity.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "Watch Trump send in federal troops to \"quell the rioting\".",
                "Am I still participating in May day if I use approved PTO?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Rothko painting worth more than £42 million damaged by child visiting gallery",
            "external_url": "https://www.the-independent.com/news/world/rothko-painting-damage-rotterdam-gallery-b2741531.html",
            "upvotes": 7357,
            "date": "04/29/2025",
            "thumbnail": "https://static.the-independent.com/2025/04/29/12/52/449659-306274-Rothko-17-739d1f-original-1552474702-bee399-original-1667481020.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "I used to work at a gallery. Half my job was telling people not to touch the art or take photos (older art can be damaged by the flash).\n\nOccasionally I even had to ask people not to lick the art.",
                "Superficial damage. Will be exhibited again in the future.\n\nThat said, watch your fucking kids.",
                "Expose children to art, they said. It'll be fun, they said. One £42M bill later, not so fun.",
                "Some kids do need a leash.",
                "Wait... \"housed at Museum Boijmans Van Beuningen in Rotterdam\"...how, that museum has been closed for renovations for years...",
                "That painting is worth 42 million?!!!! \n\nI'll never get art man",
                "My least favorite thing about art museums and galleries - the people who are most commonly in them. If it's not someone letting their unsupervised spawn run amok, it's tourists who want to pose in front of the pieces and impede on others ability to view them. Nobody cares that much about your Instagram, Olivia. Move your ass.",
                "Comments in the Independent article are pathetic.",
                "Doesn't matter whatever your opinion of the artist or the work, this is just shitty parenting.",
                "In my mid 20s - long ago, I visited the British Museum and in those days the Rosetta Stone was out in the open with no case - just on a stand in the middle of the room. Before I even realized it, I reached out and touched it. I quickly pulled my hand back and thought - I’m in trouble. Nope, no staff came in the room, no alarms, nothing. I moved along and later came back for another look - holding my hands behind my back.  I had never done anything like that before in my life - no idea what possessed me."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "USDA withdraws plan to limit salmonella levels in raw poultry",
            "external_url": "https://www.foxla.com/news/usda-salmonella-levels-raw-poultry-usda-withdraws-plan?taid=680e9f8b3d26750001e41bef",
            "upvotes": 18802,
            "date": "04/29/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/gettyimages-1212195382.jpg?ve=1&tl=1",
            "top_comments": [
                "Wow. How is our president making America great again with this ?",
                "This is the largest disease vector experiment I have ever seen.  \n\nWhich billionaire owns the biowarfare companies?",
                "Is it good for health now?",
                "So.... USDA plans to increase salmonella levels in raw poultry?",
                "We're all about to learn why our grandparents boiled the shit out of everything",
                "It has been some time since I suspected that US elites want to kill an entire generation of adults and harvest the assets of the dead with the hope their kids would become destitute and be forced into any kind of labour relation.\n\n\nI now firmly believe that.",
                "wtf, chicken is one of the few meats some people can afford!\n\nohhhhhhhhhh,\n\nthese motherfuckers are straight up evil.",
                "And he thinks this will make other countries want to import his trash? What a moron.",
                "I, for one, will be extremely satisfied as I shit my brains out while puking into the bathroom garbage bin, knowing that America is finally, in fact, great again.",
                "And at the same time, try to bully Europe into buying that crap. \n\nAnd not incidentally, poison the Cubans with the 200k tons that gets exported there."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "220 lawsuits in 100 days: Trump administration faces unprecedented legal blitz",
            "external_url": "https://abcnews.go.com/US/220-lawsuits-100-days-trump-administration-faces-unprecedented/story?id=121252266",
            "upvotes": 11702,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/08938bff-ce9a-497f-bd44-91c2d950821a/protest-gty-er-250428_1745879380880_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "\"It has become ever more apparent that to our president, the rule of law is but an impediment to his policy goals,\" U.S. District Judge John Coughenour, a Reagan appointee, said of Trump's executive order on birthright citizenship. \"There are moments in the world's history when people look back and ask, 'Where were the lawyers, where were the judges?' In these moments, the rule of law becomes especially vulnerable. I refuse to let that beacon go dark today.\"...",
                "Ffs \"unprecedented legal blitz\" maybe if they didn't break the law with astounding frequency we wouldn't be here.",
                "And who is covering his legal bills?  Us taxpayers.  What a fucking racket.",
                "They lose greater than 90% of the lawsuits too and that was when they had competent lawyers and some sort of legal justification.",
                "“Stop breaking the law asshole.”",
                "Everybody in Donald's admin, from the bastard himself to the lowest secretary needs to be indelibly marked for being complicit to this administration. Willingly working for a dictator needs to have real world consequences aside from maybe just losing their job. If their chain can be traced to the top, they need to feel their fuck-up.",
                "If Biden had not nominated the worst director of the DOJ ever this could have been 220 indictments in 100 days in 2021.\n\nStill can't believe it took years to finally get trump into a courtroom for the crimes he committed.  There should have been special prosecutors with indictments ready to file the day Biden took office.",
                "Where there is smoke , there is illegality the likes of which have never been seen.  Bigly crime doing.",
                "This is the strategy of Trump's entire business and political career.  Do whatever you want, because the legal process takes too long for anyone to do anything. Sometimes more than 4 years if you  have good lawyers.",
                "This is why Trump extorted all the top law firms for free legal work.  Our top law firms will be defending his lawlessness."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Measles cases in Texas rise to 663, state health department says",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/measles-cases-texas-rise-663-state-health-department-says-2025-04-29/",
            "upvotes": 6838,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Today's update adds 17 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 22 cases. Last Tuesday's update added 27 cases. The previous Friday’s update added 36 cases.\n\nTwenty-three additional hospitalizations were reported. No new hospitalizations were reported with Friday's update so this may reflect a backlog of reports of hospitalizations reaching the state department of health. There has to be some explanation for reported hospitalizations exceeding reported cases with this update. There have been 87 hospitalizations in Texas associated with this outbreak.\n\nTexas has two deaths associated with this outbreak. Both were in school-aged children.",
                "Imagine your kid dies just so you can own the libs.",
                "Every one of these children who suffer or die as a result of this is a victim of parental neglect and/or manslaughter. \n\nIt’s a shame these kids aren’t still a small cluster of cells, as that might make these fucking monsters care about them.",
                "666 and they can summon RFK Jr directly",
                "How are women being charged for miscarriages, but these parents aren't being charged for not vaccinating against a deadly disease? Make it make sense.",
                "Oh… another pandemic, except it’s totally preventable and even dumber.",
                "A whole lot of brave already vaccinated adults in Texas rolling the dice with the lives of their children.",
                "If only there was some way this could have been prevented.",
                "Remember: A Taxes father “bragged” in an interview about his dead daughter after she passed to Measles saying he was proud even after he never had her vaxed.\n\nMAGA is a mentally ill state of mind at this point. They are not actually political-pro life-support the constitution but the opposite",
                "Nearly three times the amount of cases the entire US had last year."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 166,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d3a99be451df24e0b19b83d6647c64dfdf21de30/0_2_5095_3057/master/5095.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9e1bdd9b0e91998610c047489621c89e",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Tomorrow we will see this judge arrested",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Black female WWII unit, 'Six Triple Eight,' to receive congressional honor",
            "external_url": "https://abcnews.go.com/US/wireStory/black-female-wwii-unit-triple-receive-congressional-honor-121264245",
            "upvotes": 6562,
            "date": "04/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f92d800d-b31d-4ade-92a5-b9d4d495f7d6/wirestory_04e760837bf3686fc4523fdaec2d6f6e_16x9.jpg?w=1600",
            "top_comments": [
                "Congressional Honors at 10:00 AM, erased from all Pentagon records by 12:00 noon.",
                "It's hard for many civilians to understand how critical mail is to the morale of a forward deployed military unit. And how critical morale is to a mission's success. Especially in this current age of instant communication. I was in the Navy on the cusp of email's growing importance. A mail call could make your day. Just the announcement of one was good news. Even if you didn't get mail, someone did. And it made their day. In turn, your day was a little easier.",
                "Whitehouse meltdown in three, two, one...",
                "I almost gave the current congress a half ounce of credit, but no, this was voted for in back in 2022 and even Mike Johnson isn't enough of a partisan hack to cancel it.",
                "Hegseth won't like this. He is eliminating women.",
                " **\" their exploits never got the attention afforded their white counterparts\"**  \\-\n\n  Well....\n\n  I would agree that many mostly white male units have received a lot more recognition that the Six Triple Eight but I don't think anyone would argue that any mostly white mail units have received more recognition than the Six Triple Eight.",
                "I can already picture the cabinet meeting when this comes out. Hegseth will spit out his gulp of whiskey in shock, Trump will claim black people didn’t exist prior to 1992 and JD Vance will start reciting Mein Kampf (from memory) to ward off woke spirits.",
                "Nice of them to wait until only two are still alive out of 800+. ",
                "That’s an awesome squad name. Six triple eight!!!!! Move out!!",
                "Meanwhile every accomplishment by women and minorities are being systematically eliminated from all public records. This one will last though. /S\nSmh"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "04/30/2025 16:11:09 UTC"
}