{
    "posts": [
        {
            "category": "HOT",
            "title": "Walmart warns of higher prices, withholds second-quarter profit guidance",
            "external_url": "https://www.reuters.com/business/retail-consumer/walmart-warns-higher-prices-withholds-second-quarter-profit-guidance-2025-05-15/",
            "upvotes": 5679,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Article does not mention how they will address the empty shelves.  Wonder if they talked about this during their earnings call. ",
                "in a couple of years time there will be a lot less money to go around, and the billionaires will be on the race to being the first trillionaire.",
                "How many people on r/stocks are telling you tariffs are “priced in” and Walmart can’t even provide guidance for next quarter?",
                "I wonder what on Earth might be causing those higher prices?  ;-)",
                "This isn’t good coming from Wally’s World.  More bad to come this summer.",
                "They aren’t “withholding” profit guidance. Attempting to forecast it accurately in this environment is a step away from lying. It is literally the only responsible thing to do because they have no idea what their supply, revenue, profit, etc will be because policy changes literally by the minute.",
                "Not just walmart, everyone should get used to buying less stuff. Hard times are coming.\n\nwww.BoycottOligarchs.com",
                "80% of all Wal-Mart goods come from China….",
                "I’m glad at least Walmart isn’t afraid to state this publicly unlike so many others who fear repercussions from this “regime”.",
                "I just got a notice on my Amazon cart/wishlist yesterday that 15 items I had went up in price, and not by cents. Seen some stuff go up from 30-60%"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "RFK Jr orders mifepristone review as anti-abortion groups push for ban",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/rfk-jr-fda-abortion-pill-mifepristone",
            "upvotes": 2596,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/67a815aac24a9d2dd041bbfd8fd6798a959d51d4/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1a221076062851cf9016b33ab6cb595",
            "top_comments": [
                "We need to spread a rumor that mifepristone treats measles. He will defend it with gusto.",
                "Didn't this man just say nobody should take health advice from him yesterday? This country has fully turned into a farce.",
                "The party of forced birth and indifference toward living children strikes again.",
                "Ladies and people who care about ladies: if you can acquire this, do so. The day is coming when it will be more difficult than just about anything to get, if not impossible. Miscarriages are incredibly dangerous if all of the tissue is not expelled, and many hospitals refuse to offer any kind of aid due to the new laws across much of the South until a woman is nearly dead.\n\n  \nAnd even then, if your baby is viable and you are not, they'll just keep you on machines until you deliver. Adriana Smith is suffering this fate in Georgia as we speak after a hospital refused care for a brain bleed when she was 9 weeks. She is now 21 weeks, and is being kept alive against her family's wishes due to the heartbeat law.",
                "The US health secretary, Robert F Kennedy Jr, said on Wednesday that he had directed the FDA to review the regulations around the abortion pill mifepristone.\n\nThe review, he said, was necessary due to “new data” – data that emerged from a flawed analysis that top US anti-abortion groups are now using to pressure the Trump administration to reimpose restrictions on the abortion pill, if not pull it from the market entirely.\n\n...**The analysis, which has not been peer-reviewed or published in a medical journal**, came after the Food and Drug Administration commissioner said he was open to reviewing new safety data on the pills, which are used in nearly two-thirds of abortions nationwide.\n\nThe conservative organizations are rallying behind a paper published on 28 April by a rightwing thinktank, the Ethics and Public Policy Center, which claims there are higher complication rates from taking mifepristone than previously known.\n\nThe paper has attracted scrutiny for appearing to dramatically overstate what it characterizes as “serious adverse effects” associated with the pill, according to medical experts. For example, it counts ectopic pregnancies – when an embryo implants somewhere other than the uterine lining – as a serious complication.\n\nMifepristone does not cause an ectopic pregnancy and taking it will not harm someone with an ectopic. It also claims that needing an in-clinic procedure to complete the abortion is a complication, when patients are counseled in advance about the pills’ failure rate of about 3 to 4%.\n\n**The data, the authors say, means the FDA should reinstate earlier restrictions on mifepristone, including a ban on telemedicine and limiting use to the first seven weeks of pregnancy – but they do not intend to stop there.**\n\nThe authors note that restoring the limits could lead to better monitoring that could help “determine whether this drug should remain on the market”, statements that echo proposals found in Project 2025, the 900-page playbook published by the Heritage Foundation and for which the EPPC was an advisory board member.\n\n**Project 2025 calls to end telemedicine prescriptions of abortion pills as an “interim step” to revoking mifepristone’s approval altogether.**\n\nMore than 100 scientific studies have found the medications cited in the paper are safe and effective for ending a pregnancy.",
                "If only his mother had made use of mifepristone",
                "Weird that anyone doesn't believe that they are really just trying to legislate that women are basically children that need men to make their decisions, so if you think about it that's why it is OK for them to marry children.\n\nLiterally, that is a pretty clear overlap on the venn diagram of legislating agenda they have been on target for.\n\n  \n\\----\n\nA quick edit so I don't come accross as hyperbolic or simply lobbing petty insults:  \n\nI realized I should probably [bring reciepts](https://www.rollingstone.com/politics/politics-features/republican-lawmakers-child-marriage-abortion-1235018777/). \n\nThere are a [*lot*](https://www.nbcnews.com/politics/politics-news/end-child-marriage-u-s-you-might-be-surprised-who-n1050471) of reciepts. \n\nThey've tried \"[defending child marriage is actually pretty pro-choice of me](https://www.newsweek.com/republican-defends-child-marriage-im-pro-choice-1898619)\" and \"[if you ban child marriage, you're letting the gays win](https://www.tba.org/?pg=Articles&blAction=showEntry&blogEntry=30366)\"  along the way . . . landing on their most successful attack yet . . .  \n\n\"[a woman is like a child](https://www.yahoo.com/news/woman-child-maga-quickly-turns-105907677.html)\" . . . and if woman == child, then it stands to reason that child == women . . . \n\nObviously, you wouldn't say women shouldn't be allowed to have an adult sexual relationship within the confines of a legally binding marriage contract that they can leave anytime they want to have enough money and a good lawyer. Which is also why child labor is so important, so that they could obviously have left the marriage if they didn't want to be there.\n\nIt also makes sense of other agenda pushes that would otherwise feel pointless and unrelated, like the absolute insane amounts of hate against women they've pushed on the youth in recent years.",
                "What was the latest quote from the guy who took some kids for a swim in a bacteria infested body of water?",
                "Review has already been done. It does exactly what it says it does and is perfectly safe",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Penn State blames looming campus closures on ‘declining’ Pennsylvania",
            "external_url": "https://www.pennlive.com/education/2025/05/penn-state-blames-looming-campus-closures-on-declining-pennsylvania.html",
            "upvotes": 2760,
            "date": "05/15/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/SVFYZVYLHBHFFHBSMBUKIE2VCU.jpeg?auth=1f592a318cc78efd45dd0748ac1753d315988f84eb6d57aa3de008a877cff527&width=1280&quality=90",
            "top_comments": [
                "Have they tried increasing Pennsylvania?",
                "Grew up and went to one of those satellite campuses. It was a great school and opportunity for the rural area I lived in. I’m grateful to have had it.\n\nThey’re right though about the demographics. I left PA because there was so little there as an adult. It never fully recovered (in my area) after coal dried up and then 08 hit. My county was old even when I was young. \n\nIt’ll always be home, but I didn’t have it in me to stay.",
                "Almost no one here read the article or understands what it really means. Penn State is closing branch campuses, which cater almost entirely to local populations. No one from out of state dreams of going to Penn State Shenango on the border of Ohio, which is over an hour from any major population center. No one is moving to Sharon PA either. The population peaked in the 50's and is half of what it was then. It is #197 of cities by population in PA. Sure Penn States tuition is bonkers, blah blah. But declining rural populations and branch campuses in nowheresville are the reason for this.",
                "..and 20 years later, almost all the children had been left behind.",
                "I read the article and frankly I suggest many others to as well as it feels like the posts in here are either bad jokes are personal quips....while the article is providing quotes such as: \n\n> The Keystone State is among five states expected to account for three-fourths of the national decline in high school graduates, with a 17% reduction projected through 2043, the report says.\n\nand \n\n> The report cites lower birth rates following the 2008 recession and reduced K-12 enrollment trends, exacerbated by the COVID-19 pandemic’s “lingering effects on earlier grade retention” for what it calls Pennsylvania’s looming “demographic cliff.”\n\nand \n\n> “Pennsylvania is facing widespread population declines, with rural areas experiencing the most pronounced reductions. Forty-one of Pennsylvania’s 67 counties are facing significant population declines: rural counties are projected to lose 5.8% of their total population by 2050, while urban counties are projected to grow slightly (+4.1%),” the report states.\n\nYea, this isn't a joking matter. It's a state university who is seeing a demographic that they don't think will latent their college alongside a trend they think is going to rock PA and shrinking itself now so it doesn't embarrass itself later. I don't know the state of PA so I don't know how this affects those closing campuses but I do feel that it's better to close than to occupy at limited capacity just to state that you're still open. I bet this also means that unless something magical happens tuition will also unfortunately increase as more students will funnel into their other campuses which will potentially stress resources \n\nAwful all around but better to do now than later",
                "Why doesn’t Pennsylvania simply eat the other states?",
                "Many public universities just shoot themselves on the foot by building elaborate stuff that the students don't need at all for their education and having ever increasing \"administrative costs\". This leads to tuition hikes and then they wonder why less people want to go to college.",
                "The children yearn for the mines.",
                "Millenials were all told \"just go to college and everything will be fine.\" Spoiler alert, it wasn't. Some of us are still paying off loans 20 years later. College aged kids these days have literally grown up listening to us bitch online about how college loans ruined our lives. Is it really surprising that they're opting out?",
                "Meanwhile at Penn State‘s main campus, they are aiming to increase enrollment by thousands of students, but the local borough passed a zoning ordinance effectively banning most off-campus apartments from the core of downtown.\n\nTo nobody’s surprise, housing is becoming crushingly unaffordable there. I’m sure the landlords on the Planning Commission are more than happy about that!\n\nWe’re going to see much more of this “feast or famine” in higher education over the next couple decades, and it’s going to get ugly."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harvard’s unofficial copy of Magna Carta is actually an original, experts say | Magna Carta",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/15/harvards-unofficial-copy-of-magna-carta-is-actually-an-original-experts-say",
            "upvotes": 2207,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/59c2322e4482318983321486556345c46c643c26/1127_684_3861_3088/master/3861.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=22ebd44c13be14147ce844d5d872fb99",
            "top_comments": [
                "A second printing, not the first edition.",
                "Official copy not original. Since Edward I didn’t, you know, since Magna Carta in 1300, it was signed by John in 1215.\n\nSo, 75 years after the fact official copy.",
                "This is the second printing amended to entitle the king to the first sick kick flip on every newly built half pipe, aka *Prima Gnarly*",
                "1216 one after Magna Carta",
                "Send it to a country that still observes the rule of law.",
                "One after the magna carta, as if I could EVER make such a mistake! I just couldnt PROVE it! \n\nI know he swapped those numbers! I knew it was 1216, not 1261. He got that idiot at the copy shop to lie for him",
                "Is there a secret map on the back too?",
                "“Evil” aristocratic family?",
                "Release the Synder Cut",
                "> It asserts a fundamental principle that the ruler is subject to the law. He can’t just say: ‘Into prison, off with your head, I’m seizing your property.’\n\nWhat a ludicrous idea.  The chief executive of a country should be able to do whatever he wants, otherwise said country would lose its greatnessitude."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 19295,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "Hate when I try to order a coffee but none of the workers clothing makes their aprons color pop and I don't feel welcome and have to have a screaming mental breakdown",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                ">create a sense of familiarity for customers as it tries to establish a warmer, more welcoming feeling in its stores.\n\nI don't think that having every store and every person working there looking the same accomplishes this.",
                "Buying new clothes for dress codes was one of the most stressful parts of working a retail job with a dress code. \n\nWhen I was making $10 and hour and my pants became worn, it was beyond stressful.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "They don't even want people drinking their drinks in the store anymore. Why the fuck should customers care how \"inviting\" baristas look? Starbucks corporate wants us out of their stores.",
                "It's very simple: whatever your opinion is on the dress code and it's validity, the union is arguing that the company doesn't have the right to change the dress code without prior consent from the union.\n\n\nThis is simply a case of the union looking out for workers the way it's supposed to, and it wouldn't matter if the dress code was changed to clown shoes and a clown car or to outlaw the color the Puce. The union is arguing that they need to be consulted and negotiated with no matter what the change is.\n\n\nThey are not dying on the hill of the dress code. They are dying on the hill of the rights of the union to collective bargaining. ",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UnitedHealth under criminal probe for possible Medicare fraud, WSJ reports",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-under-criminal-probe-possible-medicare-fraud-wsj-reports-2025-05-14/",
            "upvotes": 3733,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When companies are charged criminally - or civilly for that matter - nothing ever happens? They pay a fine and keep on criminalling.",
                "We have a UnitedHealthCare Medicare Advantage plan. They keep sending us these Cologuard tests, unsolicited. Six or seven so far. I'm sure they are billing Medicare for them, even though we haven't used them and never requested them.",
                "Calling it now - $5000 and a written apology.",
                "Well all they need to do is buy some Trump crypto and the probe will be dropped.",
                "Senator Rick “Sticky Fingers” Scott enters the chat.",
                "Again. This should say “again” because they have had massive fines and senate hearings for Medicare fraud in the recent past.\n\nFuck over taxpayers and their own patients. Rinse and repeat.",
                "A company making decisions and taking actions that effect millions of people is not just a business decision, it's a human rights decision (and violation).\n\nThose involved (prioritized from the top-down) should be held accountable accordingly. And If companies are granted the same rights/treated the same as people, then prosecute and execute as necessary.",
                "Wonder what non-extradition country the CEO beat it to",
                "I dream that UNH will collapse and the rest of for profit healthcare will soon follow",
                "He was the Man gee ohneeded to help expose this after all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 11592,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Thanks god for that grandmother.",
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                "Damn. If the report here is accurate, this wasn't simply a case of an inattentive or incompetent parent, this was essentially grooming him to become a mass shooter. It wouldn't surprise me if it comes out she flat out instructed him to do it.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                ">In April, the son was found researching the 2019 Christchuch mosque shooting in New Zealand -- a tragedy that killed 51 people -- on a school-issued computer, the affidavit said.\n\n>He was \"subsequently suspended and later in the day attempted suicide with a straight razor causing significant injuries and requiring over 100 stitches,\" the affidavit noted. The boy attended an alternative school until May 7, according to officials.\n\n>His grandmother, with whom he had been staying \"on various occasions,\" contacted police on Monday after she found her grandson \"hitting a live bullet with a hammer,\" the affidavit said.\n\n>The middle schooler told his grandmother he received the bullet from Pardo and that she had \"guns and ammunition at her house,\" according to the affidavit.\n\nSome people have no chance in life, really. It's tragic. I'm just glad they stopped this kid before be hurt anyone besides himself. I hope they can get him the serious psychiatric and social help he needs.",
                "What a loser of a mom.",
                "Thank God for that grandmother. She potentially saved many lives. And shame on that mother. What a stupid stupid lady.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "> The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nHow does a middle-schooler become so radicalized?  The internet is turning out to be as much a curse as a blessing.  Free speech never ran up against something as powerful as social media, we have to figure this out."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Rogue communication devices found in Chinese solar power inverters",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/ghost-machine-rogue-communication-devices-found-chinese-inverters-2025-05-14/",
            "upvotes": 249,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Or is it a IOT transceiver",
                "They found the same thing with the huge cranes that offload ships at the major international ports here",
                "Don't put it past China to create backdoors.\n\nDon't put it past the press or western intelligence agencies to blow some random tranceiver or radio out of proportion inside a very complex installation.\n\nI'll wait and follow the story before jumping to conclusions.",
                "Shouldn't trust Chinese produced anything involving any critical infrastructure. Trump fucked up most of the tariff issue, but it should be used to drive decoupling away from China and towards more trustworthy producers.",
                "This was posted yesterday and was nothing soup then too.\n\n\"\"The two people declined to name the Chinese manufacturers of the inverters and batteries with extra communication devices, nor say how many they had found in total.\"\"\n\nSo the source is just trust me bro.",
                "Remember when Bloomberg released an article saying Chinese spy chips were found on iPhones lol.",
                "[removed]",
                "The inclusion might be sinister but could also be remote access for service reasons.  Cisco equipment had/has back doors supposedly for that purpose.  They were exploited by hackers, though.",
                "This is my shocked face. 😐",
                "Check your lawnmowers. Toasters. Toys. Clothes. Vacuum cleaners. Cars. Hats. Toilets. \n\nChina is listening to you from every single piece of plastic but you own"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Minneapolis and state leaders prepare for possible Derek Chauvin pardon",
            "external_url": "https://kstp.com/kstp-news/top-news/minneapolis-and-state-leaders-prepare-for-possible-derek-chauvin-pardon/",
            "upvotes": 5372,
            "date": "05/14/2025",
            "thumbnail": "https://kstp.com/wp-content/uploads/2025/05/MPLS-CIVIL-UNREST-PREPS_PKG_00.01.26.30.jpg",
            "top_comments": [
                "Article says that even if he's pardoned for his Federal crimes, he must still serve his sentences for his state crimes. 22 years. He's not going to be set free.",
                "From the article:\n\n> Multiple sources told 5 EYEWITNESS NEWS that Gov. Tim Walz, the Minnesota National Guard, Mayor Jacob Frey and Hennepin County Sheriff Dawanna Witt have all been briefed on preparations for possible civil unrest if President Donald Trump pardons former Minneapolis Police Officer Derek Chauvin for his federal conviction of killing George Floyd.\n\n> Then, on Monday, when asked about the possibility of a pardon, Gov. Walz told reporters, “No indication whether they’re going to do it, or not, but I think it behooves us to be prepared for it. With this presidency, it seems like something they would do.”\n\nSo it doesn't sound like Trump or the White House have said anything concrete, but there seem to be *rumors* circulating of a potential pardon which is what is causing this preparation.\n\nThe good news: Trump can only pardon him on federal crimes, not the state ones. Chauvin still has a 22 year sentence to serve in Minnesota even if he is pardoned federally.",
                "Trump absolutely will pardon him, but he owes Minnesota 22 additional years.",
                "Can’t be pardoned by Trump for his state convictions which carry a longer sentence.",
                "They want to poke the BLM bear into rioting so they can deploy the military.",
                "If they ignore the states 22 year sentence even if pardoned you’re setting a scary precedent",
                "Derek Chauvin could be pardoned for his federal convictions, but not his state convictions. President Trump can pardon federal convictions, but not state convictions. While there have been calls for President Trump to pardon Chauvin for his federal sentence, this would not release him from his 22.5-year state sentence.",
                "They’re doing this to get black folk out to protest to lock us up and send us out of the country. \n\nI pray we don’t fall for it.",
                "This seems like Trump trying to let a federal pardon also pardon a state crime.  Try it on Chauvin and see if it works before he does it to himself and friends.",
                "The irony is that Chauvin is probably safer and more comfortable in federal prison than he would be in state prison. Trump wouldn’t be doing him any favors."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Popular beauty influencer shot dead during TikTok livestream at her salon in Mexico",
            "external_url": "https://www.cbsnews.com/news/influencer-valeria-marquez-killed-tiktok-livestream-salon-mexico/",
            "upvotes": 212,
            "date": "05/15/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/15/93a6194f-6298-4064-95a4-af69e5a09bcc/thumbnail/1200x630/902882766917a0061d395d813cbac354/2025-05-14t202922z-999346952-rc2whea24boe-rtrmadp-3-mexico-violence-tiktok.jpg?v=d8ac70a2c93631c1c3223eab6ec7acf9",
            "top_comments": [
                "That’s terribly tragic.. senseless - no motive? There was another person shot in another area at the same time, so were they just running around gunning down strangers? \n\nOr is it targeted cus she was an influencer live streaming and the other was an official iirc",
                "It was on x. It's scary",
                "The saddest part is she felt a little suspicious on what was going on and wanted to leave but her friend convinced her to stay for longer",
                "This is shocking and disgusting.",
                "Every article about this incident is really just about violence against women. It contains almost no details about this woman or the event itself.\n\nShe was hardly a \"popular\" beauty influencer -- socialblade didn't even take notice of her before her death. The \"tens of thousands\" of followers she has almost all came AFTER this news.\n\nPeople kept saying the actual video of the event looks fake. I avoided it for a long time until I finally got curious.\n\nAnd yeah, that was an incredibly fake looking death. There are weird cuts and jumps and she conveniently mutes the stream just before it happens.",
                "In the death video you see a woman (her friend) pick up her phone at the end of the video. It was her friend who killed her",
                "Tragic. At the same time...when you date criminals bad stuff will eventually happen. :-( sad.",
                "There is literally no excuse for this. But usually you dont have gang member hunting you down for no reason. Wonder if she narked or something."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump's sanctions on ICC prosecutor have halted tribunal's work",
            "external_url": "https://apnews.com/article/icc-trump-sanctions-karim-khan-court-a4b4c02751ab84c09718b1b95cbd5db3",
            "upvotes": 51,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Duterte bought some Trump coin?",
                "How does one post about politics without the auto mod removing?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US Supreme Court scrutinizes Trump bid to restrict birthright citizenship",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-hear-trump-bid-restrict-birthright-citizenship-2025-05-15/",
            "upvotes": 175,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As it’s been the law of the land up to now, I’m hoping the Court will fall back on the historical application of the law and not restrict it now.  Crossing fingers!",
                "So if we want to be very clear, the SCOTUS are not debating the birthright citizenship issue outright. They are debating/ruling on whether the lower courts had the authority to put an injunction on Trump's end to birthright citizenship. Obviously this will have an immediate direct effect on birthright citizenship if the courts overturn it, but then the executive order itself would have to be brought before the SCOTUS.",
                "Service Guarantees Citizenship! Would you like to know more?",
                "This case is not really about the merits of the administration’s interpretation of the 14th amendment and birthright citizenship.\n\nRather, the questions are focused more on whether courts has the authority to enjoin executive action, nationwide, through something called a “universal injunction.”\n\nSurprisingly, several of the conservatives justices seemed skeptical of the administration’s position on these universal injunctions, as they pressed the solicitor general to explain how affected individuals would even have an effective remedy for constitutional-rights violations if a court has no authority to impose a universal injunction on facially unconstitutional executive action.  "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Wisconsin judge pleads not guilty on charges of concealing undocumented immigrant",
            "external_url": "https://www.axios.com/2025/05/15/hannah-dugan-arraignment-judge-undocumented-immigrant",
            "upvotes": 108,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump should be the one in prison …he is a convicted felon",
                "I'm betting in a couple decades, when historians look back on things like this, it will be viewed similarly to the underground railroad that helped escaped slaves, or the people who helped shelter Jews in Nazi Germany.",
                "Always plead innocence. Otherwise the judge just throws the book at you. Remorse usually does not get you far in court, it usually gets you the maximum sentence.  \n\nHaving said that, what this judge did, legal or not, was the right thing to do.  Laws are not always right or fair, but they should be."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Rogue communication devices found in Chinese solar power inverters",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/ghost-machine-rogue-communication-devices-found-chinese-inverters-2025-05-14/",
            "upvotes": 250,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Or is it a IOT transceiver",
                "They found the same thing with the huge cranes that offload ships at the major international ports here",
                "Don't put it past China to create backdoors.\n\nDon't put it past the press or western intelligence agencies to blow some random tranceiver or radio out of proportion inside a very complex installation.\n\nI'll wait and follow the story before jumping to conclusions.",
                "Shouldn't trust Chinese produced anything involving any critical infrastructure. Trump fucked up most of the tariff issue, but it should be used to drive decoupling away from China and towards more trustworthy producers.",
                "This was posted yesterday and was nothing soup then too.\n\n\"\"The two people declined to name the Chinese manufacturers of the inverters and batteries with extra communication devices, nor say how many they had found in total.\"\"\n\nSo the source is just trust me bro.",
                "Remember when Bloomberg released an article saying Chinese spy chips were found on iPhones lol.",
                "[removed]",
                "The inclusion might be sinister but could also be remote access for service reasons.  Cisco equipment had/has back doors supposedly for that purpose.  They were exploited by hackers, though.",
                "This is my shocked face. 😐",
                "Check your lawnmowers. Toasters. Toys. Clothes. Vacuum cleaners. Cars. Hats. Toilets. \n\nChina is listening to you from every single piece of plastic but you own"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "RFK Jr orders mifepristone review as anti-abortion groups push for ban",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/rfk-jr-fda-abortion-pill-mifepristone",
            "upvotes": 2617,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/67a815aac24a9d2dd041bbfd8fd6798a959d51d4/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1a221076062851cf9016b33ab6cb595",
            "top_comments": [
                "We need to spread a rumor that mifepristone treats measles. He will defend it with gusto.",
                "Didn't this man just say nobody should take health advice from him yesterday? This country has fully turned into a farce.",
                "The party of forced birth and indifference toward living children strikes again.",
                "Ladies and people who care about ladies: if you can acquire this, do so. The day is coming when it will be more difficult than just about anything to get, if not impossible. Miscarriages are incredibly dangerous if all of the tissue is not expelled, and many hospitals refuse to offer any kind of aid due to the new laws across much of the South until a woman is nearly dead.\n\n  \nAnd even then, if your baby is viable and you are not, they'll just keep you on machines until you deliver. Adriana Smith is suffering this fate in Georgia as we speak after a hospital refused care for a brain bleed when she was 9 weeks. She is now 21 weeks, and is being kept alive against her family's wishes due to the heartbeat law.",
                "The US health secretary, Robert F Kennedy Jr, said on Wednesday that he had directed the FDA to review the regulations around the abortion pill mifepristone.\n\nThe review, he said, was necessary due to “new data” – data that emerged from a flawed analysis that top US anti-abortion groups are now using to pressure the Trump administration to reimpose restrictions on the abortion pill, if not pull it from the market entirely.\n\n...**The analysis, which has not been peer-reviewed or published in a medical journal**, came after the Food and Drug Administration commissioner said he was open to reviewing new safety data on the pills, which are used in nearly two-thirds of abortions nationwide.\n\nThe conservative organizations are rallying behind a paper published on 28 April by a rightwing thinktank, the Ethics and Public Policy Center, which claims there are higher complication rates from taking mifepristone than previously known.\n\nThe paper has attracted scrutiny for appearing to dramatically overstate what it characterizes as “serious adverse effects” associated with the pill, according to medical experts. For example, it counts ectopic pregnancies – when an embryo implants somewhere other than the uterine lining – as a serious complication.\n\nMifepristone does not cause an ectopic pregnancy and taking it will not harm someone with an ectopic. It also claims that needing an in-clinic procedure to complete the abortion is a complication, when patients are counseled in advance about the pills’ failure rate of about 3 to 4%.\n\n**The data, the authors say, means the FDA should reinstate earlier restrictions on mifepristone, including a ban on telemedicine and limiting use to the first seven weeks of pregnancy – but they do not intend to stop there.**\n\nThe authors note that restoring the limits could lead to better monitoring that could help “determine whether this drug should remain on the market”, statements that echo proposals found in Project 2025, the 900-page playbook published by the Heritage Foundation and for which the EPPC was an advisory board member.\n\n**Project 2025 calls to end telemedicine prescriptions of abortion pills as an “interim step” to revoking mifepristone’s approval altogether.**\n\nMore than 100 scientific studies have found the medications cited in the paper are safe and effective for ending a pregnancy.",
                "If only his mother had made use of mifepristone",
                "Weird that anyone doesn't believe that they are really just trying to legislate that women are basically children that need men to make their decisions, so if you think about it that's why it is OK for them to marry children.\n\nLiterally, that is a pretty clear overlap on the venn diagram of legislating agenda they have been on target for.\n\n  \n\\----\n\nA quick edit so I don't come accross as hyperbolic or simply lobbing petty insults:  \n\nI realized I should probably [bring reciepts](https://www.rollingstone.com/politics/politics-features/republican-lawmakers-child-marriage-abortion-1235018777/). \n\nThere are a [*lot*](https://www.nbcnews.com/politics/politics-news/end-child-marriage-u-s-you-might-be-surprised-who-n1050471) of reciepts. \n\nThey've tried \"[defending child marriage is actually pretty pro-choice of me](https://www.newsweek.com/republican-defends-child-marriage-im-pro-choice-1898619)\" and \"[if you ban child marriage, you're letting the gays win](https://www.tba.org/?pg=Articles&blAction=showEntry&blogEntry=30366)\"  along the way . . . landing on their most successful attack yet . . .  \n\n\"[a woman is like a child](https://www.yahoo.com/news/woman-child-maga-quickly-turns-105907677.html)\" . . . and if woman == child, then it stands to reason that child == women . . . \n\nObviously, you wouldn't say women shouldn't be allowed to have an adult sexual relationship within the confines of a legally binding marriage contract that they can leave anytime they want to have enough money and a good lawyer. Which is also why child labor is so important, so that they could obviously have left the marriage if they didn't want to be there.\n\nIt also makes sense of other agenda pushes that would otherwise feel pointless and unrelated, like the absolute insane amounts of hate against women they've pushed on the youth in recent years.",
                "What was the latest quote from the guy who took some kids for a swim in a bacteria infested body of water?",
                "Review has already been done. It does exactly what it says it does and is perfectly safe",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Popular beauty influencer shot dead during TikTok livestream at her salon in Mexico",
            "external_url": "https://www.cbsnews.com/news/influencer-valeria-marquez-killed-tiktok-livestream-salon-mexico/",
            "upvotes": 210,
            "date": "05/15/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/15/93a6194f-6298-4064-95a4-af69e5a09bcc/thumbnail/1200x630/902882766917a0061d395d813cbac354/2025-05-14t202922z-999346952-rc2whea24boe-rtrmadp-3-mexico-violence-tiktok.jpg?v=d8ac70a2c93631c1c3223eab6ec7acf9",
            "top_comments": [
                "That’s terribly tragic.. senseless - no motive? There was another person shot in another area at the same time, so were they just running around gunning down strangers? \n\nOr is it targeted cus she was an influencer live streaming and the other was an official iirc",
                "It was on x. It's scary",
                "The saddest part is she felt a little suspicious on what was going on and wanted to leave but her friend convinced her to stay for longer",
                "This is shocking and disgusting.",
                "Every article about this incident is really just about violence against women. It contains almost no details about this woman or the event itself.\n\nShe was hardly a \"popular\" beauty influencer -- socialblade didn't even take notice of her before her death. The \"tens of thousands\" of followers she has almost all came AFTER this news.\n\nPeople kept saying the actual video of the event looks fake. I avoided it for a long time until I finally got curious.\n\nAnd yeah, that was an incredibly fake looking death. There are weird cuts and jumps and she conveniently mutes the stream just before it happens.",
                "In the death video you see a woman (her friend) pick up her phone at the end of the video. It was her friend who killed her",
                "Tragic. At the same time...when you date criminals bad stuff will eventually happen. :-( sad.",
                "There is literally no excuse for this. But usually you dont have gang member hunting you down for no reason. Wonder if she narked or something."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Penn State blames looming campus closures on ‘declining’ Pennsylvania",
            "external_url": "https://www.pennlive.com/education/2025/05/penn-state-blames-looming-campus-closures-on-declining-pennsylvania.html",
            "upvotes": 2761,
            "date": "05/15/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/SVFYZVYLHBHFFHBSMBUKIE2VCU.jpeg?auth=1f592a318cc78efd45dd0748ac1753d315988f84eb6d57aa3de008a877cff527&width=1280&quality=90",
            "top_comments": [
                "Have they tried increasing Pennsylvania?",
                "Grew up and went to one of those satellite campuses. It was a great school and opportunity for the rural area I lived in. I’m grateful to have had it.\n\nThey’re right though about the demographics. I left PA because there was so little there as an adult. It never fully recovered (in my area) after coal dried up and then 08 hit. My county was old even when I was young. \n\nIt’ll always be home, but I didn’t have it in me to stay.",
                "Almost no one here read the article or understands what it really means. Penn State is closing branch campuses, which cater almost entirely to local populations. No one from out of state dreams of going to Penn State Shenango on the border of Ohio, which is over an hour from any major population center. No one is moving to Sharon PA either. The population peaked in the 50's and is half of what it was then. It is #197 of cities by population in PA. Sure Penn States tuition is bonkers, blah blah. But declining rural populations and branch campuses in nowheresville are the reason for this.",
                "..and 20 years later, almost all the children had been left behind.",
                "I read the article and frankly I suggest many others to as well as it feels like the posts in here are either bad jokes are personal quips....while the article is providing quotes such as: \n\n> The Keystone State is among five states expected to account for three-fourths of the national decline in high school graduates, with a 17% reduction projected through 2043, the report says.\n\nand \n\n> The report cites lower birth rates following the 2008 recession and reduced K-12 enrollment trends, exacerbated by the COVID-19 pandemic’s “lingering effects on earlier grade retention” for what it calls Pennsylvania’s looming “demographic cliff.”\n\nand \n\n> “Pennsylvania is facing widespread population declines, with rural areas experiencing the most pronounced reductions. Forty-one of Pennsylvania’s 67 counties are facing significant population declines: rural counties are projected to lose 5.8% of their total population by 2050, while urban counties are projected to grow slightly (+4.1%),” the report states.\n\nYea, this isn't a joking matter. It's a state university who is seeing a demographic that they don't think will latent their college alongside a trend they think is going to rock PA and shrinking itself now so it doesn't embarrass itself later. I don't know the state of PA so I don't know how this affects those closing campuses but I do feel that it's better to close than to occupy at limited capacity just to state that you're still open. I bet this also means that unless something magical happens tuition will also unfortunately increase as more students will funnel into their other campuses which will potentially stress resources \n\nAwful all around but better to do now than later",
                "Why doesn’t Pennsylvania simply eat the other states?",
                "Many public universities just shoot themselves on the foot by building elaborate stuff that the students don't need at all for their education and having ever increasing \"administrative costs\". This leads to tuition hikes and then they wonder why less people want to go to college.",
                "The children yearn for the mines.",
                "Millenials were all told \"just go to college and everything will be fine.\" Spoiler alert, it wasn't. Some of us are still paying off loans 20 years later. College aged kids these days have literally grown up listening to us bitch online about how college loans ruined our lives. Is it really surprising that they're opting out?",
                "Meanwhile at Penn State‘s main campus, they are aiming to increase enrollment by thousands of students, but the local borough passed a zoning ordinance effectively banning most off-campus apartments from the core of downtown.\n\nTo nobody’s surprise, housing is becoming crushingly unaffordable there. I’m sure the landlords on the Planning Commission are more than happy about that!\n\nWe’re going to see much more of this “feast or famine” in higher education over the next couple decades, and it’s going to get ugly."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Walmart warns of higher prices, withholds second-quarter profit guidance",
            "external_url": "https://www.reuters.com/business/retail-consumer/walmart-warns-higher-prices-withholds-second-quarter-profit-guidance-2025-05-15/",
            "upvotes": 5674,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Article does not mention how they will address the empty shelves.  Wonder if they talked about this during their earnings call. ",
                "in a couple of years time there will be a lot less money to go around, and the billionaires will be on the race to being the first trillionaire.",
                "How many people on r/stocks are telling you tariffs are “priced in” and Walmart can’t even provide guidance for next quarter?",
                "I wonder what on Earth might be causing those higher prices?  ;-)",
                "This isn’t good coming from Wally’s World.  More bad to come this summer.",
                "They aren’t “withholding” profit guidance. Attempting to forecast it accurately in this environment is a step away from lying. It is literally the only responsible thing to do because they have no idea what their supply, revenue, profit, etc will be because policy changes literally by the minute.",
                "Not just walmart, everyone should get used to buying less stuff. Hard times are coming.\n\nwww.BoycottOligarchs.com",
                "80% of all Wal-Mart goods come from China….",
                "I’m glad at least Walmart isn’t afraid to state this publicly unlike so many others who fear repercussions from this “regime”.",
                "I just got a notice on my Amazon cart/wishlist yesterday that 15 items I had went up in price, and not by cents. Seen some stuff go up from 30-60%"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Harvard’s unofficial copy of Magna Carta is actually an original, experts say | Magna Carta",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/15/harvards-unofficial-copy-of-magna-carta-is-actually-an-original-experts-say",
            "upvotes": 2200,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/59c2322e4482318983321486556345c46c643c26/1127_684_3861_3088/master/3861.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=22ebd44c13be14147ce844d5d872fb99",
            "top_comments": [
                "A second printing, not the first edition.",
                "Official copy not original. Since Edward I didn’t, you know, since Magna Carta in 1300, it was signed by John in 1215.\n\nSo, 75 years after the fact official copy.",
                "This is the second printing amended to entitle the king to the first sick kick flip on every newly built half pipe, aka *Prima Gnarly*",
                "1216 one after Magna Carta",
                "Send it to a country that still observes the rule of law.",
                "One after the magna carta, as if I could EVER make such a mistake! I just couldnt PROVE it! \n\nI know he swapped those numbers! I knew it was 1216, not 1261. He got that idiot at the copy shop to lie for him",
                "Is there a secret map on the back too?",
                "“Evil” aristocratic family?",
                "Release the Synder Cut",
                "> It asserts a fundamental principle that the ruler is subject to the law. He can’t just say: ‘Into prison, off with your head, I’m seizing your property.’\n\nWhat a ludicrous idea.  The chief executive of a country should be able to do whatever he wants, otherwise said country would lose its greatnessitude."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Feds offering $20,000 reward in decapitated dolphin case",
            "external_url": "https://www.wect.com/2025/05/14/feds-offering-20000-reward-decapitated-dolphin-case/",
            "upvotes": 1535,
            "date": "05/15/2025",
            "thumbnail": "https://gray-wect-prod.gtv-cdn.com/resizer/v2/XQDZ2JMLYNA7BHGMHGE3GA4JKQ.png?auth=4c4f971fdb94541667b018531983c8a29a8f3fb1e98ac9c78f5595abec871b2f&width=1200&height=600&smart=true",
            "top_comments": [
                "Wondering if RFK Jr. has an alabi on this one.",
                "Has anyone checked RFK Jr’s minivan?",
                "Knew what the comments would be before I even clicked.",
                "Came here for the unhinged RFK Jr. comments. \n\nI was not disappointed. Thank you Reddit.",
                "This is actually very weird and fucked up",
                "A country of 330 million people and there's only one who could have done this",
                "I heard a rumor Trump did it and then Trump did sexual things to it. Can anyone else confirm they’ve heard this rumor? That Donald Trump fucks decapitated dolphins?",
                "Better get Ace Ventura on the case!",
                "They porpoisely left out the dolphins name.",
                "When the brain worm won’t stop asking for more brains…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "RFK Jr orders mifepristone review as anti-abortion groups push for ban",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/rfk-jr-fda-abortion-pill-mifepristone",
            "upvotes": 2598,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/67a815aac24a9d2dd041bbfd8fd6798a959d51d4/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1a221076062851cf9016b33ab6cb595",
            "top_comments": [
                "We need to spread a rumor that mifepristone treats measles. He will defend it with gusto.",
                "Didn't this man just say nobody should take health advice from him yesterday? This country has fully turned into a farce.",
                "The party of forced birth and indifference toward living children strikes again.",
                "Ladies and people who care about ladies: if you can acquire this, do so. The day is coming when it will be more difficult than just about anything to get, if not impossible. Miscarriages are incredibly dangerous if all of the tissue is not expelled, and many hospitals refuse to offer any kind of aid due to the new laws across much of the South until a woman is nearly dead.\n\n  \nAnd even then, if your baby is viable and you are not, they'll just keep you on machines until you deliver. Adriana Smith is suffering this fate in Georgia as we speak after a hospital refused care for a brain bleed when she was 9 weeks. She is now 21 weeks, and is being kept alive against her family's wishes due to the heartbeat law.",
                "The US health secretary, Robert F Kennedy Jr, said on Wednesday that he had directed the FDA to review the regulations around the abortion pill mifepristone.\n\nThe review, he said, was necessary due to “new data” – data that emerged from a flawed analysis that top US anti-abortion groups are now using to pressure the Trump administration to reimpose restrictions on the abortion pill, if not pull it from the market entirely.\n\n...**The analysis, which has not been peer-reviewed or published in a medical journal**, came after the Food and Drug Administration commissioner said he was open to reviewing new safety data on the pills, which are used in nearly two-thirds of abortions nationwide.\n\nThe conservative organizations are rallying behind a paper published on 28 April by a rightwing thinktank, the Ethics and Public Policy Center, which claims there are higher complication rates from taking mifepristone than previously known.\n\nThe paper has attracted scrutiny for appearing to dramatically overstate what it characterizes as “serious adverse effects” associated with the pill, according to medical experts. For example, it counts ectopic pregnancies – when an embryo implants somewhere other than the uterine lining – as a serious complication.\n\nMifepristone does not cause an ectopic pregnancy and taking it will not harm someone with an ectopic. It also claims that needing an in-clinic procedure to complete the abortion is a complication, when patients are counseled in advance about the pills’ failure rate of about 3 to 4%.\n\n**The data, the authors say, means the FDA should reinstate earlier restrictions on mifepristone, including a ban on telemedicine and limiting use to the first seven weeks of pregnancy – but they do not intend to stop there.**\n\nThe authors note that restoring the limits could lead to better monitoring that could help “determine whether this drug should remain on the market”, statements that echo proposals found in Project 2025, the 900-page playbook published by the Heritage Foundation and for which the EPPC was an advisory board member.\n\n**Project 2025 calls to end telemedicine prescriptions of abortion pills as an “interim step” to revoking mifepristone’s approval altogether.**\n\nMore than 100 scientific studies have found the medications cited in the paper are safe and effective for ending a pregnancy.",
                "If only his mother had made use of mifepristone",
                "Weird that anyone doesn't believe that they are really just trying to legislate that women are basically children that need men to make their decisions, so if you think about it that's why it is OK for them to marry children.\n\nLiterally, that is a pretty clear overlap on the venn diagram of legislating agenda they have been on target for.\n\n  \n\\----\n\nA quick edit so I don't come accross as hyperbolic or simply lobbing petty insults:  \n\nI realized I should probably [bring reciepts](https://www.rollingstone.com/politics/politics-features/republican-lawmakers-child-marriage-abortion-1235018777/). \n\nThere are a [*lot*](https://www.nbcnews.com/politics/politics-news/end-child-marriage-u-s-you-might-be-surprised-who-n1050471) of reciepts. \n\nThey've tried \"[defending child marriage is actually pretty pro-choice of me](https://www.newsweek.com/republican-defends-child-marriage-im-pro-choice-1898619)\" and \"[if you ban child marriage, you're letting the gays win](https://www.tba.org/?pg=Articles&blAction=showEntry&blogEntry=30366)\"  along the way . . . landing on their most successful attack yet . . .  \n\n\"[a woman is like a child](https://www.yahoo.com/news/woman-child-maga-quickly-turns-105907677.html)\" . . . and if woman == child, then it stands to reason that child == women . . . \n\nObviously, you wouldn't say women shouldn't be allowed to have an adult sexual relationship within the confines of a legally binding marriage contract that they can leave anytime they want to have enough money and a good lawyer. Which is also why child labor is so important, so that they could obviously have left the marriage if they didn't want to be there.\n\nIt also makes sense of other agenda pushes that would otherwise feel pointless and unrelated, like the absolute insane amounts of hate against women they've pushed on the youth in recent years.",
                "What was the latest quote from the guy who took some kids for a swim in a bacteria infested body of water?",
                "Review has already been done. It does exactly what it says it does and is perfectly safe",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Rogue communication devices found in Chinese solar power inverters",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/ghost-machine-rogue-communication-devices-found-chinese-inverters-2025-05-14/",
            "upvotes": 248,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Or is it a IOT transceiver",
                "They found the same thing with the huge cranes that offload ships at the major international ports here",
                "Don't put it past China to create backdoors.\n\nDon't put it past the press or western intelligence agencies to blow some random tranceiver or radio out of proportion inside a very complex installation.\n\nI'll wait and follow the story before jumping to conclusions.",
                "Shouldn't trust Chinese produced anything involving any critical infrastructure. Trump fucked up most of the tariff issue, but it should be used to drive decoupling away from China and towards more trustworthy producers.",
                "This was posted yesterday and was nothing soup then too.\n\n\"\"The two people declined to name the Chinese manufacturers of the inverters and batteries with extra communication devices, nor say how many they had found in total.\"\"\n\nSo the source is just trust me bro.",
                "Remember when Bloomberg released an article saying Chinese spy chips were found on iPhones lol.",
                "[removed]",
                "The inclusion might be sinister but could also be remote access for service reasons.  Cisco equipment had/has back doors supposedly for that purpose.  They were exploited by hackers, though.",
                "This is my shocked face. 😐",
                "Check your lawnmowers. Toasters. Toys. Clothes. Vacuum cleaners. Cars. Hats. Toilets. \n\nChina is listening to you from every single piece of plastic but you own"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Walmart warns of higher prices, withholds second-quarter profit guidance",
            "external_url": "https://www.reuters.com/business/retail-consumer/walmart-warns-higher-prices-withholds-second-quarter-profit-guidance-2025-05-15/",
            "upvotes": 5675,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Article does not mention how they will address the empty shelves.  Wonder if they talked about this during their earnings call. ",
                "in a couple of years time there will be a lot less money to go around, and the billionaires will be on the race to being the first trillionaire.",
                "How many people on r/stocks are telling you tariffs are “priced in” and Walmart can’t even provide guidance for next quarter?",
                "I wonder what on Earth might be causing those higher prices?  ;-)",
                "This isn’t good coming from Wally’s World.  More bad to come this summer.",
                "They aren’t “withholding” profit guidance. Attempting to forecast it accurately in this environment is a step away from lying. It is literally the only responsible thing to do because they have no idea what their supply, revenue, profit, etc will be because policy changes literally by the minute.",
                "Not just walmart, everyone should get used to buying less stuff. Hard times are coming.\n\nwww.BoycottOligarchs.com",
                "80% of all Wal-Mart goods come from China….",
                "I’m glad at least Walmart isn’t afraid to state this publicly unlike so many others who fear repercussions from this “regime”.",
                "I just got a notice on my Amazon cart/wishlist yesterday that 15 items I had went up in price, and not by cents. Seen some stuff go up from 30-60%"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Popular beauty influencer shot dead during TikTok livestream at her salon in Mexico",
            "external_url": "https://www.cbsnews.com/news/influencer-valeria-marquez-killed-tiktok-livestream-salon-mexico/",
            "upvotes": 213,
            "date": "05/15/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/15/93a6194f-6298-4064-95a4-af69e5a09bcc/thumbnail/1200x630/902882766917a0061d395d813cbac354/2025-05-14t202922z-999346952-rc2whea24boe-rtrmadp-3-mexico-violence-tiktok.jpg?v=d8ac70a2c93631c1c3223eab6ec7acf9",
            "top_comments": [
                "That’s terribly tragic.. senseless - no motive? There was another person shot in another area at the same time, so were they just running around gunning down strangers? \n\nOr is it targeted cus she was an influencer live streaming and the other was an official iirc",
                "It was on x. It's scary",
                "The saddest part is she felt a little suspicious on what was going on and wanted to leave but her friend convinced her to stay for longer",
                "This is shocking and disgusting.",
                "Every article about this incident is really just about violence against women. It contains almost no details about this woman or the event itself.\n\nShe was hardly a \"popular\" beauty influencer -- socialblade didn't even take notice of her before her death. The \"tens of thousands\" of followers she has almost all came AFTER this news.\n\nPeople kept saying the actual video of the event looks fake. I avoided it for a long time until I finally got curious.\n\nAnd yeah, that was an incredibly fake looking death. There are weird cuts and jumps and she conveniently mutes the stream just before it happens.",
                "In the death video you see a woman (her friend) pick up her phone at the end of the video. It was her friend who killed her",
                "Tragic. At the same time...when you date criminals bad stuff will eventually happen. :-( sad.",
                "There is literally no excuse for this. But usually you dont have gang member hunting you down for no reason. Wonder if she narked or something."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Penn State blames looming campus closures on ‘declining’ Pennsylvania",
            "external_url": "https://www.pennlive.com/education/2025/05/penn-state-blames-looming-campus-closures-on-declining-pennsylvania.html",
            "upvotes": 2761,
            "date": "05/15/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/SVFYZVYLHBHFFHBSMBUKIE2VCU.jpeg?auth=1f592a318cc78efd45dd0748ac1753d315988f84eb6d57aa3de008a877cff527&width=1280&quality=90",
            "top_comments": [
                "Have they tried increasing Pennsylvania?",
                "Grew up and went to one of those satellite campuses. It was a great school and opportunity for the rural area I lived in. I’m grateful to have had it.\n\nThey’re right though about the demographics. I left PA because there was so little there as an adult. It never fully recovered (in my area) after coal dried up and then 08 hit. My county was old even when I was young. \n\nIt’ll always be home, but I didn’t have it in me to stay.",
                "Almost no one here read the article or understands what it really means. Penn State is closing branch campuses, which cater almost entirely to local populations. No one from out of state dreams of going to Penn State Shenango on the border of Ohio, which is over an hour from any major population center. No one is moving to Sharon PA either. The population peaked in the 50's and is half of what it was then. It is #197 of cities by population in PA. Sure Penn States tuition is bonkers, blah blah. But declining rural populations and branch campuses in nowheresville are the reason for this.",
                "..and 20 years later, almost all the children had been left behind.",
                "I read the article and frankly I suggest many others to as well as it feels like the posts in here are either bad jokes are personal quips....while the article is providing quotes such as: \n\n> The Keystone State is among five states expected to account for three-fourths of the national decline in high school graduates, with a 17% reduction projected through 2043, the report says.\n\nand \n\n> The report cites lower birth rates following the 2008 recession and reduced K-12 enrollment trends, exacerbated by the COVID-19 pandemic’s “lingering effects on earlier grade retention” for what it calls Pennsylvania’s looming “demographic cliff.”\n\nand \n\n> “Pennsylvania is facing widespread population declines, with rural areas experiencing the most pronounced reductions. Forty-one of Pennsylvania’s 67 counties are facing significant population declines: rural counties are projected to lose 5.8% of their total population by 2050, while urban counties are projected to grow slightly (+4.1%),” the report states.\n\nYea, this isn't a joking matter. It's a state university who is seeing a demographic that they don't think will latent their college alongside a trend they think is going to rock PA and shrinking itself now so it doesn't embarrass itself later. I don't know the state of PA so I don't know how this affects those closing campuses but I do feel that it's better to close than to occupy at limited capacity just to state that you're still open. I bet this also means that unless something magical happens tuition will also unfortunately increase as more students will funnel into their other campuses which will potentially stress resources \n\nAwful all around but better to do now than later",
                "Why doesn’t Pennsylvania simply eat the other states?",
                "Many public universities just shoot themselves on the foot by building elaborate stuff that the students don't need at all for their education and having ever increasing \"administrative costs\". This leads to tuition hikes and then they wonder why less people want to go to college.",
                "The children yearn for the mines.",
                "Millenials were all told \"just go to college and everything will be fine.\" Spoiler alert, it wasn't. Some of us are still paying off loans 20 years later. College aged kids these days have literally grown up listening to us bitch online about how college loans ruined our lives. Is it really surprising that they're opting out?",
                "Meanwhile at Penn State‘s main campus, they are aiming to increase enrollment by thousands of students, but the local borough passed a zoning ordinance effectively banning most off-campus apartments from the core of downtown.\n\nTo nobody’s surprise, housing is becoming crushingly unaffordable there. I’m sure the landlords on the Planning Commission are more than happy about that!\n\nWe’re going to see much more of this “feast or famine” in higher education over the next couple decades, and it’s going to get ugly."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harvard’s unofficial copy of Magna Carta is actually an original, experts say | Magna Carta",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/15/harvards-unofficial-copy-of-magna-carta-is-actually-an-original-experts-say",
            "upvotes": 2203,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/59c2322e4482318983321486556345c46c643c26/1127_684_3861_3088/master/3861.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=22ebd44c13be14147ce844d5d872fb99",
            "top_comments": [
                "A second printing, not the first edition.",
                "Official copy not original. Since Edward I didn’t, you know, since Magna Carta in 1300, it was signed by John in 1215.\n\nSo, 75 years after the fact official copy.",
                "This is the second printing amended to entitle the king to the first sick kick flip on every newly built half pipe, aka *Prima Gnarly*",
                "1216 one after Magna Carta",
                "Send it to a country that still observes the rule of law.",
                "One after the magna carta, as if I could EVER make such a mistake! I just couldnt PROVE it! \n\nI know he swapped those numbers! I knew it was 1216, not 1261. He got that idiot at the copy shop to lie for him",
                "Is there a secret map on the back too?",
                "“Evil” aristocratic family?",
                "Release the Synder Cut",
                "> It asserts a fundamental principle that the ruler is subject to the law. He can’t just say: ‘Into prison, off with your head, I’m seizing your property.’\n\nWhat a ludicrous idea.  The chief executive of a country should be able to do whatever he wants, otherwise said country would lose its greatnessitude."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 19294,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "Hate when I try to order a coffee but none of the workers clothing makes their aprons color pop and I don't feel welcome and have to have a screaming mental breakdown",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                ">create a sense of familiarity for customers as it tries to establish a warmer, more welcoming feeling in its stores.\n\nI don't think that having every store and every person working there looking the same accomplishes this.",
                "Buying new clothes for dress codes was one of the most stressful parts of working a retail job with a dress code. \n\nWhen I was making $10 and hour and my pants became worn, it was beyond stressful.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "They don't even want people drinking their drinks in the store anymore. Why the fuck should customers care how \"inviting\" baristas look? Starbucks corporate wants us out of their stores.",
                "It's very simple: whatever your opinion is on the dress code and it's validity, the union is arguing that the company doesn't have the right to change the dress code without prior consent from the union.\n\n\nThis is simply a case of the union looking out for workers the way it's supposed to, and it wouldn't matter if the dress code was changed to clown shoes and a clown car or to outlaw the color the Puce. The union is arguing that they need to be consulted and negotiated with no matter what the change is.\n\n\nThey are not dying on the hill of the dress code. They are dying on the hill of the rights of the union to collective bargaining. ",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UnitedHealth under criminal probe for possible Medicare fraud, WSJ reports",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-under-criminal-probe-possible-medicare-fraud-wsj-reports-2025-05-14/",
            "upvotes": 3737,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When companies are charged criminally - or civilly for that matter - nothing ever happens? They pay a fine and keep on criminalling.",
                "We have a UnitedHealthCare Medicare Advantage plan. They keep sending us these Cologuard tests, unsolicited. Six or seven so far. I'm sure they are billing Medicare for them, even though we haven't used them and never requested them.",
                "Calling it now - $5000 and a written apology.",
                "Well all they need to do is buy some Trump crypto and the probe will be dropped.",
                "Senator Rick “Sticky Fingers” Scott enters the chat.",
                "Again. This should say “again” because they have had massive fines and senate hearings for Medicare fraud in the recent past.\n\nFuck over taxpayers and their own patients. Rinse and repeat.",
                "A company making decisions and taking actions that effect millions of people is not just a business decision, it's a human rights decision (and violation).\n\nThose involved (prioritized from the top-down) should be held accountable accordingly. And If companies are granted the same rights/treated the same as people, then prosecute and execute as necessary.",
                "Wonder what non-extradition country the CEO beat it to",
                "I dream that UNH will collapse and the rest of for profit healthcare will soon follow",
                "He was the Man gee ohneeded to help expose this after all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 11592,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Thanks god for that grandmother.",
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                "Damn. If the report here is accurate, this wasn't simply a case of an inattentive or incompetent parent, this was essentially grooming him to become a mass shooter. It wouldn't surprise me if it comes out she flat out instructed him to do it.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                ">In April, the son was found researching the 2019 Christchuch mosque shooting in New Zealand -- a tragedy that killed 51 people -- on a school-issued computer, the affidavit said.\n\n>He was \"subsequently suspended and later in the day attempted suicide with a straight razor causing significant injuries and requiring over 100 stitches,\" the affidavit noted. The boy attended an alternative school until May 7, according to officials.\n\n>His grandmother, with whom he had been staying \"on various occasions,\" contacted police on Monday after she found her grandson \"hitting a live bullet with a hammer,\" the affidavit said.\n\n>The middle schooler told his grandmother he received the bullet from Pardo and that she had \"guns and ammunition at her house,\" according to the affidavit.\n\nSome people have no chance in life, really. It's tragic. I'm just glad they stopped this kid before be hurt anyone besides himself. I hope they can get him the serious psychiatric and social help he needs.",
                "What a loser of a mom.",
                "Thank God for that grandmother. She potentially saved many lives. And shame on that mother. What a stupid stupid lady.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "> The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nHow does a middle-schooler become so radicalized?  The internet is turning out to be as much a curse as a blessing.  Free speech never ran up against something as powerful as social media, we have to figure this out."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Minneapolis and state leaders prepare for possible Derek Chauvin pardon",
            "external_url": "https://kstp.com/kstp-news/top-news/minneapolis-and-state-leaders-prepare-for-possible-derek-chauvin-pardon/",
            "upvotes": 5371,
            "date": "05/14/2025",
            "thumbnail": "https://kstp.com/wp-content/uploads/2025/05/MPLS-CIVIL-UNREST-PREPS_PKG_00.01.26.30.jpg",
            "top_comments": [
                "Article says that even if he's pardoned for his Federal crimes, he must still serve his sentences for his state crimes. 22 years. He's not going to be set free.",
                "From the article:\n\n> Multiple sources told 5 EYEWITNESS NEWS that Gov. Tim Walz, the Minnesota National Guard, Mayor Jacob Frey and Hennepin County Sheriff Dawanna Witt have all been briefed on preparations for possible civil unrest if President Donald Trump pardons former Minneapolis Police Officer Derek Chauvin for his federal conviction of killing George Floyd.\n\n> Then, on Monday, when asked about the possibility of a pardon, Gov. Walz told reporters, “No indication whether they’re going to do it, or not, but I think it behooves us to be prepared for it. With this presidency, it seems like something they would do.”\n\nSo it doesn't sound like Trump or the White House have said anything concrete, but there seem to be *rumors* circulating of a potential pardon which is what is causing this preparation.\n\nThe good news: Trump can only pardon him on federal crimes, not the state ones. Chauvin still has a 22 year sentence to serve in Minnesota even if he is pardoned federally.",
                "Trump absolutely will pardon him, but he owes Minnesota 22 additional years.",
                "Can’t be pardoned by Trump for his state convictions which carry a longer sentence.",
                "They want to poke the BLM bear into rioting so they can deploy the military.",
                "If they ignore the states 22 year sentence even if pardoned you’re setting a scary precedent",
                "Derek Chauvin could be pardoned for his federal convictions, but not his state convictions. President Trump can pardon federal convictions, but not state convictions. While there have been calls for President Trump to pardon Chauvin for his federal sentence, this would not release him from his 22.5-year state sentence.",
                "They’re doing this to get black folk out to protest to lock us up and send us out of the country. \n\nI pray we don’t fall for it.",
                "This seems like Trump trying to let a federal pardon also pardon a state crime.  Try it on Chauvin and see if it works before he does it to himself and friends.",
                "The irony is that Chauvin is probably safer and more comfortable in federal prison than he would be in state prison. Trump wouldn’t be doing him any favors."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/15/2025 16:11:11 UTC"
}