{
    "posts": [
        {
            "category": "HOT",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 6933,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "All the $ and time wasted on lawsuits.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "PBS is a national treasure."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 2894,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "This man has no business having this job. Will health insurance not continue to cover these groups of people? If it doesn’t, this will kill people",
                "Let's see the double blind data from the peer reviewed study.",
                "Never take medical advice from a guy who had a worm eating his brain",
                "\"COVID shot\" sounds dumb, but \"flu shot\" doesn't. That's all I have to contribute here. I plan to take both as long as I can because getting really sick when I don't have to seems stupid. Also, RFK Jr. is a ding dong.",
                "They’re trying to kill us."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 3081,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "Fat fuck frees fat fuck.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "Anybody who voted republican in 2024 should genuinely have to prove they can be trusted to participate in society when this is all over. Fucking idiots",
                "White collar fraudster pardons blue collar fraudster.",
                "so much for fighting against fraud, waste and abuse!!!!",
                "no surprise, soon diddy will be pardoned once hes found guilty and sentenced."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tesla's monthly sales in Europe plunge by half, signaling backlash against Musk runs deep",
            "external_url": "https://apnews.com/article/tesla-elon-musk-europe-8501d6a8370b6a22c6bec7e52de7d50c",
            "upvotes": 1331,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "EV purchases are up 30% in the EU…. They are buying, just not Tesla.",
                "And yet Tsla stock rises again today. \n\nThe market makes no sense to me.",
                "The longer the US stock is artificially propped up, the bigger the crash is going to be.\n\nThe global Q2 sales report combined with the disaster that is robotaxi launch, Tesla is doomed.",
                "Don't worry though because Tesla robots are coming to save the company. Those Europeans are gonna love robots that can throw out Hitler salutes whenever.",
                "Poor Elon, the victim",
                "There's plenty of people who had family members two or three generations back killed by the Nazis. No Nazi cars, period.",
                "Europe has a long memory when it comes to people who make nazi salutes…",
                "Who could have possibly seen this coming?",
                "Dude poisoned his own company.",
                "> Sales of Tesla vehicles in 32 European countries tumbled 49% to 7,261 in April from 14,228 in the same month the previous year, according to the figures released by the European Automobile Manufacturers’ Association, or ACEA.\n\nC'mon people, I know you can do better than this. Zero sales is the easiest target to hit and can be achieved by literally doing nothing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "White House stunned as Hegseth inquiry brings up illegal wiretap claims",
            "external_url": "https://www.theguardian.com/us-news/2025/may/27/hegseth-pentagon-leak-investigation-wiretap",
            "upvotes": 682,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/531eb17c00739d970da245fe8d17823228251b16/1023_249_3601_2882/master/3601.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=192f07ecc59f0eae9cb3a1e78d4a0bdc",
            "top_comments": [
                "Of all the Republicans to draw inspiration from, why do these assholes keep going back to Nixon and McCarthy?",
                "The White House has lost confidence in a Pentagon leak investigation that Pete Hegseth used to justify firing three top aides last month, after advisers were told that the aides had supposedly been outed by an illegal warrantless National Security Agency (NSA) wiretap.\n\nThe extraordinary explanation alarmed the advisers, who also raised it with people close to JD Vance, because such a wiretap would almost certainly be unconstitutional and an even bigger scandal than a number of leaks.\n\nBut the advisers found the claim to be untrue and complained that they were being fed dubious information by Hegseth’s personal lawyer, Tim Parlatore, who had been tasked with overseeing the investigation.\n\nThe episode, as recounted by four people familiar with the matter, marked the most extraordinary twist in the investigation examining the leak of an allegedly top secret document that outlined options for the US military to reclaim the Panama canal to a reporter.\n\nThe advisers were stunned again when Parlatore denied having told anyone about an illegal NSA wiretap himself and maintained that any information he had was passed on to him by others at the Pentagon.\n\nThe leak was first attributed internally to Hegseth’s senior adviser, Dan Caldwell, who was escorted out of the Pentagon and fired last month alongside two other aides, Hegseth’s former deputy chief of staff, Darin Selnick, and the deputy defense secretary’s chief of staff Colin Carroll.\n\nBut the illegal wiretap claim and Caldwell’s denials fueled a breakdown in trust between the Pentagon and the White House, where the Trump advisers tracking the investigation have privately suggested they no longer have any idea about who or what to believe.\n\nIn particular, one Trump adviser recently told Hegseth that he did not think Caldwell – or any of the fired aides – had leaked anything, and that he suspected the investigation had been used to get rid of aides involved in the infighting with his first chief of staff, Joe Kasper.\n\nThe fraught situation is sure to increase pressure on Hegseth ahead of a Senate hearing next month, and more broadly for his office, which has been roiled by the leak investigation that has now continued for nearly a month with no new evidence or referral to the FBI.\n\nThe fallout has left Hegseth with no chief or deputy chief of staff, as he relies on six senior advisers to run his front office, which is involved in setting the direction of the defense department that has a budget of nearly $1tn and oversees more than two million troops.\n\nAnd while Hegseth’s former junior military aide Ricky Buria has effectively assumed the job of the chief of staff, the White House has blocked Hegseth from giving him the job permanently on account of his limited experience and role in internal office drama.\n\nThe Pentagon declined to comment on reporting for this story. A spokesperson for the White House said in a statement: “President Trump is confident in the secretary’s ability to ensure top leadership at the Department of Defense shares their focus on restoring a military that is focused on readiness, lethality, and excellence.”",
                "So the Republican Controlled Goverment is now illegally wiretapping it's own goverment employees in an effort to weed out anyone not loyal?  I guarantee you They are all collecting blackmail evidence on each other in case one goes down it'll be a house of cards .",
                "Oh look, watergate\n\nNothing will happen to any of them",
                "Elect a clown, expect a circus. 🤡🎪",
                "This is actually an EXTREMELY alarming development. The NSA, which has always been very strictly for spying on *foreign* threats, has been turned against top US military figures. This is a 5 alarm fire.",
                "Veep was more realistic.",
                "Saving my popcorn and a Montecristo Platinum for Hegseth's inevitable firing. I doubt he'll make the end of the fiscal year.",
                "This guy was chosen because he said he would obey an order by Trump to have the military fire on American civilians. That's his main qualification.",
                "In Trump's administration, it won't matter.\n\npeople who break the law for political reasons will be pardoned"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man turns himself in after argument turned shooting that injured six in Colorado Springs",
            "external_url": "https://www.kktv.com/2025/05/26/man-arrest-connection-with-colorado-springs-shooting-that-injured-6/",
            "upvotes": 787,
            "date": "05/27/2025",
            "thumbnail": "https://gray-kktv-prod.gtv-cdn.com/resizer/v2/URUHNSJBHBDFPDEJM3YEHJMHVA.png?auth=9019873634871bb66f8cf183c6677da6f6b57a84998d750ec83b0891e3503b32&width=1200&height=600&smart=true",
            "top_comments": [
                "Average Colorado Springs moment",
                "Why the hell is he out on bond??",
                "“My, my, my.”  — Lt. Joe Kenda",
                "I grew up here and miss the small town it used to be. What the hell. The Springs changed so freaking much. I miss home but glad I freaking left.",
                "6 injured and dude is out on bond... This system is fucked.",
                "This dude like the real life Joe dirt.",
                "Everyone thinks they're the good guy with a gun... until they aren't.",
                "\"An armed society is a polite society.\"",
                "I thought Colorado Springs was the nice part of Colorado because of the Republicans /s",
                "Where are the \"usual suspects\" comments?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New York sewage-boat explosion victim identified as veteran city engineer",
            "external_url": "https://www.nbcnews.com/news/us-news/new-york-sewage-boat-explosion-victim-identified-veteran-city-engineer-rcna209087",
            "upvotes": 566,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-new-york-sewage-boat-explosion-rc-11p-77f2ec.jpg",
            "top_comments": [
                "Chief Marine Diesel Engineer Raymond Feige, 59, died in the explosion at the North River Wastewater Resource Recovery Facility in West Harlem, the DEP said in a statement Monday. The incident occurred at around 10:30 a.m. Saturday on a boat carrying raw sewage that was docked.",
                "I've never heard of a sewage boat...why on Earth would they ship sewage and not pipe it to a treatment plant?",
                "If you saw a band called \"New York Sewage-Boat Explosion\" would you be at least curious about them?",
                "I’ve heard of explosive diarrhea, but damn…",
                "I saw sewage boat explosion and thought it might be RFK Jr, no such luck.  I feel bad that it was somebody that was actually worth something to society.",
                "No explanation on how the shit hit the fan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 6348,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "No one reads the articles.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "RIP but as a Harlem resident this man was a huge problem at the tail end of his career.",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "RIP but a fifty year career politician? This is exactly the problem."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Deputies fatally shoot Florida man who survived apparent gator attack and tried to steal their gun, sheriff says",
            "external_url": "https://www.nbcnews.com/news/us-news/deputies-fatally-shoot-florida-man-gator-attack-tried-steal-gun-rcna209128",
            "upvotes": 1243,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25526-florida-fatal-police-shooting-gator-attack-rc-925p-b8907f.jpg",
            "top_comments": [
                "It’s like they used a “Florida man” random headline generator",
                "booked and released for meth charges a week ago (⊙\\_⊙;) might explain his behavior",
                "Save you a click: Meth. It was meth.",
                "Two deputies, including a trainee, opened fire on Timothy Schulz, 42, after they deployed a stun gun that appeared to have no effect and after Schulz tried to remove a firearm from their patrol cruiser, Polk County Sheriff Grady Judd told reporters.",
                "That is definitely a Florida headline",
                "Kids this is why you don't do drugs...",
                "Is the alligator okay?",
                "Just normal everyday Polk County stuff.  Epicenter of Floridaman, including nutjob Floridaman sheriff.",
                "That's a rather misleading headline. \"Deputies fatally shot Florida man on meth-induced rampage\" would be more accurate.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "11 hospitalized, including 2 kids, after boat explosion in Florida",
            "external_url": "https://www.nbcnews.com/news/us-news/11-hospitalized-2-kids-boat-explosion-florida-rcna209138",
            "upvotes": 1380,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25527-florida-boat-explosion-rc1218a-1aa219.jpg",
            "top_comments": [
                "Antonio Rivero said he was with family members on the boat when it went up in flames.\n\n“Tried to fuel up the boat, and must have been a gas leak and, you know, spark went off and explosion,” Rivero said. “One of the guys' pants were blown off, so it was bad.”",
                "Could have been an inboard motor and they didn't use the blower before hand. If you don't use the blower to blow trapped gas fumes out before starting, you run the risk of an explosion.",
                "Money on vent fan was never turned on",
                "The greatest point in the whole story is the dog was rescued uninjured.",
                "Yeah, people don't do regular maintenance or safety checks, fuel lines or gaskets leak and then eventually a spark happens. Sadly kinda common within boating apparently.",
                "Of course it was Fort Lauderdale",
                "You gotta love the repeated reference to video footage, with none being offered in the story.",
                "Holiday weekends in Florida always turn into a flotilla of barely running and unmaintained shitboxes clogging the waterways.",
                "Sad to say probably the blower wasn’t on or the starter wasn’t a marine one. They have a screen in them as flame suppression during start up. More expensive so people cheap out and use regular starters. Same with alternators."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Penguin Waste Could Be Key to Cooling the Antarctic",
            "external_url": "https://minener.com/penguin-waste-could-be-key-to-cooling-the-antarctic/",
            "upvotes": 16,
            "date": "05/27/2025",
            "thumbnail": "https://spcdn.shortpixel.ai/spio/ret_img,q_cdnize,to_auto,s_webp:avif/minener.com/wp-content/uploads/2025/05/penguin-pooping.webp",
            "top_comments": [
                "So if cows poop less and penguins poop more, the environment can be restored? So feed cows to penguins? I plead confused. Good time to be a scatologist.",
                "And Fran Drescher could be the next pope."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House stunned as Hegseth inquiry brings up illegal wiretap claims",
            "external_url": "https://www.theguardian.com/us-news/2025/may/27/hegseth-pentagon-leak-investigation-wiretap",
            "upvotes": 684,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/531eb17c00739d970da245fe8d17823228251b16/1023_249_3601_2882/master/3601.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=192f07ecc59f0eae9cb3a1e78d4a0bdc",
            "top_comments": [
                "Of all the Republicans to draw inspiration from, why do these assholes keep going back to Nixon and McCarthy?",
                "The White House has lost confidence in a Pentagon leak investigation that Pete Hegseth used to justify firing three top aides last month, after advisers were told that the aides had supposedly been outed by an illegal warrantless National Security Agency (NSA) wiretap.\n\nThe extraordinary explanation alarmed the advisers, who also raised it with people close to JD Vance, because such a wiretap would almost certainly be unconstitutional and an even bigger scandal than a number of leaks.\n\nBut the advisers found the claim to be untrue and complained that they were being fed dubious information by Hegseth’s personal lawyer, Tim Parlatore, who had been tasked with overseeing the investigation.\n\nThe episode, as recounted by four people familiar with the matter, marked the most extraordinary twist in the investigation examining the leak of an allegedly top secret document that outlined options for the US military to reclaim the Panama canal to a reporter.\n\nThe advisers were stunned again when Parlatore denied having told anyone about an illegal NSA wiretap himself and maintained that any information he had was passed on to him by others at the Pentagon.\n\nThe leak was first attributed internally to Hegseth’s senior adviser, Dan Caldwell, who was escorted out of the Pentagon and fired last month alongside two other aides, Hegseth’s former deputy chief of staff, Darin Selnick, and the deputy defense secretary’s chief of staff Colin Carroll.\n\nBut the illegal wiretap claim and Caldwell’s denials fueled a breakdown in trust between the Pentagon and the White House, where the Trump advisers tracking the investigation have privately suggested they no longer have any idea about who or what to believe.\n\nIn particular, one Trump adviser recently told Hegseth that he did not think Caldwell – or any of the fired aides – had leaked anything, and that he suspected the investigation had been used to get rid of aides involved in the infighting with his first chief of staff, Joe Kasper.\n\nThe fraught situation is sure to increase pressure on Hegseth ahead of a Senate hearing next month, and more broadly for his office, which has been roiled by the leak investigation that has now continued for nearly a month with no new evidence or referral to the FBI.\n\nThe fallout has left Hegseth with no chief or deputy chief of staff, as he relies on six senior advisers to run his front office, which is involved in setting the direction of the defense department that has a budget of nearly $1tn and oversees more than two million troops.\n\nAnd while Hegseth’s former junior military aide Ricky Buria has effectively assumed the job of the chief of staff, the White House has blocked Hegseth from giving him the job permanently on account of his limited experience and role in internal office drama.\n\nThe Pentagon declined to comment on reporting for this story. A spokesperson for the White House said in a statement: “President Trump is confident in the secretary’s ability to ensure top leadership at the Department of Defense shares their focus on restoring a military that is focused on readiness, lethality, and excellence.”",
                "So the Republican Controlled Goverment is now illegally wiretapping it's own goverment employees in an effort to weed out anyone not loyal?  I guarantee you They are all collecting blackmail evidence on each other in case one goes down it'll be a house of cards .",
                "Oh look, watergate\n\nNothing will happen to any of them",
                "Elect a clown, expect a circus. 🤡🎪",
                "This is actually an EXTREMELY alarming development. The NSA, which has always been very strictly for spying on *foreign* threats, has been turned against top US military figures. This is a 5 alarm fire.",
                "Veep was more realistic.",
                "Saving my popcorn and a Montecristo Platinum for Hegseth's inevitable firing. I doubt he'll make the end of the fiscal year.",
                "This guy was chosen because he said he would obey an order by Trump to have the military fire on American civilians. That's his main qualification.",
                "In Trump's administration, it won't matter.\n\npeople who break the law for political reasons will be pardoned"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 2915,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "This man has no business having this job. Will health insurance not continue to cover these groups of people? If it doesn’t, this will kill people",
                "Let's see the double blind data from the peer reviewed study.",
                "Never take medical advice from a guy who had a worm eating his brain",
                "\"COVID shot\" sounds dumb, but \"flu shot\" doesn't. That's all I have to contribute here. I plan to take both as long as I can because getting really sick when I don't have to seems stupid. Also, RFK Jr. is a ding dong.",
                "They’re trying to kill us."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Forty-two people killed in central Nigeria in attacks blamed on herders",
            "external_url": "https://www.theguardian.com/world/2025/may/27/nigeria-attacks-benue",
            "upvotes": 39,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e339dd53ee138ccbd4b42968cc7f413576ac300/204_0_2040_1632/master/2040.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=538d35c3039f64d58957a2eb2b154750",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pornhub and three other adult websites face EU child safety investigation",
            "external_url": "https://www.theguardian.com/technology/2025/may/27/pornhub-three-other-adult-websites-eu-child-safety-investigation",
            "upvotes": 260,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/33ff11aebe90794ba326aa05cbd0da82721fd3a2/408_0_4080_3264/master/4080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f860db505000cb1a827495d4384cfc9",
            "top_comments": [
                "If teens want to find porn they will find porn. You don't even need to access adult orientated sites to find it. I honestly don't see the point of this. The time and money wasted here is better spent teaching kids how to use the internet safely and responsibly.",
                ">European Commission alleges the verification systems are ineffective to prevent under-18s from watching\n\nYeah, and??  That's not their job; that's the parents' job.  Car manufacturers aren't responsible for ensuring that toddlers don't play in traffic; they give the cars adequate brakes to try to prevent tragedy when possible but there's only so much they can do.  It's parents who need to make sure their kids don't end up playing somewhere dangerous, why should that be any different when it's online? \n\nBecause the only way to prevent toddlers from playing in the streets without giving any of that responsibility to the parents is to install a toddler fence on the side of every road, which would also impede *adults'* ability to access the road.  *This is exactly the same issue*.",
                "the internet will be interesting when there is no legal porn without proving ID first.    First Texas with many states to follow, now the EU.",
                "I suspect it isn't completely about minors accessing alone but also because our E.U.  *WANTS ALL YOUR DATA* and would like to know how often you watch stepbro porn tbh. Every time they want a law to gather more data it's either children or terrorists, are you for that? You have nothing to hide, right?\n\nI'm sorry I'm sceptic",
                "Where there's a wank, there's a way",
                "If we could find porn in the middle of a deep forest. Teenagers nowadays can definitely find whatever they want with the press of a few buttons.\n\nIt's inevitable.\n\n\nI still remember when I figured out I could type in boobs in Google.\n\nWhat are you gonna do? Ban search engines?",
                "> Under the DSA, the commission regulates platforms with more than 45 million users, such as Google, Meta and X, while national authorities in the 27 member states are responsible for those below this threshold.\n\nThat feels like an oddly specific number of users to set as the threshold. I wonder what the reasoning was for that particular number.\n\nRegardless, it's a good idea to require more stringent control to prevent children from accessing porn - I just don't know what method would be accepted. It does not look like the article gives examples of what would be accepted. I think entering credit card details has been banded about as an idea before, but not sure how effective that would be either. I suspect that whatever method is brought in, people would find a way to work around.",
                "As concerned as I am about restricting what we can see on the internet (it's a slippery slope), you have to admit it is a little crazy that you can Google the word \"porn\", switch to videos, turn off safe search and have unlimited results. At worst, you might need to click \"I am 18+\" before you can follow a link. That does feel irresponsible in regards to protecting children. \n\nI think a big part of the problem is there is so much free porn now and that includes weird shit. I have a hard time understanding why anyone even pays for porn. But in the earlier days of the internet, it was hard to see any porn online simply because everyone charged. They locked it down not to protect children, but to force you to pay. Maybe the solution is to charge $1 for access and the paywall is what keeps children out.\n\nETA: missing word"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 3085,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "Fat fuck frees fat fuck.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "Anybody who voted republican in 2024 should genuinely have to prove they can be trusted to participate in society when this is all over. Fucking idiots",
                "White collar fraudster pardons blue collar fraudster.",
                "so much for fighting against fraud, waste and abuse!!!!",
                "no surprise, soon diddy will be pardoned once hes found guilty and sentenced."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Thief of iconic Winston Churchill portrait 'Roaring Lion' sentenced to jail",
            "external_url": "https://www.abc.net.au/news/2025-05-27/thief-behind-iconic-churchill-portrait-theft-sentenced-to-jail/105345104",
            "upvotes": 37,
            "date": "05/27/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/3004cc405193d5500b6a32b3bd7ef9ac?impolicy=wcms_watermark_news&cropH=1310&cropW=2329&xPos=0&yPos=151&width=862&height=485&imformat=generic",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tesla's monthly sales in Europe plunge by half, signaling backlash against Musk runs deep",
            "external_url": "https://apnews.com/article/tesla-elon-musk-europe-8501d6a8370b6a22c6bec7e52de7d50c",
            "upvotes": 1336,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "EV purchases are up 30% in the EU…. They are buying, just not Tesla.",
                "And yet Tsla stock rises again today. \n\nThe market makes no sense to me.",
                "The longer the US stock is artificially propped up, the bigger the crash is going to be.\n\nThe global Q2 sales report combined with the disaster that is robotaxi launch, Tesla is doomed.",
                "Don't worry though because Tesla robots are coming to save the company. Those Europeans are gonna love robots that can throw out Hitler salutes whenever.",
                "Poor Elon, the victim",
                "There's plenty of people who had family members two or three generations back killed by the Nazis. No Nazi cars, period.",
                "Europe has a long memory when it comes to people who make nazi salutes…",
                "Who could have possibly seen this coming?",
                "Dude poisoned his own company.",
                "> Sales of Tesla vehicles in 32 European countries tumbled 49% to 7,261 in April from 14,228 in the same month the previous year, according to the figures released by the European Automobile Manufacturers’ Association, or ACEA.\n\nC'mon people, I know you can do better than this. Zero sales is the easiest target to hit and can be achieved by literally doing nothing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 6935,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "All the $ and time wasted on lawsuits.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "PBS is a national treasure."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man turns himself in after argument turned shooting that injured six in Colorado Springs",
            "external_url": "https://www.kktv.com/2025/05/26/man-arrest-connection-with-colorado-springs-shooting-that-injured-6/",
            "upvotes": 789,
            "date": "05/27/2025",
            "thumbnail": "https://gray-kktv-prod.gtv-cdn.com/resizer/v2/URUHNSJBHBDFPDEJM3YEHJMHVA.png?auth=9019873634871bb66f8cf183c6677da6f6b57a84998d750ec83b0891e3503b32&width=1200&height=600&smart=true",
            "top_comments": [
                "Average Colorado Springs moment",
                "Why the hell is he out on bond??",
                "“My, my, my.”  — Lt. Joe Kenda",
                "I grew up here and miss the small town it used to be. What the hell. The Springs changed so freaking much. I miss home but glad I freaking left.",
                "6 injured and dude is out on bond... This system is fucked.",
                "This dude like the real life Joe dirt.",
                "Everyone thinks they're the good guy with a gun... until they aren't.",
                "\"An armed society is a polite society.\"",
                "I thought Colorado Springs was the nice part of Colorado because of the Republicans /s",
                "Where are the \"usual suspects\" comments?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "White House stunned as Hegseth inquiry brings up illegal wiretap claims",
            "external_url": "https://www.theguardian.com/us-news/2025/may/27/hegseth-pentagon-leak-investigation-wiretap",
            "upvotes": 683,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/531eb17c00739d970da245fe8d17823228251b16/1023_249_3601_2882/master/3601.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=192f07ecc59f0eae9cb3a1e78d4a0bdc",
            "top_comments": [
                "Of all the Republicans to draw inspiration from, why do these assholes keep going back to Nixon and McCarthy?",
                "The White House has lost confidence in a Pentagon leak investigation that Pete Hegseth used to justify firing three top aides last month, after advisers were told that the aides had supposedly been outed by an illegal warrantless National Security Agency (NSA) wiretap.\n\nThe extraordinary explanation alarmed the advisers, who also raised it with people close to JD Vance, because such a wiretap would almost certainly be unconstitutional and an even bigger scandal than a number of leaks.\n\nBut the advisers found the claim to be untrue and complained that they were being fed dubious information by Hegseth’s personal lawyer, Tim Parlatore, who had been tasked with overseeing the investigation.\n\nThe episode, as recounted by four people familiar with the matter, marked the most extraordinary twist in the investigation examining the leak of an allegedly top secret document that outlined options for the US military to reclaim the Panama canal to a reporter.\n\nThe advisers were stunned again when Parlatore denied having told anyone about an illegal NSA wiretap himself and maintained that any information he had was passed on to him by others at the Pentagon.\n\nThe leak was first attributed internally to Hegseth’s senior adviser, Dan Caldwell, who was escorted out of the Pentagon and fired last month alongside two other aides, Hegseth’s former deputy chief of staff, Darin Selnick, and the deputy defense secretary’s chief of staff Colin Carroll.\n\nBut the illegal wiretap claim and Caldwell’s denials fueled a breakdown in trust between the Pentagon and the White House, where the Trump advisers tracking the investigation have privately suggested they no longer have any idea about who or what to believe.\n\nIn particular, one Trump adviser recently told Hegseth that he did not think Caldwell – or any of the fired aides – had leaked anything, and that he suspected the investigation had been used to get rid of aides involved in the infighting with his first chief of staff, Joe Kasper.\n\nThe fraught situation is sure to increase pressure on Hegseth ahead of a Senate hearing next month, and more broadly for his office, which has been roiled by the leak investigation that has now continued for nearly a month with no new evidence or referral to the FBI.\n\nThe fallout has left Hegseth with no chief or deputy chief of staff, as he relies on six senior advisers to run his front office, which is involved in setting the direction of the defense department that has a budget of nearly $1tn and oversees more than two million troops.\n\nAnd while Hegseth’s former junior military aide Ricky Buria has effectively assumed the job of the chief of staff, the White House has blocked Hegseth from giving him the job permanently on account of his limited experience and role in internal office drama.\n\nThe Pentagon declined to comment on reporting for this story. A spokesperson for the White House said in a statement: “President Trump is confident in the secretary’s ability to ensure top leadership at the Department of Defense shares their focus on restoring a military that is focused on readiness, lethality, and excellence.”",
                "So the Republican Controlled Goverment is now illegally wiretapping it's own goverment employees in an effort to weed out anyone not loyal?  I guarantee you They are all collecting blackmail evidence on each other in case one goes down it'll be a house of cards .",
                "Oh look, watergate\n\nNothing will happen to any of them",
                "Elect a clown, expect a circus. 🤡🎪",
                "This is actually an EXTREMELY alarming development. The NSA, which has always been very strictly for spying on *foreign* threats, has been turned against top US military figures. This is a 5 alarm fire.",
                "Veep was more realistic.",
                "Saving my popcorn and a Montecristo Platinum for Hegseth's inevitable firing. I doubt he'll make the end of the fiscal year.",
                "This guy was chosen because he said he would obey an order by Trump to have the military fire on American civilians. That's his main qualification.",
                "In Trump's administration, it won't matter.\n\npeople who break the law for political reasons will be pardoned"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tesla's monthly sales in Europe plunge by half, signaling backlash against Musk runs deep",
            "external_url": "https://apnews.com/article/tesla-elon-musk-europe-8501d6a8370b6a22c6bec7e52de7d50c",
            "upvotes": 1332,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "EV purchases are up 30% in the EU…. They are buying, just not Tesla.",
                "And yet Tsla stock rises again today. \n\nThe market makes no sense to me.",
                "The longer the US stock is artificially propped up, the bigger the crash is going to be.\n\nThe global Q2 sales report combined with the disaster that is robotaxi launch, Tesla is doomed.",
                "Don't worry though because Tesla robots are coming to save the company. Those Europeans are gonna love robots that can throw out Hitler salutes whenever.",
                "Poor Elon, the victim",
                "There's plenty of people who had family members two or three generations back killed by the Nazis. No Nazi cars, period.",
                "Europe has a long memory when it comes to people who make nazi salutes…",
                "Who could have possibly seen this coming?",
                "Dude poisoned his own company.",
                "> Sales of Tesla vehicles in 32 European countries tumbled 49% to 7,261 in April from 14,228 in the same month the previous year, according to the figures released by the European Automobile Manufacturers’ Association, or ACEA.\n\nC'mon people, I know you can do better than this. Zero sales is the easiest target to hit and can be achieved by literally doing nothing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 6928,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "All the $ and time wasted on lawsuits.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "PBS is a national treasure."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 3085,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "Fat fuck frees fat fuck.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "Anybody who voted republican in 2024 should genuinely have to prove they can be trusted to participate in society when this is all over. Fucking idiots",
                "White collar fraudster pardons blue collar fraudster.",
                "so much for fighting against fraud, waste and abuse!!!!",
                "no surprise, soon diddy will be pardoned once hes found guilty and sentenced."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 2895,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "This man has no business having this job. Will health insurance not continue to cover these groups of people? If it doesn’t, this will kill people",
                "Let's see the double blind data from the peer reviewed study.",
                "Never take medical advice from a guy who had a worm eating his brain",
                "\"COVID shot\" sounds dumb, but \"flu shot\" doesn't. That's all I have to contribute here. I plan to take both as long as I can because getting really sick when I don't have to seems stupid. Also, RFK Jr. is a ding dong.",
                "They’re trying to kill us."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New York sewage-boat explosion victim identified as veteran city engineer",
            "external_url": "https://www.nbcnews.com/news/us-news/new-york-sewage-boat-explosion-victim-identified-veteran-city-engineer-rcna209087",
            "upvotes": 562,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-new-york-sewage-boat-explosion-rc-11p-77f2ec.jpg",
            "top_comments": [
                "Chief Marine Diesel Engineer Raymond Feige, 59, died in the explosion at the North River Wastewater Resource Recovery Facility in West Harlem, the DEP said in a statement Monday. The incident occurred at around 10:30 a.m. Saturday on a boat carrying raw sewage that was docked.",
                "I've never heard of a sewage boat...why on Earth would they ship sewage and not pipe it to a treatment plant?",
                "If you saw a band called \"New York Sewage-Boat Explosion\" would you be at least curious about them?",
                "I’ve heard of explosive diarrhea, but damn…",
                "I saw sewage boat explosion and thought it might be RFK Jr, no such luck.  I feel bad that it was somebody that was actually worth something to society.",
                "No explanation on how the shit hit the fan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man turns himself in after argument turned shooting that injured six in Colorado Springs",
            "external_url": "https://www.kktv.com/2025/05/26/man-arrest-connection-with-colorado-springs-shooting-that-injured-6/",
            "upvotes": 795,
            "date": "05/27/2025",
            "thumbnail": "https://gray-kktv-prod.gtv-cdn.com/resizer/v2/URUHNSJBHBDFPDEJM3YEHJMHVA.png?auth=9019873634871bb66f8cf183c6677da6f6b57a84998d750ec83b0891e3503b32&width=1200&height=600&smart=true",
            "top_comments": [
                "Average Colorado Springs moment",
                "Why the hell is he out on bond??",
                "“My, my, my.”  — Lt. Joe Kenda",
                "I grew up here and miss the small town it used to be. What the hell. The Springs changed so freaking much. I miss home but glad I freaking left.",
                "6 injured and dude is out on bond... This system is fucked.",
                "This dude like the real life Joe dirt.",
                "Everyone thinks they're the good guy with a gun... until they aren't.",
                "\"An armed society is a polite society.\"",
                "I thought Colorado Springs was the nice part of Colorado because of the Republicans /s",
                "Where are the \"usual suspects\" comments?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Pornhub and three other adult websites face EU child safety investigation",
            "external_url": "https://www.theguardian.com/technology/2025/may/27/pornhub-three-other-adult-websites-eu-child-safety-investigation",
            "upvotes": 260,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/33ff11aebe90794ba326aa05cbd0da82721fd3a2/408_0_4080_3264/master/4080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f860db505000cb1a827495d4384cfc9",
            "top_comments": [
                "If teens want to find porn they will find porn. You don't even need to access adult orientated sites to find it. I honestly don't see the point of this. The time and money wasted here is better spent teaching kids how to use the internet safely and responsibly.",
                ">European Commission alleges the verification systems are ineffective to prevent under-18s from watching\n\nYeah, and??  That's not their job; that's the parents' job.  Car manufacturers aren't responsible for ensuring that toddlers don't play in traffic; they give the cars adequate brakes to try to prevent tragedy when possible but there's only so much they can do.  It's parents who need to make sure their kids don't end up playing somewhere dangerous, why should that be any different when it's online? \n\nBecause the only way to prevent toddlers from playing in the streets without giving any of that responsibility to the parents is to install a toddler fence on the side of every road, which would also impede *adults'* ability to access the road.  *This is exactly the same issue*.",
                "the internet will be interesting when there is no legal porn without proving ID first.    First Texas with many states to follow, now the EU.",
                "I suspect it isn't completely about minors accessing alone but also because our E.U.  *WANTS ALL YOUR DATA* and would like to know how often you watch stepbro porn tbh. Every time they want a law to gather more data it's either children or terrorists, are you for that? You have nothing to hide, right?\n\nI'm sorry I'm sceptic",
                "Where there's a wank, there's a way",
                "If we could find porn in the middle of a deep forest. Teenagers nowadays can definitely find whatever they want with the press of a few buttons.\n\nIt's inevitable.\n\n\nI still remember when I figured out I could type in boobs in Google.\n\nWhat are you gonna do? Ban search engines?",
                "> Under the DSA, the commission regulates platforms with more than 45 million users, such as Google, Meta and X, while national authorities in the 27 member states are responsible for those below this threshold.\n\nThat feels like an oddly specific number of users to set as the threshold. I wonder what the reasoning was for that particular number.\n\nRegardless, it's a good idea to require more stringent control to prevent children from accessing porn - I just don't know what method would be accepted. It does not look like the article gives examples of what would be accepted. I think entering credit card details has been banded about as an idea before, but not sure how effective that would be either. I suspect that whatever method is brought in, people would find a way to work around.",
                "As concerned as I am about restricting what we can see on the internet (it's a slippery slope), you have to admit it is a little crazy that you can Google the word \"porn\", switch to videos, turn off safe search and have unlimited results. At worst, you might need to click \"I am 18+\" before you can follow a link. That does feel irresponsible in regards to protecting children. \n\nI think a big part of the problem is there is so much free porn now and that includes weird shit. I have a hard time understanding why anyone even pays for porn. But in the earlier days of the internet, it was hard to see any porn online simply because everyone charged. They locked it down not to protect children, but to force you to pay. Maybe the solution is to charge $1 for access and the paywall is what keeps children out.\n\nETA: missing word"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Deputies fatally shoot Florida man who survived apparent gator attack and tried to steal their gun, sheriff says",
            "external_url": "https://www.nbcnews.com/news/us-news/deputies-fatally-shoot-florida-man-gator-attack-tried-steal-gun-rcna209128",
            "upvotes": 1245,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25526-florida-fatal-police-shooting-gator-attack-rc-925p-b8907f.jpg",
            "top_comments": [
                "It’s like they used a “Florida man” random headline generator",
                "booked and released for meth charges a week ago (⊙\\_⊙;) might explain his behavior",
                "Save you a click: Meth. It was meth.",
                "Two deputies, including a trainee, opened fire on Timothy Schulz, 42, after they deployed a stun gun that appeared to have no effect and after Schulz tried to remove a firearm from their patrol cruiser, Polk County Sheriff Grady Judd told reporters.",
                "That is definitely a Florida headline",
                "Kids this is why you don't do drugs...",
                "Is the alligator okay?",
                "Just normal everyday Polk County stuff.  Epicenter of Floridaman, including nutjob Floridaman sheriff.",
                "That's a rather misleading headline. \"Deputies fatally shot Florida man on meth-induced rampage\" would be more accurate.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "11 hospitalized, including 2 kids, after boat explosion in Florida",
            "external_url": "https://www.nbcnews.com/news/us-news/11-hospitalized-2-kids-boat-explosion-florida-rcna209138",
            "upvotes": 1375,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25527-florida-boat-explosion-rc1218a-1aa219.jpg",
            "top_comments": [
                "Antonio Rivero said he was with family members on the boat when it went up in flames.\n\n“Tried to fuel up the boat, and must have been a gas leak and, you know, spark went off and explosion,” Rivero said. “One of the guys' pants were blown off, so it was bad.”",
                "Could have been an inboard motor and they didn't use the blower before hand. If you don't use the blower to blow trapped gas fumes out before starting, you run the risk of an explosion.",
                "Money on vent fan was never turned on",
                "The greatest point in the whole story is the dog was rescued uninjured.",
                "Yeah, people don't do regular maintenance or safety checks, fuel lines or gaskets leak and then eventually a spark happens. Sadly kinda common within boating apparently.",
                "Of course it was Fort Lauderdale",
                "You gotta love the repeated reference to video footage, with none being offered in the story.",
                "Holiday weekends in Florida always turn into a flotilla of barely running and unmaintained shitboxes clogging the waterways.",
                "Sad to say probably the blower wasn’t on or the starter wasn’t a marine one. They have a screen in them as flame suppression during start up. More expensive so people cheap out and use regular starters. Same with alternators."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/27/2025 16:11:29 UTC"
}