{
    "posts": [
        {
            "category": "HOT",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 16759,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "How many Scaramuccis did he last?",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "Patel is not fit to run anything.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Ok, so what's this a distraction for?",
                "Did they realize he was a DEI hire as well? 🥸"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Dramatic sell-off of US government bonds as tariff war panic deepens | Bonds",
            "external_url": "https://www.theguardian.com/business/2025/apr/09/dramatic-sell-off-of-us-government-bonds-as-tariff-war-panic-deepens",
            "upvotes": 3005,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2f63b4a2b6881319e7daba96702e5b867fa7474/0_261_7837_4703/master/7837.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e6ad02d29bd98f16e70bf59bab06db6",
            "top_comments": [
                "imagine starting a tariff war as a bluff and destroying the basis of your economy (for over 100 years) in one go.",
                "Didn’t Trump pussy out of his tariffs because of the bond sell off?",
                "Who’d thought there’d be consequences for dramatically changing policy multiple times over the last two months with little rhyme or reason?!",
                "The stock indices rebounding are more smoke and mirrors than anything and reflect terrible policy and reversal with this 90 day reprieve. But the capriciousness of this debacle will continue to destabilize markets. Bottom line is the US economy has suffered irreparable harm with countries no longer wanting to buy our debt as a result. This is the lasting impact not one day of stock market bounce back.",
                "I’ve been thinking about this really old Reddit comment from 10 years ago about what to do if you win the lottery. \n\nhttps://www.reddit.com/r/AskReddit/s/RshgA8abNn\n\nParticularly these passages:\n\n> Right now, you’ll get around 3.5% on the 10 year U.S. treasury. With $18.2 million (20% of $91.2 mil after your absurdly generous family gift) invested in those you will pull down $638,400 per year. If everything else blows up, you still have that, and you will be in the top 1% of income in the United States. So how about you not fuck with it. Eh? And that’s income that is damn safe. **If we get to the point where the United States defaults on those instruments, we are in far worse shape than worrying about money.**\n\n> If you are really paranoid, you might consider picking another G7 or otherwise mainstream country other than the U.S. according to where you want to live **if the United States dissolves into anarchy or Britney Spears is elected to the United States Senate.**\n\n> You have provided for your family beyond your wildest dreams. And you still have $36.4 million in “cash.” You know you will be getting $638,400 per year **unless the capital building is burning**",
                "Why would any reasonable nation trust this demented ogre of a narcissist",
                "Hey that's a thing my money is based off of!\n\n\nSure am glad this will cost me nothing!",
                "So this means the dollar no longer holds any value, right? If no one is willing to buy these bonds, then the US is basically insolvent.",
                "This article is from 4/9.\n\nThis is part of the reason, if not the whole reason, Trump backed off on the tariffs today (4/10).\n\nEdit: messed up my dates. The article is from 12:57p today, the bond sell off started spiking overnight on 4/8 and in the am on 4/9, and preceded Trump's pause of his tariffs.",
                "Bankruptcy number 7 incoming. It's really too bad the rest of the USA will have to pay for it"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 27790,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "When the bond and dollar fail, what happens?",
                "My theory is Trump is being used to destroy the U.S and then just move to Russia to sleep in Putins bed."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 15122,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "Trump timed his comment so his rich friends get richer on the market.",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\".",
                "At some point, there begins to be no other rational explanation other than these tariff headlines are for insider trading.\n\nThis is the most inconsistent trade policy I have ever seen..."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "HOT",
            "title": "OpenAI countersues Elon Musk, claims harassment",
            "external_url": "https://www.reuters.com/legal/openai-countersues-elon-musk-claims-harassment-2025-04-09/",
            "upvotes": 2774,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Court filing can be found here: https://storage.courtlistener.com/recap/gov.uscourts.cand.433688/gov.uscourts.cand.433688.147.0.pdf",
                "Good luck OpenAI. All your judges belong to them.",
                "OpenAI chooses to represent itself, Grok preparing its case.",
                "This dude can not get out of his own way.  He had it all, and here we are.",
                "“What were the 2020s like?”\n\n“It was very stupid and annoying”",
                "Elon Musk is just a gigantic bitch. What else is there to say. Huge bitch.",
                "can they please both lose?",
                "Why is his head and hat so weird. AI couldn’t even fuck I’m that much.",
                "“Kids, kids, you’re both just…awful”",
                "The girls are fighting!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Trump tariffs spark US government debt sell-off",
            "external_url": "https://www.bbc.com/news/articles/c5yrr0e7499o",
            "upvotes": 25272,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e4c/live/1d4d0e70-1533-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                "Fucking Christ if US bonds go off a cliff, what else is left. That shit is supposed to be a gold standard in investment.",
                "Don’t forget - Trump is only able to do this because Republicans refuse to rein him in. This is a Republican problem. ",
                "Trump said if I voted for Kamala the economy would be in ruin. And I gotta say, he clocked it right. I voted for her and the economy is in shambles.",
                "Donald Trump has broken his own record as the worst president of All time.\n\nHe has betrayed the American people including his voters who were hoping that the prices would go down.",
                "China has a LOT or Treasuries to offload - no interest rate cuts",
                "*Some analysts suggested that America's central bank - the US Federal Reserve - might be forced to step in if turbulence continues, in a move reminiscent of the Bank of England's emergency action in 2022 following Liz Truss's mini-Budget.*\n\n*”We see no other option for the Fed but to step in with emergency purchases of US Treasuries to stabilise the bond market,\" said George Saravelos, global head of FX research at Deutsche Bank.*\n\nLoL, all the pro-Trump “sound money” folks railed against exactly this during the quantitative easing of 2008+. Now they’ll turn around on a dime and be all for it. Anything to defend the Trump regime.\n\nQuacks, every last one of them.",
                "I am not informed enough to understand how one person has that much power in the United States.\n\nCongress is currently talking about limiting the President's power over tariffs and my reaction is... why didn't they have power over this to begin with?\n\nHow can we not cancel $10k in student loans without congressional approval, but the President can trigger a great depression and global recession without congressional approval?",
                "The GOP budget resolution adds 5 trillion to the debt ceiling. People are understanding USA has no intention on paying off its debt. That's 5 trillion uncollected taxes from the rich. To put it in easier to understand numbers: 5,000,000,000,000/150,000,000 taxpayers = about $32,000 debt increase per person who filed taxes last year. The tariffs are a smokescreen and we are getting robbed.",
                "Guys, I think it’s very clear that loomer sucked whatever little intelligence Trump had, right out of his baby carrot. This man defies logic every time he opens his mouth. ",
                "For the MAGA people, Trump could burn your house down and shit in your mouth and you'd thank him for the warmth and what he ate beforehand."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ice director wants to run deportations like ‘Amazon Prime for human beings’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon",
            "upvotes": 985,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/859c33001990f401c9456143c4275fddf3f21c02/0_207_6219_3731/master/6219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e4d70ae77846cf21d58ce3666624a675",
            "top_comments": [
                "He has his list. Someone should be keeping our list.",
                "What the fuck.... ಠ⁠_⁠ಠ How depraved can some people be.",
                "That's odd: my Amazon packages were never  \"entitled to notice and an opportunity to challenge their removal\"\n\nDo you think the Director of ICE has heard about the legal requirement to notify these 'packages', or a requirement they're allowed a court hearing?\n\nThe dehumanizing language this 'person' uses is nauseating.  This \"great\" country has been handed to slithering snakes.",
                "satan is going to read this back to him when welcoming him to hell.",
                "Jesus Christ, the fact that this came out of his mouth...my Nazi killing grandfather is spinning in his grave.",
                "I'm surprised he acknowledged they are human beings.",
                "So we are just going to sleep walk into a grim dark future.",
                "Does anyone still doubt the holocaust could happen again tomorrow?",
                "I’ve said elsewhere, I will door knock for any Democrat who runs on putting these depraved people in the same El Salvadoran prison they’re so giddy to disappear people to.",
                "Same day delivery in select metropolitan areas?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Dow surges 2,000 points, Nasdaq jumps 8% after Trump signals a 90-day pause on some tariffs",
            "external_url": "https://www.cnbc.com/2025/04/08/stock-market-today-live-updates-.html",
            "upvotes": 4759,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129399-1744224488918-108129399-17442233882025-04-09t182555z_1576829729_rc2iuda41xcc_rtrmadp_0_usa-stocks.jpg?v=1744228854&w=1920&h=1080",
            "top_comments": [
                "This shit is so manipulated\n\n\nThe broligarchs are making hundreds of billions with insider trading here\n\n\nShort the market before announcing new tariffs, and buy before announcing negotiations & pauses",
                "Now every market acts like crypto",
                "So is it legal to manipulate stocks now ???",
                "He's manipulating markets and telling his private signal chat when to buy/sell",
                "It is still an increase on tariffs, just not as bad for 90 days. Of course, who knows what he will think tomorrow or the day after that.",
                "Marjorie Taylor Greene bought a significant amount of SPY right before the announcement. She had never before bought SPY before that. She can't be the only one, just the only one I've seen so far. \n\n\nThis shit is 100% manipulation. ",
                "I wonder how many of his sycophants bought this morning, knowing this was coming.",
                "I feel nobody is bring attention to \"some tariffs\".  It's still bad and many are still 10%.",
                "Let’s not pretend he did anything beneficial except recoup some losses he created",
                "A whole lot of insiders got much much richer off of this market manipulation. \n\nI guess the entire plan is to keep doing things like this until mid-terms. President, Congressmen and Bros get richer. They lose their seats to Democrats and then Democrats get blamed for the failing economy. And that leads right back to electing another Republican to “fix” something that they broke."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "US to announce new tariffs on pharmaceutical imports",
            "external_url": "https://www.bbc.com/news/articles/cedyylj1v32o",
            "upvotes": 6555,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5c43/live/3c6964d0-1537-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                ">India supplies nearly half of all US generics, or cheaper versions of popular drugs, saving the country billions in healthcare costs.\n\nThe news just keeps getting better, doesn't it?",
                "All I want to do is live, work, and enjoy a little bit of time I have on this planet. But I can barely afford the meds I need to live now and its gonna go up? Fuck this dude. All I did was contract an autoimmune disease as a fucking child and now I'm forced to be in debt for the rest of my life? Fuck this guy, fuck his voters, fuck his followers. You are the evil ones. ",
                "He REALLY is trying to tank the market, isn't he",
                "More expensive healthcare for people that can't afford it sounds like good policy. They just need to wait another 7 years until factories open up in the US so they can get cheap drugs again ",
                "Guess we need to get a much bigger fan again",
                "Every time the stocks start ticking up he announces another move to try to get it back in the red. The trump administration is intentionally tanking the economy and they should all be removed from office for this treason",
                "I cant wrap my head around it. They are cutting the medicaid/medicare budget while simultaneously raising the cost of drugs. Which in turn will cost the programs more money. It just doesn't make sense.",
                "realize there are posting rules, but true headlines would read ‘Republicans to announce …’  They need to own this and we need to remind them every chance we have",
                "A lot of Americans about to lose their feet.",
                "The party of \"keep them sick and let them die\"."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump sued by Democrat he removed from US civil rights agency",
            "external_url": "https://www.reuters.com/legal/trump-sued-by-democrat-he-removed-us-civil-rights-agency-2025-04-09/",
            "upvotes": 4122,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "not like trump has money to pay out a suit anyways ",
                "Another cut and dried case against him that will like go absolutely nowhere any time soon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Ice director wants to run deportations like ‘Amazon Prime for human beings’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon",
            "upvotes": 981,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/859c33001990f401c9456143c4275fddf3f21c02/0_207_6219_3731/master/6219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e4d70ae77846cf21d58ce3666624a675",
            "top_comments": [
                "He has his list. Someone should be keeping our list.",
                "What the fuck.... ಠ⁠_⁠ಠ How depraved can some people be.",
                "That's odd: my Amazon packages were never  \"entitled to notice and an opportunity to challenge their removal\"\n\nDo you think the Director of ICE has heard about the legal requirement to notify these 'packages', or a requirement they're allowed a court hearing?\n\nThe dehumanizing language this 'person' uses is nauseating.  This \"great\" country has been handed to slithering snakes.",
                "satan is going to read this back to him when welcoming him to hell.",
                "Jesus Christ, the fact that this came out of his mouth...my Nazi killing grandfather is spinning in his grave.",
                "I'm surprised he acknowledged they are human beings.",
                "So we are just going to sleep walk into a grim dark future.",
                "Does anyone still doubt the holocaust could happen again tomorrow?",
                "I’ve said elsewhere, I will door knock for any Democrat who runs on putting these depraved people in the same El Salvadoran prison they’re so giddy to disappear people to.",
                "Same day delivery in select metropolitan areas?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "US, Vietnam agree to launch trade deal talks as tariffs paused",
            "external_url": "https://www.reuters.com/world/asia-pacific/us-vietnam-agree-launch-trade-deal-talks-tariffs-paused-2025-04-10/",
            "upvotes": 210,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I, for one, am excited for my low-paid factory job making cheap manufactured goods that Vietnamese consumers will be able to afford.",
                "Vietnam has been trying to get a trade deal with us ever since we changed our minds on the TPP, which was cancelled in part due to Trump. The amount of schizophrenia Trump has on trade deals is unreal.",
                "This administration is a cornucopia of incompetence and shit, making America look like a joke. ",
                "I can’t wait for this deal with Vietnam to make the price of groceries go down.",
                "Nintendo switch 2 fans will be so happy",
                "I wonder how much begging the Vietnamese did to get this agreement.",
                "The irony: the major manufacturers in China own and operate a shit load of the factories and manufacturing in Vietnam. \n\nSo this is a back door to working around the insane tariffs placed on China.",
                "Nike and Apple are praying, and Phở Restaurants I guess",
                "If I were Vietnam, I would not put my rare minerals on the table.  Just tighten up a little on the \"trade fraud.\"",
                "It almost sounds like Trump’s ploy worked"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Attorney representing a student protestor detained by federal immigration agents",
            "external_url": "https://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
            "upvotes": 363,
            "date": "04/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1638x921+0+201/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffb%2F1d%2F7e2e76fd4e98926d3eafe5439585%2Famir.jpeg",
            "top_comments": [
                "Dystopian. The agents that are following Trumps orders are terrible human beings. I can’t imagine detaining innocent people knowing the impact it may have on them and their loved ones",
                "ICE is the new Gestapo now.",
                "In before we see comments defending the agents by saying, “He refused to show his phone. If he showed his phone, he wouldn’t have remained detained.” Or my favorite, “We don’t know the fully story. He could’ve been a terrorist, we just don’t know,” yet was allowed to leave after an unjust and racist detainment",
                "They're just trying to scare all of us at this point."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "AI-generated lawyer sparks courtroom controversy in New York",
            "external_url": "https://www.fox5ny.com/news/ny-ai-generated-lawyer-courtroom",
            "upvotes": 172,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/04/1280/720/snapshot-2025-04-07t181723.616.jpg?ve=1&tl=1",
            "top_comments": [
                "I just imagined a world in which two AI lawyers present to an AI judge and suddenly people are being convicted and sent to prison on the basis of two AIs trying to convince another AI to do what they want without any human oversight whatsoever.",
                "The AI Glen Powell Esq. got about five seconds into \"I come before this panel a humble pro-se....\" before the presiding judge stopped it.\n\nThis guy got permission to present a recorded oral argument, because he had throat cancer 25 years ago and says he has difficulty speaking.  But he's been before a trial court and this appeals court in the past, and spoken with the court staff at length.\n\n\nHe proceeded to deliver his scripted argument, with little difficulty.   The other party's attorney stammered more than the appellant did.\n\nHe didn't make a terrible argument about arbitration clauses in employment contracts, but he could have left out the Mangione reference and the three-card monte allegory.\n\nTurns out this guy's got a colorful history as a marijuana activist, an expat in Russia, and a non-profit fraud felony convict.",
                "Misleading headline.\n\n> Plaintiff Jerome Dewald was in court two weeks ago for an employment dispute when he tried to play a video to present his case. The video featured an AI-generated avatar he created to act as his legal representative.\n\nIt wasn’t an AI arguing his case in real time. It was a video he made with AI.",
                "[I knew I didn't start that fire...](https://youtu.be/XL2RLTmqG4w?si=f07Fk39TfO18-BvS)",
                "[deleted]",
                "These judges need to protect their own kind.",
                "im ready for an AI President. a type of president that cannot be bought... bc its AI lol. impervious to the flaws of humans and uncorruptable. so when do i sign up?"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Dramatic sell-off of US government bonds as tariff war panic deepens | Bonds",
            "external_url": "https://www.theguardian.com/business/2025/apr/09/dramatic-sell-off-of-us-government-bonds-as-tariff-war-panic-deepens",
            "upvotes": 3008,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2f63b4a2b6881319e7daba96702e5b867fa7474/0_261_7837_4703/master/7837.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e6ad02d29bd98f16e70bf59bab06db6",
            "top_comments": [
                "imagine starting a tariff war as a bluff and destroying the basis of your economy (for over 100 years) in one go.",
                "Didn’t Trump pussy out of his tariffs because of the bond sell off?",
                "Who’d thought there’d be consequences for dramatically changing policy multiple times over the last two months with little rhyme or reason?!",
                "The stock indices rebounding are more smoke and mirrors than anything and reflect terrible policy and reversal with this 90 day reprieve. But the capriciousness of this debacle will continue to destabilize markets. Bottom line is the US economy has suffered irreparable harm with countries no longer wanting to buy our debt as a result. This is the lasting impact not one day of stock market bounce back.",
                "I’ve been thinking about this really old Reddit comment from 10 years ago about what to do if you win the lottery. \n\nhttps://www.reddit.com/r/AskReddit/s/RshgA8abNn\n\nParticularly these passages:\n\n> Right now, you’ll get around 3.5% on the 10 year U.S. treasury. With $18.2 million (20% of $91.2 mil after your absurdly generous family gift) invested in those you will pull down $638,400 per year. If everything else blows up, you still have that, and you will be in the top 1% of income in the United States. So how about you not fuck with it. Eh? And that’s income that is damn safe. **If we get to the point where the United States defaults on those instruments, we are in far worse shape than worrying about money.**\n\n> If you are really paranoid, you might consider picking another G7 or otherwise mainstream country other than the U.S. according to where you want to live **if the United States dissolves into anarchy or Britney Spears is elected to the United States Senate.**\n\n> You have provided for your family beyond your wildest dreams. And you still have $36.4 million in “cash.” You know you will be getting $638,400 per year **unless the capital building is burning**",
                "Why would any reasonable nation trust this demented ogre of a narcissist",
                "Hey that's a thing my money is based off of!\n\n\nSure am glad this will cost me nothing!",
                "So this means the dollar no longer holds any value, right? If no one is willing to buy these bonds, then the US is basically insolvent.",
                "This article is from 4/9.\n\nThis is part of the reason, if not the whole reason, Trump backed off on the tariffs today (4/10).\n\nEdit: messed up my dates. The article is from 12:57p today, the bond sell off started spiking overnight on 4/8 and in the am on 4/9, and preceded Trump's pause of his tariffs.",
                "Bankruptcy number 7 incoming. It's really too bad the rest of the USA will have to pay for it"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "OpenAI countersues Elon Musk, claims harassment",
            "external_url": "https://www.reuters.com/legal/openai-countersues-elon-musk-claims-harassment-2025-04-09/",
            "upvotes": 2776,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Court filing can be found here: https://storage.courtlistener.com/recap/gov.uscourts.cand.433688/gov.uscourts.cand.433688.147.0.pdf",
                "Good luck OpenAI. All your judges belong to them.",
                "OpenAI chooses to represent itself, Grok preparing its case.",
                "This dude can not get out of his own way.  He had it all, and here we are.",
                "“What were the 2020s like?”\n\n“It was very stupid and annoying”",
                "Elon Musk is just a gigantic bitch. What else is there to say. Huge bitch.",
                "can they please both lose?",
                "Why is his head and hat so weird. AI couldn’t even fuck I’m that much.",
                "“Kids, kids, you’re both just…awful”",
                "The girls are fighting!"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 16754,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "How many Scaramuccis did he last?",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "Patel is not fit to run anything.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Ok, so what's this a distraction for?",
                "Did they realize he was a DEI hire as well? 🥸"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Dow surges 2,000 points, Nasdaq jumps 8% after Trump signals a 90-day pause on some tariffs",
            "external_url": "https://www.cnbc.com/2025/04/08/stock-market-today-live-updates-.html",
            "upvotes": 4763,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129399-1744224488918-108129399-17442233882025-04-09t182555z_1576829729_rc2iuda41xcc_rtrmadp_0_usa-stocks.jpg?v=1744228854&w=1920&h=1080",
            "top_comments": [
                "This shit is so manipulated\n\n\nThe broligarchs are making hundreds of billions with insider trading here\n\n\nShort the market before announcing new tariffs, and buy before announcing negotiations & pauses",
                "Now every market acts like crypto",
                "So is it legal to manipulate stocks now ???",
                "He's manipulating markets and telling his private signal chat when to buy/sell",
                "It is still an increase on tariffs, just not as bad for 90 days. Of course, who knows what he will think tomorrow or the day after that.",
                "Marjorie Taylor Greene bought a significant amount of SPY right before the announcement. She had never before bought SPY before that. She can't be the only one, just the only one I've seen so far. \n\n\nThis shit is 100% manipulation. ",
                "I wonder how many of his sycophants bought this morning, knowing this was coming.",
                "I feel nobody is bring attention to \"some tariffs\".  It's still bad and many are still 10%.",
                "Let’s not pretend he did anything beneficial except recoup some losses he created",
                "A whole lot of insiders got much much richer off of this market manipulation. \n\nI guess the entire plan is to keep doing things like this until mid-terms. President, Congressmen and Bros get richer. They lose their seats to Democrats and then Democrats get blamed for the failing economy. And that leads right back to electing another Republican to “fix” something that they broke."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 15109,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "Trump timed his comment so his rich friends get richer on the market.",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\".",
                "At some point, there begins to be no other rational explanation other than these tariff headlines are for insider trading.\n\nThis is the most inconsistent trade policy I have ever seen..."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Prisoner in Arizona serving 16 consecutive life sentences is accused of killing three inmates",
            "external_url": "https://www.nbcnews.com/news/us-news/prisoner-arizona-serving-16-consecutive-life-sentences-accused-killing-rcna200304",
            "upvotes": 2307,
            "date": "04/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250408-tucson-arizona-state-prison-complex-google-maps-ac-834p-c86e37.jpg",
            "top_comments": [
                "What's he got to lose at this point?",
                "A guy who's never getting out: *that's* your first-round draft pick for jail-house enforcer.",
                "So, 19 consecutive life sentences?",
                "\"What are you gonna do, imprison me?\"\n\n-man imprisoned",
                "If you're congratulating the prisoner for killing rapists please look up the guy's name. He is also a rapist and held a woman hostage for 2 weeks in a prison watch tower doing God knows what to her.",
                "The question i have is why was he put in the same pod as those chomos??  Staff HAD to know how that would pan out.",
                "What's the difference between 16 and 19 life sentences from a practical standpoint?",
                "Whoa, I just recently listened to the podcast episode of \"I Survived...\" where his female guard hostage from 2004, Lois Fraley, told her story. It was INTENSE. This guy sounds terrifying. I can't help but wonder what Lois Fraley might be thinking reading about this today. Maybe she would have been contacted about it ahead of time?",
                "In for a penny, in for a pound!",
                "That dude is just a prison enforcer. Quid Pro Quo"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "OpenAI countersues Elon Musk, claims harassment",
            "external_url": "https://www.reuters.com/legal/openai-countersues-elon-musk-claims-harassment-2025-04-09/",
            "upvotes": 2777,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Court filing can be found here: https://storage.courtlistener.com/recap/gov.uscourts.cand.433688/gov.uscourts.cand.433688.147.0.pdf",
                "Good luck OpenAI. All your judges belong to them.",
                "OpenAI chooses to represent itself, Grok preparing its case.",
                "This dude can not get out of his own way.  He had it all, and here we are.",
                "“What were the 2020s like?”\n\n“It was very stupid and annoying”",
                "Elon Musk is just a gigantic bitch. What else is there to say. Huge bitch.",
                "can they please both lose?",
                "Why is his head and hat so weird. AI couldn’t even fuck I’m that much.",
                "“Kids, kids, you’re both just…awful”",
                "The girls are fighting!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Attorney representing a student protestor detained by federal immigration agents",
            "external_url": "https://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
            "upvotes": 360,
            "date": "04/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1638x921+0+201/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffb%2F1d%2F7e2e76fd4e98926d3eafe5439585%2Famir.jpeg",
            "top_comments": [
                "Dystopian. The agents that are following Trumps orders are terrible human beings. I can’t imagine detaining innocent people knowing the impact it may have on them and their loved ones",
                "ICE is the new Gestapo now.",
                "In before we see comments defending the agents by saying, “He refused to show his phone. If he showed his phone, he wouldn’t have remained detained.” Or my favorite, “We don’t know the fully story. He could’ve been a terrorist, we just don’t know,” yet was allowed to leave after an unjust and racist detainment",
                "They're just trying to scare all of us at this point."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Ice director wants to run deportations like ‘Amazon Prime for human beings’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon",
            "upvotes": 984,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/859c33001990f401c9456143c4275fddf3f21c02/0_207_6219_3731/master/6219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e4d70ae77846cf21d58ce3666624a675",
            "top_comments": [
                "He has his list. Someone should be keeping our list.",
                "What the fuck.... ಠ⁠_⁠ಠ How depraved can some people be.",
                "That's odd: my Amazon packages were never  \"entitled to notice and an opportunity to challenge their removal\"\n\nDo you think the Director of ICE has heard about the legal requirement to notify these 'packages', or a requirement they're allowed a court hearing?\n\nThe dehumanizing language this 'person' uses is nauseating.  This \"great\" country has been handed to slithering snakes.",
                "satan is going to read this back to him when welcoming him to hell.",
                "Jesus Christ, the fact that this came out of his mouth...my Nazi killing grandfather is spinning in his grave.",
                "I'm surprised he acknowledged they are human beings.",
                "So we are just going to sleep walk into a grim dark future.",
                "Does anyone still doubt the holocaust could happen again tomorrow?",
                "I’ve said elsewhere, I will door knock for any Democrat who runs on putting these depraved people in the same El Salvadoran prison they’re so giddy to disappear people to.",
                "Same day delivery in select metropolitan areas?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Dramatic sell-off of US government bonds as tariff war panic deepens | Bonds",
            "external_url": "https://www.theguardian.com/business/2025/apr/09/dramatic-sell-off-of-us-government-bonds-as-tariff-war-panic-deepens",
            "upvotes": 3014,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2f63b4a2b6881319e7daba96702e5b867fa7474/0_261_7837_4703/master/7837.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e6ad02d29bd98f16e70bf59bab06db6",
            "top_comments": [
                "imagine starting a tariff war as a bluff and destroying the basis of your economy (for over 100 years) in one go.",
                "Didn’t Trump pussy out of his tariffs because of the bond sell off?",
                "Who’d thought there’d be consequences for dramatically changing policy multiple times over the last two months with little rhyme or reason?!",
                "The stock indices rebounding are more smoke and mirrors than anything and reflect terrible policy and reversal with this 90 day reprieve. But the capriciousness of this debacle will continue to destabilize markets. Bottom line is the US economy has suffered irreparable harm with countries no longer wanting to buy our debt as a result. This is the lasting impact not one day of stock market bounce back.",
                "I’ve been thinking about this really old Reddit comment from 10 years ago about what to do if you win the lottery. \n\nhttps://www.reddit.com/r/AskReddit/s/RshgA8abNn\n\nParticularly these passages:\n\n> Right now, you’ll get around 3.5% on the 10 year U.S. treasury. With $18.2 million (20% of $91.2 mil after your absurdly generous family gift) invested in those you will pull down $638,400 per year. If everything else blows up, you still have that, and you will be in the top 1% of income in the United States. So how about you not fuck with it. Eh? And that’s income that is damn safe. **If we get to the point where the United States defaults on those instruments, we are in far worse shape than worrying about money.**\n\n> If you are really paranoid, you might consider picking another G7 or otherwise mainstream country other than the U.S. according to where you want to live **if the United States dissolves into anarchy or Britney Spears is elected to the United States Senate.**\n\n> You have provided for your family beyond your wildest dreams. And you still have $36.4 million in “cash.” You know you will be getting $638,400 per year **unless the capital building is burning**",
                "Why would any reasonable nation trust this demented ogre of a narcissist",
                "Hey that's a thing my money is based off of!\n\n\nSure am glad this will cost me nothing!",
                "So this means the dollar no longer holds any value, right? If no one is willing to buy these bonds, then the US is basically insolvent.",
                "This article is from 4/9.\n\nThis is part of the reason, if not the whole reason, Trump backed off on the tariffs today (4/10).\n\nEdit: messed up my dates. The article is from 12:57p today, the bond sell off started spiking overnight on 4/8 and in the am on 4/9, and preceded Trump's pause of his tariffs.",
                "Bankruptcy number 7 incoming. It's really too bad the rest of the USA will have to pay for it"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US, Vietnam agree to launch trade deal talks as tariffs paused",
            "external_url": "https://www.reuters.com/world/asia-pacific/us-vietnam-agree-launch-trade-deal-talks-tariffs-paused-2025-04-10/",
            "upvotes": 210,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I, for one, am excited for my low-paid factory job making cheap manufactured goods that Vietnamese consumers will be able to afford.",
                "Vietnam has been trying to get a trade deal with us ever since we changed our minds on the TPP, which was cancelled in part due to Trump. The amount of schizophrenia Trump has on trade deals is unreal.",
                "This administration is a cornucopia of incompetence and shit, making America look like a joke. ",
                "I can’t wait for this deal with Vietnam to make the price of groceries go down.",
                "Nintendo switch 2 fans will be so happy",
                "I wonder how much begging the Vietnamese did to get this agreement.",
                "The irony: the major manufacturers in China own and operate a shit load of the factories and manufacturing in Vietnam. \n\nSo this is a back door to working around the insane tariffs placed on China.",
                "Nike and Apple are praying, and Phở Restaurants I guess",
                "If I were Vietnam, I would not put my rare minerals on the table.  Just tighten up a little on the \"trade fraud.\"",
                "It almost sounds like Trump’s ploy worked"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 16757,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "How many Scaramuccis did he last?",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "Patel is not fit to run anything.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Ok, so what's this a distraction for?",
                "Did they realize he was a DEI hire as well? 🥸"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "AI-generated lawyer sparks courtroom controversy in New York",
            "external_url": "https://www.fox5ny.com/news/ny-ai-generated-lawyer-courtroom",
            "upvotes": 171,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/04/1280/720/snapshot-2025-04-07t181723.616.jpg?ve=1&tl=1",
            "top_comments": [
                "I just imagined a world in which two AI lawyers present to an AI judge and suddenly people are being convicted and sent to prison on the basis of two AIs trying to convince another AI to do what they want without any human oversight whatsoever.",
                "The AI Glen Powell Esq. got about five seconds into \"I come before this panel a humble pro-se....\" before the presiding judge stopped it.\n\nThis guy got permission to present a recorded oral argument, because he had throat cancer 25 years ago and says he has difficulty speaking.  But he's been before a trial court and this appeals court in the past, and spoken with the court staff at length.\n\n\nHe proceeded to deliver his scripted argument, with little difficulty.   The other party's attorney stammered more than the appellant did.\n\nHe didn't make a terrible argument about arbitration clauses in employment contracts, but he could have left out the Mangione reference and the three-card monte allegory.\n\nTurns out this guy's got a colorful history as a marijuana activist, an expat in Russia, and a non-profit fraud felony convict.",
                "Misleading headline.\n\n> Plaintiff Jerome Dewald was in court two weeks ago for an employment dispute when he tried to play a video to present his case. The video featured an AI-generated avatar he created to act as his legal representative.\n\nIt wasn’t an AI arguing his case in real time. It was a video he made with AI.",
                "[I knew I didn't start that fire...](https://youtu.be/XL2RLTmqG4w?si=f07Fk39TfO18-BvS)",
                "[deleted]",
                "These judges need to protect their own kind.",
                "im ready for an AI President. a type of president that cannot be bought... bc its AI lol. impervious to the flaws of humans and uncorruptable. so when do i sign up?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Dow surges 2,000 points, Nasdaq jumps 8% after Trump signals a 90-day pause on some tariffs",
            "external_url": "https://www.cnbc.com/2025/04/08/stock-market-today-live-updates-.html",
            "upvotes": 4759,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129399-1744224488918-108129399-17442233882025-04-09t182555z_1576829729_rc2iuda41xcc_rtrmadp_0_usa-stocks.jpg?v=1744228854&w=1920&h=1080",
            "top_comments": [
                "This shit is so manipulated\n\n\nThe broligarchs are making hundreds of billions with insider trading here\n\n\nShort the market before announcing new tariffs, and buy before announcing negotiations & pauses",
                "Now every market acts like crypto",
                "So is it legal to manipulate stocks now ???",
                "He's manipulating markets and telling his private signal chat when to buy/sell",
                "It is still an increase on tariffs, just not as bad for 90 days. Of course, who knows what he will think tomorrow or the day after that.",
                "Marjorie Taylor Greene bought a significant amount of SPY right before the announcement. She had never before bought SPY before that. She can't be the only one, just the only one I've seen so far. \n\n\nThis shit is 100% manipulation. ",
                "I wonder how many of his sycophants bought this morning, knowing this was coming.",
                "I feel nobody is bring attention to \"some tariffs\".  It's still bad and many are still 10%.",
                "Let’s not pretend he did anything beneficial except recoup some losses he created",
                "A whole lot of insiders got much much richer off of this market manipulation. \n\nI guess the entire plan is to keep doing things like this until mid-terms. President, Congressmen and Bros get richer. They lose their seats to Democrats and then Democrats get blamed for the failing economy. And that leads right back to electing another Republican to “fix” something that they broke."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 27797,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "When the bond and dollar fail, what happens?",
                "My theory is Trump is being used to destroy the U.S and then just move to Russia to sleep in Putins bed."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 15112,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "Trump timed his comment so his rich friends get richer on the market.",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\".",
                "At some point, there begins to be no other rational explanation other than these tariff headlines are for insider trading.\n\nThis is the most inconsistent trade policy I have ever seen..."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/10/2025 04:11:34 UTC"
}