{
    "posts": [
        {
            "category": "HOT",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 7152,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "How is that even possible?!? What a broken system!",
                "Before busting out the pitchforks in the US, this was in the UK. Poor training knows no borders.",
                "You see, that 92 year-old could've been a serious threat...",
                "Gonna be honest, I expected this to be a US story.",
                "Because it isn't clarified in the headline - This took place in the United Kingdom.",
                "[Here's the body cam footage of the incident.](https://m.youtube.com/watch?v=pqyH9eORA24)\n\nWatch it yourself before commenting. \n\nAnyone still defending this response either didn't watch the footage or is just looking for an excuse to justify absurd levels of force.\n\nThere was **one** half-hearted swing with a baton,  not multiple attempts, and it didn’t even come close to making contact. That was **after** they unloaded an entire can of pepper spray directly into his face. Less than a second later, they fired the taser.\n\nTo summarize:\n\n* Full can of pepper spray to the face\n\n* One pathetic baton swing that missed\n\n* Taser deployed within a second of the failed batton strike.\n\n* All of this  happened within 60 seconds of entering the room.\n\nThese police are panicked, undertrained cowards who shouldn't be trusted with a flashlight, let alone a badge, pepper spray, or a taser.\n\nThen in the article it says: \n\n>Smith previously told jurors he did not see that the pensioner was disabled and using a wheelchair until after the incident, as he was focused on the knife.\n\nSo not only are they beyond incompetent, they are apparently blind as well. Top-tier awareness from the people we trust with weapons.\n\nI guess the wheelchair just blended in perfectly with the wallpaper. Totally reasonable for a trained officer to miss the one object that literally defines someone as physically disabled /s\n\nIf they’re too unobservant to spot a mobility aid in plain sight, maybe policing isn’t the job for them. You shouldn’t be making split-second decisions with weapons if you can’t handle basic awareness. Pick a job where nobody dies when you screw up FFS. \n\n>Meanwhile, Comotto said she believed using the Taser was the safest way to \"protect\" Mr Burgess as she feared her colleague using the baton again would cause more harm.\n\nJesus Christ. Even if the baton had broken his arm, what kind of absolute dimwit thinks that blasting a 92-year-old with 50,000+ volts is somehow less harmful? You have to be terminally dense to believe electrocuting a frail elderly man is the safer option.",
                "\"He was impossible to control!\"\n\n\n*While being interviewed at Planet Fitness doing 200# bench presses."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 4452,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "56% of votes were for this.",
                "Weird how the christians haven't stepped up to fill the void. Their churches have tax exempt status specifically for this purpose. It's almost like they've been lying this entire time and now that they have a chance to prove themselves, they're failing to. Who could have guessed this would happen?",
                "Keep starving, the golden age is just around the corner. Maybe get out in the fields and start picking? I’m sure things will improve with the big bullshit bill getting signed into law. ",
                "And they still vote Republican.",
                "Can't you see the golden age Donnie promised is coming?",
                "Iowa carried Trump and voted Chuck Grassley BACK in and have voted Joni Ernst in MANY times. They are a red state about to find out that voting/not voting has consequences. Maybe all of those farmers who voted the criminal in should be donating to the food pantries. Oh that’s right, he screwed them too. Of course they are banking on him coming thru with handouts like he did last term."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FEMA rescinds strategic plan less than 2 weeks before hurricane season",
            "external_url": "https://www.cbsnews.com/news/fema-rescinds-strategic-plan-less-than-2-weeks-before-hurricane-season/",
            "upvotes": 3890,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/21/72a084e2-608f-46ff-ab86-137b692838a3/thumbnail/1200x630/b554101e1ecdce606b889b227cb90283/ap25128165711233.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "Hey Florida, guess what's about to happen..",
                "Fucking. Egomaniac. MAGA. Assholes",
                "I always feel bad for the voters in these red states that literally did not vote for this. About 4.7 million Floridians voted for Kamala. Those folks also all bear the brunt of the other side’s short-sightedness. These states are purple. Not red or blue. There is no “mandate,” only madness.",
                "They mention a \"smaller footprint\".  FEMA used to cover the entire United States.  I wonder if they mean that only red states will get aid or nobody will?  Does anyone think they will come up with a new strategic plan or just fold like a cheap suit?",
                "Is there a word for when you're intentionally incompetent with the purpose of watching poor people die for amusement?",
                "\"The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees\"\n\nI love how all these assholes don't know how to read and have the attention spans of goldfish.",
                ">The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees. \n\nShould it also includes pictures so that perhaps Mango could understand it if he even looked at it? What even is this kind of rule?",
                "Oh no, all those voters are nearing the Find Out phase, ah geez.",
                "I’m confused. Did the article confirm there is no official FEMA plans yet because the last ones were set to expire? And that their new plans aren’t intended to be revealed until after the summer?",
                "Florida, Alabama, and Mississippi will now reap the benefits on their voting."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "French paedophile surgeon who abused hundreds sentenced to 20 years in jail.",
            "external_url": "https://www.bbc.com/news/articles/cvgdkyge198o",
            "upvotes": 3611,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/14ed/live/62dc83d0-3bdf-11f0-aa24-d1c64c46ace6.jpg",
            "top_comments": [
                "They caught him because he journaled about the abuse in extreme detail. I think that's the part of this that disturbs me the most, the fact that he kept a personal record of what he did and to whom he did it, complete with enough detail that police were able to easily find and notify his victims.",
                "20 years for sexual assault of hundreds of children feels light but he's 74.  He should never be free but at his age 20 years is basically life in prison.",
                "My heart goes out to all the victims, such a horrific story. All those who knew or were aware in their community and in the medical establishment should be so ashamed they allowed this to continue. I am glad the victims finally have some sense of closure and were able to support each other throughout the court proceedings, the one light to come out of such a pitch black case.",
                "It’s terrible what people do to children, especially when they are in a position of trust and they abuse it to push their own beliefs and desires over the child’s best interest",
                "In France if you kill or rape 20 people, you’ll only be sentenced to the maximum time, you’ve been condemned for one case.\n\nLet’s say you received a 15 years sentence for the first victim, and 8 years for a second one, you’ll go to jail for 15 years (the maximum amount time received)",
                "This is even worse than standard pedophile considering the damage to the medical world reputation. Fucking piece of human trash.",
                "With a 20 year sentence, he's likely to die before seeing freedom. But it provides no sense of security, comfort, or justice to his victims, who will suffer lifelong consequences because of his sick and evil actions.",
                "Wait how? Kids should be never alone with him? Either family or nurses or surgeon assistants should be there at all times?!",
                "Should’ve been the wood chipper",
                "I'm interested to know how he was caught and why nobody reported him off."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UK prosecutors say 21 charges authorised against Tate brothers",
            "external_url": "https://www.bbc.com/news/articles/ckg41g1140po",
            "upvotes": 1622,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7053/live/010cc8d0-3be5-11f0-babe-b506cb370d70.jpg",
            "top_comments": [
                "Haha remember when Greta Thunberg said he had small dick energy and he owned himself so hard over it he went to jail and his entire life has been downhill ever since?",
                "The Rape brothers finally getting what they rightly deserve.",
                "These two are so disgusting, but Elon and Donald still support them, how fitting",
                "Inb4 they are granted asylum in the US.",
                "Good. Roy in hell you pieces of shit.\n\nSorry Roy. \n\nMay these Douches ROT*",
                "Lock those two traffickers up, and throw away the key!",
                "My vision of this man clutching prison bars, eyes closed- imagining them to be the sides of a Lamborghini steering wheel, knowing he'll never touch one again. Please, someone make my wish come true.",
                "Good.  Now put them in front of a judge and let them lock them up so we don’t have to keep hearing about them.",
                "The grift is over. Hopefully.",
                "Andrew Tate is a fucking rapist."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ex-UFC star BJ Penn arrested on family abuse charges in Hawaii",
            "external_url": "https://www.espn.com/mma/story/_/id/45353400/ex-ufc-star-bj-penn-faces-family-abuse-charges-hawaii",
            "upvotes": 2058,
            "date": "05/28/2025",
            "thumbnail": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0801%2Fr577751_1296x729_16%2D9.jpg",
            "top_comments": [
                "This guy is going to do something absolutely horrific. He believes his mother was replaced and not his actual “mother”. \n\nHe very much has CTE and he’s not going to get better unfortunately.",
                "Penn \"recently claimed online that multiple members of his family are missing. He has accused unnamed imposters of replacing those family members in an effort to steal his inheritance\"\n\nThat's really bad and this guy needs help ASAP.",
                "In the next few years, it's going to become clearer and clearer just how brutal MMA is to fighters' brains. It's getting sad to be a longtime fan, and seeing your heroes go out like this.",
                "> According to online records, Penn, 46, was arrested on Sunday and released on $2,000 bail. He was arrested again and placed on $1,000 bail on Monday, per online records. \n\nIf you get arrested, bail out, and then get arrested again the next day for doing the same or similar thing, bail should be off the table.",
                "Kind of terrifying it took this long. He’s been making the statements & threats for a while. Hope he gets the help he needs.",
                "I met him when I lived in Hawaii about fifteen years ago and he didn't seem \"right\" then. Ironically it was at an army mma event so there was plenty of CTE going around so he fit in perfectly.",
                "It was very apparent this guy is not mentally all there when he was on Joe Rogan with Tulsi Gabbard not too long ago",
                "He’s clearly suffering from Capgras Syndrome and has been for a while.",
                "I hope he gets the help he needs. It's obvious he's suffered some CTE.",
                "Bj was always nuts. I grew up the same town."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Delta flight erupts into chaos as pigeons fly around main cabin",
            "external_url": "https://www.nbcnews.com/news/us-news/delta-flight-erupts-chaos-pigeons-fly-main-cabin-rcna209400",
            "upvotes": 1875,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-Pigeon-flight-RS-674959.jpg",
            "top_comments": [
                "According to an Instagram post from another passenger, Tom Caw was the passenger who spotted the first pigeon before the plane departed from Minneapolis-Saint Paul International Airport. Caw said the pilot announced the pigeon sighting and returned the plane to the gate to have the bird removed.\n\nAs the flight taxied out to take off again, a second pigeon emerged and flew down the main aisle of the cabin, video Caw posted on Instagram and NBC News obtained shows. The bird prompted several passengers to scream.",
                "Clearly the first officer just didn’t feel comfortable enough to speak up and ask the pilot to not bring pigeons onto the plane.",
                "Snakes on a Plane sequel is looking wild.",
                "Damn I really have to catch up on The Rehearsal.",
                "Sir, a second pigeon has hit the cabin",
                "Homing pigeons just taking shortcuts now?",
                "so much misinformation\n\nto clarify, the pigeons each paid for their own seats and had already presented their boarding passes\n\n3 of the 4 total pigeons (yes 4 not five, one of them was a white-winged dove) were in first class, one of them got tipsy and flew around the cabin, and the other was trying to chase it down and get it back to its seat\n\nplease read the article people",
                "It is my emotional support pigeon and I can't fly without it!",
                "Me to my wife: “see, this is why I need that magician costume. What a perfect time to yell out “ta da!””\n\nMy wife: *eye roll*",
                "Paging Mo Willems: we clearly need a book explaining why the pigeon is not allowed to fly the plane, because it seems we’ve neglected to explain that to the pigeons."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Aldi and Lidl fight price war in Germany",
            "external_url": "https://www.retaildetail.eu/news/food/aldi-and-lidl-fight-price-war-in-germany/",
            "upvotes": 2430,
            "date": "05/28/2025",
            "thumbnail": "https://www.retaildetail.eu/wp-content/uploads/sites/2/2025/05/shutterstock_1092014636-aldi-lidl.jpg",
            "top_comments": [
                "Good for us consumers 👍🏼",
                "Meanwhile in Australia Coles and Woolies collude for higher prices and lower wages.\n\nDisappointed Lidl didn't break in to the Aussie market",
                "So this is basically an ad.",
                "Luckily here theyre fighting about who can increase prices the most ...",
                "I don't even have either of those two nearby. I only have Edeka and Rewe, and both of them are stupidly expensive.\n\nTo clarify: I'm talking about vegetables and fruits.",
                "Like stores should be doing, instead of collectively raising prices...",
                "Why can’t we have this in America. They’re fighting over who gets to charge more and people are lining up to decide who gets to pay more. I hate it here.",
                "I remember price wars, when I was younger.\n\nThen companies realized that it's more profitable to collude on price fixing and pay a fine every few years when they get caught.",
                "That's an acceptable war",
                "Please come to Greece and start a price war."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harvard agrees to relinquish early photos of slaves, ending a long legal battle",
            "external_url": "https://apnews.com/article/harvard-university-slave-photos-d9c01b7926bba2a686ff325617e93ce9",
            "upvotes": 612,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Lanier, who lives in Connecticut, sued the Ivy League school in 2019 for “wrongful seizure, possession and expropriation” of the images of Renty, Delia and five other enslaved individuals. The suit attacked Harvard for its “exploitation” of Renty’s image at a 2017 conference and in other uses. It said Harvard has capitalized on the photos by demanding a “hefty” licensing fee to reproduce the images.\n\nThat's fucking disgusting. Harvard commissioned the daguerreotypes in order to support the cause of race-based slavery. Then, 175 years later, well after anything resembling a copyright claim could be made, they demanded a licensing fee to reproduce the image of these people.",
                "Fascinating how there seems to be a new hit piece about Harvard in the news every day since they stood up to Trump and his regime.",
                "My heart skipped on the first four words of the headline/title, fearing they went the way of Columbia.",
                "I'm guessing the last alumni the photos could've directly harm has finally died.",
                "Yeah it's shitty that innocent people were enslaved. I don't understand why \"ownership\" of the photographs are an issue. Copyright has long expired, so why should Harvard or anyone who possesses a copy of the photos have to give them up, it should all be in the public domain now.",
                "So the 175 year old stuff and 15 year old lawsuit is magically in my home feed because Harvard decided it didn’t want to bend the knee? Fuck Reddit",
                "Timing of these Harvard articles are crazy, it’s like they just had these on ready whenever something goes wrong with Harvard",
                "Another reason they should not be federally funded"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 15716,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=0ec0a9b0c45ecf3b0dd269ffc8f350b0",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Another reminder that for ICE, an asylum hearing is a perfectly safe place to get their numbers up. No dangerous drug dealers with guns, no rapists, no murderers or thugs, just honest people trying to obey the law. Easy pickings.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "How many of these are we not hearing about? Because it seems like we're seeing multiple a day.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "America is a dystopian nightmare."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Community Notes vanishes from X feeds, raising 'serious questions' amid ongoing EU probe",
            "external_url": "https://www.thejournal.ie/x-community-notes-disappeared-from-platform-factchecking-misinformation-elon-musk-6717349-May2025/",
            "upvotes": 22,
            "date": "05/28/2025",
            "thumbnail": "https://img2.thejournal.ie/article/6717349/river/?height=400&version=6717358",
            "top_comments": [
                "Genuinely surprised it lasted this long.",
                "lol the one good thing that was implemented under Musk’s ownership is now gone. What has he actually done to make that site better than it was before?",
                "If you haven't stopped using X, now's a good time."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Netanyahu says Hamas Gaza chief Mohammad Sinwar has been killed",
            "external_url": "https://www.reuters.com/world/middle-east/netanyahu-says-hamas-gaza-chief-mohammed-sinwar-has-been-eliminated-2025-05-28/",
            "upvotes": 38,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Thought these guys were in Qatar living it up? ",
                "Good, Can they stop the genocide now?",
                "Killed him hiding under a hospital. Typical Hamas.",
                "Nice, and Netanyahu’s turn when?",
                "[deleted]",
                "*Israeli media quoted defense officials saying that Sinwar was the target, but the military has yet to confirm he was killed in that strike.*  \n\nAt least according to NPR and other news outlets.",
                "How many Sinwar's is this now? I swear I've seen 3 different Hamas dudes with this name killed since this whole thing started. Is it a family? Totally unrelated? This is gonna start a King Louis situation if Hamas makes every leader a Sinwar.",
                "The problem here is it's not like they lost some outstanding military leader. They'll find his replacement in the next shrub that walks along."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US to ban foreign officials over 'flagrant censorship' on social media",
            "external_url": "https://www.reuters.com/business/media-telecom/us-visa-policy-targets-foreign-nationals-who-censor-americans-state-dept-2025-05-28/",
            "upvotes": 177,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Such hypocricy, in view of how Social Media posts are now being used by the US Government to silence disagreeing points of view:\n\n*\"Trump officials have repeatedly weighed in on European politics to denounce what they see as suppression of right-wing politicians, including in Romania, Germany and France, accusing European authorities of censoring views like criticism of immigration in the name of countering disinformation.\"*  \n\n*\"In April, Rubio shut down a State Department office that had sought to counter foreign disinformation, accusing it of censorship and wasting U.S. taxpayer money.\"*",
                "Just another double standard by the folks that live by double standards.",
                "Little Marco is a waste of space.",
                "What in the fucking hell is Trump trying to accomplish?",
                "The Administration also announced they are pausing student visas so they can have more time to comb through applicants' social media to ensure they don't say anything the administration doesn't like. Seems like Trump needs to practice what he preaches.",
                "> Some foreign officials have taken \"flagrant censorship actions against U.S. tech companies and U.S. citizens and residents when they have no authority to do so,\" Rubio said.\n\n> > no authority to do so\n\n\nGood luck with that.\n\nIts fucking astonishing to see the US fall from grace like that.\n\nFrom the outside it looks like your government is doing their best to dismantle the US as we know it.",
                "Cry me a river, bitch",
                "Except my boy Vlad, Vlads all right. \"But Mr president he kills journalists\". Fake news!",
                "Because they aren’t content with ruining the US, they have to meddle in Europe as well",
                "This is Trump paying Elon back for services rendered. The US government is so transactional these days."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Harvard agrees to relinquish early photos of slaves, ending a long legal battle",
            "external_url": "https://apnews.com/article/harvard-university-slave-photos-d9c01b7926bba2a686ff325617e93ce9",
            "upvotes": 615,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Lanier, who lives in Connecticut, sued the Ivy League school in 2019 for “wrongful seizure, possession and expropriation” of the images of Renty, Delia and five other enslaved individuals. The suit attacked Harvard for its “exploitation” of Renty’s image at a 2017 conference and in other uses. It said Harvard has capitalized on the photos by demanding a “hefty” licensing fee to reproduce the images.\n\nThat's fucking disgusting. Harvard commissioned the daguerreotypes in order to support the cause of race-based slavery. Then, 175 years later, well after anything resembling a copyright claim could be made, they demanded a licensing fee to reproduce the image of these people.",
                "Fascinating how there seems to be a new hit piece about Harvard in the news every day since they stood up to Trump and his regime.",
                "My heart skipped on the first four words of the headline/title, fearing they went the way of Columbia.",
                "I'm guessing the last alumni the photos could've directly harm has finally died.",
                "Yeah it's shitty that innocent people were enslaved. I don't understand why \"ownership\" of the photographs are an issue. Copyright has long expired, so why should Harvard or anyone who possesses a copy of the photos have to give them up, it should all be in the public domain now.",
                "So the 175 year old stuff and 15 year old lawsuit is magically in my home feed because Harvard decided it didn’t want to bend the knee? Fuck Reddit",
                "Timing of these Harvard articles are crazy, it’s like they just had these on ready whenever something goes wrong with Harvard",
                "Another reason they should not be federally funded"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK prosecutors say 21 charges authorised against Tate brothers",
            "external_url": "https://www.bbc.com/news/articles/ckg41g1140po",
            "upvotes": 1619,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7053/live/010cc8d0-3be5-11f0-babe-b506cb370d70.jpg",
            "top_comments": [
                "Haha remember when Greta Thunberg said he had small dick energy and he owned himself so hard over it he went to jail and his entire life has been downhill ever since?",
                "The Rape brothers finally getting what they rightly deserve.",
                "These two are so disgusting, but Elon and Donald still support them, how fitting",
                "Inb4 they are granted asylum in the US.",
                "Good. Roy in hell you pieces of shit.\n\nSorry Roy. \n\nMay these Douches ROT*",
                "Lock those two traffickers up, and throw away the key!",
                "My vision of this man clutching prison bars, eyes closed- imagining them to be the sides of a Lamborghini steering wheel, knowing he'll never touch one again. Please, someone make my wish come true.",
                "Good.  Now put them in front of a judge and let them lock them up so we don’t have to keep hearing about them.",
                "The grift is over. Hopefully.",
                "Andrew Tate is a fucking rapist."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bear attack leaves woman in critical condition in Slovenia",
            "external_url": "https://abcnews.go.com/International/wireStory/bear-attack-leaves-woman-critical-condition-slovenia-122257417",
            "upvotes": 112,
            "date": "05/28/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "The attack on Tuesday occurred at the edge of the forest in Skofljica, some 10 kilometers (6 miles) southeast of the capital, police said.\n\nThe bear retreated into the forest after the attack and police have advised Skofljica residents to stay away and be cautious.",
                "How dangerous/aggressive are brown bears in Europe compared to brown bears, especially grizzlies, in North America? I know black bears tend to be smaller and more skittish around people and that bears in general usually are but don't really know how European brown bears compare to NA in terms of temperament.",
                "I feel like only hours ago I saw an article about Slovenia legalizing commercial sale of brown bear meat. Weird timing.",
                "[deleted]",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 4461,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "56% of votes were for this.",
                "Weird how the christians haven't stepped up to fill the void. Their churches have tax exempt status specifically for this purpose. It's almost like they've been lying this entire time and now that they have a chance to prove themselves, they're failing to. Who could have guessed this would happen?",
                "Keep starving, the golden age is just around the corner. Maybe get out in the fields and start picking? I’m sure things will improve with the big bullshit bill getting signed into law. ",
                "And they still vote Republican.",
                "Can't you see the golden age Donnie promised is coming?",
                "Iowa carried Trump and voted Chuck Grassley BACK in and have voted Joni Ernst in MANY times. They are a red state about to find out that voting/not voting has consequences. Maybe all of those farmers who voted the criminal in should be donating to the food pantries. Oh that’s right, he screwed them too. Of course they are banking on him coming thru with handouts like he did last term."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 7143,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "How is that even possible?!? What a broken system!",
                "Before busting out the pitchforks in the US, this was in the UK. Poor training knows no borders.",
                "You see, that 92 year-old could've been a serious threat...",
                "Gonna be honest, I expected this to be a US story.",
                "Because it isn't clarified in the headline - This took place in the United Kingdom.",
                "[Here's the body cam footage of the incident.](https://m.youtube.com/watch?v=pqyH9eORA24)\n\nWatch it yourself before commenting. \n\nAnyone still defending this response either didn't watch the footage or is just looking for an excuse to justify absurd levels of force.\n\nThere was **one** half-hearted swing with a baton,  not multiple attempts, and it didn’t even come close to making contact. That was **after** they unloaded an entire can of pepper spray directly into his face. Less than a second later, they fired the taser.\n\nTo summarize:\n\n* Full can of pepper spray to the face\n\n* One pathetic baton swing that missed\n\n* Taser deployed within a second of the failed batton strike.\n\n* All of this  happened within 60 seconds of entering the room.\n\nThese police are panicked, undertrained cowards who shouldn't be trusted with a flashlight, let alone a badge, pepper spray, or a taser.\n\nThen in the article it says: \n\n>Smith previously told jurors he did not see that the pensioner was disabled and using a wheelchair until after the incident, as he was focused on the knife.\n\nSo not only are they beyond incompetent, they are apparently blind as well. Top-tier awareness from the people we trust with weapons.\n\nI guess the wheelchair just blended in perfectly with the wallpaper. Totally reasonable for a trained officer to miss the one object that literally defines someone as physically disabled /s\n\nIf they’re too unobservant to spot a mobility aid in plain sight, maybe policing isn’t the job for them. You shouldn’t be making split-second decisions with weapons if you can’t handle basic awareness. Pick a job where nobody dies when you screw up FFS. \n\n>Meanwhile, Comotto said she believed using the Taser was the safest way to \"protect\" Mr Burgess as she feared her colleague using the baton again would cause more harm.\n\nJesus Christ. Even if the baton had broken his arm, what kind of absolute dimwit thinks that blasting a 92-year-old with 50,000+ volts is somehow less harmful? You have to be terminally dense to believe electrocuting a frail elderly man is the safer option.",
                "\"He was impossible to control!\"\n\n\n*While being interviewed at Planet Fitness doing 200# bench presses."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ex-UFC star BJ Penn arrested on family abuse charges in Hawaii",
            "external_url": "https://www.espn.com/mma/story/_/id/45353400/ex-ufc-star-bj-penn-faces-family-abuse-charges-hawaii",
            "upvotes": 2057,
            "date": "05/28/2025",
            "thumbnail": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0801%2Fr577751_1296x729_16%2D9.jpg",
            "top_comments": [
                "This guy is going to do something absolutely horrific. He believes his mother was replaced and not his actual “mother”. \n\nHe very much has CTE and he’s not going to get better unfortunately.",
                "Penn \"recently claimed online that multiple members of his family are missing. He has accused unnamed imposters of replacing those family members in an effort to steal his inheritance\"\n\nThat's really bad and this guy needs help ASAP.",
                "In the next few years, it's going to become clearer and clearer just how brutal MMA is to fighters' brains. It's getting sad to be a longtime fan, and seeing your heroes go out like this.",
                "> According to online records, Penn, 46, was arrested on Sunday and released on $2,000 bail. He was arrested again and placed on $1,000 bail on Monday, per online records. \n\nIf you get arrested, bail out, and then get arrested again the next day for doing the same or similar thing, bail should be off the table.",
                "Kind of terrifying it took this long. He’s been making the statements & threats for a while. Hope he gets the help he needs.",
                "I met him when I lived in Hawaii about fifteen years ago and he didn't seem \"right\" then. Ironically it was at an army mma event so there was plenty of CTE going around so he fit in perfectly.",
                "It was very apparent this guy is not mentally all there when he was on Joe Rogan with Tulsi Gabbard not too long ago",
                "He’s clearly suffering from Capgras Syndrome and has been for a while.",
                "I hope he gets the help he needs. It's obvious he's suffered some CTE.",
                "Bj was always nuts. I grew up the same town."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FEMA rescinds strategic plan less than 2 weeks before hurricane season",
            "external_url": "https://www.cbsnews.com/news/fema-rescinds-strategic-plan-less-than-2-weeks-before-hurricane-season/",
            "upvotes": 3891,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/21/72a084e2-608f-46ff-ab86-137b692838a3/thumbnail/1200x630/b554101e1ecdce606b889b227cb90283/ap25128165711233.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "Hey Florida, guess what's about to happen..",
                "Fucking. Egomaniac. MAGA. Assholes",
                "I always feel bad for the voters in these red states that literally did not vote for this. About 4.7 million Floridians voted for Kamala. Those folks also all bear the brunt of the other side’s short-sightedness. These states are purple. Not red or blue. There is no “mandate,” only madness.",
                "They mention a \"smaller footprint\".  FEMA used to cover the entire United States.  I wonder if they mean that only red states will get aid or nobody will?  Does anyone think they will come up with a new strategic plan or just fold like a cheap suit?",
                "Is there a word for when you're intentionally incompetent with the purpose of watching poor people die for amusement?",
                "\"The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees\"\n\nI love how all these assholes don't know how to read and have the attention spans of goldfish.",
                ">The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees. \n\nShould it also includes pictures so that perhaps Mango could understand it if he even looked at it? What even is this kind of rule?",
                "Oh no, all those voters are nearing the Find Out phase, ah geez.",
                "I’m confused. Did the article confirm there is no official FEMA plans yet because the last ones were set to expire? And that their new plans aren’t intended to be revealed until after the summer?",
                "Florida, Alabama, and Mississippi will now reap the benefits on their voting."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 4469,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "56% of votes were for this.",
                "Weird how the christians haven't stepped up to fill the void. Their churches have tax exempt status specifically for this purpose. It's almost like they've been lying this entire time and now that they have a chance to prove themselves, they're failing to. Who could have guessed this would happen?",
                "Keep starving, the golden age is just around the corner. Maybe get out in the fields and start picking? I’m sure things will improve with the big bullshit bill getting signed into law. ",
                "And they still vote Republican.",
                "Can't you see the golden age Donnie promised is coming?",
                "Iowa carried Trump and voted Chuck Grassley BACK in and have voted Joni Ernst in MANY times. They are a red state about to find out that voting/not voting has consequences. Maybe all of those farmers who voted the criminal in should be donating to the food pantries. Oh that’s right, he screwed them too. Of course they are banking on him coming thru with handouts like he did last term."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UK prosecutors say 21 charges authorised against Tate brothers",
            "external_url": "https://www.bbc.com/news/articles/ckg41g1140po",
            "upvotes": 1625,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/7053/live/010cc8d0-3be5-11f0-babe-b506cb370d70.jpg",
            "top_comments": [
                "Haha remember when Greta Thunberg said he had small dick energy and he owned himself so hard over it he went to jail and his entire life has been downhill ever since?",
                "The Rape brothers finally getting what they rightly deserve.",
                "These two are so disgusting, but Elon and Donald still support them, how fitting",
                "Inb4 they are granted asylum in the US.",
                "Good. Roy in hell you pieces of shit.\n\nSorry Roy. \n\nMay these Douches ROT*",
                "Lock those two traffickers up, and throw away the key!",
                "My vision of this man clutching prison bars, eyes closed- imagining them to be the sides of a Lamborghini steering wheel, knowing he'll never touch one again. Please, someone make my wish come true.",
                "Good.  Now put them in front of a judge and let them lock them up so we don’t have to keep hearing about them.",
                "The grift is over. Hopefully.",
                "Andrew Tate is a fucking rapist."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 7162,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "How is that even possible?!? What a broken system!",
                "Before busting out the pitchforks in the US, this was in the UK. Poor training knows no borders.",
                "You see, that 92 year-old could've been a serious threat...",
                "Gonna be honest, I expected this to be a US story.",
                "Because it isn't clarified in the headline - This took place in the United Kingdom.",
                "[Here's the body cam footage of the incident.](https://m.youtube.com/watch?v=pqyH9eORA24)\n\nWatch it yourself before commenting. \n\nAnyone still defending this response either didn't watch the footage or is just looking for an excuse to justify absurd levels of force.\n\nThere was **one** half-hearted swing with a baton,  not multiple attempts, and it didn’t even come close to making contact. That was **after** they unloaded an entire can of pepper spray directly into his face. Less than a second later, they fired the taser.\n\nTo summarize:\n\n* Full can of pepper spray to the face\n\n* One pathetic baton swing that missed\n\n* Taser deployed within a second of the failed batton strike.\n\n* All of this  happened within 60 seconds of entering the room.\n\nThese police are panicked, undertrained cowards who shouldn't be trusted with a flashlight, let alone a badge, pepper spray, or a taser.\n\nThen in the article it says: \n\n>Smith previously told jurors he did not see that the pensioner was disabled and using a wheelchair until after the incident, as he was focused on the knife.\n\nSo not only are they beyond incompetent, they are apparently blind as well. Top-tier awareness from the people we trust with weapons.\n\nI guess the wheelchair just blended in perfectly with the wallpaper. Totally reasonable for a trained officer to miss the one object that literally defines someone as physically disabled /s\n\nIf they’re too unobservant to spot a mobility aid in plain sight, maybe policing isn’t the job for them. You shouldn’t be making split-second decisions with weapons if you can’t handle basic awareness. Pick a job where nobody dies when you screw up FFS. \n\n>Meanwhile, Comotto said she believed using the Taser was the safest way to \"protect\" Mr Burgess as she feared her colleague using the baton again would cause more harm.\n\nJesus Christ. Even if the baton had broken his arm, what kind of absolute dimwit thinks that blasting a 92-year-old with 50,000+ volts is somehow less harmful? You have to be terminally dense to believe electrocuting a frail elderly man is the safer option.",
                "\"He was impossible to control!\"\n\n\n*While being interviewed at Planet Fitness doing 200# bench presses."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FEMA rescinds strategic plan less than 2 weeks before hurricane season",
            "external_url": "https://www.cbsnews.com/news/fema-rescinds-strategic-plan-less-than-2-weeks-before-hurricane-season/",
            "upvotes": 3892,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/21/72a084e2-608f-46ff-ab86-137b692838a3/thumbnail/1200x630/b554101e1ecdce606b889b227cb90283/ap25128165711233.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "Hey Florida, guess what's about to happen..",
                "Fucking. Egomaniac. MAGA. Assholes",
                "I always feel bad for the voters in these red states that literally did not vote for this. About 4.7 million Floridians voted for Kamala. Those folks also all bear the brunt of the other side’s short-sightedness. These states are purple. Not red or blue. There is no “mandate,” only madness.",
                "They mention a \"smaller footprint\".  FEMA used to cover the entire United States.  I wonder if they mean that only red states will get aid or nobody will?  Does anyone think they will come up with a new strategic plan or just fold like a cheap suit?",
                "Is there a word for when you're intentionally incompetent with the purpose of watching poor people die for amusement?",
                "\"The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees\"\n\nI love how all these assholes don't know how to read and have the attention spans of goldfish.",
                ">The memo authored by Richardson was brief — the new agency head now requires that all FEMA memos to, from or for his office be no longer than one page in length, according to multiple current FEMA employees. \n\nShould it also includes pictures so that perhaps Mango could understand it if he even looked at it? What even is this kind of rule?",
                "Oh no, all those voters are nearing the Find Out phase, ah geez.",
                "I’m confused. Did the article confirm there is no official FEMA plans yet because the last ones were set to expire? And that their new plans aren’t intended to be revealed until after the summer?",
                "Florida, Alabama, and Mississippi will now reap the benefits on their voting."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harvard agrees to relinquish early photos of slaves, ending a long legal battle",
            "external_url": "https://apnews.com/article/harvard-university-slave-photos-d9c01b7926bba2a686ff325617e93ce9",
            "upvotes": 616,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Lanier, who lives in Connecticut, sued the Ivy League school in 2019 for “wrongful seizure, possession and expropriation” of the images of Renty, Delia and five other enslaved individuals. The suit attacked Harvard for its “exploitation” of Renty’s image at a 2017 conference and in other uses. It said Harvard has capitalized on the photos by demanding a “hefty” licensing fee to reproduce the images.\n\nThat's fucking disgusting. Harvard commissioned the daguerreotypes in order to support the cause of race-based slavery. Then, 175 years later, well after anything resembling a copyright claim could be made, they demanded a licensing fee to reproduce the image of these people.",
                "Fascinating how there seems to be a new hit piece about Harvard in the news every day since they stood up to Trump and his regime.",
                "My heart skipped on the first four words of the headline/title, fearing they went the way of Columbia.",
                "I'm guessing the last alumni the photos could've directly harm has finally died.",
                "Yeah it's shitty that innocent people were enslaved. I don't understand why \"ownership\" of the photographs are an issue. Copyright has long expired, so why should Harvard or anyone who possesses a copy of the photos have to give them up, it should all be in the public domain now.",
                "So the 175 year old stuff and 15 year old lawsuit is magically in my home feed because Harvard decided it didn’t want to bend the knee? Fuck Reddit",
                "Timing of these Harvard articles are crazy, it’s like they just had these on ready whenever something goes wrong with Harvard",
                "Another reason they should not be federally funded"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "French paedophile surgeon who abused hundreds sentenced to 20 years in jail.",
            "external_url": "https://www.bbc.com/news/articles/cvgdkyge198o",
            "upvotes": 3610,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/14ed/live/62dc83d0-3bdf-11f0-aa24-d1c64c46ace6.jpg",
            "top_comments": [
                "They caught him because he journaled about the abuse in extreme detail. I think that's the part of this that disturbs me the most, the fact that he kept a personal record of what he did and to whom he did it, complete with enough detail that police were able to easily find and notify his victims.",
                "20 years for sexual assault of hundreds of children feels light but he's 74.  He should never be free but at his age 20 years is basically life in prison.",
                "My heart goes out to all the victims, such a horrific story. All those who knew or were aware in their community and in the medical establishment should be so ashamed they allowed this to continue. I am glad the victims finally have some sense of closure and were able to support each other throughout the court proceedings, the one light to come out of such a pitch black case.",
                "It’s terrible what people do to children, especially when they are in a position of trust and they abuse it to push their own beliefs and desires over the child’s best interest",
                "In France if you kill or rape 20 people, you’ll only be sentenced to the maximum time, you’ve been condemned for one case.\n\nLet’s say you received a 15 years sentence for the first victim, and 8 years for a second one, you’ll go to jail for 15 years (the maximum amount time received)",
                "This is even worse than standard pedophile considering the damage to the medical world reputation. Fucking piece of human trash.",
                "With a 20 year sentence, he's likely to die before seeing freedom. But it provides no sense of security, comfort, or justice to his victims, who will suffer lifelong consequences because of his sick and evil actions.",
                "Wait how? Kids should be never alone with him? Either family or nurses or surgeon assistants should be there at all times?!",
                "Should’ve been the wood chipper",
                "I'm interested to know how he was caught and why nobody reported him off."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Delta flight erupts into chaos as pigeons fly around main cabin",
            "external_url": "https://www.nbcnews.com/news/us-news/delta-flight-erupts-chaos-pigeons-fly-main-cabin-rcna209400",
            "upvotes": 1878,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-Pigeon-flight-RS-674959.jpg",
            "top_comments": [
                "According to an Instagram post from another passenger, Tom Caw was the passenger who spotted the first pigeon before the plane departed from Minneapolis-Saint Paul International Airport. Caw said the pilot announced the pigeon sighting and returned the plane to the gate to have the bird removed.\n\nAs the flight taxied out to take off again, a second pigeon emerged and flew down the main aisle of the cabin, video Caw posted on Instagram and NBC News obtained shows. The bird prompted several passengers to scream.",
                "Clearly the first officer just didn’t feel comfortable enough to speak up and ask the pilot to not bring pigeons onto the plane.",
                "Snakes on a Plane sequel is looking wild.",
                "Damn I really have to catch up on The Rehearsal.",
                "Sir, a second pigeon has hit the cabin",
                "Homing pigeons just taking shortcuts now?",
                "so much misinformation\n\nto clarify, the pigeons each paid for their own seats and had already presented their boarding passes\n\n3 of the 4 total pigeons (yes 4 not five, one of them was a white-winged dove) were in first class, one of them got tipsy and flew around the cabin, and the other was trying to chase it down and get it back to its seat\n\nplease read the article people",
                "It is my emotional support pigeon and I can't fly without it!",
                "Me to my wife: “see, this is why I need that magician costume. What a perfect time to yell out “ta da!””\n\nMy wife: *eye roll*",
                "Paging Mo Willems: we clearly need a book explaining why the pigeon is not allowed to fly the plane, because it seems we’ve neglected to explain that to the pigeons."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Germany's Merz promises to help Ukraine produce long-range missiles",
            "external_url": "https://www.bbc.com/news/articles/cpw7vllepx7o",
            "upvotes": 320,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3fce/live/6f6bb7f0-3bc2-11f0-a3f8-3983078865f2.jpg",
            "top_comments": [
                "Germany stepping up where the US won't. Crazy timeline we're in.",
                "I sit here embarrassed by our current \"leadership\" in the US. It's disgusting.",
                "Well I'd be wary trying to use the Kerch Bridge now.",
                "The question is, will it be just more of the same old boring European hurf and blurf or will they actually step up and really make an impact?",
                "Yawn...too little too late"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ex-UFC star BJ Penn arrested on family abuse charges in Hawaii",
            "external_url": "https://www.espn.com/mma/story/_/id/45353400/ex-ufc-star-bj-penn-faces-family-abuse-charges-hawaii",
            "upvotes": 2057,
            "date": "05/28/2025",
            "thumbnail": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0801%2Fr577751_1296x729_16%2D9.jpg",
            "top_comments": [
                "This guy is going to do something absolutely horrific. He believes his mother was replaced and not his actual “mother”. \n\nHe very much has CTE and he’s not going to get better unfortunately.",
                "Penn \"recently claimed online that multiple members of his family are missing. He has accused unnamed imposters of replacing those family members in an effort to steal his inheritance\"\n\nThat's really bad and this guy needs help ASAP.",
                "In the next few years, it's going to become clearer and clearer just how brutal MMA is to fighters' brains. It's getting sad to be a longtime fan, and seeing your heroes go out like this.",
                "> According to online records, Penn, 46, was arrested on Sunday and released on $2,000 bail. He was arrested again and placed on $1,000 bail on Monday, per online records. \n\nIf you get arrested, bail out, and then get arrested again the next day for doing the same or similar thing, bail should be off the table.",
                "Kind of terrifying it took this long. He’s been making the statements & threats for a while. Hope he gets the help he needs.",
                "I met him when I lived in Hawaii about fifteen years ago and he didn't seem \"right\" then. Ironically it was at an army mma event so there was plenty of CTE going around so he fit in perfectly.",
                "It was very apparent this guy is not mentally all there when he was on Joe Rogan with Tulsi Gabbard not too long ago",
                "He’s clearly suffering from Capgras Syndrome and has been for a while.",
                "I hope he gets the help he needs. It's obvious he's suffered some CTE.",
                "Bj was always nuts. I grew up the same town."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Violent break-in at Beanie Babies mogul Ty Warner's California home left woman in coma: DA",
            "external_url": "https://abcnews.go.com/US/beanie-babies-mogul-ty-warner-california-home-invasion/story?id=122249852",
            "upvotes": 805,
            "date": "05/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/04fa225b-8ba6-48c3-976e-32d88887436d/beanie-babies_1748391049310_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The victim — identified in the criminal complaint as L. Malek-Aslanian — was transported by ambulance to a local hospital. The attack left her “comatose due to brain injury,” the complaint stated.\n\nThe complaint alleges that Phay entered the mansion with the intent to burglarize it, then held Malek-Aslanian against her will and assaulted her, causing great bodily injury. The victim was “particularly vulnerable,” the complaint stated.",
                "A Nevada man now faces multiple charges, including attempted murder, in connection with the home invasion and assault, according to the Santa Barbara County District Attorney's Office.\n\nThe incident unfolded on May 21 at the Montecito home of Warner, according to court filings obtained by ABC News.",
                "The article doesn’t mention who the woman is at all.",
                "Did anyone watch the video on that site?  That newsreader's voice is so unsettling I thought it was AI.  It has to be AI.",
                "> Beanie Babies mogul\n\n\nThat should not be an actual thing.",
                "Not lying here my first thoughts were oh great some guy who couldn't give up on beenie babie investment. However after reading the article umm it would have been funnier it was but dang the poor woman. hope she pulls through."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/28/2025 20:10:22 UTC"
}