{
    "posts": [
        {
            "category": "HOT",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 5507,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "But Navajo code talkers are gone, among other major subjects",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "Let’s get government employees their jobs back now.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "This was fucked, but it was part of a larger auto removal process that targeted anything that mentioned the accomplishments of minorities or women. This was reinstated only because of the complaints. \n\nThere were several pages highlighting the accomplishments of female and minority servicemembers that are now gone. They explicitly DO NOT want to celebrate diversity."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 9401,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "[removed]",
                "How many times has this company filed for bankruptcy?",
                "“I don’t know about you, but I’m feeling 22!”",
                "Not so forever anymore.",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "Their quality drastically declines by the day, it seems. I used to have a few decent pieces from them, but more recently nothing I've bought has lasted very well. However, I stopped shopping there about 2 years ago, so I cant speak on the quality currently. Although I have been in their stores since then and it appears to me that the quality is still continuing to decline.\n\nThey're also heavily reliant on fast fashion trends (see denim jean boots currently on their website), which many consumers aren't as interested in purchasing anymore. Shein, temu, fashion nova, and so many other online companies offer the same quality and styles for a fraction of the price as well for consumers who do still want fast fashion trends. F21 still charges the same amount (or even more) for their clothes as when they had somewhat okay quality, far less fast fashion competition, and more consumer demand for their clothing styles.\n\nI saw a jacket on their website selling for $60. cheap, mass produced fast fashion is not worth $60 to begin with. the same item can be found on shein for like $20. Most people will opt for shein if they want that item. \n\nI am Canadian, so I cant speak for American stores, but in canada the stores are consistently unpleasant to be in. Always understaffed, always insanely unorganized and every display is constantly messy, huge lack of consistency in what each location has available, store is also just generally \"trashy\" (for lack of a better word) with shotty lighting, no renovations made after whatever store occupied the space before f21, signs never accurate. It honestly looks like something out of the backrooms, but messier. The store quality really strongly reflects the product quality.\n\nI totally get why this store is going under. They dont have anything that makes them competitive or enticing to consumers compared to any other fast fashion retailer. They cheapened out their products to the point they're either fully unwearable or the product is such an ugly monstrosity that no one will even buy it, while still charging like they have any quality left. They have no care for consumer satisfaction, of course people dont want to buy from them.",
                "A business that depends on importing clothing during Trump tariffs is doomed.",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 19268,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "So we’re there. “Let them enforce it” is now reality.",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\".",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter",
                "How does this administration manage to chose the absolute wrong side of every single issue? They would be better if they just flipped a coin."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 3644,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "How does a family making $200k afford a child going to Harvard?",
                "With an endowment larger than the GDP of several nations combined its the least they can do"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Brown University professor deported despite judge’s order, defying US court",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/brown-university-rasha-alawieh-deported-lebanon",
            "upvotes": 2397,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/66cfac49c3d1e6c39345384c4c1f2be68c5ec1f5/0_119_3556_2134/master/3556.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cbafbefc10c13e90a31338700f8c6cab",
            "top_comments": [
                "We just don’t have checks and balances anymore huh\n\nAn executive branch that doesnt care\n\nA legislative branch that doesn’t work to hold the executive accountable in any way rn\n\nAnd a judicial branch that is both ignored and corrupt at the top",
                "Common theme you'll see with this administration is \"defying US court\"",
                ">The officer asked her to explain why she had multiple photos of Hezbollah fighters and martyrs on her phone.\n\n>“I have a lot of WhatsApp groups with families and friends who send them,” she replied. “I am a Shia Muslim, and he is a religious figure. He has a lot of teachings, and he is highly regarded in the Shia community. He the head of Hezbollah.”\n\n>The officer asked how Alawieh feels about Nasrallah.\n\n>“I think if you listen to one of his sermons, you would know what I mean,” she replied, according the transcript. “He is a religious, spiritual person.”\n\n>The officer asked her if she supported Hezbollah and what the organization stands for.\n\n>“I don’t,” Alawieh replied.\n\n>But, the officer said, she had high regard for the leader of Hezbollah.\n\n>“From a religious perspective,” she said.\n\n>The officer asked if she knew that Hezbollah had been designated as a terrorist organization. “Yes,” she said. “I’m not much into politics. But yes.”\n\n>The officer then asked her about the photos of Iran’s leader, Khamenei.\n\n>“Again, I am a Shia Muslim,” Alawieh said. “He’s a religious figure. It has nothing to do with politics. It’s all religious, spiritual things.”\n\n>The officer asked why she deleted photos from her phone one or two days before flying into Logan.\n\n>“Because I didn’t want the perception,” Alawieh said. “But I know I’m not doing anything wrong. I’m not related to anything politically or militarily.”\n\n>The interview ended with the officer telling her she would not be allowed to re-enter the United States.\n\nThis is quoted from a post over at r/medicine",
                "All these years I thought defying a judge was wrong and would get you held in contempt or something.  I guess that's just for us poors.",
                "> Federal prosecutors on Monday alleged that they deported 34-year-old Rasha Alawieh after discovering “sympathetic photos and videos” of prominent figures of Iran-backed Hezbollah, an immigration officer wrote in a report cited by Politico. A US homeland security department statement reported by NBC also said Alawieh had recently attended the funeral of Hezbollah leader Hassan Nasrallah.\n\n\nTo be clear, none of those alleged activities are illegal. None.",
                "Is homeland security going through visa-holder's social media and just deporting people who exercise their 1A in a way the administration doesn't like?",
                "If you wait until it affects you, you risk standing alone.",
                "They hate brown people.\n\nThey hate professors.\n\nA Brown professor had no chance.",
                "Not a professor. \n\n\nBrown noted that Alawieh had a clinical appointment with the university but was an employee of Brown Medicine, a non-profit that is affiliated with the medical school but is not operated by the university.",
                "If there is a crime committed, arrest them. If there is no crime, then there is no denying them their free speech rights. Simple as that. Once we start pretending that the first amendment is just a suggestion, it's dead and gone. And not just for some of us."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "A Spending Freeze at the FDA Threatens Safety of Food Supply, Current Staffers Say - Consumer Reports",
            "external_url": "https://www.consumerreports.org/health/food-safety/fda-spending-freeze-threatens-safety-of-food-supply-a7676246448/",
            "upvotes": 1618,
            "date": "03/17/2025",
            "thumbnail": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1741207022/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cuts-at-FDA-are-putting-consumers-at-risk-0325",
            "top_comments": [
                "Oh awesome, simple awesome\n\n\nInfant formula factories, really good stuff\n\n\nKilling Americans for no reason, awesome president no notes",
                "But according to RFK Jr the real threat is the riboflavo-something (he can't pronounce it) he saw on the ingredient list.",
                "For anyone interested. The FDA posts recalls on their webpage and you can see there are a few food recalls every week across the nation. Things like listeria, elevated levels of lead/arsenic, or other contamination. Just google FDA Recalls and then you can go sort based on drug/food/device/ etc\n\nI would imagine that if foods are not being purchased for testing then there would be a gap in reporting recalls as well as holding manufacturers accountable for physically taking their product off the shelf. The reporting appears consistent and up to date with the most recent recall being 3/17.",
                "Yes let's pause spending at the FDA while bird flu is ravaging flocks of chickens",
                "If Trumpers had any brains, they’d be protesting right now. ",
                "Thankfully eating food is optional so its safety is a luxury more than a requirement /s",
                "Some of you may die, but that is a sacrifice I’m prepared to make….",
                "Reminds me of some little news report I heard years ago. They're profiling some guy who owns a food truck and how he never washes his hands. His rationale was that if someone got food poisoning from eating something he prepared, they could sue him. No thought for taking a few minutes to prevent the problem in the first place, no, this guy has to risk seriously inconveniencing other people so that *he* isn't personally inconvenienced.",
                "These dumbfucks are gonna get us all killed for no reason except for \"cutting unnecessary expenses\". And their putting that money in their pockets. This is so fucking stupid I can't even wrap my head around it.",
                "Eh, I am sure that MTG or someone equally qualified, (maybe Big Balls) will be appointed to figure this one out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 1369,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "Now do the LASD. And, good luck with it.",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available.",
                "Federal database needed .",
                "This should be a nationwide system and database but it will not happen in my lifetime and I'm only 45"
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "HOT",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 70295,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "[deleted]",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "It's actually real. Try going to https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/medal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\n the URL redirects to \"deimedal\"",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "I am waiting for veterans to be pissed off really bad...",
                "Where the \"support our troops\" crowd at now?",
                "Hegseth must be a yuge racist like his boss."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Michigan boy's death raises concerns about unregulated hyperbaric oxygen therapy",
            "external_url": "https://www.nbcnews.com/news/us-news/-michigan-boys-death-raises-concerns-hyperbaric-therapy-rcna196260",
            "upvotes": 1605,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250313-Hyperbaric-chamber-Oxford-Center-Thomas-Cooper-aa-1225-83c28d.jpg",
            "top_comments": [
                "Regulation is written in blood.",
                "The part that kills me is it takes all of 20 seconds to figure out that this stuff doesn't work.  And yet all it takes to find suckers is to say they're lying to you! And now you will find scads of people who now believe anything you say.  \n\n\nSpeaking of which,  I have found the cure for depression, insomnia,  headaches,  erectile dysfunction,  baldness and cancer! But the greedy medical establishment doesn't want my miracle cure all to be sold because it'd put them out of business. PM for details!",
                "I mean the fact they were promoting it for ADHD, and ED cures just for patients to come in (ped the owner lying) is pretty insane. It needs to be regulated so idiots like this don't keep doing this. Oxygen is a drug and needs to be prescribed correctly",
                "There is a cult/wacko group that believes and promotes the rich and/or government have suped up \"medical beds\" that can instantly cure any aliment.\nThese snake oil salesmen are playing off that thread of desperation.\nRegulation might help, but we need education...and frankly I would suggest regulation for the people advocating and promoting agreed conspiracies.",
                "We humans really have to stop pretending like we're special and have found some secret trick or cure that \"they\" have been hiding from us.  We never will, we all think we're special, and have somehow gained secret knowledge from a YouTube commercial or some influencer or podcaster (where the secret knowledge is usually kept).  \n\nTo quote Tim Minchin: \"alternative medicine, by definition, has either not been proved to work or has been proved not to work.  You know what they call alternative medicine that's been proved to work?  Medicine.\"",
                "They did Apollo 1 to a child.",
                "[deleted]",
                "Oh, so the Deadpool therapy doesn’t work?",
                "I'm sure RFK Jr will get right on this.",
                "Anti-science, conservative, partisan rhetoric is cooking peoples' brains. Fully being deep-fried by the matrix."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 333,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "Did they try turning the water spigot on?",
                "I hope they dont get a single cent from the federal government, same as they wanted for California.",
                "Have they thought about putting tariffs on the fire?",
                "Why don't they just turn the water on?",
                "I came to watch all the mean political snipes lol",
                "Maybe if they would have raked their grass a little more... who knows.  Now, I don't know anything about this kind of thing, but the president always blames fires on a lack of raking."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 64,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "I will never forgive Pepsi for killing SoBe!",
                "Why would pepsi do this instead of just making their own product? They could have it positioned in stores right next to their products and people would probably see it and go for it. I know poppi already has a base etc. But still think a big company could just out position themselves, by better shelf space etc without spending 1.6 billion",
                "Are they going to rename it Popsi?",
                "GOD DAMNIT. I liked buying these partially because I was excited about a new brand fighting the monopoly. Guess that’s gone now :/",
                "\"Functional\" drinks? What fresh marketing garble is this? All drinks are functional. They enact the function of hydrating you.",
                "BIGSODA yet gobbles up another competitor to diversify their brand portfolio. everyone has a price and you'd be crazy not to accept it bc they'll own you one way or another (supply chain/distribution/etc).",
                "welp it was a good ride gg's",
                "There should be a law that when a company reaches a certain market cap, they CANNOT buy any more.   Survive on your own product / creativity, or suffer from the eventual implosion.  Think AOL or Sears…"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 334,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "Did they try turning the water spigot on?",
                "I hope they dont get a single cent from the federal government, same as they wanted for California.",
                "Have they thought about putting tariffs on the fire?",
                "Why don't they just turn the water on?",
                "I came to watch all the mean political snipes lol",
                "Maybe if they would have raked their grass a little more... who knows.  Now, I don't know anything about this kind of thing, but the president always blames fires on a lack of raking."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 5547,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "But Navajo code talkers are gone, among other major subjects",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "Let’s get government employees their jobs back now.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "This was fucked, but it was part of a larger auto removal process that targeted anything that mentioned the accomplishments of minorities or women. This was reinstated only because of the complaints. \n\nThere were several pages highlighting the accomplishments of female and minority servicemembers that are now gone. They explicitly DO NOT want to celebrate diversity."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Brown University professor deported despite judge’s order, defying US court",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/brown-university-rasha-alawieh-deported-lebanon",
            "upvotes": 2397,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/66cfac49c3d1e6c39345384c4c1f2be68c5ec1f5/0_119_3556_2134/master/3556.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cbafbefc10c13e90a31338700f8c6cab",
            "top_comments": [
                "We just don’t have checks and balances anymore huh\n\nAn executive branch that doesnt care\n\nA legislative branch that doesn’t work to hold the executive accountable in any way rn\n\nAnd a judicial branch that is both ignored and corrupt at the top",
                "Common theme you'll see with this administration is \"defying US court\"",
                ">The officer asked her to explain why she had multiple photos of Hezbollah fighters and martyrs on her phone.\n\n>“I have a lot of WhatsApp groups with families and friends who send them,” she replied. “I am a Shia Muslim, and he is a religious figure. He has a lot of teachings, and he is highly regarded in the Shia community. He the head of Hezbollah.”\n\n>The officer asked how Alawieh feels about Nasrallah.\n\n>“I think if you listen to one of his sermons, you would know what I mean,” she replied, according the transcript. “He is a religious, spiritual person.”\n\n>The officer asked her if she supported Hezbollah and what the organization stands for.\n\n>“I don’t,” Alawieh replied.\n\n>But, the officer said, she had high regard for the leader of Hezbollah.\n\n>“From a religious perspective,” she said.\n\n>The officer asked if she knew that Hezbollah had been designated as a terrorist organization. “Yes,” she said. “I’m not much into politics. But yes.”\n\n>The officer then asked her about the photos of Iran’s leader, Khamenei.\n\n>“Again, I am a Shia Muslim,” Alawieh said. “He’s a religious figure. It has nothing to do with politics. It’s all religious, spiritual things.”\n\n>The officer asked why she deleted photos from her phone one or two days before flying into Logan.\n\n>“Because I didn’t want the perception,” Alawieh said. “But I know I’m not doing anything wrong. I’m not related to anything politically or militarily.”\n\n>The interview ended with the officer telling her she would not be allowed to re-enter the United States.\n\nThis is quoted from a post over at r/medicine",
                "All these years I thought defying a judge was wrong and would get you held in contempt or something.  I guess that's just for us poors.",
                "> Federal prosecutors on Monday alleged that they deported 34-year-old Rasha Alawieh after discovering “sympathetic photos and videos” of prominent figures of Iran-backed Hezbollah, an immigration officer wrote in a report cited by Politico. A US homeland security department statement reported by NBC also said Alawieh had recently attended the funeral of Hezbollah leader Hassan Nasrallah.\n\n\nTo be clear, none of those alleged activities are illegal. None.",
                "Is homeland security going through visa-holder's social media and just deporting people who exercise their 1A in a way the administration doesn't like?",
                "If you wait until it affects you, you risk standing alone.",
                "They hate brown people.\n\nThey hate professors.\n\nA Brown professor had no chance.",
                "Not a professor. \n\n\nBrown noted that Alawieh had a clinical appointment with the university but was an employee of Brown Medicine, a non-profit that is affiliated with the medical school but is not operated by the university.",
                "If there is a crime committed, arrest them. If there is no crime, then there is no denying them their free speech rights. Simple as that. Once we start pretending that the first amendment is just a suggestion, it's dead and gone. And not just for some of us."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 3638,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "How does a family making $200k afford a child going to Harvard?",
                "With an endowment larger than the GDP of several nations combined its the least they can do"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Employee charged in killing of trucking CEO found after fire in Chicago suburb",
            "external_url": "https://www.cbsnews.com/chicago/news/employee-charged-killing-of-trucking-ceo-crestwood/",
            "upvotes": 508,
            "date": "03/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/17/1a39fdd1-24a5-49c7-8cd7-6b5888b0951e/thumbnail/1200x630/997c6d131cae3dc65a5c8e0ee40dc028/untitled-2025-03-17t093958-944.png?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [
                "I don't think any working class person would ever hurt a CEO they give us so many jobs and benefits. \n\nSomething's fishy here. Innocent",
                "framing an innocent employee for fire+accident death of ceo is peak USA,\nI think the ceo was not putting enough hours into his work and made a silly mistake that led to this.\nif they cut the salary of the CEO to the lowest earner of the company, then the real ceos who are in for the work and not to make money will succeed",
                "Jeramie Bizzle.\n\nI wonder how it went growing up with that name?",
                "Just gonna put it out there, anyone in the trucking industry who knows anything about brokering loads knows that EVERY Chicago based Trucking company is a scam operation.\n\nMost freight brokers will automatically ban a company based out of Chicago because they are notoriously always scamers.",
                "You don’t use dental floss on your throat. He also stored flammable materials in his house. Sounds like the employee is innocent and the CEO was just incompetent.",
                "I’m not buyin it. Sounds like the guy was framed",
                "Oh no! Not a job creator! Who’s going to create the jobs now?",
                "These guys don't truck around.",
                "So strange and completely unexpected. This sad poor must have confused that beautiful job creators infinite generosity with something else.",
                "Here before the thread gets locked. You cant use \"the man`s\" platform to talk about bringing down \"the man\"."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 1376,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "Now do the LASD. And, good luck with it.",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available.",
                "Federal database needed .",
                "This should be a nationwide system and database but it will not happen in my lifetime and I'm only 45"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 9404,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "[removed]",
                "How many times has this company filed for bankruptcy?",
                "“I don’t know about you, but I’m feeling 22!”",
                "Not so forever anymore.",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "Their quality drastically declines by the day, it seems. I used to have a few decent pieces from them, but more recently nothing I've bought has lasted very well. However, I stopped shopping there about 2 years ago, so I cant speak on the quality currently. Although I have been in their stores since then and it appears to me that the quality is still continuing to decline.\n\nThey're also heavily reliant on fast fashion trends (see denim jean boots currently on their website), which many consumers aren't as interested in purchasing anymore. Shein, temu, fashion nova, and so many other online companies offer the same quality and styles for a fraction of the price as well for consumers who do still want fast fashion trends. F21 still charges the same amount (or even more) for their clothes as when they had somewhat okay quality, far less fast fashion competition, and more consumer demand for their clothing styles.\n\nI saw a jacket on their website selling for $60. cheap, mass produced fast fashion is not worth $60 to begin with. the same item can be found on shein for like $20. Most people will opt for shein if they want that item. \n\nI am Canadian, so I cant speak for American stores, but in canada the stores are consistently unpleasant to be in. Always understaffed, always insanely unorganized and every display is constantly messy, huge lack of consistency in what each location has available, store is also just generally \"trashy\" (for lack of a better word) with shotty lighting, no renovations made after whatever store occupied the space before f21, signs never accurate. It honestly looks like something out of the backrooms, but messier. The store quality really strongly reflects the product quality.\n\nI totally get why this store is going under. They dont have anything that makes them competitive or enticing to consumers compared to any other fast fashion retailer. They cheapened out their products to the point they're either fully unwearable or the product is such an ugly monstrosity that no one will even buy it, while still charging like they have any quality left. They have no care for consumer satisfaction, of course people dont want to buy from them.",
                "A business that depends on importing clothing during Trump tariffs is doomed.",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "A Spending Freeze at the FDA Threatens Safety of Food Supply, Current Staffers Say - Consumer Reports",
            "external_url": "https://www.consumerreports.org/health/food-safety/fda-spending-freeze-threatens-safety-of-food-supply-a7676246448/",
            "upvotes": 1621,
            "date": "03/17/2025",
            "thumbnail": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1741207022/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cuts-at-FDA-are-putting-consumers-at-risk-0325",
            "top_comments": [
                "Oh awesome, simple awesome\n\n\nInfant formula factories, really good stuff\n\n\nKilling Americans for no reason, awesome president no notes",
                "But according to RFK Jr the real threat is the riboflavo-something (he can't pronounce it) he saw on the ingredient list.",
                "For anyone interested. The FDA posts recalls on their webpage and you can see there are a few food recalls every week across the nation. Things like listeria, elevated levels of lead/arsenic, or other contamination. Just google FDA Recalls and then you can go sort based on drug/food/device/ etc\n\nI would imagine that if foods are not being purchased for testing then there would be a gap in reporting recalls as well as holding manufacturers accountable for physically taking their product off the shelf. The reporting appears consistent and up to date with the most recent recall being 3/17.",
                "Yes let's pause spending at the FDA while bird flu is ravaging flocks of chickens",
                "If Trumpers had any brains, they’d be protesting right now. ",
                "Thankfully eating food is optional so its safety is a luxury more than a requirement /s",
                "Some of you may die, but that is a sacrifice I’m prepared to make….",
                "Reminds me of some little news report I heard years ago. They're profiling some guy who owns a food truck and how he never washes his hands. His rationale was that if someone got food poisoning from eating something he prepared, they could sue him. No thought for taking a few minutes to prevent the problem in the first place, no, this guy has to risk seriously inconveniencing other people so that *he* isn't personally inconvenienced.",
                "These dumbfucks are gonna get us all killed for no reason except for \"cutting unnecessary expenses\". And their putting that money in their pockets. This is so fucking stupid I can't even wrap my head around it.",
                "Eh, I am sure that MTG or someone equally qualified, (maybe Big Balls) will be appointed to figure this one out."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Thames Water wins court approval in London for emergency funding deal",
            "external_url": "https://apnews.com/article/britain-thames-water-emergency-funding-fa1bcf9f4cbb023cb21b1ad770d66582",
            "upvotes": 209,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like \"Corporate socialism\" to me: company get billions from a government to improve supply of a necessity to people, company gives that money to shareholders and then goes back to government to dig it out of the hole the company created.",
                "This is the bullshit banking Bailout allover again.....",
                ">Consumers and politicians have criticized the company, arguing that Thames Water created its own problems by paying overly generous dividends to investors and high salaries to executives while failing to invest in pipelines, pumps and reservoirs. Company executives say the fault lies with regulators who kept bills too low for too long, starving the company of the cash it needed to fund improvements.\n\nHow could a cash starved company pay overly generous dividends and executives' high salaries? \nI think such a badly run company should become bankrupt, make investors' shares worthless and the government buy it out for £1.\n\nEdit: spooling mistaek.",
                "Unwilling Thames Water customer here : Re-Nationalise it without compensation and hunt down and sequester the funds of the Boardroom members which caused this all nonsense since privatisation.\n\nWill Thatcher acolyte Starmer's Government  do any of that - of course not - too busy persecuting the disabled to pay attention.",
                "Nobody is reading the article. \n\nThe funding is from private creditors, not the government. It was being held up by the court due to an appeal from some existing creditors who claimed the interest rate on the new deal was too high.\n\nThis isn't a government bailout (yet)."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 5529,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "But Navajo code talkers are gone, among other major subjects",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "Let’s get government employees their jobs back now.",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "This was fucked, but it was part of a larger auto removal process that targeted anything that mentioned the accomplishments of minorities or women. This was reinstated only because of the complaints. \n\nThere were several pages highlighting the accomplishments of female and minority servicemembers that are now gone. They explicitly DO NOT want to celebrate diversity."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Brown University professor deported despite judge’s order, defying US court",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/brown-university-rasha-alawieh-deported-lebanon",
            "upvotes": 2408,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/66cfac49c3d1e6c39345384c4c1f2be68c5ec1f5/0_119_3556_2134/master/3556.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cbafbefc10c13e90a31338700f8c6cab",
            "top_comments": [
                "We just don’t have checks and balances anymore huh\n\nAn executive branch that doesnt care\n\nA legislative branch that doesn’t work to hold the executive accountable in any way rn\n\nAnd a judicial branch that is both ignored and corrupt at the top",
                "Common theme you'll see with this administration is \"defying US court\"",
                ">The officer asked her to explain why she had multiple photos of Hezbollah fighters and martyrs on her phone.\n\n>“I have a lot of WhatsApp groups with families and friends who send them,” she replied. “I am a Shia Muslim, and he is a religious figure. He has a lot of teachings, and he is highly regarded in the Shia community. He the head of Hezbollah.”\n\n>The officer asked how Alawieh feels about Nasrallah.\n\n>“I think if you listen to one of his sermons, you would know what I mean,” she replied, according the transcript. “He is a religious, spiritual person.”\n\n>The officer asked her if she supported Hezbollah and what the organization stands for.\n\n>“I don’t,” Alawieh replied.\n\n>But, the officer said, she had high regard for the leader of Hezbollah.\n\n>“From a religious perspective,” she said.\n\n>The officer asked if she knew that Hezbollah had been designated as a terrorist organization. “Yes,” she said. “I’m not much into politics. But yes.”\n\n>The officer then asked her about the photos of Iran’s leader, Khamenei.\n\n>“Again, I am a Shia Muslim,” Alawieh said. “He’s a religious figure. It has nothing to do with politics. It’s all religious, spiritual things.”\n\n>The officer asked why she deleted photos from her phone one or two days before flying into Logan.\n\n>“Because I didn’t want the perception,” Alawieh said. “But I know I’m not doing anything wrong. I’m not related to anything politically or militarily.”\n\n>The interview ended with the officer telling her she would not be allowed to re-enter the United States.\n\nThis is quoted from a post over at r/medicine",
                "All these years I thought defying a judge was wrong and would get you held in contempt or something.  I guess that's just for us poors.",
                "> Federal prosecutors on Monday alleged that they deported 34-year-old Rasha Alawieh after discovering “sympathetic photos and videos” of prominent figures of Iran-backed Hezbollah, an immigration officer wrote in a report cited by Politico. A US homeland security department statement reported by NBC also said Alawieh had recently attended the funeral of Hezbollah leader Hassan Nasrallah.\n\n\nTo be clear, none of those alleged activities are illegal. None.",
                "Is homeland security going through visa-holder's social media and just deporting people who exercise their 1A in a way the administration doesn't like?",
                "If you wait until it affects you, you risk standing alone.",
                "They hate brown people.\n\nThey hate professors.\n\nA Brown professor had no chance.",
                "Not a professor. \n\n\nBrown noted that Alawieh had a clinical appointment with the university but was an employee of Brown Medicine, a non-profit that is affiliated with the medical school but is not operated by the university.",
                "If there is a crime committed, arrest them. If there is no crime, then there is no denying them their free speech rights. Simple as that. Once we start pretending that the first amendment is just a suggestion, it's dead and gone. And not just for some of us."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 334,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "Did they try turning the water spigot on?",
                "I hope they dont get a single cent from the federal government, same as they wanted for California.",
                "Have they thought about putting tariffs on the fire?",
                "Why don't they just turn the water on?",
                "I came to watch all the mean political snipes lol",
                "Maybe if they would have raked their grass a little more... who knows.  Now, I don't know anything about this kind of thing, but the president always blames fires on a lack of raking."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 3638,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "How does a family making $200k afford a child going to Harvard?",
                "With an endowment larger than the GDP of several nations combined its the least they can do"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 1376,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "Now do the LASD. And, good luck with it.",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available.",
                "Federal database needed .",
                "This should be a nationwide system and database but it will not happen in my lifetime and I'm only 45"
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "RISING",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 9401,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "[removed]",
                "How many times has this company filed for bankruptcy?",
                "“I don’t know about you, but I’m feeling 22!”",
                "Not so forever anymore.",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "Their quality drastically declines by the day, it seems. I used to have a few decent pieces from them, but more recently nothing I've bought has lasted very well. However, I stopped shopping there about 2 years ago, so I cant speak on the quality currently. Although I have been in their stores since then and it appears to me that the quality is still continuing to decline.\n\nThey're also heavily reliant on fast fashion trends (see denim jean boots currently on their website), which many consumers aren't as interested in purchasing anymore. Shein, temu, fashion nova, and so many other online companies offer the same quality and styles for a fraction of the price as well for consumers who do still want fast fashion trends. F21 still charges the same amount (or even more) for their clothes as when they had somewhat okay quality, far less fast fashion competition, and more consumer demand for their clothing styles.\n\nI saw a jacket on their website selling for $60. cheap, mass produced fast fashion is not worth $60 to begin with. the same item can be found on shein for like $20. Most people will opt for shein if they want that item. \n\nI am Canadian, so I cant speak for American stores, but in canada the stores are consistently unpleasant to be in. Always understaffed, always insanely unorganized and every display is constantly messy, huge lack of consistency in what each location has available, store is also just generally \"trashy\" (for lack of a better word) with shotty lighting, no renovations made after whatever store occupied the space before f21, signs never accurate. It honestly looks like something out of the backrooms, but messier. The store quality really strongly reflects the product quality.\n\nI totally get why this store is going under. They dont have anything that makes them competitive or enticing to consumers compared to any other fast fashion retailer. They cheapened out their products to the point they're either fully unwearable or the product is such an ugly monstrosity that no one will even buy it, while still charging like they have any quality left. They have no care for consumer satisfaction, of course people dont want to buy from them.",
                "A business that depends on importing clothing during Trump tariffs is doomed.",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "A Spending Freeze at the FDA Threatens Safety of Food Supply, Current Staffers Say - Consumer Reports",
            "external_url": "https://www.consumerreports.org/health/food-safety/fda-spending-freeze-threatens-safety-of-food-supply-a7676246448/",
            "upvotes": 1622,
            "date": "03/17/2025",
            "thumbnail": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1741207022/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cuts-at-FDA-are-putting-consumers-at-risk-0325",
            "top_comments": [
                "Oh awesome, simple awesome\n\n\nInfant formula factories, really good stuff\n\n\nKilling Americans for no reason, awesome president no notes",
                "But according to RFK Jr the real threat is the riboflavo-something (he can't pronounce it) he saw on the ingredient list.",
                "For anyone interested. The FDA posts recalls on their webpage and you can see there are a few food recalls every week across the nation. Things like listeria, elevated levels of lead/arsenic, or other contamination. Just google FDA Recalls and then you can go sort based on drug/food/device/ etc\n\nI would imagine that if foods are not being purchased for testing then there would be a gap in reporting recalls as well as holding manufacturers accountable for physically taking their product off the shelf. The reporting appears consistent and up to date with the most recent recall being 3/17.",
                "Yes let's pause spending at the FDA while bird flu is ravaging flocks of chickens",
                "If Trumpers had any brains, they’d be protesting right now. ",
                "Thankfully eating food is optional so its safety is a luxury more than a requirement /s",
                "Some of you may die, but that is a sacrifice I’m prepared to make….",
                "Reminds me of some little news report I heard years ago. They're profiling some guy who owns a food truck and how he never washes his hands. His rationale was that if someone got food poisoning from eating something he prepared, they could sue him. No thought for taking a few minutes to prevent the problem in the first place, no, this guy has to risk seriously inconveniencing other people so that *he* isn't personally inconvenienced.",
                "These dumbfucks are gonna get us all killed for no reason except for \"cutting unnecessary expenses\". And their putting that money in their pockets. This is so fucking stupid I can't even wrap my head around it.",
                "Eh, I am sure that MTG or someone equally qualified, (maybe Big Balls) will be appointed to figure this one out."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Employee charged in killing of trucking CEO found after fire in Chicago suburb",
            "external_url": "https://www.cbsnews.com/chicago/news/employee-charged-killing-of-trucking-ceo-crestwood/",
            "upvotes": 507,
            "date": "03/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/17/1a39fdd1-24a5-49c7-8cd7-6b5888b0951e/thumbnail/1200x630/997c6d131cae3dc65a5c8e0ee40dc028/untitled-2025-03-17t093958-944.png?v=0f810147b409d4839bb6b9850f758494",
            "top_comments": [
                "I don't think any working class person would ever hurt a CEO they give us so many jobs and benefits. \n\nSomething's fishy here. Innocent",
                "framing an innocent employee for fire+accident death of ceo is peak USA,\nI think the ceo was not putting enough hours into his work and made a silly mistake that led to this.\nif they cut the salary of the CEO to the lowest earner of the company, then the real ceos who are in for the work and not to make money will succeed",
                "Jeramie Bizzle.\n\nI wonder how it went growing up with that name?",
                "Just gonna put it out there, anyone in the trucking industry who knows anything about brokering loads knows that EVERY Chicago based Trucking company is a scam operation.\n\nMost freight brokers will automatically ban a company based out of Chicago because they are notoriously always scamers.",
                "You don’t use dental floss on your throat. He also stored flammable materials in his house. Sounds like the employee is innocent and the CEO was just incompetent.",
                "I’m not buyin it. Sounds like the guy was framed",
                "Oh no! Not a job creator! Who’s going to create the jobs now?",
                "These guys don't truck around.",
                "So strange and completely unexpected. This sad poor must have confused that beautiful job creators infinite generosity with something else.",
                "Here before the thread gets locked. You cant use \"the man`s\" platform to talk about bringing down \"the man\"."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 19273,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "So we’re there. “Let them enforce it” is now reality.",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\".",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter",
                "How does this administration manage to chose the absolute wrong side of every single issue? They would be better if they just flipped a coin."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Thames Water wins court approval in London for emergency funding deal",
            "external_url": "https://apnews.com/article/britain-thames-water-emergency-funding-fa1bcf9f4cbb023cb21b1ad770d66582",
            "upvotes": 209,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like \"Corporate socialism\" to me: company get billions from a government to improve supply of a necessity to people, company gives that money to shareholders and then goes back to government to dig it out of the hole the company created.",
                "This is the bullshit banking Bailout allover again.....",
                ">Consumers and politicians have criticized the company, arguing that Thames Water created its own problems by paying overly generous dividends to investors and high salaries to executives while failing to invest in pipelines, pumps and reservoirs. Company executives say the fault lies with regulators who kept bills too low for too long, starving the company of the cash it needed to fund improvements.\n\nHow could a cash starved company pay overly generous dividends and executives' high salaries? \nI think such a badly run company should become bankrupt, make investors' shares worthless and the government buy it out for £1.\n\nEdit: spooling mistaek.",
                "Unwilling Thames Water customer here : Re-Nationalise it without compensation and hunt down and sequester the funds of the Boardroom members which caused this all nonsense since privatisation.\n\nWill Thatcher acolyte Starmer's Government  do any of that - of course not - too busy persecuting the disabled to pay attention.",
                "Nobody is reading the article. \n\nThe funding is from private creditors, not the government. It was being held up by the court due to an appeal from some existing creditors who claimed the interest rate on the new deal was too high.\n\nThis isn't a government bailout (yet)."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "03/17/2025 20:09:22 UTC"
}