{
    "posts": [
        {
            "category": "HOT",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 11052,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[ Removed by Reddit ]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "I'll bet he wants to bring back debtor's prison.",
                "I thought the Education Department was abolished. What are they doing still working?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 41976,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.",
                "I scream this into the void whenever this topic comes up, and I will continue doing so:\n\nI was a flight instructor for nearly a decade. I taught hundreds of students from recreational private pilots, up through commercial pilots and flight instructors. I taught many women, people of color, and even one trans person (that I knew of). And of course, mostly white dudes. \n\nThere is *absolutely zero* correlation between a person's gender or race and their ability to fly an airplane, make critical decisions during a flight, or manage resources.\n\nActually, I take that back. Women were generally better at studying and were less likely to take risks. The worst students were usually rich old men. \n\nAirlines **do not** hire under-performing candidates to meet \"DEI quotas.\" Everyone has to perform to the same standard. Sure, there may be initiatives to help those who have been subjected to an industry with a deeply ingrained \"good ol' boy\" tradition, but not at the expense of safety, performance, and quality. You either meet the standards, or you don't.\n\nThese cowards hide behind DEI and say stuff like \"Ohh I just don't like these woke hiring practices that allow under-qualified people in, women can be perfectly fine pilots too!\" But that's *bullshit.* They are cowards who refuse to say it with their chest. They think women can't be pilots. They think black people can't be pilots. They think trans people can't be pilots. It's fucking horseshit and they are sad little pussies who are too afraid to be openly sexist and racist.\n\nTake it from me, an *actual professional* with years of experience in the industry. Not some dipshit podcaster or brainless news personality.",
                "Unfortunately, america no longer has a justice system.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Hope she wins and wins big"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 3374,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "This will not end well.",
                "We have reached the eugenics part of the plot.",
                "This seems a little anti-HIPAA ish. Our private medical data is protected from sharing unless consent is given. I understand that some instances, public emergency, national security, criminal investigation, can allow the government access. But, I don’t feel Autism research is enough. I know that ‘some’ feel there is an Autism emergency, but there is no evidence to support that. Any increase in the rate of Autism is easily explained by widened diagnostic criteria and better screenings. I’m really not thrilled about allowing these handpicked ‘researchers’ unfettered access to our personal data.",
                "Someone needs to diagnose RFK jr with autism so he will shut the fuck up."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 22998,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "Long term gain, though, right?\n\n...you guys?",
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "I’m confused, is America great again yet or not?",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "I think a corky laugh and a stable 401k would’ve been better than this.",
                "Bond yields are spiking again, too.  \nFaith is being lost in not just the dollar and U.S. equities, but Treasuries, too.  \nYikes.",
                "Every time a Republican is in office my life gets harder."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
            "external_url": "https://www.ctvnews.ca/world/article/person-found-on-elevated-surface-inside-trump-tower-in-new-york-is-arrested-police-say/",
            "upvotes": 2101,
            "date": "04/22/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2PADYAXEK5WCWYG67FNQU3FVSQ.jpg?smart=true&auth=28d8b408dc7fcee6c89b601bcc25a522afbde941aeb080eed5dff54b81d9e4f2&width=1200&height=630",
            "top_comments": [
                "What the fuck is an \"elevated surface\"?\n\nA platform? Stairs? Another Floor? High Heels?",
                "What does this even mean? Elevated surface? Arrested for what? Seriously wtf does this mean?",
                "Aaaand that's it. The title says everything and the article contains no further details.",
                ">Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say\n\n\n\nhe stole a pair of trump's lifts",
                "Who cares, hope he left some upper deckers. ",
                "Was it Trump in his shoe lifts?",
                "Don Jr coked out of his mind screaming from a balcony “I can fly!”",
                "That just leaves man, woman, camera and TV.",
                "He won’t be making it 4 years… he’s upsetting so much of his base lol.",
                "Wait is planking back in?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "China retreats from US private equity investments, FT reports",
            "external_url": "https://www.reuters.com/world/china/china-retreats-us-private-equity-investments-ft-reports-2025-04-21/",
            "upvotes": 2462,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ooooh. That’s going to cause interesting problems.",
                "God knows what kind of news we'll see in next month.",
                "I'm really fascinated by how no one who stands to lose much as a result of this has thought to speak up yet. You know, the super but not quite mega rich. Heck, even the mega rich. Aren't they worried?",
                "The flight from US Assets is worldwide, based on partially the “tariffs”, but mostly the unpredictable nature of the government ",
                "China isn’t messing around while Trump sits by the phone waiting for a call that isn’t coming.",
                "yay ... president trump made private equity cheaper, just like with stocks.\n\nNext eggs. Then infrastructure week.",
                "Best not to invest in Trump's mess?",
                "So how long before hyper-inflation and mass homelessness and starvation set in?",
                "Anyone have a non paywall link? Would like to learn something beyond the headlines.",
                "Oh no, less money to buy profitable companies and rape them for every last penny before letting them go bankrupt"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder",
            "external_url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc",
            "upvotes": 8665,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Patrick Crusius was automatically be sentenced to life in prison without parole in the massacre near the U.S.-Mexico border. The change of plea comes after local prosecutors took the death penalty off the table.\n\n>El Paso County District Attorney James Montoya declined to pursue the death penalty, saying that decision was driven by a majority of victims’ relatives who want the case to be over.\n\nI can see the sentiment of just wanting to not think about it anymore. The murderer is 26 now and will likely spend decades in [a Texas prison](https://www.texastribune.org/2022/08/24/texas-prisons-air-conditioning/).",
                "> About 100 people from victims’ families were seated in the gallery behind a few rows reserved for media, prosecutors and Crusius’ defense team. They will be given the time to give victim impact statements starting Monday afternoon. Dozens made emotional statements during a similar hearing in federal court in 2023 that lasted for three days.\n\n> The people who were killed at Walmart ranged in age from a 15-year-old high school athlete to elderly grandparents. They included immigrants, a retired city bus driver, a teacher, tradesmen including a former iron worker, and several Mexican nationals who had crossed the U.S. border on routine shopping trips.\n\nThose people leave behind a legacy of loved ones who will keep their memories alive. 100 loved ones to share their stories. This man leaves no legacy but hatred, and will be remembered as a bigoted monster. May he rot in prison and fade into obscurity.",
                "So death for the UHC CEO murderer, but this dude gets to live?  Cool.  Cool.",
                "Wait, hold on. This guy kills 23 people in a racist attack and isn't considered a terrorist, but a guy killing a corrupt CEO is a terrorist?",
                "> The online rant speaks of a “Hispanic invasion of Texas.”\n\n>“They are the instigators, not me,” it says. “I am simply defending my country from cultural and ethnic replacement brought on by an invasion.”\n\n\nAsshole never studied U.S. history, clearly. It’s the other way around.",
                "23 people. Killed. In a grocery store.  \n\nMake it make sense. 2 is horrible but 23????",
                "It's important to note that you cannot appeal a conviction in which you plead guilty to with much chance of success. \n\nMost appeals that are successful aren't about innocence, but procedural mistakes by the prosecution and law enforcement officers in the case. \n\nAs high profile as this is, I imagine that the last thing anyone wants is for someone to have made one tiny mistake in an otherwise open and shut case and this guy go free because of it. There is still the fact that the judge can alter sentencing, and order modifiers such as without parole, or non concurrent sentences, meaning a separate life sentence for each victim, to be stacked on top of each other. \n\nI'm not a huge fan of the death penalty, but that's not the only way to make sure this man never walks away free.",
                "Surely the charges will be as bad as Luigi, right?",
                "Five and a half frikkin years to get here? He posted his manifesto on one of the chan sites.\n\n\n OFC the families just want to move on now. IT'S BEEN OVER FIVE YEARS.",
                "I was just thinking about this the other day. Some madman guns down Hispanics at Walmart enraged at Mexicans under Trump's stoking of hatred, for said group. Mad man kills a mother and father leaving a baby homeless. Uncle of the baby is a MAGA lover, finds out Trump is coming, first thought is not overwhelming grief for his lost sister and orphaned niece, no he thinks! Bingo! If I grab the baby like a prop and head back to hospital where my sister and brother in law just died, maybe I can get a picture with Trump! https://www.theguardian.com/us-news/2019/aug/09/trump-el-paso-melania-orphan-baby-thumbs-up\nAnd he got his picture. I always think of this when people get shocked that the maga won't turn on him."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 4451,
            "date": "04/21/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "With a 2025 budget of $295 Million, cutting the IMLS will offset Trump's golf expenses.  \n\nMusk is still looking for cuts to help cover Trump's trip to the Superbowl and the Daytona 500.",
                "Yup our state library staff is being laid off due to federal cuts. It’s really depressing. These libraries help low income children with meals during the summer due to school being closed and not providing food.\n\nAll the money these oligarchs have and they’re cutting programs that help kids have food. This is despicable.",
                "There was a time when we used to look up to smart people.  \n\nNow, smart people are a threat to the dumb fucks trying to destroy the country for their own profit.",
                "Libraries: the nexus of evil",
                "Republicans have been against libraries and non-commercial museums for decades. Sad more voters didn't consider this outcome when voting to give them more power.",
                "This timeline is just getting depressing at this point.",
                "[This tweet remains relevant](https://x.com/sketchesbyboze/status/1304555319817797634?s=46&t=gYqP6Q5IoxKTzkC236AFpA)\n\n> my girlfriend regularly tells me “if free public libraries didn’t already exist and someone tried to invent them, they would be condemned as a socialist plot” and I think about that a lot.",
                "You know I would love to ask someone who voted for these clowns ONE question when I see things like this.\n\nWhat is the benefit to the American people of doing things like this?  \n\nAnd I would really like an honest answer. But doubt I'd ever get one.",
                "Reminds me of the book Fahrenheit 451",
                "Welp, now I know why Cruz and Cornyn want to move the Discovery to Texas..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Homeland Security Sec Kristi Noem has purse stolen in restaurant",
            "external_url": "https://www.cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/index.html",
            "upvotes": 4032,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25099707900433.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Spycraft often happens in plain sight. Now I'm not saying this was spycraft, but of you wanted to hand off stuff with plausible deniability, play the victim.\n\nOr, you're just grossly incompetent.",
                "Homeland Security Secretary can’t even secure her own purse? That’s hilariously ironic",
                "What was she doing with $3000 in cash on her? Feels like possible MS13 gang activity, should probably send her to Cecot to be safe. She might even have tattoos.",
                "The incompetence of Trump's staff is staggering.  \n \nThe thief got away with Noem’s driver’s license, medication, apartment keys, passport, DHS access badge, makeup bag, blank checks, and about $3,000 in cash.",
                "Walking around with $3000 in cash while wearing a $60,000 Rolex - look at how these parasites live while our 401ks dissolve.",
                "Who carries 3000.00 in cash?\n\n  \nEdit: after 34 minutes I would like to thank all of you for some humorous responses. Let's hold them account!!",
                "Gee, I wonder how many Signal chats that thief now has access to...",
                "If she can't even keep her own purse secure...",
                "Can't even secure her own purse and this is who we put in charge of homeland security. It's almost like poetry.",
                "Maybe if this current Trump administration works really, really hard they can eventually increase their level of security to that of Hillary Clinton's staff going into the 2016 election."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 53361,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm glad he made it out of the hospital, anyway. He died in his own bed.",
                "Must have been holding out for one last Easter",
                "Gone the day after Easter. Idk, is there anything more... Catholic? May he rest in eternal peace far from the trials and tribulations of Earth.",
                "At least he lived past Easter and lived long enough to make that impact standing.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "> Francis appointed nearly 80% of the cardinal electors who will choose the next pope, increasing the possibility that his successor will continue his progressive policies, despite the strong pushback from traditionalists.\n\n\nThis will provide some hope.",
                "Damn, the guy clung to life for that Easter appearance, probably because he knew that it would mean a lot to a lot of people and then he just let go. \n\nRest in Peace, Francis. You were actually a good Pope. \n\nI hope we can find someone similar, especially in these insane times.",
                "I was a closeted teenager in Catholic school when he was elected, and as he preached compassion over the years I felt like I could tangibly sense the people around me change their viewpoints on queerness. So many of my family members, including my godfather, changed their minds without knowing at the time that I was queer. I think it made me feel a lot more secure in my self when I did decide to start coming out a few years ago.\n\nI'm not Catholic anymore, but I think it would have taken me a lot longer to get on my own path if not for him. I'll always appreciate him for that. I hope he knows that he helped a little lesbian feel a bit more loved.\n\nEdit - OH MY GOD thank you guys for the awards!!!!!!",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "I met pope Francis at a charity do once. He was surprisingly down to earth, and very funny"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "US FTC sues Uber, alleging deceptive subscription practices",
            "external_url": "https://www.bbc.com/news/articles/c1drkq0dy07o",
            "upvotes": 212,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/542a/live/0456b050-1f20-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "tomorrow: Uber buys 10k Teslas",
                "Good. Go after ticket master next.",
                "someone's grandma at FTC must have realized they paid for Uber One the last 5 years. I just don't see the current gov going after uber.",
                "I hope they get shafted hard.  Wolves in sheep's clothing.  ",
                "> In its complaint filed on Monday, the FTC said that Uber has made suspending subscriptions \"extremely difficult\" for consumers, who can be subjected to navigating as many as 23 screens and taking up to 32 actions if they try to cancel.\n\n\nI wonder how many people just gave up and reported their card as lost to their bank.",
                "Looks like Uber forgot to pay their bribe to daddy Trump.",
                "Hmm. Who wants to bet that this gets shoved under a rug once Uber makes some “donations”?",
                "Something tells me the majority of those affected will be compensated with a code for 30 days with no delivery fees to Uber Eats courtesy of Uber. Only applied to orders with a minimum purchase of $30 and with agreement that you will continue a 12 month subscription after your 30 days. You know, for your troubles.",
                "Uber announces new Trump hotel to open in San Fransisco.  Also, in the news, DOGE starts gutting FTC staff.",
                "Could we preemptively go after SpaceX's Golden Dome [missile defense subscription](https://www.reuters.com/business/aerospace-defense/musks-spacex-is-frontrunner-build-trumps-golden-dome-missile-shield-2025-04-17/)?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 3377,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "This will not end well.",
                "We have reached the eugenics part of the plot.",
                "This seems a little anti-HIPAA ish. Our private medical data is protected from sharing unless consent is given. I understand that some instances, public emergency, national security, criminal investigation, can allow the government access. But, I don’t feel Autism research is enough. I know that ‘some’ feel there is an Autism emergency, but there is no evidence to support that. Any increase in the rate of Autism is easily explained by widened diagnostic criteria and better screenings. I’m really not thrilled about allowing these handpicked ‘researchers’ unfettered access to our personal data.",
                "Someone needs to diagnose RFK jr with autism so he will shut the fuck up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
            "external_url": "https://www.ctvnews.ca/world/article/person-found-on-elevated-surface-inside-trump-tower-in-new-york-is-arrested-police-say/",
            "upvotes": 2098,
            "date": "04/22/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2PADYAXEK5WCWYG67FNQU3FVSQ.jpg?smart=true&auth=28d8b408dc7fcee6c89b601bcc25a522afbde941aeb080eed5dff54b81d9e4f2&width=1200&height=630",
            "top_comments": [
                "What the fuck is an \"elevated surface\"?\n\nA platform? Stairs? Another Floor? High Heels?",
                "What does this even mean? Elevated surface? Arrested for what? Seriously wtf does this mean?",
                "Aaaand that's it. The title says everything and the article contains no further details.",
                ">Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say\n\n\n\nhe stole a pair of trump's lifts",
                "Who cares, hope he left some upper deckers. ",
                "Was it Trump in his shoe lifts?",
                "Don Jr coked out of his mind screaming from a balcony “I can fly!”",
                "That just leaves man, woman, camera and TV.",
                "He won’t be making it 4 years… he’s upsetting so much of his base lol.",
                "Wait is planking back in?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "China retreats from US private equity investments, FT reports",
            "external_url": "https://www.reuters.com/world/china/china-retreats-us-private-equity-investments-ft-reports-2025-04-21/",
            "upvotes": 2466,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ooooh. That’s going to cause interesting problems.",
                "God knows what kind of news we'll see in next month.",
                "I'm really fascinated by how no one who stands to lose much as a result of this has thought to speak up yet. You know, the super but not quite mega rich. Heck, even the mega rich. Aren't they worried?",
                "The flight from US Assets is worldwide, based on partially the “tariffs”, but mostly the unpredictable nature of the government ",
                "China isn’t messing around while Trump sits by the phone waiting for a call that isn’t coming.",
                "yay ... president trump made private equity cheaper, just like with stocks.\n\nNext eggs. Then infrastructure week.",
                "Best not to invest in Trump's mess?",
                "So how long before hyper-inflation and mass homelessness and starvation set in?",
                "Anyone have a non paywall link? Would like to learn something beyond the headlines.",
                "Oh no, less money to buy profitable companies and rape them for every last penny before letting them go bankrupt"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 11049,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[ Removed by Reddit ]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "I'll bet he wants to bring back debtor's prison.",
                "I thought the Education Department was abolished. What are they doing still working?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Nadine Menendez found guilty in bribery trial",
            "external_url": "https://www.nbcnewyork.com/news/local/crime-and-courts/verdict-nadine-menendez-bribery-trial-jury/6232296/",
            "upvotes": 863,
            "date": "04/21/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2206570763.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A jury found Nadine Menendez guilty on all counts in a bribery case in which prosecutors said she was a “critical participant” in the five-year fraud with her husband, former U.S. Sen. Bob Menendez, as they accepted cash, gold bars and a luxury car from three New Jersey men looking for help with business dealings or legal woes.\n\nThe jury began considering the charges against the 58-year-old on Friday in Manhattan federal court. They returned the guilty verdict late Monday afternoon on all 15 counts she faced, including bribery, conspiracy, obstruction of justice, working as a foreign agent and more.\n\nMenendez, wearing a pink facemask, stood beside her defense attorney as the verdict was read following the three-week trial. Sentencing was scheduled for June 12.\n\nShe was found guilty in the same federal courthouse in Manhattan where a different jury convicted her husband of many of the same charges in 2024. He was not in the courthouse for Monday's guilty verdict.\n\nHer husband, the 71-year-old former senator, is set to report to prison in June to begin an 11-year sentence. He stepped down from his Senate post after his conviction. Repeatedly during the trial, prosecutors said Bob and Nadine Menendez were “partners in crime,\" detailing the timeline of the whirlwind romance between the couple that began in early 2018 and continued after criminal charges were brought against them in Sept. 2023.\n\nBoth Nadine and Bob Menendez said they are innocent and never took any bribes.",
                "Good. This woman got away with killing a pedestrian with her car in 2018. A new car is one of the things she kept requesting in the bribery scheme.",
                "The woman wore a breast cancer pin through trial to try to garner sympathy. Glad it didn’t work. What a horrible person.",
                "Fuck them both. Don’t care what party you’re from but I hope they enjoy their golden years in a cell.",
                "Good. Any politician taking money from foreign nations should be promptly expelled.\n\nGranted she was his wife, but a criminal none the less.",
                "Too bad for them they weren't Republicans.",
                "The gold bars will always be my favorite part of this.  It just makes me laugh how comically corrupt it is to ask for gold bars as payment.",
                "Democrat here. Happy to see it. There's no place in politics for this. Sadly, republicans have blind eyes.",
                "Almost like this calls for a firing squad.",
                "Tell me why I read thst as Nelson Mandela"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Passengers on Delta flight evacuate on slides after engine fire at Orlando airport",
            "external_url": "https://www.nbcnews.com/news/us-news/passengers-delta-flight-evacuate-slides-engine-fire-orlando-airport-rcna202183",
            "upvotes": 464,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250421-orlando-airport-delta-ew-128p-95838a.jpg",
            "top_comments": [
                "I mean, that's scary, but those slides do look fun. So there's that.",
                "I assume Delta charged them extra later for the comfort slides.",
                "Doesn't Ever Leave The Airport",
                "This’ll help the already struggling domestic airline industry for sure",
                "An Airbus jet, before anyone jumps to the Boeing hate Reddit has been having. Not that Airbus even made the engine anyway."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 41978,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.",
                "I scream this into the void whenever this topic comes up, and I will continue doing so:\n\nI was a flight instructor for nearly a decade. I taught hundreds of students from recreational private pilots, up through commercial pilots and flight instructors. I taught many women, people of color, and even one trans person (that I knew of). And of course, mostly white dudes. \n\nThere is *absolutely zero* correlation between a person's gender or race and their ability to fly an airplane, make critical decisions during a flight, or manage resources.\n\nActually, I take that back. Women were generally better at studying and were less likely to take risks. The worst students were usually rich old men. \n\nAirlines **do not** hire under-performing candidates to meet \"DEI quotas.\" Everyone has to perform to the same standard. Sure, there may be initiatives to help those who have been subjected to an industry with a deeply ingrained \"good ol' boy\" tradition, but not at the expense of safety, performance, and quality. You either meet the standards, or you don't.\n\nThese cowards hide behind DEI and say stuff like \"Ohh I just don't like these woke hiring practices that allow under-qualified people in, women can be perfectly fine pilots too!\" But that's *bullshit.* They are cowards who refuse to say it with their chest. They think women can't be pilots. They think black people can't be pilots. They think trans people can't be pilots. It's fucking horseshit and they are sad little pussies who are too afraid to be openly sexist and racist.\n\nTake it from me, an *actual professional* with years of experience in the industry. Not some dipshit podcaster or brainless news personality.",
                "Unfortunately, america no longer has a justice system.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Hope she wins and wins big"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Pakistan expels 80,000 Afghans in two weeks amid crackdown on undocumented migrants",
            "external_url": "https://www.abc.net.au/news/2025-04-19/pakistan-expels-afghans-amid-crackdown-on-undocumented-migrants/105193418",
            "upvotes": 690,
            "date": "04/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/f17eb1eb2d355ef87e4d9a38b750216c?impolicy=wcms_watermark_news&cropH=2295&cropW=4080&xPos=0&yPos=213&width=862&height=485&imformat=generic",
            "top_comments": [
                "Deportations are so hot right now 🥵",
                "*Thousands of Afghans who have lived in Pakistan for years — some for decades —are being forced to return to a homeland they describe as unsafe, economically crippled, and socially repressive under Taliban rule.  Many cite fears over limited job prospects, insecurity, and the Taliban's ongoing restrictions on women...*\n\nAdd to this the 9,000 Afghans presently seeking asylum in the U.S. who are about to be deported.",
                "Not to distract but I thought the thumbnail was ace Ventura in a rhino ",
                "So \"mass deportation\" light?",
                "No way you can detain and deport 80k people in two weeks without a bunch of deaths right?",
                "Holy fuck the world is a mess. Why did I choose 2025 to start watching the news and paying attention.",
                "The ones who least wanted the democratic regime to fall were those absent when it did. \nTragic."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 23003,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "Long term gain, though, right?\n\n...you guys?",
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "I’m confused, is America great again yet or not?",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "I think a corky laugh and a stable 401k would’ve been better than this.",
                "Bond yields are spiking again, too.  \nFaith is being lost in not just the dollar and U.S. equities, but Treasuries, too.  \nYikes.",
                "Every time a Republican is in office my life gets harder."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 3376,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                "This will not end well.",
                "We have reached the eugenics part of the plot.",
                "This seems a little anti-HIPAA ish. Our private medical data is protected from sharing unless consent is given. I understand that some instances, public emergency, national security, criminal investigation, can allow the government access. But, I don’t feel Autism research is enough. I know that ‘some’ feel there is an Autism emergency, but there is no evidence to support that. Any increase in the rate of Autism is easily explained by widened diagnostic criteria and better screenings. I’m really not thrilled about allowing these handpicked ‘researchers’ unfettered access to our personal data.",
                "Someone needs to diagnose RFK jr with autism so he will shut the fuck up."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US FTC sues Uber, alleging deceptive subscription practices",
            "external_url": "https://www.bbc.com/news/articles/c1drkq0dy07o",
            "upvotes": 211,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/542a/live/0456b050-1f20-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "tomorrow: Uber buys 10k Teslas",
                "Good. Go after ticket master next.",
                "someone's grandma at FTC must have realized they paid for Uber One the last 5 years. I just don't see the current gov going after uber.",
                "I hope they get shafted hard.  Wolves in sheep's clothing.  ",
                "> In its complaint filed on Monday, the FTC said that Uber has made suspending subscriptions \"extremely difficult\" for consumers, who can be subjected to navigating as many as 23 screens and taking up to 32 actions if they try to cancel.\n\n\nI wonder how many people just gave up and reported their card as lost to their bank.",
                "Looks like Uber forgot to pay their bribe to daddy Trump.",
                "Hmm. Who wants to bet that this gets shoved under a rug once Uber makes some “donations”?",
                "Something tells me the majority of those affected will be compensated with a code for 30 days with no delivery fees to Uber Eats courtesy of Uber. Only applied to orders with a minimum purchase of $30 and with agreement that you will continue a 12 month subscription after your 30 days. You know, for your troubles.",
                "Uber announces new Trump hotel to open in San Fransisco.  Also, in the news, DOGE starts gutting FTC staff.",
                "Could we preemptively go after SpaceX's Golden Dome [missile defense subscription](https://www.reuters.com/business/aerospace-defense/musks-spacex-is-frontrunner-build-trumps-golden-dome-missile-shield-2025-04-17/)?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "China retreats from US private equity investments, FT reports",
            "external_url": "https://www.reuters.com/world/china/china-retreats-us-private-equity-investments-ft-reports-2025-04-21/",
            "upvotes": 2467,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ooooh. That’s going to cause interesting problems.",
                "God knows what kind of news we'll see in next month.",
                "I'm really fascinated by how no one who stands to lose much as a result of this has thought to speak up yet. You know, the super but not quite mega rich. Heck, even the mega rich. Aren't they worried?",
                "The flight from US Assets is worldwide, based on partially the “tariffs”, but mostly the unpredictable nature of the government ",
                "China isn’t messing around while Trump sits by the phone waiting for a call that isn’t coming.",
                "yay ... president trump made private equity cheaper, just like with stocks.\n\nNext eggs. Then infrastructure week.",
                "Best not to invest in Trump's mess?",
                "So how long before hyper-inflation and mass homelessness and starvation set in?",
                "Anyone have a non paywall link? Would like to learn something beyond the headlines.",
                "Oh no, less money to buy profitable companies and rape them for every last penny before letting them go bankrupt"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say",
            "external_url": "https://www.ctvnews.ca/world/article/person-found-on-elevated-surface-inside-trump-tower-in-new-york-is-arrested-police-say/",
            "upvotes": 2100,
            "date": "04/22/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2PADYAXEK5WCWYG67FNQU3FVSQ.jpg?smart=true&auth=28d8b408dc7fcee6c89b601bcc25a522afbde941aeb080eed5dff54b81d9e4f2&width=1200&height=630",
            "top_comments": [
                "What the fuck is an \"elevated surface\"?\n\nA platform? Stairs? Another Floor? High Heels?",
                "What does this even mean? Elevated surface? Arrested for what? Seriously wtf does this mean?",
                "Aaaand that's it. The title says everything and the article contains no further details.",
                ">Person found on ‘elevated surface’ inside Trump Tower in New York is arrested, police say\n\n\n\nhe stole a pair of trump's lifts",
                "Who cares, hope he left some upper deckers. ",
                "Was it Trump in his shoe lifts?",
                "Don Jr coked out of his mind screaming from a balcony “I can fly!”",
                "That just leaves man, woman, camera and TV.",
                "He won’t be making it 4 years… he’s upsetting so much of his base lol.",
                "Wait is planking back in?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 4449,
            "date": "04/21/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "With a 2025 budget of $295 Million, cutting the IMLS will offset Trump's golf expenses.  \n\nMusk is still looking for cuts to help cover Trump's trip to the Superbowl and the Daytona 500.",
                "Yup our state library staff is being laid off due to federal cuts. It’s really depressing. These libraries help low income children with meals during the summer due to school being closed and not providing food.\n\nAll the money these oligarchs have and they’re cutting programs that help kids have food. This is despicable.",
                "There was a time when we used to look up to smart people.  \n\nNow, smart people are a threat to the dumb fucks trying to destroy the country for their own profit.",
                "Libraries: the nexus of evil",
                "Republicans have been against libraries and non-commercial museums for decades. Sad more voters didn't consider this outcome when voting to give them more power.",
                "This timeline is just getting depressing at this point.",
                "[This tweet remains relevant](https://x.com/sketchesbyboze/status/1304555319817797634?s=46&t=gYqP6Q5IoxKTzkC236AFpA)\n\n> my girlfriend regularly tells me “if free public libraries didn’t already exist and someone tried to invent them, they would be condemned as a socialist plot” and I think about that a lot.",
                "You know I would love to ask someone who voted for these clowns ONE question when I see things like this.\n\nWhat is the benefit to the American people of doing things like this?  \n\nAnd I would really like an honest answer. But doubt I'd ever get one.",
                "Reminds me of the book Fahrenheit 451",
                "Welp, now I know why Cruz and Cornyn want to move the Discovery to Texas..."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 11059,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[ Removed by Reddit ]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "I'll bet he wants to bring back debtor's prison.",
                "I thought the Education Department was abolished. What are they doing still working?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Passengers on Delta flight evacuate on slides after engine fire at Orlando airport",
            "external_url": "https://www.nbcnews.com/news/us-news/passengers-delta-flight-evacuate-slides-engine-fire-orlando-airport-rcna202183",
            "upvotes": 469,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250421-orlando-airport-delta-ew-128p-95838a.jpg",
            "top_comments": [
                "I mean, that's scary, but those slides do look fun. So there's that.",
                "I assume Delta charged them extra later for the comfort slides.",
                "Doesn't Ever Leave The Airport",
                "This’ll help the already struggling domestic airline industry for sure",
                "An Airbus jet, before anyone jumps to the Boeing hate Reddit has been having. Not that Airbus even made the engine anyway."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Nadine Menendez found guilty in bribery trial",
            "external_url": "https://www.nbcnewyork.com/news/local/crime-and-courts/verdict-nadine-menendez-bribery-trial-jury/6232296/",
            "upvotes": 861,
            "date": "04/21/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/GettyImages-2206570763.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A jury found Nadine Menendez guilty on all counts in a bribery case in which prosecutors said she was a “critical participant” in the five-year fraud with her husband, former U.S. Sen. Bob Menendez, as they accepted cash, gold bars and a luxury car from three New Jersey men looking for help with business dealings or legal woes.\n\nThe jury began considering the charges against the 58-year-old on Friday in Manhattan federal court. They returned the guilty verdict late Monday afternoon on all 15 counts she faced, including bribery, conspiracy, obstruction of justice, working as a foreign agent and more.\n\nMenendez, wearing a pink facemask, stood beside her defense attorney as the verdict was read following the three-week trial. Sentencing was scheduled for June 12.\n\nShe was found guilty in the same federal courthouse in Manhattan where a different jury convicted her husband of many of the same charges in 2024. He was not in the courthouse for Monday's guilty verdict.\n\nHer husband, the 71-year-old former senator, is set to report to prison in June to begin an 11-year sentence. He stepped down from his Senate post after his conviction. Repeatedly during the trial, prosecutors said Bob and Nadine Menendez were “partners in crime,\" detailing the timeline of the whirlwind romance between the couple that began in early 2018 and continued after criminal charges were brought against them in Sept. 2023.\n\nBoth Nadine and Bob Menendez said they are innocent and never took any bribes.",
                "Good. This woman got away with killing a pedestrian with her car in 2018. A new car is one of the things she kept requesting in the bribery scheme.",
                "The woman wore a breast cancer pin through trial to try to garner sympathy. Glad it didn’t work. What a horrible person.",
                "Fuck them both. Don’t care what party you’re from but I hope they enjoy their golden years in a cell.",
                "Good. Any politician taking money from foreign nations should be promptly expelled.\n\nGranted she was his wife, but a criminal none the less.",
                "Too bad for them they weren't Republicans.",
                "The gold bars will always be my favorite part of this.  It just makes me laugh how comically corrupt it is to ask for gold bars as payment.",
                "Democrat here. Happy to see it. There's no place in politics for this. Sadly, republicans have blind eyes.",
                "Almost like this calls for a firing squad.",
                "Tell me why I read thst as Nelson Mandela"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 41969,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.",
                "I scream this into the void whenever this topic comes up, and I will continue doing so:\n\nI was a flight instructor for nearly a decade. I taught hundreds of students from recreational private pilots, up through commercial pilots and flight instructors. I taught many women, people of color, and even one trans person (that I knew of). And of course, mostly white dudes. \n\nThere is *absolutely zero* correlation between a person's gender or race and their ability to fly an airplane, make critical decisions during a flight, or manage resources.\n\nActually, I take that back. Women were generally better at studying and were less likely to take risks. The worst students were usually rich old men. \n\nAirlines **do not** hire under-performing candidates to meet \"DEI quotas.\" Everyone has to perform to the same standard. Sure, there may be initiatives to help those who have been subjected to an industry with a deeply ingrained \"good ol' boy\" tradition, but not at the expense of safety, performance, and quality. You either meet the standards, or you don't.\n\nThese cowards hide behind DEI and say stuff like \"Ohh I just don't like these woke hiring practices that allow under-qualified people in, women can be perfectly fine pilots too!\" But that's *bullshit.* They are cowards who refuse to say it with their chest. They think women can't be pilots. They think black people can't be pilots. They think trans people can't be pilots. It's fucking horseshit and they are sad little pussies who are too afraid to be openly sexist and racist.\n\nTake it from me, an *actual professional* with years of experience in the industry. Not some dipshit podcaster or brainless news personality.",
                "Unfortunately, america no longer has a justice system.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Hope she wins and wins big"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder",
            "external_url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc",
            "upvotes": 8660,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Patrick Crusius was automatically be sentenced to life in prison without parole in the massacre near the U.S.-Mexico border. The change of plea comes after local prosecutors took the death penalty off the table.\n\n>El Paso County District Attorney James Montoya declined to pursue the death penalty, saying that decision was driven by a majority of victims’ relatives who want the case to be over.\n\nI can see the sentiment of just wanting to not think about it anymore. The murderer is 26 now and will likely spend decades in [a Texas prison](https://www.texastribune.org/2022/08/24/texas-prisons-air-conditioning/).",
                "> About 100 people from victims’ families were seated in the gallery behind a few rows reserved for media, prosecutors and Crusius’ defense team. They will be given the time to give victim impact statements starting Monday afternoon. Dozens made emotional statements during a similar hearing in federal court in 2023 that lasted for three days.\n\n> The people who were killed at Walmart ranged in age from a 15-year-old high school athlete to elderly grandparents. They included immigrants, a retired city bus driver, a teacher, tradesmen including a former iron worker, and several Mexican nationals who had crossed the U.S. border on routine shopping trips.\n\nThose people leave behind a legacy of loved ones who will keep their memories alive. 100 loved ones to share their stories. This man leaves no legacy but hatred, and will be remembered as a bigoted monster. May he rot in prison and fade into obscurity.",
                "So death for the UHC CEO murderer, but this dude gets to live?  Cool.  Cool.",
                "Wait, hold on. This guy kills 23 people in a racist attack and isn't considered a terrorist, but a guy killing a corrupt CEO is a terrorist?",
                "> The online rant speaks of a “Hispanic invasion of Texas.”\n\n>“They are the instigators, not me,” it says. “I am simply defending my country from cultural and ethnic replacement brought on by an invasion.”\n\n\nAsshole never studied U.S. history, clearly. It’s the other way around.",
                "23 people. Killed. In a grocery store.  \n\nMake it make sense. 2 is horrible but 23????",
                "It's important to note that you cannot appeal a conviction in which you plead guilty to with much chance of success. \n\nMost appeals that are successful aren't about innocence, but procedural mistakes by the prosecution and law enforcement officers in the case. \n\nAs high profile as this is, I imagine that the last thing anyone wants is for someone to have made one tiny mistake in an otherwise open and shut case and this guy go free because of it. There is still the fact that the judge can alter sentencing, and order modifiers such as without parole, or non concurrent sentences, meaning a separate life sentence for each victim, to be stacked on top of each other. \n\nI'm not a huge fan of the death penalty, but that's not the only way to make sure this man never walks away free.",
                "Surely the charges will be as bad as Luigi, right?",
                "Five and a half frikkin years to get here? He posted his manifesto on one of the chan sites.\n\n\n OFC the families just want to move on now. IT'S BEEN OVER FIVE YEARS.",
                "I was just thinking about this the other day. Some madman guns down Hispanics at Walmart enraged at Mexicans under Trump's stoking of hatred, for said group. Mad man kills a mother and father leaving a baby homeless. Uncle of the baby is a MAGA lover, finds out Trump is coming, first thought is not overwhelming grief for his lost sister and orphaned niece, no he thinks! Bingo! If I grab the baby like a prop and head back to hospital where my sister and brother in law just died, maybe I can get a picture with Trump! https://www.theguardian.com/us-news/2019/aug/09/trump-el-paso-melania-orphan-baby-thumbs-up\nAnd he got his picture. I always think of this when people get shocked that the maga won't turn on him."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/22/2025 04:10:53 UTC"
}