{
    "posts": [
        {
            "category": "HOT",
            "title": "British Columbia woman detained at U.S. border, sent to Arizona detention facility in chains",
            "external_url": "https://vancouversun.com/news/bc-woman-detained-at-us-border-sent-to-arizona-detention-facility",
            "upvotes": 21466,
            "date": "03/13/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/jasmine-mooney_294005028.jpg",
            "top_comments": [
                "\"We eventually learned that about 30 people, including Jasmine, were removed from their cells at 3 a.m. and transferred to the San Luis Detention Center in Arizona. They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.”\n\nCruel and unusual.",
                "\n#Canadian Woman Detained at US Border in Harrowing Ordeal\n\nA British Columbia woman has found herself trapped in a nightmare after being unexpectedly detained at the US border and transferred to an Arizona detention centre under conditions her family describes as inhumane.\n\nJasmine Mooney, a 35-year-old businesswoman from Abbotsford, was attempting to enter the United States through the San Ysidro border crossing between Mexico and San Diego on 3 March. She had hoped to apply for a Trade NAFTA (TN) work visa, but her paperwork was incomplete. Instead of being turned away or allowed to rectify the issue, she was arrested by US border officers and placed in detention.\n\nWhat followed has left her mother, Alexis Eagles, desperate for answers. After three nights at a San Diego detention centre, Mooney was handed over to US Immigration and Customs Enforcement. For a brief moment, her family thought she had been released when an online tracking system marked her as free. Then she vanished.\n\nPanic set in when hours turned into a full day with no word from her. Eventually, the family learned that Mooney and around thirty others had been pulled from their cells in the middle of the night and transported to the San Luis Detention Center in Arizona. There, according to reports from inside, she has been crammed into a concrete cell with no natural light, harsh fluorescent bulbs that never switch off, no proper bedding and limited bathroom facilities.\n\nMooney has not been charged with any crime. She has no criminal record. She has simply been caught in a bureaucratic nightmare that has left her in chains, awaiting a resolution that remains unclear.\n\nHer mother is not disputing the right of US authorities to refuse Mooney entry. She does, however, take issue with the treatment her daughter is enduring. Mooney herself, in text messages to a business partner, described the conditions as \"inhumane.\" The women in detention are sleeping on mats, the food is barely edible, and the lights make proper rest impossible. Despite the circumstances, Mooney has tried to stay strong, telling her friend that she is in a better position than others and must keep going.\n\nMooney is no stranger to hard work. She built a career in Vancouver’s hospitality industry after moving there from the Yukon in 2008, later expanding into the health and wellness sector. Her most recent work had her involved in Los Angeles, where she had previously been granted a TN work visa. That visa was revoked in November last year when she attempted to return to the US after a vacation. This time, hoping to secure another visa, she took the route that had worked for her before, crossing from Mexico. It was a decision that led to an ordeal beyond anything she could have imagined.\n\nHer business partner, BJ McCaslin, has been in touch with her through a prison communication app and is deeply concerned. He does not understand why she remains detained when there is no evidence of wrongdoing.\n\nGlobal Affairs Canada has acknowledged Mooney's detention and confirmed that consular officials are in contact with US authorities. Beyond that, they say little can be done. While governments may express concern, they rarely intervene when another country enforces its own immigration rules.\n\nThat leaves Mooney and her family in an agonising state of limbo. They are not asking for special treatment, only basic human decency. For now, all they can do is wait, and hope that her ordeal does not stretch on indefinitely.",
                "THIS is another reason for Canadians to avoid all US travel.",
                "Perhaps countries should issue travel advisories for the U.S.",
                "And the other people in her situation don't even have a resourceful Canadian mom to get attention to their cause, so even if the poor woman who in no way deserves this random act of cruelty by the US regime is released the problem remains",
                "How're the US supposed to host the world cup next year if they're putting loads of people in chains??\n\nI have a feeling foreigners may want to stay away and stadiums will be empty af",
                "The Terror begins. To be clear, this woman was detained because her application to renew her work visa was incomplete. That's it. That's all she did and she ended up in a cell for a week with nothing but a mat and rotten food.",
                "So I’ve been reading a book recently (When Mckinsey comes to town) and it says during the first Trump admiration many ICE employees had begun to find the work distasteful based on the orders coming from the government at that time, as well as bad press. As a result ICE was struggling to find and retain employees. The solution? Change hiring practices to recruit neckbeards who get a kick out of having the power to detain and arrest people. Basically adult Eric Cartmans demanding “respect ma authoritah!” It’s all Trump loyalists now. Same goes for many police forces.",
                "Historically, paperwork issues like this at the US border result in immediate deportation. Like, *immediate.* Guards grab you and frog-march you to the next flight to your home country with zero recourse. \n\nWhile that’s already ridiculous, this woman’s case is a new level. They already had the chance to deport her the “traditional” way. They refused. They chose instead to retain her in this country and imprison her at taxpayer expense. \n\nTrump supporters, make it make sense. Why are your boys keeping them here instead of sending them home, if they are so scary and dangerous?",
                "Why not just turn her back? There’s no reason to lock her up. I hope they get the ACLU involved. She has constitutional rights and they’re being violated."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ayo Edebiri ‘got insane death threats’ after Elon Musk shared fake report about Pirates of the Caribbean casting | Movies",
            "external_url": "https://www.theguardian.com/film/2025/mar/12/ayo-edebiri-got-insane-death-threats-after-elon-musk-shared-fake-report-about-pirates-of-the-caribbean-casting",
            "upvotes": 7317,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f177e2f93bdfbad4a59315adf7ca12135d9e10d0/0_0_3828_2297/master/3828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6c37eab200b27b17b52533c0edb15ce",
            "top_comments": [
                "> The Bear actor called Musk a fascist and an idiot after his reaction to a post from a rightwing account that claimed she was replacing Johnny Depp.\n\nThis man needs to lose another hundred billion+ in net worth and fade into obscurity. We also need to stop ignoring the severity of online harassment.",
                "> Responding to Edebiri’s post on Wednesday, the owner of the original account said: “I clearly stated ‘reportedly’ because it was the latest information coming from credible Hollywood sources. And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.\n\nSome people are fucking cultish and weird",
                "A dark-skinned person in the Caribbean? Who would have thought?",
                "[removed]",
                "The owner of the X account said, \"And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.” \n\nI can't even..",
                "Now that the government is a goner well never get this but boy do we need to start revamping how society treats digital threata in general and especially anonymous digital threats.",
                "She is fucking Caribbean!! People are insane.",
                "Why can’t the x outage be more permanent!?",
                "I remember in the 90s and early 2000s there was serious concern about online cyber bullying and death threats. There was a lot of talk about passing laws to stop it and most closely regulate these platforms. \n\nThen big tech got into bed with the government and everyone became “free speech absolutists”. \n\nNo other culture at no other point in history would allow this sort of shit to persist like we have.",
                "Elon about to clarify: \"This is Ukraine's fault\"."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Canadians who visit US for more than 30 days will be fingerprinted",
            "external_url": "https://www.theguardian.com/world/2025/mar/13/canada-fingerprint-visit-us",
            "upvotes": 3768,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ba10c375cb1e5b1586ed64ae5133e0ac2597c5f2/0_120_3600_2161/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=668367ca2ae33ce304afbb4d7814f743",
            "top_comments": [
                "1996. The USA had Clinton, Canada had Chretien. The US economy was roaring, and the dot com boom was just taking off. And I learned in geography class that our nations had the largest friendly border in the world.\n\nFive years later the worst terrorist attack on US soil occurred. 15 of the hijackers were Saudi nationals. None of the terrorists entered through the Canadian border. For the first and only time, the USA invoked Article 5 of NATO, and Canada fought alongside the US for damn near two decades in Afghanistan. 165 of our boys died fighting for the US.\n\nToday the Trump administration - after bungling the Afghan pullout and cutting a deal with the enemy Taliban, one of the world's most repressive regimes - now takes a friendlier attitude to Saudi Arabia than it does Canada.  A sickening betrayal and a reversal on more than a century of friendship that will harm Canada, but it will also do the USA more harm than good.",
                "Canada to employ large handed border agents to cavity search US visitors.",
                "Canadians who come and stay for more than 30 days are likely to be wealthy snowbirds.\n\nDiscouraging them from visiting and treating them like criminals is a weird strategy. \n\nDo Canadians suddenly become criminal troublemakers after 30 days?\n\nA lot of European, Pacific, and Central and South American beach towns thank the USA for the boost in polite, wealthy tourists.",
                "I would just suggest that our Canadian friends not come here if you don’t absolutely have to. Our government is hostile, chaotic, unstable, and untrustworthy right now. Many of us are hoping to fix that problem in the future, but it is going to take a while to get there.",
                "Just like US midwesterners, there are a good sized number of Canadians who spend their winters in the US south and it’s a lot of money to the towns who cater to them. Many Canadians have been already reconsidering their winter homes and  I suspect this will be the last straw for most.  It will be devastating to these communities when Canadian dollars decide to stay in Canada   ",
                "From an American, Canadians please don't come here if this is going to happen. We care about you and your safety. Stay out of here until we can burn this shit out.",
                "If I were a Canadian I would say fuck off US Government, my money stays in Canada or go to Europe. So much lording-it-over chickenshit.",
                "I'm canadian and my partner and I were planning to go back to NYC for our 15th anniversary. We go to the US every 2 years or so, each time spending ~5k$ for hotels, foods, drinks and entertainment over the course of a weekend.\n\nWe decided to forgo going to the US, we'll be going elsewhere in Canada or doing longer Europe trips.\n\nShit like this changes habits and will _decimate_ the US tourism industry.\n\nI can live without a broadway show, I can't live with being treated as a criminal for trying to give you guys money.",
                "Funny because I don't plan on spending a fucking dime on their fucking country.  Eat a dick Trump.   Eat all the dicks Trump supporters.",
                "It has been embarrassing to be an American since November…. Apologies to my Canadian friends"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 1316,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "What happened, did it turn out that he was qualified for the job?",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What, did he say he supports vaccines or something",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Meta stops former Facebook director from promoting critical memoir",
            "external_url": "https://www.bbc.com/news/articles/cq5zyq0250wo",
            "upvotes": 1230,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/355c/live/da2d5260-fda1-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "Getting  way more press than this book would have ever gotten without arbitration .",
                "That’s funny the news of the legal injunction is far better than any marketing she could have provided.  I’m going to buy a copy now.",
                "“Your honor, I object!\n\n“And why is that, Mr. Zuckerberg?”\n\n“Because it’s devastating to my case!”",
                "Are you you talking about the book \"[Careless People by Sarah Wynn-Williams](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237)\", available now to purchase?\n\n(Just because she can't promote it, doesn't meant the rest of us can't.)",
                "\n>During the emergency hearing the arbitrator, Nicholas Gowen, found Meta had provided enough evidence that Ms Wynn-Williams had potentially violated her severance contract.\n\n>Following the decision, Meta spokesperson Andy Stone said in a post on X: \"This ruling affirms that Sarah Wynn-Williams' false and defamatory book should never have been published.\"\n\nUmm, no it doesn't",
                "The BBC article says \"Meta has won an emergency ruling in the US to temporarily stop a former director of Facebook from promoting or further distributing copies of her memoir.\"\n\nIs this Streisand effect in action? Amazon's still selling it... seems like she just can't promote it... but Zuck's doing that himself.",
                "\\#1 best seller on amazon:  \n[https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr\\_1\\_1?sr=8-1](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr_1_1?sr=8-1)\n\nLOL, meta, failed again.",
                "And to think, I may have never heard about the next book I'm going to read.",
                "I deleted my facebook account last month after 16 years of pretty heavy use. \n\nI've heard you can't delete it in the states, can only deactivate, but in Canada you can permanently delete. I strongly suggest doing that if you have an account. Also remove all their apps from your phone. Don't let them earn off of your data.",
                "Something, something Streisand effect"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "HOT",
            "title": "Baby wombat-snatching US influencer at risk of losing Australian visa",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/13/sam-jones-us-influencer-baby-wombat-stolen-from-mother-ntwnfb",
            "upvotes": 6075,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0560f44a8da1ddb4f316428666c2344dcc6a6aa1/632_287_1104_662/master/1104.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b6e7d88616efb53cb511458b3581440d",
            "top_comments": [
                "Good.  Kick her ass out.  I had just watched the video of her doing this.",
                "Stupid influencers are the absolute cancer of society!",
                "What an absolute piece of trash.",
                ">The Australian prime minister, Anthony Albanese, said it was “an outrage” Jones had separated the joey from its mother.\n\n>“Maybe she might try some other Australian animals,” he said at a press conference, when asked about the incident. “Take a baby crocodile from its mother and see how you go there. Take another animal that can actually fight back rather than stealing a baby wombat from its mother. See how you go there.”\n\nYou guys are the best over there!",
                "Who's the fuckwit with her? Should bloody know better, but clearly doesn't give a shit.",
                "I’d rather she sit in jail for a while and then get deported,  but losing her visa and being banned from the country would be a decent next alternative",
                "“I can’t wait to see the back of this individual,” the home affairs minister, Tony Burke\n\nSo is booting actually one of their proudest traditions?",
                "Learn from S.Korea, throw these dummies in jail, and publicly shame them.",
                "She has 1.1k subs on YouTube and 1.8k followers on IG.  Does this count as an influencer?",
                "Animal cruelity, fucking psychopath. \n\nThrow her in prison, then throw out and ban this this piece of shit."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 1141,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "This will fast track to SCOTUS",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "Great, now will he be charged for these unlawful acts? What a freaking joke of a man",
                "Alright so the obvious question will be: “what happens when the Trump Administration tells this judge to kick rocks”?",
                "That back-pay is sure going to look sweet."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 15011,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "i think that's illegal",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "The cruelty is the point. Never let them convince you otherwise."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 56941,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "It's always the ones you most suspect. ",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "It's sad that it took 40+ years for him to face justice. The article says the accuser tried getting the rapist to pay for therapy in 2007 but she wouldn't sign an NDA so he wouldn't. \n\nThat means for atleast 18 years (probably more) she has been actively trying to get justice. All while he probably made millions of dollars and most likely abused others. \n\n>Morris was a member of President Donald Trump's spiritual advisory committee during his first term.\n\nWow. Of course the guy who raped a 12 year old was in Trump's cabinet.",
                "This is the free space on the BINGO card",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "\"lewd acts\" is such a misleading way of saying what happened."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Woman charged with holding 'severely emaciated' stepson in captivity for over 20 years: Police",
            "external_url": "https://abcnews.go.com/US/woman-charged-holding-severely-emaciated-stepson-captivity-20/story?id=119742983",
            "upvotes": 957,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/396fe395-fd90-4e43-920c-41c7dd3fcc33/Sullivan-arrest_1741847969820_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "32 year old man. He weighed 68 pounds.",
                "Wow. Guy lit the house on fire as a plea for help. Smart.\n>‘I wanted my freedom.’",
                "There was a wellness check in 2005 after his friends asked where he went. Imagine having your childhood friend just disappear one day and then finding out 20 years later that he was being held in his room the whole time. \n\nI'm the same age as this guy and I'm imagining having my whole life stolen from me just as I was starting to grow up. Absolutely chilling.",
                "Her blaming her husband as if being complicit for 20+ years is any better. Husband of course not able to be questioned, and not in the house but she continued. ",
                "Part of understanding this kind of thing - is the almost certainty that she feels no regret or remorse about this. If anything she's upset at people 'interfering'. In her mind, she was perfect and the child 'deserved' this.",
                "I always wonder how many kids are just held prisoner by their parents for their entire lives and just die at home with no one else ever knowing they existed. These crimes are horrific.",
                ">>During the background investigation, police found that there were two incidents in the Waterbury Police Department had in their system for that address in 2005.\n\n>>**The first was a request from the Department of Children and Families to do a welfare check at the location because the victim’s friends had not seen him lately and were concerned about him, police said. Officers went to the house and saw that it was clean**, and **they spoke to the victim but at that point in time, there was no cause for any alarm** or any conditions that would have led officers to believe anything abnormal was occurring, police said Thursday.\n\nOh and no follow up when the child was never seen again you say? DCFS should’ve followed up, absolutely worthless social work and policing",
                "Looking at the police escorting her..... EXACTLY what I expected. Cross necklace, hair, outfit, age, and everything.",
                "She’s a devout Christian it seems. Figures. ",
                "With all the \"homeschooling\" going on now , you can bet there are a lot of kids living through this"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "‘Amazed it hasn’t burned’: One of Tahoe’s oldest forest stands at high risk of wildfire - The Nevada Independent",
            "external_url": "https://thenevadaindependent.com/article/amazed-it-hasnt-burned-one-of-tahoes-oldest-forest-stands-at-high-risk-of-wildfire",
            "upvotes": 3,
            "date": "03/13/2025",
            "thumbnail": "https://storage.googleapis.com/cdn.thenevadaindependent.com/2025/03/6dd8ac0f-samplingemeraldpt_c-hugh-safford-uc-davis-scaled.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cop delivers pizza after delivery driver finds 8-foot alligator hiding under customer's car",
            "external_url": "https://abcnews.go.com/US/cop-delivers-pizza-after-delivery-driver-finds-8/story?id=119743080",
            "upvotes": 52,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4bff9eae-2228-4363-a8f9-3590d1ca70c0/alligator-pizza-delivery_1741850952876_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "I lived in south Florida for five years and this is so common. I love how the old gal was so nonplussed about the whole situation. She clearly has been in the Sunshine State for a while.",
                "Read the title, thought it must be Florida, clicked the link -> Florida.",
                "Alligator ordered delivery.",
                "Plot twist, the pizza was for the alligator 🐊 🍕",
                "Holy smokes that’s pretty crazy!"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 1314,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "What happened, did it turn out that he was qualified for the job?",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What, did he say he supports vaccines or something",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Jewish protesters flood Trump Tower's lobby to demand the Columbia University activist's release",
            "external_url": "https://apnews.com/article/columbia-university-protests-khalil-trump-tower-8e2f455134a2f1b82458e32aecbb59f7",
            "upvotes": 609,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Jewish people having a problem with agents of the state disappearing someone without the government publicly saying what he did wrong?\n\nWeird.",
                "Hell yeah! Solidarity",
                "Ok but Fox News was telling me these were all anti semetic protesters who hate America. Why would they say that? /s",
                "Okay, how long until they're labeled as Hamas supporters and/or paid agitators?",
                "Jewish Voice for Peace isn't necessarily all Jewish people.  Many aren't Jewish, they're wearing T-shirts and pretending.\n\nI'm not saying that there aren't Jewish people with them.  There are.  But there's also a lot of people wearing \"not in our name\" shirts who are just cosplaying.  Like Ally Beardsley.",
                "fake jews do blah blah...not a story"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 1142,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "This will fast track to SCOTUS",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "Great, now will he be charged for these unlawful acts? What a freaking joke of a man",
                "Alright so the obvious question will be: “what happens when the Trump Administration tells this judge to kick rocks”?",
                "That back-pay is sure going to look sweet."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Tesla working with Baidu to improve assisted driving system in China, sources say",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-working-with-baidu-improve-assisted-driving-system-china-sources-2025-03-13/",
            "upvotes": 0,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In other words, Tesla's system doesn't work.",
                "Tesla is the last company I'd have help with anything like that.",
                "So now it's \"assisted driving\", not \"full self driving\" any more?",
                "Yeah, good luck with that",
                "So the man, who's gonna take us to Mars, cannot yet navigate on earth",
                "Is working with China Dark MAGA or regular MAGA?",
                "That must be how Tesla was eligible for that $56BILLION DOLLAR federal bailout. ",
                "At least they're trying to improve"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Elianne Andam murder: Hassan Sentamu jailed for life (UK)",
            "external_url": "https://www.bbc.co.uk/news/articles/ckg8ly1wr8ro",
            "upvotes": 30,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dc0e/live/598923a0-000d-11f0-8482-95fc1747d814.jpg",
            "top_comments": [
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Meta stops former Facebook director from promoting critical memoir",
            "external_url": "https://www.bbc.com/news/articles/cq5zyq0250wo",
            "upvotes": 1231,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/355c/live/da2d5260-fda1-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "Getting  way more press than this book would have ever gotten without arbitration .",
                "That’s funny the news of the legal injunction is far better than any marketing she could have provided.  I’m going to buy a copy now.",
                "“Your honor, I object!\n\n“And why is that, Mr. Zuckerberg?”\n\n“Because it’s devastating to my case!”",
                "Are you you talking about the book \"[Careless People by Sarah Wynn-Williams](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237)\", available now to purchase?\n\n(Just because she can't promote it, doesn't meant the rest of us can't.)",
                "\n>During the emergency hearing the arbitrator, Nicholas Gowen, found Meta had provided enough evidence that Ms Wynn-Williams had potentially violated her severance contract.\n\n>Following the decision, Meta spokesperson Andy Stone said in a post on X: \"This ruling affirms that Sarah Wynn-Williams' false and defamatory book should never have been published.\"\n\nUmm, no it doesn't",
                "The BBC article says \"Meta has won an emergency ruling in the US to temporarily stop a former director of Facebook from promoting or further distributing copies of her memoir.\"\n\nIs this Streisand effect in action? Amazon's still selling it... seems like she just can't promote it... but Zuck's doing that himself.",
                "\\#1 best seller on amazon:  \n[https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr\\_1\\_1?sr=8-1](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr_1_1?sr=8-1)\n\nLOL, meta, failed again.",
                "And to think, I may have never heard about the next book I'm going to read.",
                "I deleted my facebook account last month after 16 years of pretty heavy use. \n\nI've heard you can't delete it in the states, can only deactivate, but in Canada you can permanently delete. I strongly suggest doing that if you have an account. Also remove all their apps from your phone. Don't let them earn off of your data.",
                "Something, something Streisand effect"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Woman charged with holding 'severely emaciated' stepson in captivity for over 20 years: Police",
            "external_url": "https://abcnews.go.com/US/woman-charged-holding-severely-emaciated-stepson-captivity-20/story?id=119742983",
            "upvotes": 954,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/396fe395-fd90-4e43-920c-41c7dd3fcc33/Sullivan-arrest_1741847969820_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "32 year old man. He weighed 68 pounds.",
                "Wow. Guy lit the house on fire as a plea for help. Smart.\n>‘I wanted my freedom.’",
                "There was a wellness check in 2005 after his friends asked where he went. Imagine having your childhood friend just disappear one day and then finding out 20 years later that he was being held in his room the whole time. \n\nI'm the same age as this guy and I'm imagining having my whole life stolen from me just as I was starting to grow up. Absolutely chilling.",
                "Her blaming her husband as if being complicit for 20+ years is any better. Husband of course not able to be questioned, and not in the house but she continued. ",
                "Part of understanding this kind of thing - is the almost certainty that she feels no regret or remorse about this. If anything she's upset at people 'interfering'. In her mind, she was perfect and the child 'deserved' this.",
                "I always wonder how many kids are just held prisoner by their parents for their entire lives and just die at home with no one else ever knowing they existed. These crimes are horrific.",
                ">>During the background investigation, police found that there were two incidents in the Waterbury Police Department had in their system for that address in 2005.\n\n>>**The first was a request from the Department of Children and Families to do a welfare check at the location because the victim’s friends had not seen him lately and were concerned about him, police said. Officers went to the house and saw that it was clean**, and **they spoke to the victim but at that point in time, there was no cause for any alarm** or any conditions that would have led officers to believe anything abnormal was occurring, police said Thursday.\n\nOh and no follow up when the child was never seen again you say? DCFS should’ve followed up, absolutely worthless social work and policing",
                "Looking at the police escorting her..... EXACTLY what I expected. Cross necklace, hair, outfit, age, and everything.",
                "She’s a devout Christian it seems. Figures. ",
                "With all the \"homeschooling\" going on now , you can bet there are a lot of kids living through this"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Rain set to hit Southern California amid flood warnings",
            "external_url": "https://www.latimes.com/california/story/2025-03-12/southern-california-storm-evacuation-warnings-flood-debris-flow",
            "upvotes": 85,
            "date": "03/13/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/090134b/2147483647/strip/true/crop/8192x4301+0+582/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdc%2F9e%2F394547d04c6f92d365534aac1d4f%2F1497952-me-0311-laweather-march-storm-gem-002.jpg",
            "top_comments": [
                "It never rains in Southern California, it pours.  Man it pours.",
                "Evacuation orders are being given elsewhere: https://www.msn.com/en-us/weather/topstories/flooding-debris-flow-possible-as-rain-slams-la-evacuation-orders-issued/ar-AA1AR2cZ?ocid=BingNewsBrowse\n\nStay safe, stay prepared out there.",
                "Trump will turn off the big faucet",
                "Thank gawd. I hate watering my yard."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 1140,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "This will fast track to SCOTUS",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "Great, now will he be charged for these unlawful acts? What a freaking joke of a man",
                "Alright so the obvious question will be: “what happens when the Trump Administration tells this judge to kick rocks”?",
                "That back-pay is sure going to look sweet."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Jewish protesters flood Trump Tower's lobby to demand the Columbia University activist's release",
            "external_url": "https://apnews.com/article/columbia-university-protests-khalil-trump-tower-8e2f455134a2f1b82458e32aecbb59f7",
            "upvotes": 609,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Jewish people having a problem with agents of the state disappearing someone without the government publicly saying what he did wrong?\n\nWeird.",
                "Hell yeah! Solidarity",
                "Ok but Fox News was telling me these were all anti semetic protesters who hate America. Why would they say that? /s",
                "Okay, how long until they're labeled as Hamas supporters and/or paid agitators?",
                "Jewish Voice for Peace isn't necessarily all Jewish people.  Many aren't Jewish, they're wearing T-shirts and pretending.\n\nI'm not saying that there aren't Jewish people with them.  There are.  But there's also a lot of people wearing \"not in our name\" shirts who are just cosplaying.  Like Ally Beardsley.",
                "fake jews do blah blah...not a story"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Meta stops former Facebook director from promoting critical memoir",
            "external_url": "https://www.bbc.com/news/articles/cq5zyq0250wo",
            "upvotes": 1235,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/355c/live/da2d5260-fda1-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "Getting  way more press than this book would have ever gotten without arbitration .",
                "That’s funny the news of the legal injunction is far better than any marketing she could have provided.  I’m going to buy a copy now.",
                "“Your honor, I object!\n\n“And why is that, Mr. Zuckerberg?”\n\n“Because it’s devastating to my case!”",
                "Are you you talking about the book \"[Careless People by Sarah Wynn-Williams](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237)\", available now to purchase?\n\n(Just because she can't promote it, doesn't meant the rest of us can't.)",
                "\n>During the emergency hearing the arbitrator, Nicholas Gowen, found Meta had provided enough evidence that Ms Wynn-Williams had potentially violated her severance contract.\n\n>Following the decision, Meta spokesperson Andy Stone said in a post on X: \"This ruling affirms that Sarah Wynn-Williams' false and defamatory book should never have been published.\"\n\nUmm, no it doesn't",
                "The BBC article says \"Meta has won an emergency ruling in the US to temporarily stop a former director of Facebook from promoting or further distributing copies of her memoir.\"\n\nIs this Streisand effect in action? Amazon's still selling it... seems like she just can't promote it... but Zuck's doing that himself.",
                "\\#1 best seller on amazon:  \n[https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr\\_1\\_1?sr=8-1](https://www.amazon.com/Careless-People-Cautionary-Power-Idealism/dp/1250391237/ref=sr_1_1?sr=8-1)\n\nLOL, meta, failed again.",
                "And to think, I may have never heard about the next book I'm going to read.",
                "I deleted my facebook account last month after 16 years of pretty heavy use. \n\nI've heard you can't delete it in the states, can only deactivate, but in Canada you can permanently delete. I strongly suggest doing that if you have an account. Also remove all their apps from your phone. Don't let them earn off of your data.",
                "Something, something Streisand effect"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "USDA ends program that helped schools serve food from local farmers",
            "external_url": "https://apnews.com/article/school-lunch-usda-trump-c1485f824573913fe9a734bbf1273e26",
            "upvotes": 587,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fixed headline: \"Trump appointee Brooke Rollins ends program that helped schools serve food from local farmers\".\n\nNo hiding behind agency names for these unqualified sycophants.",
                "That’ll make America great again",
                "Total waste.  Buying fresh food from local farmers to feed children.  FRAUD!\n\n\n/s obviously",
                "Damaging the health of children. Hampering their ability to learn and also under cutting the business of farmers. All with subsequent harm to the wider society and economy. \n\nTrump scores!",
                "\"Fuck them farmers, and fuck them kids to\" - maga",
                "I’m glad the farmers got exactly what they voted for. It’s sad the children have to suffer.",
                "All the good things.\n\nWhy not go after the bad things? Oh wait…",
                "USDA takes jobs away from American farmers and starves school children.",
                "If there is anything that Republicans love more than hurting brown people, it's hurting children and farmers.",
                "Republicans once again hurting Americans and thinking nothing of it."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 1326,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "What happened, did it turn out that he was qualified for the job?",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What, did he say he supports vaccines or something",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Ayo Edebiri ‘got insane death threats’ after Elon Musk shared fake report about Pirates of the Caribbean casting | Movies",
            "external_url": "https://www.theguardian.com/film/2025/mar/12/ayo-edebiri-got-insane-death-threats-after-elon-musk-shared-fake-report-about-pirates-of-the-caribbean-casting",
            "upvotes": 7311,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f177e2f93bdfbad4a59315adf7ca12135d9e10d0/0_0_3828_2297/master/3828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6c37eab200b27b17b52533c0edb15ce",
            "top_comments": [
                "> The Bear actor called Musk a fascist and an idiot after his reaction to a post from a rightwing account that claimed she was replacing Johnny Depp.\n\nThis man needs to lose another hundred billion+ in net worth and fade into obscurity. We also need to stop ignoring the severity of online harassment.",
                "> Responding to Edebiri’s post on Wednesday, the owner of the original account said: “I clearly stated ‘reportedly’ because it was the latest information coming from credible Hollywood sources. And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.\n\nSome people are fucking cultish and weird",
                "A dark-skinned person in the Caribbean? Who would have thought?",
                "[removed]",
                "The owner of the X account said, \"And yes, I am a HUGE fan and supporter of Mr Musk. He has my loyalty for LIFE, and I don’t say that lightly.” \n\nI can't even..",
                "Now that the government is a goner well never get this but boy do we need to start revamping how society treats digital threata in general and especially anonymous digital threats.",
                "She is fucking Caribbean!! People are insane.",
                "Why can’t the x outage be more permanent!?",
                "I remember in the 90s and early 2000s there was serious concern about online cyber bullying and death threats. There was a lot of talk about passing laws to stop it and most closely regulate these platforms. \n\nThen big tech got into bed with the government and everyone became “free speech absolutists”. \n\nNo other culture at no other point in history would allow this sort of shit to persist like we have.",
                "Elon about to clarify: \"This is Ukraine's fault\"."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Canadians who visit US for more than 30 days will be fingerprinted",
            "external_url": "https://www.theguardian.com/world/2025/mar/13/canada-fingerprint-visit-us",
            "upvotes": 3763,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ba10c375cb1e5b1586ed64ae5133e0ac2597c5f2/0_120_3600_2161/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=668367ca2ae33ce304afbb4d7814f743",
            "top_comments": [
                "1996. The USA had Clinton, Canada had Chretien. The US economy was roaring, and the dot com boom was just taking off. And I learned in geography class that our nations had the largest friendly border in the world.\n\nFive years later the worst terrorist attack on US soil occurred. 15 of the hijackers were Saudi nationals. None of the terrorists entered through the Canadian border. For the first and only time, the USA invoked Article 5 of NATO, and Canada fought alongside the US for damn near two decades in Afghanistan. 165 of our boys died fighting for the US.\n\nToday the Trump administration - after bungling the Afghan pullout and cutting a deal with the enemy Taliban, one of the world's most repressive regimes - now takes a friendlier attitude to Saudi Arabia than it does Canada.  A sickening betrayal and a reversal on more than a century of friendship that will harm Canada, but it will also do the USA more harm than good.",
                "Canada to employ large handed border agents to cavity search US visitors.",
                "Canadians who come and stay for more than 30 days are likely to be wealthy snowbirds.\n\nDiscouraging them from visiting and treating them like criminals is a weird strategy. \n\nDo Canadians suddenly become criminal troublemakers after 30 days?\n\nA lot of European, Pacific, and Central and South American beach towns thank the USA for the boost in polite, wealthy tourists.",
                "I would just suggest that our Canadian friends not come here if you don’t absolutely have to. Our government is hostile, chaotic, unstable, and untrustworthy right now. Many of us are hoping to fix that problem in the future, but it is going to take a while to get there.",
                "Just like US midwesterners, there are a good sized number of Canadians who spend their winters in the US south and it’s a lot of money to the towns who cater to them. Many Canadians have been already reconsidering their winter homes and  I suspect this will be the last straw for most.  It will be devastating to these communities when Canadian dollars decide to stay in Canada   ",
                "From an American, Canadians please don't come here if this is going to happen. We care about you and your safety. Stay out of here until we can burn this shit out.",
                "If I were a Canadian I would say fuck off US Government, my money stays in Canada or go to Europe. So much lording-it-over chickenshit.",
                "I'm canadian and my partner and I were planning to go back to NYC for our 15th anniversary. We go to the US every 2 years or so, each time spending ~5k$ for hotels, foods, drinks and entertainment over the course of a weekend.\n\nWe decided to forgo going to the US, we'll be going elsewhere in Canada or doing longer Europe trips.\n\nShit like this changes habits and will _decimate_ the US tourism industry.\n\nI can live without a broadway show, I can't live with being treated as a criminal for trying to give you guys money.",
                "Funny because I don't plan on spending a fucking dime on their fucking country.  Eat a dick Trump.   Eat all the dicks Trump supporters.",
                "It has been embarrassing to be an American since November…. Apologies to my Canadian friends"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Woman charged with holding 'severely emaciated' stepson in captivity for over 20 years: Police",
            "external_url": "https://abcnews.go.com/US/woman-charged-holding-severely-emaciated-stepson-captivity-20/story?id=119742983",
            "upvotes": 953,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/396fe395-fd90-4e43-920c-41c7dd3fcc33/Sullivan-arrest_1741847969820_hpMain_16x9.JPG?w=1600",
            "top_comments": [
                "32 year old man. He weighed 68 pounds.",
                "Wow. Guy lit the house on fire as a plea for help. Smart.\n>‘I wanted my freedom.’",
                "There was a wellness check in 2005 after his friends asked where he went. Imagine having your childhood friend just disappear one day and then finding out 20 years later that he was being held in his room the whole time. \n\nI'm the same age as this guy and I'm imagining having my whole life stolen from me just as I was starting to grow up. Absolutely chilling.",
                "Her blaming her husband as if being complicit for 20+ years is any better. Husband of course not able to be questioned, and not in the house but she continued. ",
                "Part of understanding this kind of thing - is the almost certainty that she feels no regret or remorse about this. If anything she's upset at people 'interfering'. In her mind, she was perfect and the child 'deserved' this.",
                "I always wonder how many kids are just held prisoner by their parents for their entire lives and just die at home with no one else ever knowing they existed. These crimes are horrific.",
                ">>During the background investigation, police found that there were two incidents in the Waterbury Police Department had in their system for that address in 2005.\n\n>>**The first was a request from the Department of Children and Families to do a welfare check at the location because the victim’s friends had not seen him lately and were concerned about him, police said. Officers went to the house and saw that it was clean**, and **they spoke to the victim but at that point in time, there was no cause for any alarm** or any conditions that would have led officers to believe anything abnormal was occurring, police said Thursday.\n\nOh and no follow up when the child was never seen again you say? DCFS should’ve followed up, absolutely worthless social work and policing",
                "Looking at the police escorting her..... EXACTLY what I expected. Cross necklace, hair, outfit, age, and everything.",
                "She’s a devout Christian it seems. Figures. ",
                "With all the \"homeschooling\" going on now , you can bet there are a lot of kids living through this"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Hundreds of Shoes, Personal Items and a List of Victims Found In Cartel Crematorium in Mexico",
            "external_url": "https://www.latintimes.com/hundreds-shoes-personal-items-list-victims-found-cartel-crematorium-mexico-578008",
            "upvotes": 576,
            "date": "03/13/2025",
            "thumbnail": "https://d.latintimes.com/en/full/572166/rancho-izaguirre.png",
            "top_comments": [
                "“Cartel crematorium” that’s terrifying. Guess we know where all the missing people in Mexico have gone.",
                "Remember who arms the cartels, who buys their shit and takes their bribes.",
                "This. This is what makes me ok with declaring Cartels Terrorists. People are talking about all the ways they aren’t.\n\nScrew Trump. But if that isn’t a campaign of terror I don’t know what is.",
                "People don't understand how bad the cartel is. They make their own problems dissappear.  They have people everywhere they need people to be and crematoriums where they can't get people.",
                "Anyways, we got \"cheap\" housing for any foreigners who want to retire over here, come come, don't be shy!",
                "My uncle has a crematorium in Mexico. Now everyone is going to think his business is cartel related..",
                "oh i know fuck the US right Reddit?  But here ya go...this is the reality of the rest of the planet.",
                "This is one of many reasons we need to secure of southern border."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Trump Family Has Held Deal Talks With Binance Following Crypto Exchange’s Guilty Plea",
            "external_url": "https://www.wsj.com/finance/currencies/trump-family-has-held-deal-talks-with-binance-following-crypto-exchanges-guilty-plea-05b029fa?mod=hp_lead_pos1",
            "upvotes": 952,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grifters helping grifters, Making Amazing Grifts Always.",
                "The weirdest thing is MAGA has somehow convinced a large percentage of the US population that everything is corrupt except Trump and the random drug addict that is destroying the US government is somehow uncovering corruption and fraud. ",
                "tHe bIdEN crImE FaMiLy",
                "Crypto and crime: a winning combination",
                "Silver lining: A global recession will destroy crypto.",
                "Sounds legit. Nothing to see here. Something something trans Canadian DEI.",
                "*So how do we get into this grift?*",
                "what a deal maker, right?",
                "Interesting development. Do you have more details on the nature of these talks?",
                "Complete fabrication by wsj aka Fake News\n\nhttps://x.com/cz_binance/status/1900194883891322948\n\n\"Feels like the article is motivated as an attack on the President and crypto, and the residual forces of the \"war on crypto\" from the last administration are still at work.\""
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/13/2025 20:09:22 UTC"
}