{
    "posts": [
        {
            "category": "HOT",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 42184,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Now we see what happens if the executive branch says “nah”",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "It's not a win, yet: \"However, the court said that the additional requirement to \"effectuate\" his return was unclear and may exceed the judge's authority. The justices directed Xinis to clarify the directive \"with due regard for the deference owed to the executive branch in the conduct of foreign affairs.\"\" \n\n\nThey want the judge to explain how the government should bring him back, which isn't the judge's job. They're still giving the government a lot of wiggle room.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Carnegie Mellon student with one semester left learns his visa was revoked with no explanation",
            "external_url": "https://www.cbsnews.com/pittsburgh/news/carnegie-mellon-student-visa-revoked-interview/",
            "upvotes": 9757,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/09/d2d0d1ef-58b8-44eb-a94c-1adcf57c1d2b/thumbnail/1200x630/6294363d99a43018d8f43abee72b6adc/snapshot-2025-04-09t180915-561.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "How to create a generation of smart potential immigrants who despise America.",
                "I wonder if these universities will let them finish their degrees online. That would definitely be the move.",
                "At the very least since he is three weeks away from graduating, couldn't CMU just award him the degree anyway if he get's deported or forced out of school?",
                "Similar cases with some Indian students - [https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09](https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09)",
                "What happened is a racist asshole got into the White House.",
                "Didn't Marco Rubio say he had cancelled more than 300 student visas by then?",
                "Strange that none of these kids getting their visas revoked are European or Aussie... hmm... \n\n(Obviously not strange, it's racism)",
                "The U.S. is radicalizing a whole new generation agaisnt it. Its a bizarre self-fulfilling prophecy.",
                "It hasn’t been noted in the media I don’t think, but this is another way Trump is attacking higher education. A lot of schools rely on international students since they usually pay a lot more for tuition.",
                "I hate this so much.  Since they absolutely do not care about the person that is affected. People pay a lot of money and time to get a degree, for it all to be snatched away for no reason but cruelty."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Planes clip wings at DCA with members of Congress on board",
            "external_url": "https://www.fox5dc.com/news/planes-collide-dca-per-members-congress-board",
            "upvotes": 10929,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2025/04/1280/720/gettyimages-2206556196-scaled.jpg?ve=1&tl=1",
            "top_comments": [
                "Based on the tweets, looks like 3 Congresspeople were involved:\n\n* Josh Gottheimer - NJ (Dem)\n* Nick LaLota - NY (Rep)\n* Grace Meng - NY (Dem)",
                "Flying to DCA is like playing a game of Russian Roulette.",
                "Now Congress will finally do something about it. Because Congress, especially Republicans, don't take any action unless it benefits them. ",
                "I hope this is a reminder to policymakers that when we say the agencies and programs they’re defunding benefit everyone, we literally mean *everyone*. Safety in transportation, health, food, weather — I could go on — is everyone’s business.",
                "Maybe dismantling the FAA was not a good idea?",
                "DOGE gutting the FAA means this will be increasingly common.",
                "If only Congress had some kind of funding and oversight role... Oh well...",
                ">“Aviation mishaps are at an all-time high, and the Trump administration's reckless decision to fire FAA control staff has put us all in danger.”\n\nHonestly, it's scary, you know, thinking about how quickly things can go wrong, especially when critical safety measures are cut... the political games shouldn't be interfering with something so vital, and I really hope those involved in this incident are okay, because that's the main thing, and it does make you think twice about flying.",
                "I’m about to google their voting records.  I was talking to people at work about how after the first few times I just thought the media was giving it extra attention because it was already in the cycle but it was getting weird, that was a few weeks ago",
                "About time the Congress clowns feel real world consequences for their bullshit"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 9155,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "Make showers golden again",
                "The syphilis has finally taken control of trumps brain. 🧠"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "USDA to close down DC headquarters, lay off thousands of workers: report",
            "external_url": "https://www.fox5dc.com/news/usda-close-down-dc-headquarters-lay-off-thousands-workers-report",
            "upvotes": 15214,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2024/01/1280/720/Dept-of-Agriculture.jpg?ve=1&tl=1",
            "top_comments": [
                "As an FYI- the USDA is not just food. They also oversee RD, or Rural Development which a portion of subsidized housing very similar to HUD or Section 8. This housing subsidy helps very low income households pay rent each month. \n\n  \nLosing funding would make millions of people homeless.",
                "What the fuck. \n\nSo we can't get fruit from Mexico and our own farms no longer have insurance to cover the increasing terrible storms",
                "Cool, this should have zero negative ramifications",
                "This is a plot to get more small farms to fail so large corps can buy the land",
                "Eh, my food was too safe anyway. Time to take a life altering gamble every time I eat a meal I guess....",
                "I've been watching the new Daredevil series. Every episode, I'm disappointed by the sad truth that Wilson Fisk is less destructive than our own president.",
                "Welcome to The Jungle",
                "USDA's main funding—70% is to school lunch, WIC, SNAP and rural home loans. Crop insurance and rural infrastructure are important too. Gonna be a big hit to rural schools combined with DOE cuts.",
                "Glad I’m not looking for jobs in DC, which would probably going to be the unemployment capital of the U.S.",
                "Its so wonderful to wake up each day, go online, and see what other terrible, unconstitutional, illegal ccr4p Felon47 has done to further destroy our once great nation....i pr4y daily that you know who has a massive myocardial infarction...."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Tourist helicopter crashes in Hudson River in New York City, all 6 on board killed",
            "external_url": "https://abcnews.go.com/US/helicopter-crashes-hudson-river-new-york-city/story?id=120691975",
            "upvotes": 2234,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7379b5d6-5467-43f4-b5cd-0a11bac25b6f/helicopter-crash-07-ht-jt-250410_1744320561326_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Those helicopter tours are once in a lifetime kinda thing for tourists. They’re not particularly cheap, but an incredible and unforgettable experience while visiting the city. This is so so so upsetting, they could be anybody.",
                "When I was a kid around ‘77ish we took a helicopter tour around The Queen Mary in Long Beach. Few days later that helicopter crashed killing all onboard. My Dad was white as a ghost for a few weeks after that. Never seen him scared before.",
                "Does anyone remember the traffic reporter who went down in the helicopter during a report?  Her words still HAUNT me - I can hear it vividly to this day.  RIP",
                "Those poor people. Can't imagine the terror they experienced...I just hope it was quick.",
                "when you think about it, those helicopters are going on, what, 5-10 trips or more a day? are they maintained properly?\n\nthis is so unbelievable - my heart is shattered for that family, pilot & their loved ones.",
                "From what I read of the article something hit the rotor, busted off a chunk of one and a fragment hit the engine causing it to explode and fall into the river. At least that's what I was able to gather. What the hell could do that to a helicopter? A drone maybe?",
                "Oh shit. That poor family and pilot’s family members . How terrifying. Can we just stop with the sassy comments?",
                "This fucking year man.",
                "I saw a pic of the family. Cute kids. An absolute tragedy. 🥺",
                "This had to be the worst air disaster year in us history. Let's fire more expert personnel"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Florida teacher loses job for calling student by ‘preferred’ name",
            "external_url": "https://www.clickorlando.com/news/local/2025/04/09/florida-teacher-loses-job-for-calling-student-by-preferred-name/",
            "upvotes": 33282,
            "date": "04/10/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/TBZTHJYBJ563IwLrah5g/1744232082153_1920x1080_thumbnail.jpg?_a=DATAdtfiZAA0",
            "top_comments": [
                "I remember a recent Townhall where a citizen called the chairperson \"Madam Chairwoman\" and the chair said \"I would prefer you call me Mr. Chairman,\" and the citizen responded with \"Per the resolution you just passed, I cannot be compelled to use your preferred pronouns, Madam Chairwoman.\"",
                "So does this apply to nicknames, or just trans kids?",
                "My wife is a Florida teacher, she cannot call students named Samuel, \"Sam\". She cannot call students named Samantha, \"Sam\". She can't call someone named Robert, \"Bobby\", unless she has a signed note by the parents allowing it. No, I'm not joking.\n\nShe also teaches 8 non-verbal special needs students, that have so far cut her face several times, choked her (kindergarten), and given her several bloody lips. These are kindergarteners. Many don't even live in a house, they live in shelters, or in a vehicle. The schools have codewords for those students, and offer no help. My wife is the one that gives them the stability their lives lack, and her thanks is being given more and more non-verbal, no IEP (they have no special education plan) and that makes it near impossible to teach the OTHER 30 kids in her class. She's also forced to teach them all together. So while one kid is hitting another, another kid is ripping books, and another has now absconded, with no teacher's aide, she has to deal with all that at the same time. \n\nEducation in Florida is in real danger.",
                "They aren't just firing her, the state of Florida is taking action to revoke her teachers license so she can never work as a teacher again. This is all happening because her parents contacted the school board to whine about this teacher using their child's preferred name. Imagine how guilty their kid is going to feel for being used to destroy the career of such a beloved compassionate teacher.",
                "The party of freedom is all about telling everyone what they can't do.",
                "> “BPS supports parents’ rights to be the primary decision-makers in their children’s lives, and Florida law affirms their right to be informed.\n\n\n   \n\nUnless, of course, parents want to direct their transgender child's health care in a way that the state of Florida doesn't like. Then it's \"fuck off, we know best.\"",
                "Using the name the kid prefers is grounds for dismissal? What kind of bizarro world is this?",
                "Ok, I’ll tell my son to let me know the next time his asshole coach calls him “ buddy” or “dude” or “bud” or “son”",
                "I still don’t understand how this law isn’t a direct violation of the first amendment. We’re supposed to have freedom of speech but can get fired for calling someone the “wrong” name?",
                "\"The teacher is working under a ten-month contract... Calhoun worked for the school district for eleven years\"\n\nHere is a good indication that Education is not considered a Profession in the fine state of Florida."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Police shoot best-selling author and wife of Weezer bassist, saying she pointed gun at officers",
            "external_url": "https://www.nbcnews.com/news/us-news/police-shoot-wife-weezers-bassist-say-pointed-gun-officers-rcna200543",
            "upvotes": 10482,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-scott-shriner-weezer-bassist-wife-jillian-lauren-shriner-2015-ac-1021p-c88a84.jpg",
            "top_comments": [
                "can't wait to see this body cam",
                "Gosh, this story sure has changed since yesterday. From \"she came out the front door shooting\" to \"she was in her back yard with a gun protecting her property\". This is a prime example of \"A lie can travel halfway around the world before the truth can get its boots on.\"",
                "*A best-selling author was shot by police and accused of attempted murder after authorities said she pointed a gun at officers who were searching for hit-and-run suspects in a residential Los Angeles neighborhood.*\n\n*Police said Shriner was not involved in the hit-and-run incident and the shooting is being investigated by LAPD’s Force Investigation Division.*\n\n*The department said officers encountered Shriner in the backyard of her home in Eagle Rock, north of downtown Los Angeles, Tuesday afternoon after the California Highway Patrol requested help finding three hit-and-run suspects allegedly involved in a crash on a nearby freeway.*\n\nSo she armed herself because strangers were in her yard and they shot her?",
                "Love how they tried to charge her to get out of shit. Show the body cam footage.",
                "This was on her property, I'm willing to bet a musician with a net worth north of 10 million has security cameras.",
                "she was in her own backyard? wow",
                "> In a Wednesday night news conference, Detective Meghan Aguilar said that it was not clear from body-worn police video what happened in the moments before the shooting, or whether she fired at officers.\n\n> Aguilar said that police body-worn police camera had not provided “a clear view of what she did with that firearm” or said it was “not clear if she fired at officers or not.”\n\nNot clear what happened or if she even shot her gun, but yet she’s still charged with attempted murder…make it make sense.\n\n> One of the hit-and-run suspects was found, cited and released, the department said. Two others were not located\n\n🤡",
                "Thank you for highlighting her achievement rather than her marriage",
                "What's with these homies shooting my girl",
                "So wait...  the police were chasing other people, went into HER backyard, saw her armed and immediately shot her?\n\nPolice should go to jail."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Macron says France could recognise Palestinian state in \"June\"",
            "external_url": "https://www.aljazeera.com/news/2025/4/9/macron-says-france-could-recognise-palestinian-state-in-june",
            "upvotes": 1348,
            "date": "04/11/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250408__39KN892__v1__HighRes__EgyptFrancePalestinianIsraelPoliticsDiplomacyCo-1744228213.jpg?resize=1920%2C1440",
            "top_comments": [
                "But not today. It’s not real *yet*",
                "Bibi probably hears that and says \"45 days to eradicate the entire Palestinian population? Pshh, hold my beer\"",
                "Bold of him to assume there will still be a Palestine by then…",
                "So many Zio-bots in the comments already lol",
                "Anyone thinking peace will come from something other than direct negotiations either isn't being realistic or is ignorant to the situation. \n\n  \nHe also says hes doing this so that he can promote recognition of Israel to countries with integrity... I don't think the countries who don't recognize Israel care for integrity lol.",
                "What will the Palestinians have then? One camper van in a barbed wire lot with no more orchards? Hey, maybe they can all have houseboats and live offshore, so Trump and Nuttin’nohow can develop their new resort. FFS.",
                "what a loser. recognize now you coward. we are so cooked",
                "[deleted]",
                "Let Macron stand under Israeli rain until \"June\".",
                "He is just pandering to his newer citizen population."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. stocks slide again as euphoria over Trump's tariff pause starts to fade",
            "external_url": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
            "upvotes": 8487,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2Fc7%2F92a79a2c4836b9771d5e43dfba5d%2Fgettyimages-2208870658-1.jpg",
            "top_comments": [
                "The fomo yesterday gave way to math and realism overnight.",
                "You can bend a paperclip a few times. It'll hold.\n\nKeep bending it again and again and it breaks.",
                "China is now at 145% after clarification this morning and there’s still that’s blanket 10% on everyone else, and Mexico and Canada still at 25%.\n\nSo like, it’s not over, shits still going to get expensive and we won’t be able to afford the same amount of stuff we can right now.\n\nOh well. They’re doing an investigation on price gouging eggs! They’re fixing the eggs y’all!\n\nEdit: We are on track to wipe out most gains from yesterday, and might hit a circuit breaker today. Hope people didn't celebrate it, cause now they may look dumb.",
                "All this \"Yay! The market is up!\" Is so stupid\n\nIts still down over 6% in a month and down over 10% from the high\n\nTrump is still a disaster for the economy, its just less bad than it was 2 days ago, but its still bad lol",
                "Bond market is cratering and the Dow riding on feels. These bounces are all money making chances for the billionaires with inside scoops.",
                "Insider trading isn't a crime if youre the one writing the rules",
                "Do not try and play this market. Either you sold a week ago, or just buckle down.",
                "All the money was made yesterday, give them a few weeks, and they'll repeat what they did again.... They may have to investigate themselves for insider trading, but they won't find any wrong doing...",
                "When the timing’s right, we’re gonna see a tweet that he’s “dealing” with China just for a little boost. At this point the US economy might as well just be a pump and dump meme.",
                "If you want to see how corrupt the media is, look at all the headlines after the tariff reversal. \n\n“Stock Market soars” \n\n“US Stocks rally after Trump Tariff Reprieve” \n\n “US stocks skyrocket higher after Trump signals shift in trade policy”\n\nEvery headline puts a positive spin while completely ignoring the fact that it was an intentional and unnecessary drop because of stupid tariff threats. (And let’s not ignore that anyone with inside knowledge cashed out huge)."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Attorney believes student visa for man living in Minnesota may have been revoked due to his political views",
            "external_url": "https://www.cbsnews.com/minnesota/news/marshall-minnesota-aditya-harsono-student-visa-revoked/",
            "upvotes": 54,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/11/be362094-af08-4a81-a14e-15dde32f972d/thumbnail/1200x630/cea1b98c99842a2414c2f3c0260e362b/10p-pkg-student-detained-wcco7j42.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "Political views and country of origin"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "US fugitive fatally shoots ‘Gringo Hunters’ officer in Mexico",
            "external_url": "https://www.theguardian.com/world/2025/apr/10/us-fugitive-gringo-hunters-officer-mexico?CMP=Share_iOSApp_Other",
            "upvotes": 292,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f97de6adfe2f5a4c65b402943e710e595b787b52/0_133_3976_2386/master/3976.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ef4f42851d9499ff6c370809e3b71bbc",
            "top_comments": [
                "She was 33, the leader of the unit in the state of Baja, and already “had led more than 400 operations to arrest US fugitives in Mexico”…! He escaped dozens of cops, a chopper, and a drone, running thru the streets almost naked, then “emerged” from a tarp in a neon green costume…?? I must be high.",
                "You mean to tell me that criminals aren’t home free once they cross the Mexican border like Blue Streak? Did they end up hunting Martin Lawrence down? We need a sequel!",
                "That dude just jogged away from prison lol",
                "In the article in the third paragraph the word “prediction” should be “predilection”.  RIP proofreading.",
                "The hunter became the hunted.",
                "He will not be taken alive. They may find him alive, but he’s not making it to the station except in a body bag.",
                "I just texted my friend Lonnie Payne and told him, I think this guy's book will outsell yours lol."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Carnegie Mellon student with one semester left learns his visa was revoked with no explanation",
            "external_url": "https://www.cbsnews.com/pittsburgh/news/carnegie-mellon-student-visa-revoked-interview/",
            "upvotes": 9765,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/09/d2d0d1ef-58b8-44eb-a94c-1adcf57c1d2b/thumbnail/1200x630/6294363d99a43018d8f43abee72b6adc/snapshot-2025-04-09t180915-561.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "How to create a generation of smart potential immigrants who despise America.",
                "I wonder if these universities will let them finish their degrees online. That would definitely be the move.",
                "At the very least since he is three weeks away from graduating, couldn't CMU just award him the degree anyway if he get's deported or forced out of school?",
                "Similar cases with some Indian students - [https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09](https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09)",
                "What happened is a racist asshole got into the White House.",
                "Didn't Marco Rubio say he had cancelled more than 300 student visas by then?",
                "Strange that none of these kids getting their visas revoked are European or Aussie... hmm... \n\n(Obviously not strange, it's racism)",
                "The U.S. is radicalizing a whole new generation agaisnt it. Its a bizarre self-fulfilling prophecy.",
                "It hasn’t been noted in the media I don’t think, but this is another way Trump is attacking higher education. A lot of schools rely on international students since they usually pay a lot more for tuition.",
                "I hate this so much.  Since they absolutely do not care about the person that is affected. People pay a lot of money and time to get a degree, for it all to be snatched away for no reason but cruelty."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "A jury finds Soulja Boy liable for abuse and sexual assault of ex-assistant, awards over $4 million",
            "external_url": "https://apnews.com/article/soulja-boy-verdict-trial-49900aea50a965d457890db8c19702e8",
            "upvotes": 579,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Does Soulja Boy even have $4 million?",
                "The most surprising part is that he is only 34.  What a POS",
                "Same entrepreneur that sold the Soulja Game console for like $400 which was a bootleg of a bootleg console containing bootleg games? Color me shocked.",
                "Now he’s going to have to beg extra hard on TikTok for money😂😂",
                "First rapper to be found liable of SA!\n\n\n/s its a long list at this point",
                "Another irrelevant washed out artist taking heat for SA again. Boy, I hate these trashy celebrities behavior and those who gave them a voice to begin so passionately.",
                "He made so much money from his hit song from back in the day. He also made a lot from ringtones. Back then you could put songs on cellphones and artists got paid, sound cloud also paid artists a lot back then. He absolutely has the money and more as long as he wasn’t stupid. He invested in a lot of companies too.",
                "Soulja Boy cranked it",
                "Can anyone explain to me why criminal cases involve money? he committed sexual assault, why a payout instead of jail time?",
                "I guess he finally superman-ed that ho?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Macron says France could recognise Palestinian state in \"June\"",
            "external_url": "https://www.aljazeera.com/news/2025/4/9/macron-says-france-could-recognise-palestinian-state-in-june",
            "upvotes": 1352,
            "date": "04/11/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250408__39KN892__v1__HighRes__EgyptFrancePalestinianIsraelPoliticsDiplomacyCo-1744228213.jpg?resize=1920%2C1440",
            "top_comments": [
                "But not today. It’s not real *yet*",
                "Bibi probably hears that and says \"45 days to eradicate the entire Palestinian population? Pshh, hold my beer\"",
                "Bold of him to assume there will still be a Palestine by then…",
                "So many Zio-bots in the comments already lol",
                "Anyone thinking peace will come from something other than direct negotiations either isn't being realistic or is ignorant to the situation. \n\n  \nHe also says hes doing this so that he can promote recognition of Israel to countries with integrity... I don't think the countries who don't recognize Israel care for integrity lol.",
                "What will the Palestinians have then? One camper van in a barbed wire lot with no more orchards? Hey, maybe they can all have houseboats and live offshore, so Trump and Nuttin’nohow can develop their new resort. FFS.",
                "what a loser. recognize now you coward. we are so cooked",
                "[deleted]",
                "Let Macron stand under Israeli rain until \"June\".",
                "He is just pandering to his newer citizen population."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Tourist helicopter crashes in Hudson River in New York City, all 6 on board killed",
            "external_url": "https://abcnews.go.com/US/helicopter-crashes-hudson-river-new-york-city/story?id=120691975",
            "upvotes": 2238,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7379b5d6-5467-43f4-b5cd-0a11bac25b6f/helicopter-crash-07-ht-jt-250410_1744320561326_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Those helicopter tours are once in a lifetime kinda thing for tourists. They’re not particularly cheap, but an incredible and unforgettable experience while visiting the city. This is so so so upsetting, they could be anybody.",
                "When I was a kid around ‘77ish we took a helicopter tour around The Queen Mary in Long Beach. Few days later that helicopter crashed killing all onboard. My Dad was white as a ghost for a few weeks after that. Never seen him scared before.",
                "Does anyone remember the traffic reporter who went down in the helicopter during a report?  Her words still HAUNT me - I can hear it vividly to this day.  RIP",
                "Those poor people. Can't imagine the terror they experienced...I just hope it was quick.",
                "when you think about it, those helicopters are going on, what, 5-10 trips or more a day? are they maintained properly?\n\nthis is so unbelievable - my heart is shattered for that family, pilot & their loved ones.",
                "From what I read of the article something hit the rotor, busted off a chunk of one and a fragment hit the engine causing it to explode and fall into the river. At least that's what I was able to gather. What the hell could do that to a helicopter? A drone maybe?",
                "Oh shit. That poor family and pilot’s family members . How terrifying. Can we just stop with the sassy comments?",
                "This fucking year man.",
                "I saw a pic of the family. Cute kids. An absolute tragedy. 🥺",
                "This had to be the worst air disaster year in us history. Let's fire more expert personnel"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 42182,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Now we see what happens if the executive branch says “nah”",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "It's not a win, yet: \"However, the court said that the additional requirement to \"effectuate\" his return was unclear and may exceed the judge's authority. The justices directed Xinis to clarify the directive \"with due regard for the deference owed to the executive branch in the conduct of foreign affairs.\"\" \n\n\nThey want the judge to explain how the government should bring him back, which isn't the judge's job. They're still giving the government a lot of wiggle room.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Apple airlifts 600 tons of iPhones from India 'to beat' Trump tariffs, sources say",
            "external_url": "https://www.reuters.com/technology/apple-airlifts-600-tons-iphones-india-to-beat-trump-tariffs-sources-say-2025-04-10/",
            "upvotes": 805,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">implying the total cargo of 600 tons comprised about 1.5 million iPhones\n\nWe can live without the newest iPhone, any chance of filling a few planes with prescription drugs?",
                "They will still charge like it’s tariffed.",
                "How does this beat tariffs though?",
                "Small business owners that can't do this are the ones hurt the worst. They just are leaving their shipments of goods at the port and going bankrupt.",
                "Omg when Trump finds out he will be so pissed at Tim Apple!",
                "To avoid paying tariffs set up by the guy whose ass they kissed lol",
                "That's only like a week of iPhone sales, maybe less.",
                "Tim Apple strikes again",
                "I guess it's time to buy calls on Apple, those phones are gonna be going for sky high prices",
                "Isn't that just smuggling?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 9167,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "Make showers golden again",
                "The syphilis has finally taken control of trumps brain. 🧠"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Gun goes off in child's bag in Maryland school days after similar gunfire in Virginia",
            "external_url": "https://www.nbcwashington.com/news/local/gun-goes-off-in-childs-bag-in-maryland-school-days-after-similar-gunfire-in-virginia/3889130/?utm_source=fark&utm_medium=website&utm_content=link&ICID=ref_fark",
            "upvotes": 1308,
            "date": "04/10/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/charles-county-school-chopper-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The good news:\n\n> The child’s parents were arrested and charged with recklessly leaving a loaded, unsecured firearm so as to endanger the life or limb of a child under 14.",
                "9 years old, wow. Fumbling through his backpack for a piece of paper while it was in his lap and accidentally discharged the gun.",
                "Teachers should require the kids turn in their guns at the beginning of each class. Otherwise they are just too distracting.",
                "I'm all for responsible gun ownership.\n\n\nProblem is that too many gun owners think responsibility is a liberal conspiracy.",
                "Only in the US will you see this type of shit occur regularly, and a huge number of people content to do absolutely nothing.\n\nAnd a big contingent of people that will vehemently oppose any discussion about measures that can be taken to prevent this kind of occurrence. ",
                "Parents who mishandle guns that cause situations like this deserve severe prison time.\n\nI know it is unethical to remove parents from a kid, but there has to be examples made that if you do this, you go to prison for a long time and lose access to your kids.",
                "Child carrying loaded gun in US school lunch bag.\nOkay, I can see that.",
                "Maryland is pretty good about gun laws. They will go after the parents. ",
                "america wont restrict gun-access but they'll restrict voter rights. MURRICA",
                "Man it almost sounds like this kid is bringing a gun to school out of fear of all these shootings, it’s\nSad. Also fuck the parents for not securing their guns properly."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Macron says France could recognise Palestinian state in \"June\"",
            "external_url": "https://www.aljazeera.com/news/2025/4/9/macron-says-france-could-recognise-palestinian-state-in-june",
            "upvotes": 1352,
            "date": "04/11/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250408__39KN892__v1__HighRes__EgyptFrancePalestinianIsraelPoliticsDiplomacyCo-1744228213.jpg?resize=1920%2C1440",
            "top_comments": [
                "But not today. It’s not real *yet*",
                "Bibi probably hears that and says \"45 days to eradicate the entire Palestinian population? Pshh, hold my beer\"",
                "Bold of him to assume there will still be a Palestine by then…",
                "So many Zio-bots in the comments already lol",
                "Anyone thinking peace will come from something other than direct negotiations either isn't being realistic or is ignorant to the situation. \n\n  \nHe also says hes doing this so that he can promote recognition of Israel to countries with integrity... I don't think the countries who don't recognize Israel care for integrity lol.",
                "What will the Palestinians have then? One camper van in a barbed wire lot with no more orchards? Hey, maybe they can all have houseboats and live offshore, so Trump and Nuttin’nohow can develop their new resort. FFS.",
                "what a loser. recognize now you coward. we are so cooked",
                "[deleted]",
                "Let Macron stand under Israeli rain until \"June\".",
                "He is just pandering to his newer citizen population."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Carnegie Mellon student with one semester left learns his visa was revoked with no explanation",
            "external_url": "https://www.cbsnews.com/pittsburgh/news/carnegie-mellon-student-visa-revoked-interview/",
            "upvotes": 9764,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/09/d2d0d1ef-58b8-44eb-a94c-1adcf57c1d2b/thumbnail/1200x630/6294363d99a43018d8f43abee72b6adc/snapshot-2025-04-09t180915-561.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "How to create a generation of smart potential immigrants who despise America.",
                "I wonder if these universities will let them finish their degrees online. That would definitely be the move.",
                "At the very least since he is three weeks away from graduating, couldn't CMU just award him the degree anyway if he get's deported or forced out of school?",
                "Similar cases with some Indian students - [https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09](https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09)",
                "What happened is a racist asshole got into the White House.",
                "Didn't Marco Rubio say he had cancelled more than 300 student visas by then?",
                "Strange that none of these kids getting their visas revoked are European or Aussie... hmm... \n\n(Obviously not strange, it's racism)",
                "The U.S. is radicalizing a whole new generation agaisnt it. Its a bizarre self-fulfilling prophecy.",
                "It hasn’t been noted in the media I don’t think, but this is another way Trump is attacking higher education. A lot of schools rely on international students since they usually pay a lot more for tuition.",
                "I hate this so much.  Since they absolutely do not care about the person that is affected. People pay a lot of money and time to get a degree, for it all to be snatched away for no reason but cruelty."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US fugitive fatally shoots ‘Gringo Hunters’ officer in Mexico",
            "external_url": "https://www.theguardian.com/world/2025/apr/10/us-fugitive-gringo-hunters-officer-mexico?CMP=Share_iOSApp_Other",
            "upvotes": 291,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f97de6adfe2f5a4c65b402943e710e595b787b52/0_133_3976_2386/master/3976.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ef4f42851d9499ff6c370809e3b71bbc",
            "top_comments": [
                "She was 33, the leader of the unit in the state of Baja, and already “had led more than 400 operations to arrest US fugitives in Mexico”…! He escaped dozens of cops, a chopper, and a drone, running thru the streets almost naked, then “emerged” from a tarp in a neon green costume…?? I must be high.",
                "You mean to tell me that criminals aren’t home free once they cross the Mexican border like Blue Streak? Did they end up hunting Martin Lawrence down? We need a sequel!",
                "That dude just jogged away from prison lol",
                "In the article in the third paragraph the word “prediction” should be “predilection”.  RIP proofreading.",
                "The hunter became the hunted.",
                "He will not be taken alive. They may find him alive, but he’s not making it to the station except in a body bag.",
                "I just texted my friend Lonnie Payne and told him, I think this guy's book will outsell yours lol."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A jury finds Soulja Boy liable for abuse and sexual assault of ex-assistant, awards over $4 million",
            "external_url": "https://apnews.com/article/soulja-boy-verdict-trial-49900aea50a965d457890db8c19702e8",
            "upvotes": 580,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Does Soulja Boy even have $4 million?",
                "The most surprising part is that he is only 34.  What a POS",
                "Same entrepreneur that sold the Soulja Game console for like $400 which was a bootleg of a bootleg console containing bootleg games? Color me shocked.",
                "Now he’s going to have to beg extra hard on TikTok for money😂😂",
                "First rapper to be found liable of SA!\n\n\n/s its a long list at this point",
                "Another irrelevant washed out artist taking heat for SA again. Boy, I hate these trashy celebrities behavior and those who gave them a voice to begin so passionately.",
                "He made so much money from his hit song from back in the day. He also made a lot from ringtones. Back then you could put songs on cellphones and artists got paid, sound cloud also paid artists a lot back then. He absolutely has the money and more as long as he wasn’t stupid. He invested in a lot of companies too.",
                "Soulja Boy cranked it",
                "Can anyone explain to me why criminal cases involve money? he committed sexual assault, why a payout instead of jail time?",
                "I guess he finally superman-ed that ho?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Tourist helicopter crashes in Hudson River in New York City, all 6 on board killed",
            "external_url": "https://abcnews.go.com/US/helicopter-crashes-hudson-river-new-york-city/story?id=120691975",
            "upvotes": 2235,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7379b5d6-5467-43f4-b5cd-0a11bac25b6f/helicopter-crash-07-ht-jt-250410_1744320561326_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Those helicopter tours are once in a lifetime kinda thing for tourists. They’re not particularly cheap, but an incredible and unforgettable experience while visiting the city. This is so so so upsetting, they could be anybody.",
                "When I was a kid around ‘77ish we took a helicopter tour around The Queen Mary in Long Beach. Few days later that helicopter crashed killing all onboard. My Dad was white as a ghost for a few weeks after that. Never seen him scared before.",
                "Does anyone remember the traffic reporter who went down in the helicopter during a report?  Her words still HAUNT me - I can hear it vividly to this day.  RIP",
                "Those poor people. Can't imagine the terror they experienced...I just hope it was quick.",
                "when you think about it, those helicopters are going on, what, 5-10 trips or more a day? are they maintained properly?\n\nthis is so unbelievable - my heart is shattered for that family, pilot & their loved ones.",
                "From what I read of the article something hit the rotor, busted off a chunk of one and a fragment hit the engine causing it to explode and fall into the river. At least that's what I was able to gather. What the hell could do that to a helicopter? A drone maybe?",
                "Oh shit. That poor family and pilot’s family members . How terrifying. Can we just stop with the sassy comments?",
                "This fucking year man.",
                "I saw a pic of the family. Cute kids. An absolute tragedy. 🥺",
                "This had to be the worst air disaster year in us history. Let's fire more expert personnel"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 42178,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Now we see what happens if the executive branch says “nah”",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "It's not a win, yet: \"However, the court said that the additional requirement to \"effectuate\" his return was unclear and may exceed the judge's authority. The justices directed Xinis to clarify the directive \"with due regard for the deference owed to the executive branch in the conduct of foreign affairs.\"\" \n\n\nThey want the judge to explain how the government should bring him back, which isn't the judge's job. They're still giving the government a lot of wiggle room.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Gun goes off in child's bag in Maryland school days after similar gunfire in Virginia",
            "external_url": "https://www.nbcwashington.com/news/local/gun-goes-off-in-childs-bag-in-maryland-school-days-after-similar-gunfire-in-virginia/3889130/?utm_source=fark&utm_medium=website&utm_content=link&ICID=ref_fark",
            "upvotes": 1314,
            "date": "04/10/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/charles-county-school-chopper-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The good news:\n\n> The child’s parents were arrested and charged with recklessly leaving a loaded, unsecured firearm so as to endanger the life or limb of a child under 14.",
                "9 years old, wow. Fumbling through his backpack for a piece of paper while it was in his lap and accidentally discharged the gun.",
                "Teachers should require the kids turn in their guns at the beginning of each class. Otherwise they are just too distracting.",
                "I'm all for responsible gun ownership.\n\n\nProblem is that too many gun owners think responsibility is a liberal conspiracy.",
                "Only in the US will you see this type of shit occur regularly, and a huge number of people content to do absolutely nothing.\n\nAnd a big contingent of people that will vehemently oppose any discussion about measures that can be taken to prevent this kind of occurrence. ",
                "Parents who mishandle guns that cause situations like this deserve severe prison time.\n\nI know it is unethical to remove parents from a kid, but there has to be examples made that if you do this, you go to prison for a long time and lose access to your kids.",
                "Child carrying loaded gun in US school lunch bag.\nOkay, I can see that.",
                "Maryland is pretty good about gun laws. They will go after the parents. ",
                "america wont restrict gun-access but they'll restrict voter rights. MURRICA",
                "Man it almost sounds like this kid is bringing a gun to school out of fear of all these shootings, it’s\nSad. Also fuck the parents for not securing their guns properly."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 9166,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "Make showers golden again",
                "The syphilis has finally taken control of trumps brain. 🧠"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Planes clip wings at DCA with members of Congress on board",
            "external_url": "https://www.fox5dc.com/news/planes-collide-dca-per-members-congress-board",
            "upvotes": 10922,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2025/04/1280/720/gettyimages-2206556196-scaled.jpg?ve=1&tl=1",
            "top_comments": [
                "Based on the tweets, looks like 3 Congresspeople were involved:\n\n* Josh Gottheimer - NJ (Dem)\n* Nick LaLota - NY (Rep)\n* Grace Meng - NY (Dem)",
                "Flying to DCA is like playing a game of Russian Roulette.",
                "Now Congress will finally do something about it. Because Congress, especially Republicans, don't take any action unless it benefits them. ",
                "I hope this is a reminder to policymakers that when we say the agencies and programs they’re defunding benefit everyone, we literally mean *everyone*. Safety in transportation, health, food, weather — I could go on — is everyone’s business.",
                "Maybe dismantling the FAA was not a good idea?",
                "DOGE gutting the FAA means this will be increasingly common.",
                "If only Congress had some kind of funding and oversight role... Oh well...",
                ">“Aviation mishaps are at an all-time high, and the Trump administration's reckless decision to fire FAA control staff has put us all in danger.”\n\nHonestly, it's scary, you know, thinking about how quickly things can go wrong, especially when critical safety measures are cut... the political games shouldn't be interfering with something so vital, and I really hope those involved in this incident are okay, because that's the main thing, and it does make you think twice about flying.",
                "I’m about to google their voting records.  I was talking to people at work about how after the first few times I just thought the media was giving it extra attention because it was already in the cycle but it was getting weird, that was a few weeks ago",
                "About time the Congress clowns feel real world consequences for their bullshit"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "USDA to close down DC headquarters, lay off thousands of workers: report",
            "external_url": "https://www.fox5dc.com/news/usda-close-down-dc-headquarters-lay-off-thousands-workers-report",
            "upvotes": 15214,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2024/01/1280/720/Dept-of-Agriculture.jpg?ve=1&tl=1",
            "top_comments": [
                "As an FYI- the USDA is not just food. They also oversee RD, or Rural Development which a portion of subsidized housing very similar to HUD or Section 8. This housing subsidy helps very low income households pay rent each month. \n\n  \nLosing funding would make millions of people homeless.",
                "What the fuck. \n\nSo we can't get fruit from Mexico and our own farms no longer have insurance to cover the increasing terrible storms",
                "Cool, this should have zero negative ramifications",
                "This is a plot to get more small farms to fail so large corps can buy the land",
                "Eh, my food was too safe anyway. Time to take a life altering gamble every time I eat a meal I guess....",
                "I've been watching the new Daredevil series. Every episode, I'm disappointed by the sad truth that Wilson Fisk is less destructive than our own president.",
                "Welcome to The Jungle",
                "USDA's main funding—70% is to school lunch, WIC, SNAP and rural home loans. Crop insurance and rural infrastructure are important too. Gonna be a big hit to rural schools combined with DOE cuts.",
                "Glad I’m not looking for jobs in DC, which would probably going to be the unemployment capital of the U.S.",
                "Its so wonderful to wake up each day, go online, and see what other terrible, unconstitutional, illegal ccr4p Felon47 has done to further destroy our once great nation....i pr4y daily that you know who has a massive myocardial infarction...."
            ],
            "aggregate_sentiment": 85.0
        }
    ],
    "last_updated": "04/11/2025 08:12:13 UTC"
}