{
    "posts": [
        {
            "category": "HOT",
            "title": "‘Read this email immediately’: CDC tells about 180 fired employees to come back to work",
            "external_url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
            "upvotes": 10816,
            "date": "03/06/2025",
            "thumbnail": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
            "top_comments": [
                "Ladies and Gentlemen, the Department of Government Efficiency.",
                "What a shit show this administration is",
                "You mean emails in accounts they were locked out of?",
                "&gt; “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\n**MAY** have caused?  Do you think firing people, then asking them to come back two weeks later MIGHT have caused some disruption?  Like, you're not certain?",
                "&gt; You’re fired. You’re hired. No more remote working. Write me an email and tell me what you do. Actually just kidding you don’t have to, but also if you don’t, You’re fired. Ok You’re fired. Wait, please come back. \n\nThe Department of Government Efficiency ladies and gentlemen",
                "CDC *begs* fired employees to come back to work. FTFY",
                "Why?  Why would you go back to work?  You know maybe next week, for no reason whatsoever, you might just get fired again.  Go find a more stable job elsewhere.  I hear China is hiring.",
                "You know how much loyalty you owe an employer that terminated you on a whim?\n\nNot an ounce.",
                "“Come back to work for temporary employment.”  \n\nWhy work for an employer that you can’t trust?",
                "\"too late, moved to Canada\""
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Amazon Boycott Begins Friday, Includes Whole Foods, Prime, Twitch",
            "external_url": "https://www.cnet.com/tech/economic-blackout-asks-you-to-boycott-amazon-for-a-week/",
            "upvotes": 3824,
            "date": "03/06/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/54cc0d7481c3b4ba6cd1b5d7865f11c43feb1e75/hub/2024/09/30/ab904444-01d1-4d43-b94b-8d091f7ef01e/amazon-box-foreground.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "I hope people who are just beginning the boycotts realize they can just remove these out of their lives as they become used to living without them. Why go back? Don't.",
                "Jokes on them , I'm broke and can't afford it anyway",
                "Great time for people in the US to curve their over consumption habits in preparation for all the tariffs\n.",
                "Havent had prime for 2-3 years now and it hasnt made my life harder at all.\n\n  \nMaybe bought a handful of things in that time  when it wasn't offered elsewhere but that is pretty much it. The other stores (costco) always come in clutch.  \n\n  \nThey also somehow made whole foods worse.",
                "i saw someone say 40 day target boycott and honestly people still don't seem to get it. if you live somewhere that you have another option, take it. 40 days is literally nothing. \n\nblack americans were boycotting busses for a full fucking year, if you have the ability, go to your local latino markets, asian markets, go in with a neighbor and get a costco membership if you have to ( you can have 2 people on one membership, 1 owner and a secondary member) \n\n(ps before anyone starts yelling about \"some of us its far/don't have transport/can't afford it\" then did it seem like i was talking to you when i said \"if you have the means\"?)",
                "Why cant we boycott things all at the same time",
                "I would like to remind anyone not cancelling their prime account to go use your twitch prime on a creator, any creator. It forces Amazon/twitch to pay your chosen creator out of their own pocket on a monthly basis, and is one of Twitch’s biggest loss items",
                "I just cancelled my Amazon Prime subscription yesterday. I’m not going back!",
                "Remember when people said they weren't going to use Netflix after the price hike (and for the password sharing thing) and the company actually saw positive growth? It's hard to take these things seriously. I'm curious if an actual boycott of a \"TBTF\" business has ever had a modicum of success. ",
                "I already let Prime lapse and honestly haven’t experienced any life changing drama or delivery anxiety. Prime Video is junk and Amazon itself has become a flea market. Would you pay annual membership to a flea market?\n\nFuck Jeff Bezos."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Six people arrested in Romania for treason over alleged negotiations with Russian agents to leave NATO",
            "external_url": "https://www.g4media.ro/six-people-arrested-in-romania-for-treason-over-alleged-negotiations-with-russian-agents-to-leave-nato.html",
            "upvotes": 2653,
            "date": "03/06/2025",
            "thumbnail": "https://cdn.g4media.ro/wp-content/uploads/2022/01/Radu-Theodoru.jpg",
            "top_comments": [
                "Hey, look a country that doesn’t suck off Putin. I remember when America was like that.",
                "Romania seemingly not that nostalgic about the \"good\" old days.",
                "Good job Romania, keep fighting for freedom.",
                "Give us 5hrs until the 🍊man will get angry about it.",
                "For the life of me, I would never understand why the Russian government focus on improving their own country instead of bringing down others to their level. The largest country in the world and the richest in natural resources.",
                "How does Russia have so much pull on so many? Are this many people willing to sell out for a few bucks?\n\n\nNevermind, I don’t think I want to know…",
                "Romanians are the type to drag dictators out into the street, give them a quick “trial” and kill them. Good for them.",
                "CIA could learn from Romanian counterintelligence, how to deal with ruzzian assets…",
                "101 years old. Damn, maybe vampires are real. But good for Romania",
                "Republicans, tell us again Trump isn't under Russian influence as he keeps taking those undocumented calls direct from Putin, violating the presidential records act. And calling to leave NATO, what a coincidence."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech",
            "external_url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986",
            "upvotes": 19252,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250303-mike-johnson-vl-1116a-90e2c1.jpg",
            "top_comments": [
                "These DUI hires, I tell ya",
                "That’ll be an interesting “what did you do this week” bullet",
                "Is there any way to FOIA the body cam footage? I bet this guy tried the ' No, you can't. I work for-\" defense.",
                "&gt;A Johnson spokesman said the speaker is standing by his chief of staff and \"has full faith and confidence\" in him.\n\n\nmy man you cannot be this spineless to your blundering henchmen",
                "I guarantee that if it has be the chief of staff for a Democrat the GOP would have been calling on said Democrat to resign for having such poor judgement in who they employed...",
                "My only question - celebrating or drowning his sorrows?",
                "I’d be a heavy drinker too if I sold out my country and values.",
                "The party of family values, everyone",
                "*No one* should be driving drunk. There's no -- zero -- excuse for that with ride shares and taxis existing, and there being a huge crowd there, some of whom would undoubtedly have given him a ride just for the asking if he was at the speech. Heck, I'd give an opposing party member a ride to keep them and others safe. \n\nThat said, he is not the only person who wanted to have a few too many after Trump's performance.",
                "How much do you want to bet he dropped the \"Do you know who I am?\""
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Political poll news site 538 to close amid larger shuttering across ABC and Disney",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/05/abc-news-538-shut-down",
            "upvotes": 12752,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6c1a8889b7ac4bae2cadb7e884b80cb6ee9948d5/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e202632038d7d38a3df642de6fd4c07",
            "top_comments": [
                "&gt;The broader media landscape has been hit with mass layoffs seemingly nonstop for months. Last month, MSNBC announced a massive shakeup at the network that included letting go of Joy Reid and her production team, as well as no longer using the Spanish-language network Telemundo.\n\nSetting aside any questions about former 538 head Nate Silver, it sucks to lose a valuable source for political polling and data analysis.  I hope the talented people there find new work.",
                "Wait but what about Galen Druke??? HE’S MY BOY",
                "How am I going to get my hopes up only to be woefully disappointed now?!",
                "I stopped obsessing over horserace polling after 2016 but still a shame. I liked their podcast and articles.",
                "Is the podcast getting axed also?",
                "Coincidentally, they chose to shutter 538 the day after it started showing that Trump had negative approval in the aggregate.",
                "Truth Social to soon come out with polling data that always shows Trump favored by 99%",
                "Nate Silver was removed over a year ago. Didn't really make sense to try to keep using his branding without him there.",
                "I don't give a shit about polls, but there's been a weird sudden shutdown of media. They weren't nice to Trump last time, now they're immediately handing him settlement money and are crickets quiet about his madness and ineptitude. Something is rotten.",
                "You don’t need an election monitoring site if you no longer plan on having elections."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.co.uk/news/articles/c4gmd3g2nzqo.amp",
            "upvotes": 5209,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "\"Older men declare war. But it is youth that must fight and die.\" \n-Herbert Hoover ",
                "\"Trump will scare dictators off with his strength\" - MAGA during the 2024 election season",
                "Break dancing followed by a rap battle?",
                "Just great stuff you love to see, and I haven't been to the grocery store but I must assume eggs have gone down in price",
                "If China declared war on the USA, Trump would ask what’s in it for him, and leave for Russia.",
                "Well good thing we found the most incompetent people running all aspects of the government then.",
                "Well, they might be right since the USA just essentially told all their allies to fuck off... They might not have any help.",
                "I think a lot of people do not understand the way trade wars can become or contribute to real wars. \n\nSarah Paine, I believe she said that the US oil embargo of Japan was the real starting point of the pacific conflict in WW2. She’s a top flight historian all over YouTube now and she’s a great lecturer. \n\nYou start waving swords, people will start planning bad outcomes.",
                "Can we please not go to war?  We need to restore that concept to an amendment to the Constitution that said war gets put to a national vote and the people that vote for it immediately get put into a draft.",
                "The US is eager to toss Europe, Canada, and Mexico under the bus so the US can lose a war to China while Russia gives us a thumbs up and laughs at the US with China. \n\nWe’re a bull tricked into charging a wall."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 20525,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "Damn Justice Amy Coney Barrett doing justice.",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess she does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.\n\nETA: to fix typo.",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "&gt;billions of dollars in foreign aid **approved by Congress**\n\nNo Kings live here"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "CIA director says US has paused intelligence support to Ukraine",
            "external_url": "https://www.cnn.com/2025/03/05/politics/us-pause-intelligence-support-ukraine?utm_medium=social&amp;utm_source=whatsappCNN&amp;utm_content=2025-03-05T13%3A51%3A35",
            "upvotes": 27440,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200569649.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "&gt;In the lead up to Trump’s inauguration, Ratcliffe and the Trump transition team were told of the value of intelligence sharing with Ukraine by US officials who stressed that it was a hallmark of their achievements on the battlefield, according to a source familiar with the discussions.\n\nWell, that's something, isn't it.",
                "The whole world is about to shift away from America and conservatives are going to wonder what happened in a decade.",
                "Just in case anyone believed that it was ever actually about the money and not an ideological desire to support Russia in the war.",
                "Sooner or later the US will share their intelligence support to its new closest ally: Russia.",
                "Intelligence in the United States has been paused as well.",
                "If not Russian asset, why Russian asset shaped?",
                "Better headline:  \n\\&gt; Russian Agent has paused US intelligence sharing with Ukraine",
                "They've paused intelligence alright ",
                "we are the baddies, its official",
                "There won't be future support from the US to Ukraine at all. It's over. Trump is going to start a manufactured fight with the entire EU I imagine to use it as a pretense to leave NATO and The UN."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 7594,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "This the same artist that did the goldfish in blenders?",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "This was likely the plan by the artist from the beginning. His friend is the one who helped the activists \"rescue\" the piglets.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "The article mentioned that a friend of the artist was behind the theft of the piglets so I thought that maybe it was all prearranged. \n\nThen I read further and it sounds like the artist is actually just a horrible person.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "'We are Canadian': 25 years later, Joe Canadian is back with a new patriotic video | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/we-are-canadian-video-1.7475829",
            "upvotes": 351,
            "date": "03/06/2025",
            "thumbnail": "https://i.cbc.ca/1.7475912.1741218576!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/as-it-happens-co-host-20101215.jpg?im=Resize%3D620",
            "top_comments": [
                "I had to teach my kids what the [Shawinigan handshake](https://en.wikipedia.org/wiki/Shawinigan_Handshake) was — Prime Minister \"Chrétien grabbed Clennett by the back of the neck and chin, forcing Clennett to the ground and breaking one of his teeth.\" \n\nCanadian PMs can hold their own. I can't imagine Trump without two layers of bodyguards around him.",
                "In case any of you Americans are wondering why the people of the north are so upset, watch this. Canada has a lot of national pride and we will never be the 51st anything",
                "Hell yeah, Canada, hell yeah. From an American, BTW. 🇨🇦🇨🇦🇨🇦",
                "Was wondering when he’d show up gain, eh. Nice.",
                "Now, one from “Guy” please, I need to find out if he still goes to club supersex…",
                "Dayum. The orange shitgibbon went out on the ice floe and poked a polar bear with no exit strategy. \n\nI, for one, welcome the day Western WA becomes part of British Columbia.",
                "You knew they’d bring him back.",
                "Cletus USA is about to release a response video."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "New U.S. Tariffs Will Impact Consoles, GPUs, and Physical Games, Say Analysts",
            "external_url": "https://www.ign.com/articles/new-us-tariffs-will-impact-consoles-gpus-and-physical-games-say-analysts",
            "upvotes": 46,
            "date": "03/06/2025",
            "thumbnail": "https://assets-prd.ignimgs.com/2025/01/16/screenshot-161-1737034377908.png?width=1280",
            "top_comments": [
                "All i feel for these people doing this is hatered",
                "Good... perhaps if some of life's distractions are impacted people will get more vocal with the Trump government that's doing this to them for no valid reason while attacking allies and destabilizing north America.",
                "Playtime is over graybeard, it is time to fight the Balrog.",
                "Gamers will now dive into politics as well.",
                "So people will smuggle eggs and consoles out of Canada now?",
                "Stating the obvious here aren't they? ACER already put 10% on all their goods a few weeks back. https://gizmodo.com/trumps-gamer-tax-begins-acer-says-itll-raise-prices-10-to-cover-tariffs-2000565553",
                "At least this means groceries will be cheaper, right?",
                "Probably gonna have to hold off on that Switch2 Purchase.",
                "So the PS5 pro wil be more expansive in the US then with us :P",
                "They targeted gamers.\n\nGamers.\n\nWe're a group of people who will sit for hours, days, even weeks on end performing some of the hardest, most mentally demanding tasks. Over, and over, and over all for nothing more than a little digital token saying we did.\n\nWe'll punish our selfs doing things others would consider torture, because we think it's fun.\n\nWe'll spend most if not all of our free time min maxing the stats of a fictional character all to draw out a single extra point of damage per second.\n\nMany of us have made careers out of doing just these things: slogging through the grind, all day, the same quests over and over, hundreds of times to the point where we know evety little detail such that some have attained such gamer nirvana that they can literally play these games blindfolded.\n\nDo these people have any idea how many controllers have been smashed, systems over heated, disks and carts destroyed 8n frustration? All to latter be referred to as bragging rights?\n\nThese people honestly think this is a battle they can win? They take our media? We're already building a new one without them. They take our devs? Gamers aren't shy about throwing their money else where, or even making the games our selves. They think calling us racist, mysoginistic, rape apologists is going to change us? We've been called worse things by prepubescent 10 year olds with a shitty head set. They picked a fight against a group that's already grown desensitized to their strategies and methods. Who enjoy the battle of attrition they've threatened us with. Who take it as a challange when they tell us we no longer matter. Our obsession with proving we can after being told we can't is so deeply ingrained from years of dealing with big brothers/sisters and friends laughing at how pathetic we used to be that proving you people wrong has become a very real need; a honed reflex.\n\nGamers are competative, hard core, by nature. We love a challange. The worst thing you did in all of this was to challange us. You're not special, you're not original, you're not the first; this is just another boss fight."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Three friends were found dead last year after watching a Chiefs game. Now, 2 men face charges in the case",
            "external_url": "https://www.cnn.com/2025/03/06/us/kansas-city-deaths-chiefs-fans-hnk?cid=external-feeds_iluminar_yahoo",
            "upvotes": 125,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/240125172228-kc-chiefs-fans-deaths-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Wow, it took a year to get the evidence to arrest the guy everyone thought did it the second they heard he lived in the house for a couple days with three corpses in his backyard?",
                "Great police work, man.  Takes them a year to get charges on this?  Good lord.  You never know if stuff has been laced with something.  Regardless, how do you not know that there are 3 dead bodies in your backyard for 2 days?",
                "Damn that sucks, And they were white so these cops were just lazy as hell",
                "I have to say, if 3 people go out of their way to buy drugs that are known to be dangerous and overdose, I don’t think that should be considered murder for those who supplied the drugs. They should get charged with selling drugs, sure.",
                "Is this that “Chiefsaholic” guy? Or is it another murder case?",
                "Real interesting that CNN has no problem plastering the drug users and victims faces all over the article, but can’t be bothered to show the mug shot of the criminals arrested."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Six people arrested in Romania for treason over alleged negotiations with Russian agents to leave NATO",
            "external_url": "https://www.g4media.ro/six-people-arrested-in-romania-for-treason-over-alleged-negotiations-with-russian-agents-to-leave-nato.html",
            "upvotes": 2661,
            "date": "03/06/2025",
            "thumbnail": "https://cdn.g4media.ro/wp-content/uploads/2022/01/Radu-Theodoru.jpg",
            "top_comments": [
                "Hey, look a country that doesn’t suck off Putin. I remember when America was like that.",
                "Romania seemingly not that nostalgic about the \"good\" old days.",
                "Good job Romania, keep fighting for freedom.",
                "Give us 5hrs until the 🍊man will get angry about it.",
                "For the life of me, I would never understand why the Russian government focus on improving their own country instead of bringing down others to their level. The largest country in the world and the richest in natural resources.",
                "How does Russia have so much pull on so many? Are this many people willing to sell out for a few bucks?\n\n\nNevermind, I don’t think I want to know…",
                "Romanians are the type to drag dictators out into the street, give them a quick “trial” and kill them. Good for them.",
                "CIA could learn from Romanian counterintelligence, how to deal with ruzzian assets…",
                "101 years old. Damn, maybe vampires are real. But good for Romania",
                "Republicans, tell us again Trump isn't under Russian influence as he keeps taking those undocumented calls direct from Putin, violating the presidential records act. And calling to leave NATO, what a coincidence."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Amazon Boycott Begins Friday, Includes Whole Foods, Prime, Twitch",
            "external_url": "https://www.cnet.com/tech/economic-blackout-asks-you-to-boycott-amazon-for-a-week/",
            "upvotes": 3828,
            "date": "03/06/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/54cc0d7481c3b4ba6cd1b5d7865f11c43feb1e75/hub/2024/09/30/ab904444-01d1-4d43-b94b-8d091f7ef01e/amazon-box-foreground.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "I hope people who are just beginning the boycotts realize they can just remove these out of their lives as they become used to living without them. Why go back? Don't.",
                "Jokes on them , I'm broke and can't afford it anyway",
                "Great time for people in the US to curve their over consumption habits in preparation for all the tariffs\n.",
                "Havent had prime for 2-3 years now and it hasnt made my life harder at all.\n\n  \nMaybe bought a handful of things in that time  when it wasn't offered elsewhere but that is pretty much it. The other stores (costco) always come in clutch.  \n\n  \nThey also somehow made whole foods worse.",
                "i saw someone say 40 day target boycott and honestly people still don't seem to get it. if you live somewhere that you have another option, take it. 40 days is literally nothing. \n\nblack americans were boycotting busses for a full fucking year, if you have the ability, go to your local latino markets, asian markets, go in with a neighbor and get a costco membership if you have to ( you can have 2 people on one membership, 1 owner and a secondary member) \n\n(ps before anyone starts yelling about \"some of us its far/don't have transport/can't afford it\" then did it seem like i was talking to you when i said \"if you have the means\"?)",
                "Why cant we boycott things all at the same time",
                "I would like to remind anyone not cancelling their prime account to go use your twitch prime on a creator, any creator. It forces Amazon/twitch to pay your chosen creator out of their own pocket on a monthly basis, and is one of Twitch’s biggest loss items",
                "I just cancelled my Amazon Prime subscription yesterday. I’m not going back!",
                "Remember when people said they weren't going to use Netflix after the price hike (and for the password sharing thing) and the company actually saw positive growth? It's hard to take these things seriously. I'm curious if an actual boycott of a \"TBTF\" business has ever had a modicum of success. ",
                "I already let Prime lapse and honestly haven’t experienced any life changing drama or delivery anxiety. Prime Video is junk and Amazon itself has become a flea market. Would you pay annual membership to a flea market?\n\nFuck Jeff Bezos."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "'We are Canadian': 25 years later, Joe Canadian is back with a new patriotic video | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/we-are-canadian-video-1.7475829",
            "upvotes": 357,
            "date": "03/06/2025",
            "thumbnail": "https://i.cbc.ca/1.7475912.1741218576!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/as-it-happens-co-host-20101215.jpg?im=Resize%3D620",
            "top_comments": [
                "I had to teach my kids what the [Shawinigan handshake](https://en.wikipedia.org/wiki/Shawinigan_Handshake) was — Prime Minister \"Chrétien grabbed Clennett by the back of the neck and chin, forcing Clennett to the ground and breaking one of his teeth.\" \n\nCanadian PMs can hold their own. I can't imagine Trump without two layers of bodyguards around him.",
                "In case any of you Americans are wondering why the people of the north are so upset, watch this. Canada has a lot of national pride and we will never be the 51st anything",
                "Hell yeah, Canada, hell yeah. From an American, BTW. 🇨🇦🇨🇦🇨🇦",
                "Was wondering when he’d show up gain, eh. Nice.",
                "Now, one from “Guy” please, I need to find out if he still goes to club supersex…",
                "Dayum. The orange shitgibbon went out on the ice floe and poked a polar bear with no exit strategy. \n\nI, for one, welcome the day Western WA becomes part of British Columbia.",
                "You knew they’d bring him back.",
                "Cletus USA is about to release a response video."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "‘Read this email immediately’: CDC tells about 180 fired employees to come back to work",
            "external_url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
            "upvotes": 10835,
            "date": "03/06/2025",
            "thumbnail": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
            "top_comments": [
                "Ladies and Gentlemen, the Department of Government Efficiency.",
                "What a shit show this administration is",
                "You mean emails in accounts they were locked out of?",
                "&gt; “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\n**MAY** have caused?  Do you think firing people, then asking them to come back two weeks later MIGHT have caused some disruption?  Like, you're not certain?",
                "&gt; You’re fired. You’re hired. No more remote working. Write me an email and tell me what you do. Actually just kidding you don’t have to, but also if you don’t, You’re fired. Ok You’re fired. Wait, please come back. \n\nThe Department of Government Efficiency ladies and gentlemen",
                "CDC *begs* fired employees to come back to work. FTFY",
                "Why?  Why would you go back to work?  You know maybe next week, for no reason whatsoever, you might just get fired again.  Go find a more stable job elsewhere.  I hear China is hiring.",
                "You know how much loyalty you owe an employer that terminated you on a whim?\n\nNot an ounce.",
                "“Come back to work for temporary employment.”  \n\nWhy work for an employer that you can’t trust?",
                "\"too late, moved to Canada\""
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.co.uk/news/articles/c4gmd3g2nzqo.amp",
            "upvotes": 5205,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "\"Older men declare war. But it is youth that must fight and die.\" \n-Herbert Hoover ",
                "\"Trump will scare dictators off with his strength\" - MAGA during the 2024 election season",
                "Break dancing followed by a rap battle?",
                "Just great stuff you love to see, and I haven't been to the grocery store but I must assume eggs have gone down in price",
                "If China declared war on the USA, Trump would ask what’s in it for him, and leave for Russia.",
                "Well good thing we found the most incompetent people running all aspects of the government then.",
                "Well, they might be right since the USA just essentially told all their allies to fuck off... They might not have any help.",
                "I think a lot of people do not understand the way trade wars can become or contribute to real wars. \n\nSarah Paine, I believe she said that the US oil embargo of Japan was the real starting point of the pacific conflict in WW2. She’s a top flight historian all over YouTube now and she’s a great lecturer. \n\nYou start waving swords, people will start planning bad outcomes.",
                "Can we please not go to war?  We need to restore that concept to an amendment to the Constitution that said war gets put to a national vote and the people that vote for it immediately get put into a draft.",
                "The US is eager to toss Europe, Canada, and Mexico under the bus so the US can lose a war to China while Russia gives us a thumbs up and laughs at the US with China. \n\nWe’re a bull tricked into charging a wall."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Boy kidnapped by mother for 7 years found in Colorado: Police",
            "external_url": "https://abcnews.go.com/US/boy-kidnapped-mother-7-years-found-colorado-police/story?id=119487753",
            "upvotes": 772,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c102dada-d793-44df-b147-8d89a4594f9f/rabia-khalid-main-ht-jt-250305_1741212848697_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That’s kinda how I grew up. Except my mom married a jarhead and hid me in Hawai‘i. I didn’t find out until early adulthood.",
                "Whoa, that’s a happy ending, nice. But what’s up with her current husband, \n\n“The other adult was identified as 42-year-old Elliot Blake Bourgeois, who is Khalid’s husband, but not the boy’s father. Both Khalid and Bourgeois were arrested and charged with second degree kidnapping, forgery, identity theft, providing false information to authorities and trespassing, the sheriff’s department said.”\n\nElliott Blake Bourgeois looks like someone stole his Pokémon characters.",
                "This whole story is in an episode of Unsolved Mysteries on Netflix. This woman is definitely the “bad guy.” She was unhinged from the beginning, failed to show up to a custody hearing and disappeared with the son. The father has been looking for him for 7 years.",
                "I wish I could hear the child pov on events.\n\nGrateful with his dad for rescue, or bitter at his dad for destroying his mom's life?",
                "These are the type of people who live in Douglas County, CO. Fuck Douglas County CO",
                "She kinda resembles Ashley Judd. *Kinda*.",
                "Kinda like what happened to some ppl in my life. The kids are super fucked up now, but their c*nt is/was happy.",
                "I wonder how something like this is resolved. It sounds like both the boy and girl were well taken care of, and now the son will be taken away from the only parent he knows, and given to his father. Divorce custody hearings are so unfair, it should really start at 50/50 so no one feels like they have to flee to protect their children.",
                "That's not kidnapping or newsworthy"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Political poll news site 538 to close amid larger shuttering across ABC and Disney",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/05/abc-news-538-shut-down",
            "upvotes": 12754,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6c1a8889b7ac4bae2cadb7e884b80cb6ee9948d5/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e202632038d7d38a3df642de6fd4c07",
            "top_comments": [
                "&gt;The broader media landscape has been hit with mass layoffs seemingly nonstop for months. Last month, MSNBC announced a massive shakeup at the network that included letting go of Joy Reid and her production team, as well as no longer using the Spanish-language network Telemundo.\n\nSetting aside any questions about former 538 head Nate Silver, it sucks to lose a valuable source for political polling and data analysis.  I hope the talented people there find new work.",
                "Wait but what about Galen Druke??? HE’S MY BOY",
                "How am I going to get my hopes up only to be woefully disappointed now?!",
                "I stopped obsessing over horserace polling after 2016 but still a shame. I liked their podcast and articles.",
                "Is the podcast getting axed also?",
                "Coincidentally, they chose to shutter 538 the day after it started showing that Trump had negative approval in the aggregate.",
                "Truth Social to soon come out with polling data that always shows Trump favored by 99%",
                "Nate Silver was removed over a year ago. Didn't really make sense to try to keep using his branding without him there.",
                "I don't give a shit about polls, but there's been a weird sudden shutdown of media. They weren't nice to Trump last time, now they're immediately handing him settlement money and are crickets quiet about his madness and ineptitude. Something is rotten.",
                "You don’t need an election monitoring site if you no longer plan on having elections."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "10 Chinese nationals charged with hacking U.S. Treasury and others: Justice Department",
            "external_url": "https://www.usatoday.com/story/news/politics/2025/03/05/chinese-cyber-hacking-federal-charges/81612072007/",
            "upvotes": 1394,
            "date": "03/05/2025",
            "thumbnail": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/03/05/USAT/81615283007-20240613-t-182358-z-1395539376-rc-2-ha-8-azkjvc-rtrmadp-3-microsoftcyber.JPG?crop=5710,3212,x0,y297&width=3200&height=1801&format=pjpg&auto=webp",
            "top_comments": [
                "Good thing Trump dissolved the Cyber Safety Review Board (CSRB), established to investigate major cyber incidents like this.",
                "Investigation put on hold and all prosecutors fired in 3, 2,...",
                "Did they check to see if they were DOGE employees first?",
                "“It wasn’t us, it was the Chinese hackers that cut Medicaid” incoming",
                "DOGE got hacked. So happy we were able to do a thorough review of their software to protect people's data.",
                "Gee, I wonder how a vulnerability could have gotten into that system............",
                "When do we charge the Russian hacker for hacking all US government agencies? I think he's called Krasnov or something.",
                "I’m sure for a tidy sum Trump will make the charges disappear.",
                "Sure. It was the Chinese. Or a Doge bro.",
                "Their strategic mistake was not being Russian."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "New U.S. Tariffs Will Impact Consoles, GPUs, and Physical Games, Say Analysts",
            "external_url": "https://www.ign.com/articles/new-us-tariffs-will-impact-consoles-gpus-and-physical-games-say-analysts",
            "upvotes": 46,
            "date": "03/06/2025",
            "thumbnail": "https://assets-prd.ignimgs.com/2025/01/16/screenshot-161-1737034377908.png?width=1280",
            "top_comments": [
                "All i feel for these people doing this is hatered",
                "Good... perhaps if some of life's distractions are impacted people will get more vocal with the Trump government that's doing this to them for no valid reason while attacking allies and destabilizing north America.",
                "Playtime is over graybeard, it is time to fight the Balrog.",
                "Gamers will now dive into politics as well.",
                "So people will smuggle eggs and consoles out of Canada now?",
                "Stating the obvious here aren't they? ACER already put 10% on all their goods a few weeks back. https://gizmodo.com/trumps-gamer-tax-begins-acer-says-itll-raise-prices-10-to-cover-tariffs-2000565553",
                "At least this means groceries will be cheaper, right?",
                "Probably gonna have to hold off on that Switch2 Purchase.",
                "So the PS5 pro wil be more expansive in the US then with us :P",
                "They targeted gamers.\n\nGamers.\n\nWe're a group of people who will sit for hours, days, even weeks on end performing some of the hardest, most mentally demanding tasks. Over, and over, and over all for nothing more than a little digital token saying we did.\n\nWe'll punish our selfs doing things others would consider torture, because we think it's fun.\n\nWe'll spend most if not all of our free time min maxing the stats of a fictional character all to draw out a single extra point of damage per second.\n\nMany of us have made careers out of doing just these things: slogging through the grind, all day, the same quests over and over, hundreds of times to the point where we know evety little detail such that some have attained such gamer nirvana that they can literally play these games blindfolded.\n\nDo these people have any idea how many controllers have been smashed, systems over heated, disks and carts destroyed 8n frustration? All to latter be referred to as bragging rights?\n\nThese people honestly think this is a battle they can win? They take our media? We're already building a new one without them. They take our devs? Gamers aren't shy about throwing their money else where, or even making the games our selves. They think calling us racist, mysoginistic, rape apologists is going to change us? We've been called worse things by prepubescent 10 year olds with a shitty head set. They picked a fight against a group that's already grown desensitized to their strategies and methods. Who enjoy the battle of attrition they've threatened us with. Who take it as a challange when they tell us we no longer matter. Our obsession with proving we can after being told we can't is so deeply ingrained from years of dealing with big brothers/sisters and friends laughing at how pathetic we used to be that proving you people wrong has become a very real need; a honed reflex.\n\nGamers are competative, hard core, by nature. We love a challange. The worst thing you did in all of this was to challange us. You're not special, you're not original, you're not the first; this is just another boss fight."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "‘Read this email immediately’: CDC tells about 180 fired employees to come back to work",
            "external_url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
            "upvotes": 10823,
            "date": "03/06/2025",
            "thumbnail": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
            "top_comments": [
                "Ladies and Gentlemen, the Department of Government Efficiency.",
                "What a shit show this administration is",
                "You mean emails in accounts they were locked out of?",
                "&gt; “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\n**MAY** have caused?  Do you think firing people, then asking them to come back two weeks later MIGHT have caused some disruption?  Like, you're not certain?",
                "&gt; You’re fired. You’re hired. No more remote working. Write me an email and tell me what you do. Actually just kidding you don’t have to, but also if you don’t, You’re fired. Ok You’re fired. Wait, please come back. \n\nThe Department of Government Efficiency ladies and gentlemen",
                "CDC *begs* fired employees to come back to work. FTFY",
                "Why?  Why would you go back to work?  You know maybe next week, for no reason whatsoever, you might just get fired again.  Go find a more stable job elsewhere.  I hear China is hiring.",
                "You know how much loyalty you owe an employer that terminated you on a whim?\n\nNot an ounce.",
                "“Come back to work for temporary employment.”  \n\nWhy work for an employer that you can’t trust?",
                "\"too late, moved to Canada\""
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Amazon Boycott Begins Friday, Includes Whole Foods, Prime, Twitch",
            "external_url": "https://www.cnet.com/tech/economic-blackout-asks-you-to-boycott-amazon-for-a-week/",
            "upvotes": 3819,
            "date": "03/06/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/54cc0d7481c3b4ba6cd1b5d7865f11c43feb1e75/hub/2024/09/30/ab904444-01d1-4d43-b94b-8d091f7ef01e/amazon-box-foreground.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "I hope people who are just beginning the boycotts realize they can just remove these out of their lives as they become used to living without them. Why go back? Don't.",
                "Jokes on them , I'm broke and can't afford it anyway",
                "Great time for people in the US to curve their over consumption habits in preparation for all the tariffs\n.",
                "Havent had prime for 2-3 years now and it hasnt made my life harder at all.\n\n  \nMaybe bought a handful of things in that time  when it wasn't offered elsewhere but that is pretty much it. The other stores (costco) always come in clutch.  \n\n  \nThey also somehow made whole foods worse.",
                "i saw someone say 40 day target boycott and honestly people still don't seem to get it. if you live somewhere that you have another option, take it. 40 days is literally nothing. \n\nblack americans were boycotting busses for a full fucking year, if you have the ability, go to your local latino markets, asian markets, go in with a neighbor and get a costco membership if you have to ( you can have 2 people on one membership, 1 owner and a secondary member) \n\n(ps before anyone starts yelling about \"some of us its far/don't have transport/can't afford it\" then did it seem like i was talking to you when i said \"if you have the means\"?)",
                "Why cant we boycott things all at the same time",
                "I would like to remind anyone not cancelling their prime account to go use your twitch prime on a creator, any creator. It forces Amazon/twitch to pay your chosen creator out of their own pocket on a monthly basis, and is one of Twitch’s biggest loss items",
                "I just cancelled my Amazon Prime subscription yesterday. I’m not going back!",
                "Remember when people said they weren't going to use Netflix after the price hike (and for the password sharing thing) and the company actually saw positive growth? It's hard to take these things seriously. I'm curious if an actual boycott of a \"TBTF\" business has ever had a modicum of success. ",
                "I already let Prime lapse and honestly haven’t experienced any life changing drama or delivery anxiety. Prime Video is junk and Amazon itself has become a flea market. Would you pay annual membership to a flea market?\n\nFuck Jeff Bezos."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Six people arrested in Romania for treason over alleged negotiations with Russian agents to leave NATO",
            "external_url": "https://www.g4media.ro/six-people-arrested-in-romania-for-treason-over-alleged-negotiations-with-russian-agents-to-leave-nato.html",
            "upvotes": 2663,
            "date": "03/06/2025",
            "thumbnail": "https://cdn.g4media.ro/wp-content/uploads/2022/01/Radu-Theodoru.jpg",
            "top_comments": [
                "Hey, look a country that doesn’t suck off Putin. I remember when America was like that.",
                "Romania seemingly not that nostalgic about the \"good\" old days.",
                "Good job Romania, keep fighting for freedom.",
                "Give us 5hrs until the 🍊man will get angry about it.",
                "For the life of me, I would never understand why the Russian government focus on improving their own country instead of bringing down others to their level. The largest country in the world and the richest in natural resources.",
                "How does Russia have so much pull on so many? Are this many people willing to sell out for a few bucks?\n\n\nNevermind, I don’t think I want to know…",
                "Romanians are the type to drag dictators out into the street, give them a quick “trial” and kill them. Good for them.",
                "CIA could learn from Romanian counterintelligence, how to deal with ruzzian assets…",
                "101 years old. Damn, maybe vampires are real. But good for Romania",
                "Republicans, tell us again Trump isn't under Russian influence as he keeps taking those undocumented calls direct from Putin, violating the presidential records act. And calling to leave NATO, what a coincidence."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech",
            "external_url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986",
            "upvotes": 19250,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250303-mike-johnson-vl-1116a-90e2c1.jpg",
            "top_comments": [
                "These DUI hires, I tell ya",
                "That’ll be an interesting “what did you do this week” bullet",
                "Is there any way to FOIA the body cam footage? I bet this guy tried the ' No, you can't. I work for-\" defense.",
                "&gt;A Johnson spokesman said the speaker is standing by his chief of staff and \"has full faith and confidence\" in him.\n\n\nmy man you cannot be this spineless to your blundering henchmen",
                "I guarantee that if it has be the chief of staff for a Democrat the GOP would have been calling on said Democrat to resign for having such poor judgement in who they employed...",
                "My only question - celebrating or drowning his sorrows?",
                "I’d be a heavy drinker too if I sold out my country and values.",
                "The party of family values, everyone",
                "*No one* should be driving drunk. There's no -- zero -- excuse for that with ride shares and taxis existing, and there being a huge crowd there, some of whom would undoubtedly have given him a ride just for the asking if he was at the speech. Heck, I'd give an opposing party member a ride to keep them and others safe. \n\nThat said, he is not the only person who wanted to have a few too many after Trump's performance.",
                "How much do you want to bet he dropped the \"Do you know who I am?\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Political poll news site 538 to close amid larger shuttering across ABC and Disney",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/05/abc-news-538-shut-down",
            "upvotes": 12754,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6c1a8889b7ac4bae2cadb7e884b80cb6ee9948d5/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e202632038d7d38a3df642de6fd4c07",
            "top_comments": [
                "&gt;The broader media landscape has been hit with mass layoffs seemingly nonstop for months. Last month, MSNBC announced a massive shakeup at the network that included letting go of Joy Reid and her production team, as well as no longer using the Spanish-language network Telemundo.\n\nSetting aside any questions about former 538 head Nate Silver, it sucks to lose a valuable source for political polling and data analysis.  I hope the talented people there find new work.",
                "Wait but what about Galen Druke??? HE’S MY BOY",
                "How am I going to get my hopes up only to be woefully disappointed now?!",
                "I stopped obsessing over horserace polling after 2016 but still a shame. I liked their podcast and articles.",
                "Is the podcast getting axed also?",
                "Coincidentally, they chose to shutter 538 the day after it started showing that Trump had negative approval in the aggregate.",
                "Truth Social to soon come out with polling data that always shows Trump favored by 99%",
                "Nate Silver was removed over a year ago. Didn't really make sense to try to keep using his branding without him there.",
                "I don't give a shit about polls, but there's been a weird sudden shutdown of media. They weren't nice to Trump last time, now they're immediately handing him settlement money and are crickets quiet about his madness and ineptitude. Something is rotten.",
                "You don’t need an election monitoring site if you no longer plan on having elections."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.co.uk/news/articles/c4gmd3g2nzqo.amp",
            "upvotes": 5207,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "\"Older men declare war. But it is youth that must fight and die.\" \n-Herbert Hoover ",
                "\"Trump will scare dictators off with his strength\" - MAGA during the 2024 election season",
                "Break dancing followed by a rap battle?",
                "Just great stuff you love to see, and I haven't been to the grocery store but I must assume eggs have gone down in price",
                "If China declared war on the USA, Trump would ask what’s in it for him, and leave for Russia.",
                "Well good thing we found the most incompetent people running all aspects of the government then.",
                "Well, they might be right since the USA just essentially told all their allies to fuck off... They might not have any help.",
                "I think a lot of people do not understand the way trade wars can become or contribute to real wars. \n\nSarah Paine, I believe she said that the US oil embargo of Japan was the real starting point of the pacific conflict in WW2. She’s a top flight historian all over YouTube now and she’s a great lecturer. \n\nYou start waving swords, people will start planning bad outcomes.",
                "Can we please not go to war?  We need to restore that concept to an amendment to the Constitution that said war gets put to a national vote and the people that vote for it immediately get put into a draft.",
                "The US is eager to toss Europe, Canada, and Mexico under the bus so the US can lose a war to China while Russia gives us a thumbs up and laughs at the US with China. \n\nWe’re a bull tricked into charging a wall."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 20530,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "Damn Justice Amy Coney Barrett doing justice.",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess she does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.\n\nETA: to fix typo.",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "&gt;billions of dollars in foreign aid **approved by Congress**\n\nNo Kings live here"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "CIA director says US has paused intelligence support to Ukraine",
            "external_url": "https://www.cnn.com/2025/03/05/politics/us-pause-intelligence-support-ukraine?utm_medium=social&amp;utm_source=whatsappCNN&amp;utm_content=2025-03-05T13%3A51%3A35",
            "upvotes": 27447,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200569649.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "&gt;In the lead up to Trump’s inauguration, Ratcliffe and the Trump transition team were told of the value of intelligence sharing with Ukraine by US officials who stressed that it was a hallmark of their achievements on the battlefield, according to a source familiar with the discussions.\n\nWell, that's something, isn't it.",
                "The whole world is about to shift away from America and conservatives are going to wonder what happened in a decade.",
                "Just in case anyone believed that it was ever actually about the money and not an ideological desire to support Russia in the war.",
                "Sooner or later the US will share their intelligence support to its new closest ally: Russia.",
                "Intelligence in the United States has been paused as well.",
                "If not Russian asset, why Russian asset shaped?",
                "Better headline:  \n\\&gt; Russian Agent has paused US intelligence sharing with Ukraine",
                "They've paused intelligence alright ",
                "we are the baddies, its official",
                "There won't be future support from the US to Ukraine at all. It's over. Trump is going to start a manufactured fight with the entire EU I imagine to use it as a pretense to leave NATO and The UN."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 7596,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "This the same artist that did the goldfish in blenders?",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "This was likely the plan by the artist from the beginning. His friend is the one who helped the activists \"rescue\" the piglets.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "The article mentioned that a friend of the artist was behind the theft of the piglets so I thought that maybe it was all prearranged. \n\nThen I read further and it sounds like the artist is actually just a horrible person.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "03/06/2025 12:30:35 UTC"
}