{
    "posts": [
        {
            "category": "HOT",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 5722,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "It's always the ones you most suspect. ",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "This is the free space on the BINGO card",
                "Not a transperson. Not gay. Hmm",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Thanks for reminding me that it's Wednesday, I almost missed movie night.",
                "No shit? So, are we still worried about the Drag Show Reading programs? /s"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 9283,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "Well, it's better than having the rocket blow up.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back.",
                "Just to be clear, they aren’t “stuck” or “stranded” there is a return vehicle on the ISS, just their original one had issues. They also are doing work on the ISS, doing science and shit (literally)"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 12636,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "Fuck the environment, fuck affordable healthcare, fuck vaccines, fuck FDA regulations for food handling! Being alive and healthy is woke liberal garbage! Let me breathe asbestos and eat lead and contract preventable diseases like our forefathers intended 😡"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 3254,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "So glad we elected Trump to Make America Healthy Again",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "“We don’t need trees from Canada, we have National Parks”",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 23093,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "Imagine being Putin and planning for this day for so long and finally seeing it come together.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "Minnesota is a blue state but all the farm areas are red as hell.  Good hit those soybeans, I have no more empthany for those people.  \n\nFarmers in Blue States really get me upset (I grew up among them), Minnesota has some of the best social programs and protections in the nation and all of them just shit on the Gov and everyone from the Twin Cities.  They themselves benefit from these programs and then talk about how great Christie Noem is from South Dakota.  GO FUCKING MOVE THERE THEN (yeah i know she's not the gov now) \n\nThey also hate anyone who accepts any assistance or benefits like snap or welfare, yet they're the biggest welfare queens I've ever met.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "They should have hit tech. That's all trump cares about because they stand in his room. Mark Twitter for being blocked, tons of valid reasons. Mark Apple because they store data in the US.\n\nMake them bleed where they live, they don't care about farmers.",
                "Thank you, EU, for targeting republican states."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 5714,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "Getting harder and harder to hate the French ffs",
                "Clearly a baguette class submarine",
                "This is not nearly as big a deal as some people think.",
                "I hope it stays there until trump is out of office",
                "I love the French.\n\nMacron should request that the U.S. return the Statue of Liberty since \"they arent using it\" anymore."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 4843,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "So like when they took a single racists lie and a picture of a black guy with a dead goose as undeniable proof that black people were eating cats and dogs enmasse.",
                "They didn't even cherry pick the studies, they used out of context information in the studies to justify their idiocy."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "A European Starlink rival’s shares skyrocketed 390% in a week — here’s why",
            "external_url": "https://www.cnbc.com/2025/03/10/why-european-starlink-rival-eutelsat-shares-are-rocketing.html",
            "upvotes": 614,
            "date": "03/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108113207-1741601280278-gettyimages-2203401162-PORTUGAL_EUTELSAT.jpeg?v=1741601379&w=1920&h=1080",
            "top_comments": [
                "Let me guess without clicking the link. Because StarLink owner is a poop poop head nazi ?",
                "Premier of Ontario just canceled his provincial contract with F.elon’s 卐tarlink. \neutelsat should give him a call for a replacement deal. ",
                "While Starlink is very popular with Nazis, good news is the target market is relatively small. Lots of room just opened up for competition.",
                "Leon os suing companies for not advertising on xitter, now he’ll sue everyone for not using starlink",
                "Eutelsat is a much better product and satellite provider anyways...",
                "It would be great if they can supplant starlink. They could provide the same technology but not tied to a fascist. This would also mean that if things go terrible with America there will be an alternative to support the military needs of the EU.",
                "Ok guys, this is the one time no one will get after you for not reading the article. Because yes, it is exactly why you are thinking."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 2146,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "Fascism, pure and simple",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Why did they send him to Louisiana?",
                "Can someone please tell me exactly what this guy has done?",
                "This is perhaps the most egregious First Amendment violation of many of our lifetimes.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Trump's regime and his supporters: Fuck the Constitution!",
                "Republicans will claim that non-Americans do not have human rights in America and the Republican Supreme Court will agree."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 2531,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Johnny Martinez is the man who saw her from atop a large tractor. An incredible stroke of luck that he saw her and to quickly take action. What a hero.",
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                "So thankful someone found her in time. Something similar happened to my coworker’s husband some years ago. They were relocating to a new state for a job. Husband was the last to travel alone after closing up the old house. He was driving through a mountainous area and veered off the road. His car landed in a very wooded area many feet below the highway and not visible. He was pinned hanging upside down and could not get down or out of the car. Couldn’t reach the phone and the battery eventually died. Authorities were reluctant to do deep search because he had not been missing 24 hours. They said he could have stopped off to eat or rest. She reached out to friends and family and anyone who would help. They were able to narrow down the search area on the basis of his last conversation with his wife. The only reason they finally found him was a bright red dolly fell out of his truck during the accident and the handle was sticking out of a visible area. This is why you should always let someone know of your travel plans and check in once in a while and keep your phone charged.",
                ">Vanderwall said Martinez could spot the car because he was driving a tall tractor.\n\n>\"I myself had traveled that road at least three to four times since she crashed and did not see her,\" Vanderwall noted.\n\nThat's some serious luck right there, or just fate.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. ",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "I live a bit northeast of where she was found and everyone in the area is quite shocked especially when this almost exact scenerio happened to a man in portage a few years ago. \n\nI hope the best for her. To be that close to help without a way to be seen is absolutely horrific.",
                "What a hero Mr. Martinez is!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Canada hits U.S. with dollar-for-dollar retaliation for Trump’s steel and aluminum tariffs",
            "external_url": "https://www.ctvnews.ca/world/trumps-tariffs/article/canada-to-announce-298-billion-in-retaliatory-tariffs-on-us-official-tells-reuters/",
            "upvotes": 48,
            "date": "03/13/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/O2Z3R2AGDRBHPAVMLPWN67KEVU.JPG?smart=true&auth=d37064364955204825c361d2b31d8e8e2ee31af7d9968a7e20c781659e87a7af&width=1200&height=630",
            "top_comments": [
                "If only someone could have seen this coming...",
                "Wait until tomorrow I bet Lutnick will make a fool of himself with Ford"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Sandy Hook families ‘no longer see any benefit’ in Alex Jones’ Infowars fight, propose new plan",
            "external_url": "https://www.newstimes.com/news/article/alex-jones-infowars-sandy-hook-families-bankruptcy-20217270.php",
            "upvotes": 8,
            "date": "03/13/2025",
            "thumbnail": "https://s.hdnux.com/photos/01/27/46/40/22964270/5/rawImage.jpg",
            "top_comments": [
                "Scum just kept hedging and hedging..",
                "Why Trump hasn't given him a cabinet appointment yet, I'll never know",
                "“In the over three years since (Infowars) and Jones first filed their bankruptcy cases, more than $10 million has been billed by estate professionals in these cases, either defending Jones or responding to objections from Jones … (a)nd yet, the Sandy Hook families have not yet received – and are no closer to receiving – a single dollar,” writes a team of seven attorneys representing the Sandy Hook families. “The Sandy Hook families have determined that the best path for collecting on their judgments against (Infowars) is to work together and pursue remedies in state court, which they will be doing in short order.”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "NOAA braces for mass layoffs, fueling concerns about lifesaving weather services",
            "external_url": "https://abcnews.go.com/Politics/noaa-braces-mass-layoffs-fueling-concerns-lifesaving-weather/story?id=119730398",
            "upvotes": 14,
            "date": "03/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1adaf63d-971b-42f5-9aef-5502689ad7bc/noaa-3-gty-gmh-250303_1741028114098_hpMain_16x9.jpg?w=1600",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 5711,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "It's always the ones you most suspect. ",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "This is the free space on the BINGO card",
                "Not a transperson. Not gay. Hmm",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Thanks for reminding me that it's Wednesday, I almost missed movie night.",
                "No shit? So, are we still worried about the Drag Show Reading programs? /s"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "A European Starlink rival’s shares skyrocketed 390% in a week — here’s why",
            "external_url": "https://www.cnbc.com/2025/03/10/why-european-starlink-rival-eutelsat-shares-are-rocketing.html",
            "upvotes": 608,
            "date": "03/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108113207-1741601280278-gettyimages-2203401162-PORTUGAL_EUTELSAT.jpeg?v=1741601379&w=1920&h=1080",
            "top_comments": [
                "Let me guess without clicking the link. Because StarLink owner is a poop poop head nazi ?",
                "Premier of Ontario just canceled his provincial contract with F.elon’s 卐tarlink. \neutelsat should give him a call for a replacement deal. ",
                "While Starlink is very popular with Nazis, good news is the target market is relatively small. Lots of room just opened up for competition.",
                "Leon os suing companies for not advertising on xitter, now he’ll sue everyone for not using starlink",
                "Eutelsat is a much better product and satellite provider anyways...",
                "It would be great if they can supplant starlink. They could provide the same technology but not tied to a fascist. This would also mean that if things go terrible with America there will be an alternative to support the military needs of the EU.",
                "Ok guys, this is the one time no one will get after you for not reading the article. Because yes, it is exactly why you are thinking."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 3254,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "So glad we elected Trump to Make America Healthy Again",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "“We don’t need trees from Canada, we have National Parks”",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 9291,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "Well, it's better than having the rocket blow up.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back.",
                "Just to be clear, they aren’t “stuck” or “stranded” there is a return vehicle on the ISS, just their original one had issues. They also are doing work on the ISS, doing science and shit (literally)"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Israel to occupy Syrian southern territory for ‘unlimited time’, says minister | Syria",
            "external_url": "https://www.theguardian.com/world/2025/mar/12/israel-to-occupy-syrian-southern-territory-for-unlimited-time-says-minister",
            "upvotes": 251,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e4f6302824bc1c9f72d2eecba91d7b5858529f3/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=debc208a7e25cdd0d0e95622faeaa7bc",
            "top_comments": [
                "Israel's really planing to just take over the entire fucking Arabian Peninsula, aren't they? Same way the US wants to absorb Canada and Mexico, and Russia's planning to take all of Europe.",
                "So kind of like Nazis",
                "This is fucked up, and this is what Syrians were scared about in the sub for Syria. \n\nWhy does Israel think and act like they can do whatever they want ugh. \n\nThis is so frustrating.",
                "Maybe the EU can sanction Israel? This is bluntly a violation of a nations territorial sovereignty.",
                "This is why they pushed to remove Assad and destabilize the county. This will only continue until greater Israel is achieved. \n\nThe Jewish people and the world need to stand up to these Nazis that use antisemitism as a shield to continue this land grab.",
                "*All your deserts are belong to us!*\n\nIsrael has always wanted the biblical/antiquity Israel territory. That's the main pillar of the Zionism.\n\nImagine if all countries started using antiquity countries territories they claim inheriting from to define their own legitim territory today... Europe would be a mess.",
                "Trying to revive the Kingdom of Israel eh?",
                "next up ... kurdistan?",
                "\"When we declared a perpetual war on Israel, we meant one where we win :(  \"",
                "This is why we Arabs don't take seriously the Western liberal values. They don't care about things like human rights or international laws. It's because we know how much hypocritical they are and because we know they will always look the other way when their people and allies are violating them.\n\nYet they ask us to help with Ukraine when they need it and are astonished when we refused. It's always a one-way street with them. We have to do the right thing because it's right while they can wrong us all they want. Still, they will continue to support this apartheid against while asking us for compassion for them when they had none for us.\n\nWe don't care about any of that and we don't want them to lecture us on anything because we know they will mess us when they can and we don't want them to preach their values to us because we will never accept them. If they don't like, then that's their problem."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Britain’s oldest drag queen Maisie Trollette dies aged 91",
            "external_url": "https://www.bbc.com/news/articles/cm2yjnvjem3o",
            "upvotes": 478,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6d2b/live/3acc56d0-ff63-11ef-9c50-1fc1966647c9.png",
            "top_comments": [
                "I read that as “Bidens oldest drag queen”.  My eyes have never been that confusedly widened.",
                "You know, I don't understand why all this drama about drag queens. I have heard far worse stories about what the clergymen were doing to women and children especially the Catholic clergymen. People hear those stories on a daily basis yet drag queens get more attention than priests. I am not myself someone who believe that a man can become a woman or vice versa but still I don't get all the drama. Is life really that good in the West that they had to invent problems? I find that so entitled.",
                "I want to make a joke about another drag queen but i'll just say RIP.",
                "It seems to me that she lived her life like a feather boa in the wind.",
                "It's a sad day for the Drag community as a whole, but especially those who Trollette encouraged and supported over her career. RIP, Maisie.",
                "[removed]",
                "Honestly like any other wanna be or celebrety who da fuck cares , Kim who cares , Kanye who cares the diddler who cares let him rot in jail . Auge knight who cares he’s already in jail shit . They all want click baits and attention just the the big companies corporations no more dei no more deversity who wanna bet they won’t be a pride month this year ?",
                "Drag queens are just fancy clowns. Change my mind."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 4846,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "So like when they took a single racists lie and a picture of a black guy with a dead goose as undeniable proof that black people were eating cats and dogs enmasse.",
                "They didn't even cherry pick the studies, they used out of context information in the studies to justify their idiocy."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 5711,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "It's always the ones you most suspect. ",
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "This is the free space on the BINGO card",
                "Not a transperson. Not gay. Hmm",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\"",
                "Thanks for reminding me that it's Wednesday, I almost missed movie night.",
                "No shit? So, are we still worried about the Drag Show Reading programs? /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A European Starlink rival’s shares skyrocketed 390% in a week — here’s why",
            "external_url": "https://www.cnbc.com/2025/03/10/why-european-starlink-rival-eutelsat-shares-are-rocketing.html",
            "upvotes": 608,
            "date": "03/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108113207-1741601280278-gettyimages-2203401162-PORTUGAL_EUTELSAT.jpeg?v=1741601379&w=1920&h=1080",
            "top_comments": [
                "Let me guess without clicking the link. Because StarLink owner is a poop poop head nazi ?",
                "Premier of Ontario just canceled his provincial contract with F.elon’s 卐tarlink. \neutelsat should give him a call for a replacement deal. ",
                "While Starlink is very popular with Nazis, good news is the target market is relatively small. Lots of room just opened up for competition.",
                "Leon os suing companies for not advertising on xitter, now he’ll sue everyone for not using starlink",
                "Eutelsat is a much better product and satellite provider anyways...",
                "It would be great if they can supplant starlink. They could provide the same technology but not tied to a fascist. This would also mean that if things go terrible with America there will be an alternative to support the military needs of the EU.",
                "Ok guys, this is the one time no one will get after you for not reading the article. Because yes, it is exactly why you are thinking."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 4849,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "So like when they took a single racists lie and a picture of a black guy with a dead goose as undeniable proof that black people were eating cats and dogs enmasse.",
                "They didn't even cherry pick the studies, they used out of context information in the studies to justify their idiocy."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 3259,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "So glad we elected Trump to Make America Healthy Again",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "“We don’t need trees from Canada, we have National Parks”",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 9289,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "Well, it's better than having the rocket blow up.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "They’re not really stuck. They can come home at any time. \n\nThey’re part of the ISS crew and sending them home right now would leave the ISS undermanned. \n\nThey are waiting for the replacement crew members to get up there before they come back.",
                "Just to be clear, they aren’t “stuck” or “stranded” there is a return vehicle on the ISS, just their original one had issues. They also are doing work on the ISS, doing science and shit (literally)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Israel to occupy Syrian southern territory for ‘unlimited time’, says minister | Syria",
            "external_url": "https://www.theguardian.com/world/2025/mar/12/israel-to-occupy-syrian-southern-territory-for-unlimited-time-says-minister",
            "upvotes": 252,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e4f6302824bc1c9f72d2eecba91d7b5858529f3/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=debc208a7e25cdd0d0e95622faeaa7bc",
            "top_comments": [
                "Israel's really planing to just take over the entire fucking Arabian Peninsula, aren't they? Same way the US wants to absorb Canada and Mexico, and Russia's planning to take all of Europe.",
                "So kind of like Nazis",
                "This is fucked up, and this is what Syrians were scared about in the sub for Syria. \n\nWhy does Israel think and act like they can do whatever they want ugh. \n\nThis is so frustrating.",
                "Maybe the EU can sanction Israel? This is bluntly a violation of a nations territorial sovereignty.",
                "This is why they pushed to remove Assad and destabilize the county. This will only continue until greater Israel is achieved. \n\nThe Jewish people and the world need to stand up to these Nazis that use antisemitism as a shield to continue this land grab.",
                "*All your deserts are belong to us!*\n\nIsrael has always wanted the biblical/antiquity Israel territory. That's the main pillar of the Zionism.\n\nImagine if all countries started using antiquity countries territories they claim inheriting from to define their own legitim territory today... Europe would be a mess.",
                "Trying to revive the Kingdom of Israel eh?",
                "next up ... kurdistan?",
                "\"When we declared a perpetual war on Israel, we meant one where we win :(  \"",
                "This is why we Arabs don't take seriously the Western liberal values. They don't care about things like human rights or international laws. It's because we know how much hypocritical they are and because we know they will always look the other way when their people and allies are violating them.\n\nYet they ask us to help with Ukraine when they need it and are astonished when we refused. It's always a one-way street with them. We have to do the right thing because it's right while they can wrong us all they want. Still, they will continue to support this apartheid against while asking us for compassion for them when they had none for us.\n\nWe don't care about any of that and we don't want them to lecture us on anything because we know they will mess us when they can and we don't want them to preach their values to us because we will never accept them. If they don't like, then that's their problem."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 2145,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "Fascism, pure and simple",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Why did they send him to Louisiana?",
                "Can someone please tell me exactly what this guy has done?",
                "This is perhaps the most egregious First Amendment violation of many of our lifetimes.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Trump's regime and his supporters: Fuck the Constitution!",
                "Republicans will claim that non-Americans do not have human rights in America and the Republican Supreme Court will agree."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Britain’s oldest drag queen Maisie Trollette dies aged 91",
            "external_url": "https://www.bbc.com/news/articles/cm2yjnvjem3o",
            "upvotes": 472,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6d2b/live/3acc56d0-ff63-11ef-9c50-1fc1966647c9.png",
            "top_comments": [
                "I read that as “Bidens oldest drag queen”.  My eyes have never been that confusedly widened.",
                "You know, I don't understand why all this drama about drag queens. I have heard far worse stories about what the clergymen were doing to women and children especially the Catholic clergymen. People hear those stories on a daily basis yet drag queens get more attention than priests. I am not myself someone who believe that a man can become a woman or vice versa but still I don't get all the drama. Is life really that good in the West that they had to invent problems? I find that so entitled.",
                "I want to make a joke about another drag queen but i'll just say RIP.",
                "It seems to me that she lived her life like a feather boa in the wind.",
                "It's a sad day for the Drag community as a whole, but especially those who Trollette encouraged and supported over her career. RIP, Maisie.",
                "[removed]",
                "Honestly like any other wanna be or celebrety who da fuck cares , Kim who cares , Kanye who cares the diddler who cares let him rot in jail . Auge knight who cares he’s already in jail shit . They all want click baits and attention just the the big companies corporations no more dei no more deversity who wanna bet they won’t be a pride month this year ?",
                "Drag queens are just fancy clowns. Change my mind."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 5719,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "Getting harder and harder to hate the French ffs",
                "Clearly a baguette class submarine",
                "This is not nearly as big a deal as some people think.",
                "I hope it stays there until trump is out of office",
                "I love the French.\n\nMacron should request that the U.S. return the Statue of Liberty since \"they arent using it\" anymore."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 12637,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3",
                "Fuck the environment, fuck affordable healthcare, fuck vaccines, fuck FDA regulations for food handling! Being alive and healthy is woke liberal garbage! Let me breathe asbestos and eat lead and contract preventable diseases like our forefathers intended 😡"
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/13/2025 04:10:40 UTC"
}