{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. Marine in Okinawa indicted over rape, injury",
            "external_url": "https://english.kyodonews.net/news/2025/04/5413b1fdde94-us-marine-in-okinawa-indicted-over-rape-injury.html",
            "upvotes": 11423,
            "date": "05/01/2025",
            "thumbnail": "https://img.kyodonews.net/english/public/images/posts/1a71a3b6018cfd9dd803de89574f1b7e/cropped_image_l.jpg",
            "top_comments": [
                "Same old shit, different year. I remember arriving in Okinawa in 2004 right before bases went on lock down because some Air Force SSgt liked school girls.",
                "I visited Japan back in 2019 and my cousin, who was stationed there, couldn't hang out with me until the very last day of my trip because the base had gone in to lockdown over some rapes that transpired in Okinawa.",
                "Holy fuck shots\n\n\"We cannot help but have doubts regarding the education and management of U.S. military personnel. We strongly urge the implementation of more effective countermeasures,\" \n\nHoly fuck this guy is bonkers.\n\n\"According to the indictment, Wedington choked a female civilian worker in a base lavatory before sexually assaulting her against a stall door and then stomped on the face of the woman who tried to rescue her.\"",
                "Same old shit, different year, I remember being on Oki back in 2010 and left just before the bases got locked down and drinking secured because some reserve fly boys thought consent ended at the international date line.\n\nWalk down any strip near a base at 9pm and its embarassing how our servicemen present themselves. \n\nThe fact he has already been handed over to Japanese authorities sounds like SOFA is being waived and he is fuuuuuucked, he will likely be charged and serve time in the Japanese criminal justice system, then be handed back over to be charged again under the UCMJ.   \n  \nU.S. and Japanese legal systems are considered **separate sovereigns**, so prosecution by both does **not** violate double jeopardy laws.",
                "Does this happen more frequently in Okinawa compared to other international bases?",
                "Why is it always Marines? I'm sure Army, Navy... etc are guilty as well, but it really seems 90% of issues in Okinawa are from Marines.",
                "Fuck, man.  This shit again.  Was stationed in Japan from 08 - 14.  Towards the end of my time there, some sailors decided to rape and murder a local girl which sent the whole of Japan bases on lockdown and curfews.  This shit just keeps happening.  Fucking clowns.  To hell with this guy.",
                "Ah yes Okinawa marines and rape. Truly a combo",
                "So that place still the same since I was there in 2000. 7th Crime BN Csmp Hansen.",
                ">U.S. Ambassador to Japan **George Glass** said in a statement that he was \"disturbed\" by the allegations, \n\nHe went from being Jan Brady's [boyfriend](https://bradybunch.fandom.com/wiki/George_Glass) to US Ambassador to Japan.  Pretty impressive."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
            "external_url": "https://apnews.com/article/trump-npr-pbs-republicans-public-broadcasting-f0e3e1acb96986732a0211833165bf84",
            "upvotes": 1185,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Back in my day, the executive’s job was to *execute* the laws enacted by the legislature, not undermine them.",
                "Republicans have given up the legislative branch completely and are trying to help weaken the judicial as well. Pathetic. They are all worthless cunts.",
                "Congress approved this funding in the ‘60s. You can’t just EO that away. More performative nonsense from Dementia Don",
                "I was reading an article in CNN about this, in which it was cited that Republicans were complaining that PBS programs have a \"liberal\" bias.  What a crock of shit.  I'd been listening to PBS Newshour podcast for the past few months and it's been such a breath of fresh air.  It's nearly an hour and ad-free, so they can really delve into stories.  Their political coverage is especially good, and they always have conservatives on to give their perspective as well as liberals.",
                "The good news is apparently NPR gets about one percent of its budget from the feds. This will largely hurt public tv and radio in less affluent states.",
                "Hey Don-old, the money I don't spend on your shitty Made-in-China Trump crap is now going here.",
                "So basically this means gov censorship to things they don’t agree with. Let’s not pretend this is anything but that.",
                "Just another way to deprive people of education. We continue  to be the dumbest easily ruled nation.",
                "How did the Nazis feel about the BBC? They confiscated all the radios!",
                "I was taught in school that Congress approved the funding.  What are kids taught today?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 36477,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "I guess Alabama will now be literally full of shit.",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "To be extremely clear: \n\nThe program itself has nothing to do with DEI. The program itself has nothing to do with racism.\n\nThe program is simply because 1 in 3 people there have intestinal parasitic hookworms, due to an extremely unsafe lack of proper sanitation.\n\nThe REASON this area has zero infrastructure for good sanitation is because the federal government and the state of Alabama have been extremely racist for 150 years, since black people were allowed to own land. The only place they were allowed to buy land was an area which was very low and had soil which made it basically impossible to dig sanitation infrastructure. \n\nOn top of that, due to segregationist zoning laws and redlining, their parents and grandparents were prohibited from buying land elsewhere. \n\nNow, they cannot move because the land they live on is basically worthless - nobody would want to buy their property for a reasonable price - and they cannot climb out of poverty due to suppressed wages and higher medical bills - due to the lack of sanitation.\n\nCan't sell the land, can't get better wages, can't climb out of poverty. \n\nThis is true for all the people there, regardless of race.\n\nSo, to repeat myself: the *current program* has nothing to do with DEI and race. Everyone who lives there benefits from it.\n\nThis is  also a perfect example of Critical Race Theory - it's not about anyone *currently* being racist. It's just that centuries of racism created this situation, and we need to fix it. \n\nDonald Trump, and Republicans, want to get rid of it because *they* are racist, though.",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Jill Sobule, the singer-songwriter known for ‘I Kissed a Girl,’ has died in a fire",
            "external_url": "https://apnews.com/article/singer-jill-sobule-died-b4e86bd7f089df00da536ea9815bce03",
            "upvotes": 1208,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a little bit of an aside but I just want to spread the PSA:  \n\nHouse fires are dangerous as fuck.   You might only have minutes to get out.   I was with my mom when my parents' house burned half-way down (started by a battery).   From the moment the alarms went off to when we would have been fucked was about 6 minutes.  \n\nTake that shit seriously.",
                ">Sobule was known for taking control of her career by fundraising so she could make her next album. In 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album.\n\nNice. A take charge lady who kick-started before Kickstarter.",
                "That song meant a lot to so many, heartbreaking way to go. Rest easy, Jill.",
                "‘Cause I’m young, and I’m hip, and so beautiful! I’m gonna be a supermodel!\n \n😢",
                "Oh fuck. I remember she did some videos and livestreams with Kate Micucci and they were all wonderful, this is such a tragedy.",
                "I met her many years ago now, but I've never forgotten how nice she was. It was easily one of the warmest and most genuine celebrity interactions I've ever had.\n\nWhat a loss. May her memory be a blessing, especially under such awful circumstances.",
                "She wrote a song called Lucy at the gym about a young woman she used to see at the gym with anorexia. One day she just stopped seeing her there, and Jill decided she must of passed away because she was otherwise there every single day without fail.\n\n\"And when I get to heaven, they'll say come right in, ill show you round the gym...everyone here's beautiful and thin, and here there's no sin and your life can begin, Lucy at the gym\". \n\nRIP Jill.",
                "Listen to her song “Lucy at the Gym”….Truly so sad that such a spirit left this earth far too soon.",
                "Ughhh this year is terrible, with deaths but in general",
                "So Katy Perry's onslaught continues.  First that nun and now this woman.  How monstrous."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 49177,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "We winning yet? \n\nIdk why we are suprised. Republicans have always faught the 9/11 suvivors fund...",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 13530,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad.",
                "Waltz has left the group chat."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Justice Department sues Hawaii, Michigan over plans to sue fossil fuel companies for climate harm",
            "external_url": "https://apnews.com/article/trump-doj-climate-states-policy-lawsuits-a5228e1dd6348f09d2a70f460142531a",
            "upvotes": 3217,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article:\n\n> In court filings, the DOJ said the Clean Air Act — a federal law authorizing the Environmental Protection Agency to regulate air emissions — “creates a comprehensive program for regulating air pollution in the United States and “displaces” the ability of States to regulate greenhouse gas emissions beyond their borders.”\n\nDidn't the Trump administration make a big stink about how governmental agencies don't have the power to direct and lead policy decisions?",
                "I'm glad the government is standing up for the little guy.  Multi billion dollar corporations are people too, just unlike you and me.",
                "Small government, states rights, and all that jazz…",
                "You're gonna sue _us_? No. WE DOUBLE DOG SUE YOU!!1!",
                "It's all about states rights... until it isn't.",
                "So they're being prosecuted for pre-crime?",
                "Can you even sue someone for the sole reason that someone sues someone else??? Do you even have a standing?",
                "The justice department is going to have to prove to a judge what damages would be caused by another state suing fossil fuel companies.",
                "The trump regime and his republican sycophants HATE actual hard-working Americans.",
                "All the corporate cocks in Trump's and bondi's mouths, it's amazing they're still able to speak."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Education Department stops $1 billion in funding for school mental health",
            "external_url": "https://www.npr.org/2025/05/01/nx-s1-5382582/trump-school-mental-health",
            "upvotes": 6563,
            "date": "05/01/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F70%2Fb8e504e5426384e23dd10894cbb8%2Fgettyimages-2206185094.jpg",
            "top_comments": [
                "Interesting this drops on the same day the Supreme Court is expected to rule states are obligated to fund religious charter schools. We have to pay for religion with our tax dollars, but can't pay for mental health i suppose.",
                "They are literally writing entire books about how these kids are suffering from mental health issues. It's ok though remember this country doesn't have a gun problem it has a mental health problem.",
                "Conservatives say school shootings are a mental health problem and then do shit like this",
                "This is how you get school shootings. But at this point I think that's what this administration wants.",
                "Weren’t school shootings about mental health?",
                "\"It's not the guns! It's a mental health issue!\"\n\nProceeds to gut mental health support. \n\nFuck the GOP.",
                "Republicans have always been about short term thinking. \n\nTheir biggest concerns are how to make fast money and they dismiss climate change or investments into society. This is why they hate scientists, economists, analysts and historians. Anyone who isn’t helping them gain immediate wealth is trying to sabotage them. And that is why the current administration is operating under the republican golden rule:  \n\n“if we can’t monetize it then we will destroy it”. \n\nGreenland, Canada, Ukraine, Education, Healthcare, Social Security, EVs, Windmills, FEMA and National Parks. All things that should be invested into (or at least left alone) are viewed as enemies to America because “How can these things exist without huge personal profit?”  \n\nDe-investing Education, Mental Health and Kids is going to create the absolute worst society possible. And this is why putting these things in the hands of people who wont be here in a decade is so destructive. They aren’t looking at the future, they’re trying to cash in now.",
                "We are an evil country. There's no other way to say it that won't get me banned, lol",
                "Just our kids, folks.  You know, the future of our nation … \n\nCan’t think of a single, solitary, rational reason that investing money into the mental health of our children is a bad thing.",
                "The rate at which they are completely dismantling anything that helps american people is staggering.  Like, i would have thought it would be more difficult to do, but in 100 days, Trump has done more than a military strike against America would have done.  \n\nIt's all so strange, since he was so ineffective his first time as President.  But, I guess he was 'new' to it, and tried to surround himself with actual politicians at the time, rather than people who are yes-men or even worse than he is."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US small parcels loophole closes pushing up prices for Shein and Temu",
            "external_url": "https://www.bbc.com/news/articles/cwy79j2n7d4o",
            "upvotes": 201,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b752/live/b1b193d0-23f5-11f0-80b8-a98d7c7fd7fe.jpg",
            "top_comments": [
                "On one hand, Temu and Shien abused the FUCK out of this loophole and something had to be done.\n\nOn the other, wow do 200% tariffs and no exemption for small orders STING.",
                "It's not just Chinese high volume sellers, it's everything that comes from China, including anything that could be packaged under $800 worth, including parts for machines, generic drugs, small electronics like game consoles, shoes, clothing—all of that is now essentially 3x the price. The tariffs go up to 170% plus shipping is now going way up (takes longer to process), so basically 3X on the import price. Also any American manufacturer who is lucky enough to not import parts or raw ingredients, will also jack up their price, as why not make more money. So everything is going up, which will increase inflation and ultimately cause interest rates to climb (going down now because economy is slowing).",
                "if this kills 'fast fashion' industries who help pollute the planet with extra plastics, oil usage, and clothing thrown into landfills, then good.",
                "Not just for them. I know a lot of small businesses that use this loophole. \n\nEven larger businesses will do this:  \n\nLet’s say you want to test a product before you buy 20,000 of them to keep in your warehouse. Using small individual shipments is more expensive per unit, but less risky. \n\nThis won’t just drive up prices, it will slow down business growth because testing new products in your market just got more expensive. ",
                "Good. Let's put an end to this wasteful crap. ",
                "Is this the end of fast fashion and cheap stuff?",
                "title needs a comma at least",
                "Hopefully this helps mom and pop shops aka small biz !"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "Bay Area parent calls for baseball season to end after anti-Asian taunts",
            "external_url": "https://www.sfgate.com/bayarea/article/bay-area-parent-baseball-season-racism-20305307.php",
            "upvotes": 1112,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That’s pretty shitty.  \n\nWhen I played ball as a kid, our coach would have ate us alive for disgracing the game, shaming our school, and letting our community down.\n\nSounds like some real accountability problems with that team and its leadership.",
                "You gotta punish folks for this or else racists are gonna continue to behave this way. You have to hold coaches accountable too. Players involved in this kind of behavior need to be benched or kicked off the team.",
                "Unfortunate that his son had to go through this. But this once again proves that Asian racism is not taken as seriously.",
                "First off, absolutely unacceptable behavior. Having played baseball myself, I know our coach would have never let us get away with this. \n\nBut looking through the comments, it’s clear how disconnected many Redditors are from reality. The narrative that this is just “Trump white people being racist” doesn’t hold up when you consider that the school is only 12.9% white. It’s time to step outside the echo chamber and acknowledge that anti-Asian hate isn’t solely coming from the direction many of you just assume.\n\nIf we can't address the problem as it really is we can't and won't solve anything.",
                "No need to cancel the rest of the season, just bar that one team for the remainder.",
                "It's the pattern of Asian racism in these high school baseball games that's at issue, not just the one or two games mentioned in this article. But there's enough here to indicate a pattern.  This also aligns with the increasing Asian racism in California--perhaps associated with the trade war or a lot of the oft mentioned possible war with China--and the deportations of international students (many of whom are envied/disliked by American students)",
                "wtf is happening to the Bay Area",
                "The head coach is responsible for the culture of the team. He should be fired for allowing this behavior to go on. My son played Little League and had been on a team with a coach like this. It's a disgrace. We need to prioritize sportsmanship over winning games. If I had done this on my high school basketball team my coach and the principal would have kicked my ass.",
                "Sounds like the PVHS coach needs to be out of a job.",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "German Economist and 6-time best selling author Matthias Weik Explains the Decline of the German Auto Industry.",
            "external_url": "https://www.focus.de/finanzen/news/innovationskiller-buerokratie-der-langsame-absturz-der-deutschen-autobranche_5926efc4-1fe8-4a2a-ae09-2db3deb10215.html",
            "upvotes": 3,
            "date": "05/02/2025",
            "thumbnail": "https://quadro.burda-forward.de/ctf/1b12d386-73d5-476c-80c3-64142c875703.1e33b381-1d99-40c4-9c4b-e8a8a239b412.png?im=RegionOfInterestCrop%3D%281200%2C630%29%2CregionOfInterest%3D%28652%2C408%29&hash=2b43184526ad329b675b5f305765f416961cc764947d0ccc88b9c1da175ef635",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "RFK Jr plans placebo-trial testing for 'all new vaccines'",
            "external_url": "https://www.bbc.co.uk/news/articles/crkx3egk3ygo?fbclid=PAQ0xDSwKBlMBleHRuA2FlbQIxMQABpxz-vcbOrpXyUIHbPkD3JoXLspK0TLUXLuOcteBADjQhncwVIbIUdrNn0JIM_aem_7pfTbvCYLxHUeeNvWyACMQ",
            "upvotes": 2,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37c6/live/d61a2670-26a6-11f0-b505-55b7c1f611de.jpg",
            "top_comments": [
                "RFK is the mengele of the magas",
                "He’s an idiot. All this is going to do is show some AEs are psychosomatic."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Gaza humanitarian aid ship bombed by drones in waters off Malta",
            "external_url": "https://www.samsung-news.com/articles/2e7HFMnNUXGpKnGy28rAzQ-en-CA?section=breaking_news_push&action=news&tab=foryou&landing=news_detail&url=https%253A%252F%252Fwww.samsung-news.com%252Farticles%252F2e7HFMnNUXGpKnGy28rAzQ-en-CA%253Fsection%253Dbreaking_news_push&id=2e7HFMnNUXGpKnGy28rAzQ-en-CA&pub_id=theguardian.com&pub=The%20Guardian&pub_logo=https%253A%252F%252Fnews-image.samsung-news.com%252Flogo%252Fcustom%252FThe%252520Guardian%252FLayer_1.svg&theme_color=%2310285e&referrer=share-news&title=Gaza%20humanitarian%20aid%20ship%20bombed%20by%20drones%20in%20waters%20off%20Malta&rss_url=&img=https%3A%2F%2Fimage.samsung-news.com%2Fapi%2Fv1%2Fimage%2Fstatic%2Fw%3D700%2Ch%3D394%2Cface%3Dfalse%2Cstyle%3DLANDSCAPE%2Fhttps%3A%2F%2Fmedia.guim.co.uk%2Fc2689e3c3e3ad4ed58c8d44b84ab059334bd7a2e%2F0_120_1600_960%2F1600.jpg&pub_time=2025-05-02T11%3A27%3A31Z&ed=en_CA&section_type=&category_id=",
            "upvotes": 134,
            "date": "05/02/2025",
            "thumbnail": "https://www.samsung-news.com/assets/articles/default.jpg",
            "top_comments": [
                "Over 1000 nautical miles away - if you announce you’re trying to help the people they are genociding, they will travel around the world to try and kill you too.",
                "The Israelies bombed the USS Liberty in the 60s.\n\nYou read that right.  They bombed and strafed the living shit out of the AMERICAN (as in, their ALLY) ship.  Not a warship; an intelligence gathering ship (CIA) that was there to monitor what was going on during the 1967 war with Egypt et al.\n\n[https://en.wikipedia.org/wiki/USS\\_Liberty\\_incident](https://en.wikipedia.org/wiki/USS_Liberty_incident)",
                "They're doing genocide, this is nothing to them. I hope we all live to see these monsters get justice at the Hague.",
                "That's not supposed to happen",
                "It's all right, the US and Europe will defend Israel so they won't suffer consequences.",
                "The us gonna bend over for Israel 💀"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Irish data protection watchdog slaps TikTok with €530 million fine over data transfers to China",
            "external_url": "https://jrnl.ie/6693965",
            "upvotes": 69,
            "date": "05/02/2025",
            "thumbnail": "https://img2.thejournal.ie/article/6693965/river/?height=400&version=6694009",
            "top_comments": [
                "> The hefty penalty was over TikTok transferring EU users’ personal data to China, where the information could be “remotely accessed by staff” at the company’s global headquarters.\n\nWe're living in a time where massive amounts of user data are harvested, and there's solid evidence that hostile nations use that data to push their preferred candidates into power. And yet, people prioritise watching brain-dead content online in exchange for personal data.",
                "A leopard can’t change its spots. ",
                "China: oh no, anyways"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Justice Department lifts desegregation order in Plaquemines Parish",
            "external_url": "https://apnews.com/article/school-segregation-order-civil-rights-justice-department-7fc5e2e4ef8e9ad4a283f563c042ae7c",
            "upvotes": 97,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, after constantly screaming about being called Nazis, they want racially segregated schools? ",
                "Republicans are racist. End of story",
                "The very origin of the movement started by Jerry Falwell started with opposition to school integration. The other stuff like abortion and gays came about later - but clearly segregation was never lost as a topic of grievance that needed to be serviced by Trump.",
                "When the GOP was talking about taking us back to the days of America where they 'Recognized America', Segregation was on the short list of things to bring back.\n\nWhat ever happened to the small Government GOP? Seems they are trying to interfere into every aspect of our lives.  The Neo-Nazi regime of SecDef Hegseth, Stephen Miller, Elon Musk and other known Nazi-boys, proves America is now being run by the 4th REICH.",
                "\"It doesn't matter who we vote for!!! Republicans and Democrats are the same and will do the same policies except Democrats will use flowery words!\" -the smooth brained wing of the left during the 2024 election.\n\n\nAs a POC with a disability I'm so glad I won't be sent to \"genocide Joe's/Kamala's\" outsourced concentration camps or be denied access to businesses/services based on my race on their watch. Totally things that would be happening if Harris were president right now.",
                "I love how we are focusing on the needs of every American! Who would’ve know we really want segregation again. I knew that would bring the prices down for everything! /s",
                "\nIt’s only a matter of time until the obfuscates and apologists rush in here to tell us how this means nothing and it was just an old order being closed for administrative efficiency. But we all know that’s bullshit. \n\n\nThis specific action will likely have no direct consequences since it’s an old order that just was left open mistakenly. \n\nBut that’s  not what this was about. It’s about, yet again,  signaling to white supremacists and segregationists  that the administration stands with them."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US small parcels loophole closes pushing up prices for Shein and Temu",
            "external_url": "https://www.bbc.com/news/articles/cwy79j2n7d4o",
            "upvotes": 203,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b752/live/b1b193d0-23f5-11f0-80b8-a98d7c7fd7fe.jpg",
            "top_comments": [
                "On one hand, Temu and Shien abused the FUCK out of this loophole and something had to be done.\n\nOn the other, wow do 200% tariffs and no exemption for small orders STING.",
                "It's not just Chinese high volume sellers, it's everything that comes from China, including anything that could be packaged under $800 worth, including parts for machines, generic drugs, small electronics like game consoles, shoes, clothing—all of that is now essentially 3x the price. The tariffs go up to 170% plus shipping is now going way up (takes longer to process), so basically 3X on the import price. Also any American manufacturer who is lucky enough to not import parts or raw ingredients, will also jack up their price, as why not make more money. So everything is going up, which will increase inflation and ultimately cause interest rates to climb (going down now because economy is slowing).",
                "if this kills 'fast fashion' industries who help pollute the planet with extra plastics, oil usage, and clothing thrown into landfills, then good.",
                "Not just for them. I know a lot of small businesses that use this loophole. \n\nEven larger businesses will do this:  \n\nLet’s say you want to test a product before you buy 20,000 of them to keep in your warehouse. Using small individual shipments is more expensive per unit, but less risky. \n\nThis won’t just drive up prices, it will slow down business growth because testing new products in your market just got more expensive. ",
                "Good. Let's put an end to this wasteful crap. ",
                "Is this the end of fast fashion and cheap stuff?",
                "title needs a comma at least",
                "Hopefully this helps mom and pop shops aka small biz !"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Alleged leaders of child exploitation cult known as 764 arrested, charged | ‘Trippy’ and ‘War’ are accused of operating 764 Inferno, an invitation-only group for top members",
            "external_url": "https://www.cbc.ca/news/fifthestate/764-alleged-leaders-arrested-charged-1.7524177",
            "upvotes": 42,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7524278.1746136529!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/764-propaganda.jpg?im=Resize%3D620",
            "top_comments": [
                "Some details:\n\n>Two men have been arrested and charged with running an international child exploitation enterprise known as 764 which targets vulnerable minors online and coerces them to self-harm, make child sexual abuse material of themselves and participate in violent acts — including animal abuse and even suicide.\n>\n>Prasan Nepal, 20, who police say used the moniker \"Trippy\" in the 764 network, was arrested in North Carolina. Leonidas Varagiannis, a 21-year-old U.S. citizen, known as \"War\" was arrested in Greece, according to police. \n>\n>They allegedly led a core subgroup called 764 Inferno that operated using encrypted messaging platforms. Police say the men exploited at least eight minors, some as young as 13 years old.\n>\n>\"The information in the criminal complaint is sickening,\" said an online investigator named Becca who tracks 764 and shares what she learns with law enforcement. For her safety, we are only using her first name. \n>\n>...\n>\n>According to an affidavit and criminal complaint unsealed Wednesday in the United States District Court for the District of Columbia, Nepal had been involved in 764 since its inception in 2020. He emerged as its leader in August 2021 after the founder, Bradley Cadenhead, was arrested by the FBI. \n>\n>Cadenhead created 764 in 2020 at the age of 15 and named the group after his area code in Stephenville, Texas. He is serving an 80-year sentence for pleading guilty to possession with intent to promote child pornography in 2023.\n>\n>Varagiannis is believed to have joined in December 2023 and became a co-leader of 764 Inferno, which was reserved solely for the inner core members of 764 and was by invitation only.\n>\n>Nepal and Varagiannis had strict rules for joining 764, according to police. Potential members had to produce and share content that often included child sexual abuse material and images of victims self harming.  \n>\n>\"These defendants are accused of orchestrating one of the most heinous online child exploitation enterprises we have ever encountered,\" said U.S. Attorney General Pamela Bondi in a media release Wednesday.\n>\n>Nepal and Varagiannis, along with two others, allegedly created a guide that gave prospective members instructions on how to create \"content\" by targeting vulnerable \"e-girls,\" who struggled with mental illness.\n>\n>...\n>\n>The group also poses an escalating threat worldwide as it forges alliances with other violent online groups that promote mass killings and targeted attacks. \n>\n>Other violent acts have been linked to 764, including a school shooting earlier this year in Nashville, stabbings last fall in Sweden and the murder of an elderly woman in Romania in 2022. \n>\n>Police have also foiled deadly plots tied to the groups in the U.K. and the United States in recent months. In Italy, police arrested a member last month who they say was in the advanced stages of a plan to kill vulnerable people.\n\nIf these allegations prove true, then these are some truly despicable acts perpetrated by some heinous people."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione attorneys seek dismissal of state murder case",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-attorneys-seek-dismissal-state-murder-case/story?id=121378320",
            "upvotes": 95,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/144b029e-81d8-497c-9744-c073bc724a3c/luigi-mangione-ap-jef-250424_1745516598762_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "I can’t understand how this case lands in a federal court.  Maybe the terrorism charges?  (Which really, I don’t see this meeting the definition of terrorism … premeditated murder? Sure, fair charges). \n\nAnyway, not a jurisdiction expert by any means, but it seems to me if the crime is alleged to have happened in NYC, subject to that criminal laws if the state of NY, and those laws satisfy the rights of the victim and accused for a fair trial, then why exactly is this even an issue? (Seriously, would love an attorney to make it make sense)",
                "Seek dismissal of state charges due to federal charges \n\n\nSeek dismissal of federal charges due to state charges\n\n\n???\n\n\nProfit "
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
            "external_url": "https://apnews.com/article/trump-npr-pbs-republicans-public-broadcasting-f0e3e1acb96986732a0211833165bf84",
            "upvotes": 1192,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Back in my day, the executive’s job was to *execute* the laws enacted by the legislature, not undermine them.",
                "Republicans have given up the legislative branch completely and are trying to help weaken the judicial as well. Pathetic. They are all worthless cunts.",
                "Congress approved this funding in the ‘60s. You can’t just EO that away. More performative nonsense from Dementia Don",
                "I was reading an article in CNN about this, in which it was cited that Republicans were complaining that PBS programs have a \"liberal\" bias.  What a crock of shit.  I'd been listening to PBS Newshour podcast for the past few months and it's been such a breath of fresh air.  It's nearly an hour and ad-free, so they can really delve into stories.  Their political coverage is especially good, and they always have conservatives on to give their perspective as well as liberals.",
                "The good news is apparently NPR gets about one percent of its budget from the feds. This will largely hurt public tv and radio in less affluent states.",
                "Hey Don-old, the money I don't spend on your shitty Made-in-China Trump crap is now going here.",
                "So basically this means gov censorship to things they don’t agree with. Let’s not pretend this is anything but that.",
                "Just another way to deprive people of education. We continue  to be the dumbest easily ruled nation.",
                "How did the Nazis feel about the BBC? They confiscated all the radios!",
                "I was taught in school that Congress approved the funding.  What are kids taught today?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Marshall man whose student visa was revoked remains detained",
            "external_url": "https://www.mprnews.org/story/2025/05/02/marshall-man-whose-student-visa-was-revoked-remains-detained",
            "upvotes": 99,
            "date": "05/02/2025",
            "thumbnail": "https://img.apmcdn.org/8f38bffd0f03498506afec1d413d5da0dbed70ce/widescreen/0a37c6-20250414-a-baby-reads-a-book-2000.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US small parcels loophole closes pushing up prices for Shein and Temu",
            "external_url": "https://www.bbc.com/news/articles/cwy79j2n7d4o",
            "upvotes": 202,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b752/live/b1b193d0-23f5-11f0-80b8-a98d7c7fd7fe.jpg",
            "top_comments": [
                "On one hand, Temu and Shien abused the FUCK out of this loophole and something had to be done.\n\nOn the other, wow do 200% tariffs and no exemption for small orders STING.",
                "It's not just Chinese high volume sellers, it's everything that comes from China, including anything that could be packaged under $800 worth, including parts for machines, generic drugs, small electronics like game consoles, shoes, clothing—all of that is now essentially 3x the price. The tariffs go up to 170% plus shipping is now going way up (takes longer to process), so basically 3X on the import price. Also any American manufacturer who is lucky enough to not import parts or raw ingredients, will also jack up their price, as why not make more money. So everything is going up, which will increase inflation and ultimately cause interest rates to climb (going down now because economy is slowing).",
                "if this kills 'fast fashion' industries who help pollute the planet with extra plastics, oil usage, and clothing thrown into landfills, then good.",
                "Not just for them. I know a lot of small businesses that use this loophole. \n\nEven larger businesses will do this:  \n\nLet’s say you want to test a product before you buy 20,000 of them to keep in your warehouse. Using small individual shipments is more expensive per unit, but less risky. \n\nThis won’t just drive up prices, it will slow down business growth because testing new products in your market just got more expensive. ",
                "Good. Let's put an end to this wasteful crap. ",
                "Is this the end of fast fashion and cheap stuff?",
                "title needs a comma at least",
                "Hopefully this helps mom and pop shops aka small biz !"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
            "external_url": "https://apnews.com/article/trump-npr-pbs-republicans-public-broadcasting-f0e3e1acb96986732a0211833165bf84",
            "upvotes": 1189,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Back in my day, the executive’s job was to *execute* the laws enacted by the legislature, not undermine them.",
                "Republicans have given up the legislative branch completely and are trying to help weaken the judicial as well. Pathetic. They are all worthless cunts.",
                "Congress approved this funding in the ‘60s. You can’t just EO that away. More performative nonsense from Dementia Don",
                "I was reading an article in CNN about this, in which it was cited that Republicans were complaining that PBS programs have a \"liberal\" bias.  What a crock of shit.  I'd been listening to PBS Newshour podcast for the past few months and it's been such a breath of fresh air.  It's nearly an hour and ad-free, so they can really delve into stories.  Their political coverage is especially good, and they always have conservatives on to give their perspective as well as liberals.",
                "The good news is apparently NPR gets about one percent of its budget from the feds. This will largely hurt public tv and radio in less affluent states.",
                "Hey Don-old, the money I don't spend on your shitty Made-in-China Trump crap is now going here.",
                "So basically this means gov censorship to things they don’t agree with. Let’s not pretend this is anything but that.",
                "Just another way to deprive people of education. We continue  to be the dumbest easily ruled nation.",
                "How did the Nazis feel about the BBC? They confiscated all the radios!",
                "I was taught in school that Congress approved the funding.  What are kids taught today?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Mexico City bans violent bullfighting in bid to keep the tradition, but without the bloodshed",
            "external_url": "https://www.cbsnews.com/news/mexico-city-ban-violent-bullfighting-back-bloodless-bullfights/",
            "upvotes": 261,
            "date": "05/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/19/62236213-f328-4178-934f-d34ff11c463f/thumbnail/1200x630/3b44483feea07dbbe00ecca20daba708/mexico-bullfighting-1406776071.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "The moment I see a bullfighter with one of the spears, I start rooting for the bull.",
                "Most English speakers probably don't know that matador just means \"killer\" in Spanish.",
                "Good, fuck bullfighting so much. Old as tradition that serves only the most brain rotted motherfuckers. I always hate how my uncles used to watch that shit and change my cartoons for this sad excuse of pathetic group of men.",
                "why not equip the bull with a velcro suit, then stick them with tennis balls",
                "Good. It's absolutely sickening.",
                "Aren’t the bull fights in Spain ‘bloodless’v",
                "They'll be switching to Nerf weapons  and teaching the bulls to play dead.",
                "Thounsands of citizens, hundreds of TV reporters death.... .but the important is bullfighting.\nOk",
                "What are they supposed to use, harsh language?",
                "Next on the list:\n\n\n- Banning punching, keeping boxing. \n- Banning cars, keeping Formula 1."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Jill Sobule, the singer-songwriter known for ‘I Kissed a Girl,’ has died in a fire",
            "external_url": "https://apnews.com/article/singer-jill-sobule-died-b4e86bd7f089df00da536ea9815bce03",
            "upvotes": 1210,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a little bit of an aside but I just want to spread the PSA:  \n\nHouse fires are dangerous as fuck.   You might only have minutes to get out.   I was with my mom when my parents' house burned half-way down (started by a battery).   From the moment the alarms went off to when we would have been fucked was about 6 minutes.  \n\nTake that shit seriously.",
                ">Sobule was known for taking control of her career by fundraising so she could make her next album. In 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album.\n\nNice. A take charge lady who kick-started before Kickstarter.",
                "That song meant a lot to so many, heartbreaking way to go. Rest easy, Jill.",
                "‘Cause I’m young, and I’m hip, and so beautiful! I’m gonna be a supermodel!\n \n😢",
                "Oh fuck. I remember she did some videos and livestreams with Kate Micucci and they were all wonderful, this is such a tragedy.",
                "I met her many years ago now, but I've never forgotten how nice she was. It was easily one of the warmest and most genuine celebrity interactions I've ever had.\n\nWhat a loss. May her memory be a blessing, especially under such awful circumstances.",
                "She wrote a song called Lucy at the gym about a young woman she used to see at the gym with anorexia. One day she just stopped seeing her there, and Jill decided she must of passed away because she was otherwise there every single day without fail.\n\n\"And when I get to heaven, they'll say come right in, ill show you round the gym...everyone here's beautiful and thin, and here there's no sin and your life can begin, Lucy at the gym\". \n\nRIP Jill.",
                "Listen to her song “Lucy at the Gym”….Truly so sad that such a spirit left this earth far too soon.",
                "Ughhh this year is terrible, with deaths but in general",
                "So Katy Perry's onslaught continues.  First that nun and now this woman.  How monstrous."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Bay Area parent calls for baseball season to end after anti-Asian taunts",
            "external_url": "https://www.sfgate.com/bayarea/article/bay-area-parent-baseball-season-racism-20305307.php",
            "upvotes": 1117,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That’s pretty shitty.  \n\nWhen I played ball as a kid, our coach would have ate us alive for disgracing the game, shaming our school, and letting our community down.\n\nSounds like some real accountability problems with that team and its leadership.",
                "You gotta punish folks for this or else racists are gonna continue to behave this way. You have to hold coaches accountable too. Players involved in this kind of behavior need to be benched or kicked off the team.",
                "Unfortunate that his son had to go through this. But this once again proves that Asian racism is not taken as seriously.",
                "First off, absolutely unacceptable behavior. Having played baseball myself, I know our coach would have never let us get away with this. \n\nBut looking through the comments, it’s clear how disconnected many Redditors are from reality. The narrative that this is just “Trump white people being racist” doesn’t hold up when you consider that the school is only 12.9% white. It’s time to step outside the echo chamber and acknowledge that anti-Asian hate isn’t solely coming from the direction many of you just assume.\n\nIf we can't address the problem as it really is we can't and won't solve anything.",
                "No need to cancel the rest of the season, just bar that one team for the remainder.",
                "It's the pattern of Asian racism in these high school baseball games that's at issue, not just the one or two games mentioned in this article. But there's enough here to indicate a pattern.  This also aligns with the increasing Asian racism in California--perhaps associated with the trade war or a lot of the oft mentioned possible war with China--and the deportations of international students (many of whom are envied/disliked by American students)",
                "wtf is happening to the Bay Area",
                "The head coach is responsible for the culture of the team. He should be fired for allowing this behavior to go on. My son played Little League and had been on a team with a coach like this. It's a disgrace. We need to prioritize sportsmanship over winning games. If I had done this on my high school basketball team my coach and the principal would have kicked my ass.",
                "Sounds like the PVHS coach needs to be out of a job.",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. Marine in Okinawa indicted over rape, injury",
            "external_url": "https://english.kyodonews.net/news/2025/04/5413b1fdde94-us-marine-in-okinawa-indicted-over-rape-injury.html",
            "upvotes": 11420,
            "date": "05/01/2025",
            "thumbnail": "https://img.kyodonews.net/english/public/images/posts/1a71a3b6018cfd9dd803de89574f1b7e/cropped_image_l.jpg",
            "top_comments": [
                "Same old shit, different year. I remember arriving in Okinawa in 2004 right before bases went on lock down because some Air Force SSgt liked school girls.",
                "I visited Japan back in 2019 and my cousin, who was stationed there, couldn't hang out with me until the very last day of my trip because the base had gone in to lockdown over some rapes that transpired in Okinawa.",
                "Holy fuck shots\n\n\"We cannot help but have doubts regarding the education and management of U.S. military personnel. We strongly urge the implementation of more effective countermeasures,\" \n\nHoly fuck this guy is bonkers.\n\n\"According to the indictment, Wedington choked a female civilian worker in a base lavatory before sexually assaulting her against a stall door and then stomped on the face of the woman who tried to rescue her.\"",
                "Same old shit, different year, I remember being on Oki back in 2010 and left just before the bases got locked down and drinking secured because some reserve fly boys thought consent ended at the international date line.\n\nWalk down any strip near a base at 9pm and its embarassing how our servicemen present themselves. \n\nThe fact he has already been handed over to Japanese authorities sounds like SOFA is being waived and he is fuuuuuucked, he will likely be charged and serve time in the Japanese criminal justice system, then be handed back over to be charged again under the UCMJ.   \n  \nU.S. and Japanese legal systems are considered **separate sovereigns**, so prosecution by both does **not** violate double jeopardy laws.",
                "Does this happen more frequently in Okinawa compared to other international bases?",
                "Why is it always Marines? I'm sure Army, Navy... etc are guilty as well, but it really seems 90% of issues in Okinawa are from Marines.",
                "Fuck, man.  This shit again.  Was stationed in Japan from 08 - 14.  Towards the end of my time there, some sailors decided to rape and murder a local girl which sent the whole of Japan bases on lockdown and curfews.  This shit just keeps happening.  Fucking clowns.  To hell with this guy.",
                "Ah yes Okinawa marines and rape. Truly a combo",
                "So that place still the same since I was there in 2000. 7th Crime BN Csmp Hansen.",
                ">U.S. Ambassador to Japan **George Glass** said in a statement that he was \"disturbed\" by the allegations, \n\nHe went from being Jan Brady's [boyfriend](https://bradybunch.fandom.com/wiki/George_Glass) to US Ambassador to Japan.  Pretty impressive."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "RISING",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 36467,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "I guess Alabama will now be literally full of shit.",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "To be extremely clear: \n\nThe program itself has nothing to do with DEI. The program itself has nothing to do with racism.\n\nThe program is simply because 1 in 3 people there have intestinal parasitic hookworms, due to an extremely unsafe lack of proper sanitation.\n\nThe REASON this area has zero infrastructure for good sanitation is because the federal government and the state of Alabama have been extremely racist for 150 years, since black people were allowed to own land. The only place they were allowed to buy land was an area which was very low and had soil which made it basically impossible to dig sanitation infrastructure. \n\nOn top of that, due to segregationist zoning laws and redlining, their parents and grandparents were prohibited from buying land elsewhere. \n\nNow, they cannot move because the land they live on is basically worthless - nobody would want to buy their property for a reasonable price - and they cannot climb out of poverty due to suppressed wages and higher medical bills - due to the lack of sanitation.\n\nCan't sell the land, can't get better wages, can't climb out of poverty. \n\nThis is true for all the people there, regardless of race.\n\nSo, to repeat myself: the *current program* has nothing to do with DEI and race. Everyone who lives there benefits from it.\n\nThis is  also a perfect example of Critical Race Theory - it's not about anyone *currently* being racist. It's just that centuries of racism created this situation, and we need to fix it. \n\nDonald Trump, and Republicans, want to get rid of it because *they* are racist, though.",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 49173,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "We winning yet? \n\nIdk why we are suprised. Republicans have always faught the 9/11 suvivors fund...",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 13534,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad.",
                "Waltz has left the group chat."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Justice Department sues Hawaii, Michigan over plans to sue fossil fuel companies for climate harm",
            "external_url": "https://apnews.com/article/trump-doj-climate-states-policy-lawsuits-a5228e1dd6348f09d2a70f460142531a",
            "upvotes": 3229,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article:\n\n> In court filings, the DOJ said the Clean Air Act — a federal law authorizing the Environmental Protection Agency to regulate air emissions — “creates a comprehensive program for regulating air pollution in the United States and “displaces” the ability of States to regulate greenhouse gas emissions beyond their borders.”\n\nDidn't the Trump administration make a big stink about how governmental agencies don't have the power to direct and lead policy decisions?",
                "I'm glad the government is standing up for the little guy.  Multi billion dollar corporations are people too, just unlike you and me.",
                "Small government, states rights, and all that jazz…",
                "You're gonna sue _us_? No. WE DOUBLE DOG SUE YOU!!1!",
                "It's all about states rights... until it isn't.",
                "So they're being prosecuted for pre-crime?",
                "Can you even sue someone for the sole reason that someone sues someone else??? Do you even have a standing?",
                "The justice department is going to have to prove to a judge what damages would be caused by another state suing fossil fuel companies.",
                "The trump regime and his republican sycophants HATE actual hard-working Americans.",
                "All the corporate cocks in Trump's and bondi's mouths, it's amazing they're still able to speak."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "05/02/2025 12:16:02 UTC"
}