{
    "posts": [
        {
            "category": "HOT",
            "title": "Man stripped naked, beaten with poles after calling people 'N-word' in Mississippi bar, police say",
            "external_url": "https://www.fox13memphis.com/news/man-attacked-after-walking-into-mississippi-bar-and-using-racial-slur-police-say/article_33d95bce-f26a-4284-85d4-161c04c692a8.html?utm_campaign=snd-autopilot&fbclid=IwY2xjawKbzQtleHRuA2FlbQIxMQABHvZDhMKZjBMcUdIzDoKKIclyx7RUgukMSyomx_2paZi3IdLCJ9fOQZoFhPYd_aem_Ftnn7PYHVPKasVie-X8-Yg",
            "upvotes": 16398,
            "date": "05/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/fox13memphis.com/content/tncms/custom/image/586ecdee-7801-11ed-8535-17dbee2a28ca.png?resize=600%2C315",
            "top_comments": [
                "As a Pole I'm just glad we could be of service",
                "A man walks into a bar looking for a fight, people are shocked when he gets what he wants. /s",
                "> Davis said he doesn't believe the club to be a problem spot. \n\nThere's no one of that name identified in the article, but previous quotes were attributed to a Miles Stone.  \nDid the author refer to Miles Stone as Davis?  [Miles Davis?](https://en.wikipedia.org/wiki/Miles_Davis)",
                "There has to be an easier way to get invited to the White House.",
                "This sounds like a Boondocks episode. Wtf did he think was going to happen?",
                "Incoming GoFundMe for this moron",
                "Was he playing Simon says with Hans Gruber’s brother or something?",
                "Most people: “Fantastic!”\n\nCops: “Ermm, looks like a hate crime…against the racist.”",
                "Lol I want to do business in that town. 30 calls to the place, no liquor or business license, and they still haven't been shut down. Looks like someone bought a house and just decided to run a bar out of it. That's freedom. That's America.",
                "This just in: Actions have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Multiple people dead after small plane crashes into San Diego neighborhood",
            "external_url": "https://www.nbcnews.com/news/us-news/small-plane-crashes-san-diego-neighborhood-rcna208465",
            "upvotes": 3013,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250522-san-diego-plane-crash-mn-1050-3cf78d.jpg",
            "top_comments": [
                "Cessna 550 is debatable as being a small plane, more like a private jet.",
                "Sad for those who lost their lives. Rest in peace. Hopefully others will be okay.",
                "I live in San Diego and deliver Uber-eats as a side hustle, and I've delivered in that area numerous times. It is quite large and has a school and community center. Good honest, navy folks. I heard nobody on the ground was killed.  ❤️ 💙",
                "Truly tragic and feel for the families involved. Hope the transportation secretary is on top of this.",
                "And people want flying cars",
                "Why is the neighborhood name/military housing complex not mentioned by name, I wonder?",
                "God damn it seems like there have been a lot of plane crashes this year.",
                "This may have been avoided if the pilot and copilot had practiced the Feilder method.",
                "Anyone watching Nathan Fielders Rehearsal?",
                "Sad to see. Seems like this private jet crashed into a neighborhood, but everyone who died was already on the plane. It seems like from what we know right now that no one in the neighborhood died from this, which is a small solace from this tragedy.\n\nIt feels like this is happening more often in recent months, though maybe the media is raising more awareness of these kinds of incidents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Person shot outside CIA headquarters by security guards",
            "external_url": "https://www.cnbc.com/2025/05/22/cia-shooting-headquarters.html",
            "upvotes": 2225,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108149325-1747919164608-AP22267585432357.jpg?v=1747919221&w=1920&h=1080",
            "top_comments": [
                "I accidentally made a wrong turn there by mistake once , they surrounded my car with their hands on their guns, had me roll down all my windows and then interrogated me before letting me go, they weren’t very friendly at first but were nice enough to give me directions once they determined I wasn’t a security threat just an idiot",
                "CIA main gate is a magnet for the mentally ill unfortunately. This headline could be copy and pasted every three or four months.",
                "Everyone knows that you can't break into Langley unless you're Ethan Hunt",
                "Guards at CIA headquarters opened fire on an individual early Thursday morning in what the agency called a “security incident,” a person familiar with the matter told NBC News’ Andrea Mitchell.\n\nThe non-fatal shooting on CIA property in Langley, Virginia, occurred hours after officials said two Israeli Embassy staff members, Yaron Lischinsky and Sarah Milgrim, were shot and killed outside D.C.’s Capital Jewish Museum.\n\n**There is no evidence that the two incidents are linked.** The CIA did not immediately respond to CNBC’s request for additional information.",
                "Not surprising. There's a guy there called Stan Smith that crashes his SUV into the flagpole daily. They're on edge.",
                "\"Well,  uhm... there was a snag. This analyst, Cox, was attacking the gym guy. Uhm, it was in broad daylight, on the street, our man uh did not know what to do, felt he had to step in... he uhm... he shot the analyst, he shot Cox.\"",
                "$5 million to his family, pronto",
                "Omg, thats Jason Bourne.",
                "Don’t worry this person will be paid $5 million in a couple of months.",
                "Who needs to break into the CIA?  \n\nAll the information you need is on Signal.  Just hop on group chat, you will get information that only top officials are privy to."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "St. Louis tornado sirens didn't sound in deadly storm. Now a city commissioner has been placed on leave.",
            "external_url": "https://www.cbsnews.com/news/st-louis-tornado-sirens-emergency-management-commissioner-leave/",
            "upvotes": 1225,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/13918c6e-6382-4d4e-b33e-17a61d727be2/thumbnail/1200x630/1331215528447082c245240dabfd7a02/ap25136823869443.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                ">However, even if someone had pressed the button at the Fire Department, city officials learned Tuesday that the button was not working. \n\n>\"Work to repair the button began Tuesday afternoon and is expected to be completed within days,\" Spencer's office said. \n\nTheir tornado button is broken. This story feels surreal.",
                "A city with 60 sirens and not one sounded. That’s not just a mistake, that’s systemic failure.",
                "I live close to an area that has an emergency siren like this, but I’m not too familiar as I am new to this area. Does anyone know if you can connect your phones to the sirens so when they go off your phone gets an alert? Is this a thing?",
                "This is so bizarre. I lived in a small town close to St Louis, and I swear they tested the tornado sirens once a week.",
                "*Sarah Russell, commissioner of the City Emergency Management Agency in St. Louis, will remain on paid administrative leave as an external investigation proceeds into what went wrong.*  \n\n\n*Until a permanent replacement for Russell is found, St. Louis fire captain John Walk will serve as the interim emergency management commissioner.*\n\n\n\nI’ll be interested to see the conclusions of the external investigation. I wonder what they’ll determine.",
                "Weather ballon’s are important in helping to predict weather conditions. \n\nhttps://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts",
                "We blow ours on the first Wednesday of every month at noon whether we want to or not",
                "Last Month, no sirens were heard when an F1 touched down in a neighbouring town to me.\n\nThis Monday, no sirens were audible, nor was a Tornado warning issued, in suburban Nebraska areas.\n\nThis administration is going to get people killed, and I'm of the opinion they want that to happen.\n\nEDIT: I understand the issue in St Louis was because the alarms aren't working, but I'm also confident that warning systems working improperly is a widespread issue right now and that the departments that should be fixing it are under turmoil due to this administrations current choices",
                "At this point you gotta just have YouTube open with Ryan Hall or Max live-streaming your warnings these days.",
                "I had a tornado occur in DFW, TX with no siren. My dog woke up. Pretty wild to think about really."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge finds police acted reasonably in shooting New Mexico man while at wrong address",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-finds-police-acted-reasonably-shooting-new-mexico-man-wrong-addr-rcna208157",
            "upvotes": 5935,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Farmington-police-shooting-RS-791813.jpg",
            "top_comments": [
                "Isn't that amazing? They can start a conflict, and when someone has a natural reaction to said conflict and exercises their supposed 2nd Amendment right, you can legally be killed.",
                "Cops can\n\n\n1) kill if they feel threatened.  \n2) lie as much as they want.  \n3) break laws that would land you in jail.  \n4) just sit there while you're being killed because they have no obligation to actually help anyone.",
                "If the police can legally kill you for reasonably exercising a right then you don't have that right.",
                "This stuff is so weird being on the outside looking in.\n\nLike, so much American insistence of having firearms to defend yourself and your property, but like then this shit happens all the time where the cops shoot the wrong person just cause they had a firearm to defend themselves because no one will know if the person bashing on their door in the middle of night screaming police is actually police or if its intruders. \n\nLike what is the play here as a citizen.",
                "The 2nd amendment is equal for all Americans, except some Americans are more equal than others…",
                "So, you \\*don't\\* actually have a right to defend your own home, or even have a gun in your hand, if it happens to be incompetent cops trying to break in.\n\nReally seems like the only sane response is to act like cops - shoot first and ask questions never. At least that might make them hesitate.",
                "They don't value life at all",
                "The judge is district court Judge Matthew Garcia.",
                "If the situation had ended differently and the homeowner killed the police and then called 911, would the homeowner have 'acted responsibly'?",
                "When police fuck up, you know, doing the police work, it should be an automatic disqualification of qualified immunity. They want legal protections for doing the job? Don't. Fuck. Up. The. Job. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "2 shot, 1 fatally, in Washington DC; Israeli embassy staffer believed to be among victims: police",
            "external_url": "https://abc7.com/post/2-shot-1-fatally-outside-capital-jewish-museum-washington-dc-israeli-embassy-staff-among-victims-police-say/16500500/",
            "upvotes": 11882,
            "date": "05/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16503737_052225-wpvi-dc-shooting-img.jpg?w=1600",
            "top_comments": [
                "Two embassy staffers are dead. A man and a woman. Shooter apprehended.\n\nhttps://www.cnn.com/2025/05/21/politics/individuals-connected-to-israeli-embassy-shot-in-dc-sources-says",
                "This is gonna be a world class shitshow.",
                "[\"Suspect chanted 'Free-Free Palestine' while in custody.\" ](https://www.youtube.com/live/nGVVRy0vimE?t=1113s) - Seems like a political motive is confirmed.",
                "Suspect identified as Elias Rodrigues from Chicago IL.",
                "Ahh shit this won’t be good",
                "Still not locked after 4 hours. I'm impressed. Usually topics of this nature get locked almost immediately.",
                "[removed]",
                "It would be nice if just one day this year could not be a shit show",
                "regardless of the debate of judaism vs zionism, this is going escalate things in a nerve wracking way.\n\nand with palestine as well as other things trump is doing, this is gonna be an interesting summer.",
                "The male victim, Yaron, was a classmate of mine. May his memory be a blessing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 9581,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "Always wear your seatbelt",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "In separate crashes, what are the odds of that? Poor kid.",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "That stretch of LA 67 has a long history of high‑severity crashes—especially in low‑light or early‑morning conditions. In 2022 they found that 47 crashes happened over just three years at the LA 67/72nd Avenue intersection—roughly 16 crashes per year. [Source](https://movebr.brla.gov/assets/documents/final-plans/Plank-Road%20-Design-Study%20-Report_02-28-2022-web.pdf?utm_source=chatgpt.com)",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Divided Supreme Court Rejects Bid for Religious Charter School in Oklahoma",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/supreme-court-religious-charter-school-oklahoma.html?unlocked_article_code=1.JE8.vgNC.2rORn3aeSqNA&smid=nytcore-android-share",
            "upvotes": 369,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "4-4 split decision. Amy Coney Barrett recused herself.",
                "Divided over whether tax-payers should help pay for a religious school.  \n\nLet that sink in.",
                "\"The Supreme Court on Thursday effectively ended a publicly funded Catholic charter school in Oklahoma, dividing 4-4\"\n\nFuck me, that's way too close. This should've been a unanimous vote, not this horseshit. This was going to be a clear violation of the separation of church and state, the government clearly endorsing a specific religion.",
                "Disappointing that it was an even split, but thank goodness it was rejected.",
                "I'll take whatever win comes at this point.",
                "Oh, we don't know whether it was Roberts, Kavanaugh, or Gorsuch who provided the 4th vote.\n\nIf I had to guess, I'd say Roberts.",
                "This will be back at the court in 1-2 years, and sadly Amy will vote with the conservatives.",
                "What amazes me is that 4 people actually voted for this. What the hell is happening to our country?",
                "Being half right is better than I expect from any decision out of the current Supreme Court. Barrett recusing herself on this is also a welcome surprise. That being said, I still do not see the current Supreme Court as legitimate and I do not trust them to correctly interpret the Constitution.",
                "We don’t need religious schools.PERIOD."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 29894,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                "Maybe they will hire AI agents/bots to restock shelves and ai registers.  And maybe they can sell their goods exclusively to AI families.",
                "Maybe they should not have bent over for one group and their king?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "\"Go woke go broke, am I right?\" LMAO. It's hilarious to me these big corporations took the the threat of....broke ass people who don't spend any money in their stores anyway....seriously. Instead they decide to piss off the people who have money and \\*used\\* to shop there. \n\nKeep soaring, Costco!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "'Serious' accident at North Korea warship launch ceremony",
            "external_url": "https://www.channelnewsasia.com/east-asia/north-korea-warship-launch-serious-accident-5145951?cid=internal_sharetool_iphone_22052025_cna",
            "upvotes": 3164,
            "date": "05/22/2025",
            "thumbnail": "https://dam.mediacorp.sg/image/upload/s--grLCuTo7--/c_crop,h_450,w_800,x_0,y_61/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-05-22t011638z_3_lynxmpel4l00t_rtroptp_3_northkorea-navy.jpg?itok=IBofV_y-",
            "top_comments": [
                "The long and short of it is somebody fucked up and it messed up the bottom of the boat so it no longer was balanced correctly. Kim Jong-un said that it was basically a criminal act of carelessness and that shit is gonna be done about it.",
                "Someone is about to get killed by cannon fire again.",
                "A good steering wheel that doesn’t fly out of your hand while you’re sailing",
                "This is their brand new ship they've been bragging about. You've got to wonder if there was sabotage involved.",
                "Maybe Dennis Rodman can go over there and give him a pep talk",
                "Someone is going to be artillery’d to death.",
                "Did the front fall off?",
                "They should've slapped it and say, \"that will hold.\"",
                "No worry. This Korean nesting ship design. We open broken ship and slightly smaller not broken ship inside",
                "Do you think he’s just in a constant state of embarrassment?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Treasury Department set to phase out the penny",
            "external_url": "https://www.cbsnews.com/news/treasury-penny-mint-to-stop-making-pennies/",
            "upvotes": 9,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/02/10/b7dda7ee-9c6d-485d-8b1c-b5ac33406f50/thumbnail/1200x630/0eefa8ef8f918a7e143597b66c23943b/gettyimages-1241287327.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "Good. Do the nickel and dime while your at it. Round everything to the nearest quarter.",
                "Phew, that should settle the bond market."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Divided Supreme Court Rejects Bid for Religious Charter School in Oklahoma",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/supreme-court-religious-charter-school-oklahoma.html?unlocked_article_code=1.JE8.vgNC.2rORn3aeSqNA&smid=nytcore-android-share",
            "upvotes": 376,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "4-4 split decision. Amy Coney Barrett recused herself.",
                "Divided over whether tax-payers should help pay for a religious school.  \n\nLet that sink in.",
                "\"The Supreme Court on Thursday effectively ended a publicly funded Catholic charter school in Oklahoma, dividing 4-4\"\n\nFuck me, that's way too close. This should've been a unanimous vote, not this horseshit. This was going to be a clear violation of the separation of church and state, the government clearly endorsing a specific religion.",
                "Disappointing that it was an even split, but thank goodness it was rejected.",
                "I'll take whatever win comes at this point.",
                "Oh, we don't know whether it was Roberts, Kavanaugh, or Gorsuch who provided the 4th vote.\n\nIf I had to guess, I'd say Roberts.",
                "This will be back at the court in 1-2 years, and sadly Amy will vote with the conservatives.",
                "What amazes me is that 4 people actually voted for this. What the hell is happening to our country?",
                "Being half right is better than I expect from any decision out of the current Supreme Court. Barrett recusing herself on this is also a welcome surprise. That being said, I still do not see the current Supreme Court as legitimate and I do not trust them to correctly interpret the Constitution.",
                "We don’t need religious schools.PERIOD."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Multiple people dead after small plane crashes into San Diego neighborhood",
            "external_url": "https://www.nbcnews.com/news/us-news/small-plane-crashes-san-diego-neighborhood-rcna208465",
            "upvotes": 3025,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250522-san-diego-plane-crash-mn-1050-3cf78d.jpg",
            "top_comments": [
                "Cessna 550 is debatable as being a small plane, more like a private jet.",
                "Sad for those who lost their lives. Rest in peace. Hopefully others will be okay.",
                "I live in San Diego and deliver Uber-eats as a side hustle, and I've delivered in that area numerous times. It is quite large and has a school and community center. Good honest, navy folks. I heard nobody on the ground was killed.  ❤️ 💙",
                "Truly tragic and feel for the families involved. Hope the transportation secretary is on top of this.",
                "And people want flying cars",
                "Why is the neighborhood name/military housing complex not mentioned by name, I wonder?",
                "God damn it seems like there have been a lot of plane crashes this year.",
                "This may have been avoided if the pilot and copilot had practiced the Feilder method.",
                "Anyone watching Nathan Fielders Rehearsal?",
                "Sad to see. Seems like this private jet crashed into a neighborhood, but everyone who died was already on the plane. It seems like from what we know right now that no one in the neighborhood died from this, which is a small solace from this tragedy.\n\nIt feels like this is happening more often in recent months, though maybe the media is raising more awareness of these kinds of incidents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The US has a new most powerful laser",
            "external_url": "https://news.umich.edu/the-us-has-a-new-most-powerful-laser/",
            "upvotes": 137,
            "date": "05/22/2025",
            "thumbnail": "https://news.umich.edu/wp-content/uploads/mc-image-cache/2025/05/the-us-has-a-new-most-powerful-laser-ti-sapph-crystal.jpg",
            "top_comments": [
                "Neat! Now attach it to sharks and see what happens",
                "Hopefully Director Krennic will find this one sufficient.",
                "MGT has concerns about this and the weather.",
                "It's not about the size of the laser, it's about how you use it",
                "Someone call Chris, Mitch, and Jordan, then order all the popcorn.",
                "90's Keanu Reeves wrote this headline",
                "Is Sci-fi becoming real?",
                "It went with NATO classification naming “Laserfucker”",
                "This is cool, I've actually been on experiments here a couple of times. Glad to see they've managed to get the beam power even higher, it was a fun place to do work at (and a great opportunity for doing interesting physics stuff).",
                "And this is what makes America great, really big science-y stuff that everyone agrees is: \"Pretty frickin awesome\"."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "St. Louis tornado sirens didn't sound in deadly storm. Now a city commissioner has been placed on leave.",
            "external_url": "https://www.cbsnews.com/news/st-louis-tornado-sirens-emergency-management-commissioner-leave/",
            "upvotes": 1226,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/13918c6e-6382-4d4e-b33e-17a61d727be2/thumbnail/1200x630/1331215528447082c245240dabfd7a02/ap25136823869443.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                ">However, even if someone had pressed the button at the Fire Department, city officials learned Tuesday that the button was not working. \n\n>\"Work to repair the button began Tuesday afternoon and is expected to be completed within days,\" Spencer's office said. \n\nTheir tornado button is broken. This story feels surreal.",
                "A city with 60 sirens and not one sounded. That’s not just a mistake, that’s systemic failure.",
                "I live close to an area that has an emergency siren like this, but I’m not too familiar as I am new to this area. Does anyone know if you can connect your phones to the sirens so when they go off your phone gets an alert? Is this a thing?",
                "This is so bizarre. I lived in a small town close to St Louis, and I swear they tested the tornado sirens once a week.",
                "*Sarah Russell, commissioner of the City Emergency Management Agency in St. Louis, will remain on paid administrative leave as an external investigation proceeds into what went wrong.*  \n\n\n*Until a permanent replacement for Russell is found, St. Louis fire captain John Walk will serve as the interim emergency management commissioner.*\n\n\n\nI’ll be interested to see the conclusions of the external investigation. I wonder what they’ll determine.",
                "Weather ballon’s are important in helping to predict weather conditions. \n\nhttps://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts",
                "We blow ours on the first Wednesday of every month at noon whether we want to or not",
                "Last Month, no sirens were heard when an F1 touched down in a neighbouring town to me.\n\nThis Monday, no sirens were audible, nor was a Tornado warning issued, in suburban Nebraska areas.\n\nThis administration is going to get people killed, and I'm of the opinion they want that to happen.\n\nEDIT: I understand the issue in St Louis was because the alarms aren't working, but I'm also confident that warning systems working improperly is a widespread issue right now and that the departments that should be fixing it are under turmoil due to this administrations current choices",
                "At this point you gotta just have YouTube open with Ryan Hall or Max live-streaming your warnings these days.",
                "I had a tornado occur in DFW, TX with no siren. My dog woke up. Pretty wild to think about really."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Moderna pulls application for COVID-flu combination shot",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-withdraws-application-covid-flu-combination-vaccine-2025-05-21/",
            "upvotes": 174,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "God do I hate our government being run by idiots.",
                "[Moderna's combo Covid and flu mRNA shot outperforms current vaccines in large trial](https://www.nbcnews.com/health/health-news/modernas-combo-covid-flu-mrna-shot-outperforms-current-vaccines-large-rcna205242)\n\n>The trial, funded by Moderna, included more than 8,000 adults ages 50 and older who were enrolled in October and November 2023. For people ages 50 to 64, the new vaccine was compared to Moderna’s Covid vaccine and the flu shot Fluarix. For people 65 and older, it was compared to the Covid vaccine and a different flu shot, called Fluzone, which is a stronger dose typically given to older adults. The trial participants either got the existing shots, or the new combination vaccine plus a placebo shot. (This way, both groups got two injections.)\n\n>The trial found that antibody levels were higher for Covid and all but one influenza strain in people who got the combination vaccine, compared to those who got the existing shots in both groups. \n\n>Dr. Buddy Creech, a pediatric infectious disease physician at Vanderbilt University Medical Center in Nashville, Tennessee, said the antibody levels generated by the new vaccine were about 20% to 40% higher.",
                "We were really looking forward to this shot in the clinics",
                "As someone who vaccinates regularly (flu, COVID, shingles, pneumonia, etc.) I would love this. \n\nCOVID is still around. Two of my friends just contracted it last week.",
                "It says Soft Paywall, but I'm not willing to send money to every news site I come across in a day."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US filings for jobless aid, a proxy for layoffs, inch down modestly last week",
            "external_url": "https://abcnews.go.com/Business/wireStory/us-filings-jobless-aid-proxy-layoffs-inch-modestly-122069969",
            "upvotes": 147,
            "date": "05/22/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f8609644-52a1-4e57-ab9f-e586f6b1d5c0/wirestory_fab6330cb2c188419a41936c2c10a4cd_16x9.jpg?w=1600",
            "top_comments": [
                "Fed chair Jerome Powell said the potential for both higher unemployment and inflation are elevated, an unusual combination that complicates the central bank’s dual mandate of controlling prices and keeping unemployment low.",
                "I once again want to remind people that most economic changes take months and years to happen. \n\nWe can only speculate what the effect on the economy will be under Trump. Its obviously going to be bad long term but people thinking were about to collapse are misguided. That's not really how things happen.\n\nWe're in for a long period of stagnation and probably a prolonged recession as the buying power of the lower and middle classes is eroded. People are still able to find work so spending is keeping thing afloat. \n\nBad policy will catch up to us all, but it probably won't come for a year or two.",
                "Give it 3 weeks, there are massive layoffs happening right now. Advertising is a litmus test because they depend on brands, and brands depend on sales. When sales slump, they fire agencies and everyone dedicated to those accounts get the boot. I got laid off in Jan, and there was another big wave in early May. TikTok social commerce team just canned 20-30% of their staff as revenue drops from a slow Q1.",
                "Walmart just announced layoffs today. The end is nigh.",
                "The word modest means not much action will be taken"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Person shot outside CIA headquarters by security guards",
            "external_url": "https://www.cnbc.com/2025/05/22/cia-shooting-headquarters.html",
            "upvotes": 2227,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108149325-1747919164608-AP22267585432357.jpg?v=1747919221&w=1920&h=1080",
            "top_comments": [
                "I accidentally made a wrong turn there by mistake once , they surrounded my car with their hands on their guns, had me roll down all my windows and then interrogated me before letting me go, they weren’t very friendly at first but were nice enough to give me directions once they determined I wasn’t a security threat just an idiot",
                "CIA main gate is a magnet for the mentally ill unfortunately. This headline could be copy and pasted every three or four months.",
                "Everyone knows that you can't break into Langley unless you're Ethan Hunt",
                "Guards at CIA headquarters opened fire on an individual early Thursday morning in what the agency called a “security incident,” a person familiar with the matter told NBC News’ Andrea Mitchell.\n\nThe non-fatal shooting on CIA property in Langley, Virginia, occurred hours after officials said two Israeli Embassy staff members, Yaron Lischinsky and Sarah Milgrim, were shot and killed outside D.C.’s Capital Jewish Museum.\n\n**There is no evidence that the two incidents are linked.** The CIA did not immediately respond to CNBC’s request for additional information.",
                "Not surprising. There's a guy there called Stan Smith that crashes his SUV into the flagpole daily. They're on edge.",
                "\"Well,  uhm... there was a snag. This analyst, Cox, was attacking the gym guy. Uhm, it was in broad daylight, on the street, our man uh did not know what to do, felt he had to step in... he uhm... he shot the analyst, he shot Cox.\"",
                "$5 million to his family, pronto",
                "Omg, thats Jason Bourne.",
                "Don’t worry this person will be paid $5 million in a couple of months.",
                "Who needs to break into the CIA?  \n\nAll the information you need is on Signal.  Just hop on group chat, you will get information that only top officials are privy to."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Small plane crashes into San Diego neighborhood, setting home and cars on fire",
            "external_url": "https://apnews.com/article/plane-crash-san-diego-5e465454fc0282a81adafc1bfdc142a1",
            "upvotes": 134,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Scary to think of how many people were home and sleeping when this happened (around 3:45am)."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man stripped naked, beaten with poles after calling people 'N-word' in Mississippi bar, police say",
            "external_url": "https://www.fox13memphis.com/news/man-attacked-after-walking-into-mississippi-bar-and-using-racial-slur-police-say/article_33d95bce-f26a-4284-85d4-161c04c692a8.html?utm_campaign=snd-autopilot&fbclid=IwY2xjawKbzQtleHRuA2FlbQIxMQABHvZDhMKZjBMcUdIzDoKKIclyx7RUgukMSyomx_2paZi3IdLCJ9fOQZoFhPYd_aem_Ftnn7PYHVPKasVie-X8-Yg",
            "upvotes": 16406,
            "date": "05/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/fox13memphis.com/content/tncms/custom/image/586ecdee-7801-11ed-8535-17dbee2a28ca.png?resize=600%2C315",
            "top_comments": [
                "As a Pole I'm just glad we could be of service",
                "A man walks into a bar looking for a fight, people are shocked when he gets what he wants. /s",
                "> Davis said he doesn't believe the club to be a problem spot. \n\nThere's no one of that name identified in the article, but previous quotes were attributed to a Miles Stone.  \nDid the author refer to Miles Stone as Davis?  [Miles Davis?](https://en.wikipedia.org/wiki/Miles_Davis)",
                "There has to be an easier way to get invited to the White House.",
                "This sounds like a Boondocks episode. Wtf did he think was going to happen?",
                "Incoming GoFundMe for this moron",
                "Was he playing Simon says with Hans Gruber’s brother or something?",
                "Most people: “Fantastic!”\n\nCops: “Ermm, looks like a hate crime…against the racist.”",
                "Lol I want to do business in that town. 30 calls to the place, no liquor or business license, and they still haven't been shut down. Looks like someone bought a house and just decided to run a bar out of it. That's freedom. That's America.",
                "This just in: Actions have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Divided Supreme Court Rejects Bid for Religious Charter School in Oklahoma",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/supreme-court-religious-charter-school-oklahoma.html?unlocked_article_code=1.JE8.vgNC.2rORn3aeSqNA&smid=nytcore-android-share",
            "upvotes": 370,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "4-4 split decision. Amy Coney Barrett recused herself.",
                "Divided over whether tax-payers should help pay for a religious school.  \n\nLet that sink in.",
                "\"The Supreme Court on Thursday effectively ended a publicly funded Catholic charter school in Oklahoma, dividing 4-4\"\n\nFuck me, that's way too close. This should've been a unanimous vote, not this horseshit. This was going to be a clear violation of the separation of church and state, the government clearly endorsing a specific religion.",
                "Disappointing that it was an even split, but thank goodness it was rejected.",
                "I'll take whatever win comes at this point.",
                "Oh, we don't know whether it was Roberts, Kavanaugh, or Gorsuch who provided the 4th vote.\n\nIf I had to guess, I'd say Roberts.",
                "This will be back at the court in 1-2 years, and sadly Amy will vote with the conservatives.",
                "What amazes me is that 4 people actually voted for this. What the hell is happening to our country?",
                "Being half right is better than I expect from any decision out of the current Supreme Court. Barrett recusing herself on this is also a welcome surprise. That being said, I still do not see the current Supreme Court as legitimate and I do not trust them to correctly interpret the Constitution.",
                "We don’t need religious schools.PERIOD."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "St. Louis tornado sirens didn't sound in deadly storm. Now a city commissioner has been placed on leave.",
            "external_url": "https://www.cbsnews.com/news/st-louis-tornado-sirens-emergency-management-commissioner-leave/",
            "upvotes": 1223,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/13918c6e-6382-4d4e-b33e-17a61d727be2/thumbnail/1200x630/1331215528447082c245240dabfd7a02/ap25136823869443.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                ">However, even if someone had pressed the button at the Fire Department, city officials learned Tuesday that the button was not working. \n\n>\"Work to repair the button began Tuesday afternoon and is expected to be completed within days,\" Spencer's office said. \n\nTheir tornado button is broken. This story feels surreal.",
                "A city with 60 sirens and not one sounded. That’s not just a mistake, that’s systemic failure.",
                "I live close to an area that has an emergency siren like this, but I’m not too familiar as I am new to this area. Does anyone know if you can connect your phones to the sirens so when they go off your phone gets an alert? Is this a thing?",
                "This is so bizarre. I lived in a small town close to St Louis, and I swear they tested the tornado sirens once a week.",
                "*Sarah Russell, commissioner of the City Emergency Management Agency in St. Louis, will remain on paid administrative leave as an external investigation proceeds into what went wrong.*  \n\n\n*Until a permanent replacement for Russell is found, St. Louis fire captain John Walk will serve as the interim emergency management commissioner.*\n\n\n\nI’ll be interested to see the conclusions of the external investigation. I wonder what they’ll determine.",
                "Weather ballon’s are important in helping to predict weather conditions. \n\nhttps://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts",
                "We blow ours on the first Wednesday of every month at noon whether we want to or not",
                "Last Month, no sirens were heard when an F1 touched down in a neighbouring town to me.\n\nThis Monday, no sirens were audible, nor was a Tornado warning issued, in suburban Nebraska areas.\n\nThis administration is going to get people killed, and I'm of the opinion they want that to happen.\n\nEDIT: I understand the issue in St Louis was because the alarms aren't working, but I'm also confident that warning systems working improperly is a widespread issue right now and that the departments that should be fixing it are under turmoil due to this administrations current choices",
                "At this point you gotta just have YouTube open with Ryan Hall or Max live-streaming your warnings these days.",
                "I had a tornado occur in DFW, TX with no siren. My dog woke up. Pretty wild to think about really."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Multiple people dead after small plane crashes into San Diego neighborhood",
            "external_url": "https://www.nbcnews.com/news/us-news/small-plane-crashes-san-diego-neighborhood-rcna208465",
            "upvotes": 3029,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250522-san-diego-plane-crash-mn-1050-3cf78d.jpg",
            "top_comments": [
                "Cessna 550 is debatable as being a small plane, more like a private jet.",
                "Sad for those who lost their lives. Rest in peace. Hopefully others will be okay.",
                "I live in San Diego and deliver Uber-eats as a side hustle, and I've delivered in that area numerous times. It is quite large and has a school and community center. Good honest, navy folks. I heard nobody on the ground was killed.  ❤️ 💙",
                "Truly tragic and feel for the families involved. Hope the transportation secretary is on top of this.",
                "And people want flying cars",
                "Why is the neighborhood name/military housing complex not mentioned by name, I wonder?",
                "God damn it seems like there have been a lot of plane crashes this year.",
                "This may have been avoided if the pilot and copilot had practiced the Feilder method.",
                "Anyone watching Nathan Fielders Rehearsal?",
                "Sad to see. Seems like this private jet crashed into a neighborhood, but everyone who died was already on the plane. It seems like from what we know right now that no one in the neighborhood died from this, which is a small solace from this tragedy.\n\nIt feels like this is happening more often in recent months, though maybe the media is raising more awareness of these kinds of incidents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Person shot outside CIA headquarters by security guards",
            "external_url": "https://www.cnbc.com/2025/05/22/cia-shooting-headquarters.html",
            "upvotes": 2225,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108149325-1747919164608-AP22267585432357.jpg?v=1747919221&w=1920&h=1080",
            "top_comments": [
                "I accidentally made a wrong turn there by mistake once , they surrounded my car with their hands on their guns, had me roll down all my windows and then interrogated me before letting me go, they weren’t very friendly at first but were nice enough to give me directions once they determined I wasn’t a security threat just an idiot",
                "CIA main gate is a magnet for the mentally ill unfortunately. This headline could be copy and pasted every three or four months.",
                "Everyone knows that you can't break into Langley unless you're Ethan Hunt",
                "Guards at CIA headquarters opened fire on an individual early Thursday morning in what the agency called a “security incident,” a person familiar with the matter told NBC News’ Andrea Mitchell.\n\nThe non-fatal shooting on CIA property in Langley, Virginia, occurred hours after officials said two Israeli Embassy staff members, Yaron Lischinsky and Sarah Milgrim, were shot and killed outside D.C.’s Capital Jewish Museum.\n\n**There is no evidence that the two incidents are linked.** The CIA did not immediately respond to CNBC’s request for additional information.",
                "Not surprising. There's a guy there called Stan Smith that crashes his SUV into the flagpole daily. They're on edge.",
                "\"Well,  uhm... there was a snag. This analyst, Cox, was attacking the gym guy. Uhm, it was in broad daylight, on the street, our man uh did not know what to do, felt he had to step in... he uhm... he shot the analyst, he shot Cox.\"",
                "$5 million to his family, pronto",
                "Omg, thats Jason Bourne.",
                "Don’t worry this person will be paid $5 million in a couple of months.",
                "Who needs to break into the CIA?  \n\nAll the information you need is on Signal.  Just hop on group chat, you will get information that only top officials are privy to."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man stripped naked, beaten with poles after calling people 'N-word' in Mississippi bar, police say",
            "external_url": "https://www.fox13memphis.com/news/man-attacked-after-walking-into-mississippi-bar-and-using-racial-slur-police-say/article_33d95bce-f26a-4284-85d4-161c04c692a8.html?utm_campaign=snd-autopilot&fbclid=IwY2xjawKbzQtleHRuA2FlbQIxMQABHvZDhMKZjBMcUdIzDoKKIclyx7RUgukMSyomx_2paZi3IdLCJ9fOQZoFhPYd_aem_Ftnn7PYHVPKasVie-X8-Yg",
            "upvotes": 16403,
            "date": "05/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/fox13memphis.com/content/tncms/custom/image/586ecdee-7801-11ed-8535-17dbee2a28ca.png?resize=600%2C315",
            "top_comments": [
                "As a Pole I'm just glad we could be of service",
                "A man walks into a bar looking for a fight, people are shocked when he gets what he wants. /s",
                "> Davis said he doesn't believe the club to be a problem spot. \n\nThere's no one of that name identified in the article, but previous quotes were attributed to a Miles Stone.  \nDid the author refer to Miles Stone as Davis?  [Miles Davis?](https://en.wikipedia.org/wiki/Miles_Davis)",
                "There has to be an easier way to get invited to the White House.",
                "This sounds like a Boondocks episode. Wtf did he think was going to happen?",
                "Incoming GoFundMe for this moron",
                "Was he playing Simon says with Hans Gruber’s brother or something?",
                "Most people: “Fantastic!”\n\nCops: “Ermm, looks like a hate crime…against the racist.”",
                "Lol I want to do business in that town. 30 calls to the place, no liquor or business license, and they still haven't been shut down. Looks like someone bought a house and just decided to run a bar out of it. That's freedom. That's America.",
                "This just in: Actions have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge finds police acted reasonably in shooting New Mexico man while at wrong address",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-finds-police-acted-reasonably-shooting-new-mexico-man-wrong-addr-rcna208157",
            "upvotes": 5936,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Farmington-police-shooting-RS-791813.jpg",
            "top_comments": [
                "Isn't that amazing? They can start a conflict, and when someone has a natural reaction to said conflict and exercises their supposed 2nd Amendment right, you can legally be killed.",
                "Cops can\n\n\n1) kill if they feel threatened.  \n2) lie as much as they want.  \n3) break laws that would land you in jail.  \n4) just sit there while you're being killed because they have no obligation to actually help anyone.",
                "If the police can legally kill you for reasonably exercising a right then you don't have that right.",
                "This stuff is so weird being on the outside looking in.\n\nLike, so much American insistence of having firearms to defend yourself and your property, but like then this shit happens all the time where the cops shoot the wrong person just cause they had a firearm to defend themselves because no one will know if the person bashing on their door in the middle of night screaming police is actually police or if its intruders. \n\nLike what is the play here as a citizen.",
                "The 2nd amendment is equal for all Americans, except some Americans are more equal than others…",
                "So, you \\*don't\\* actually have a right to defend your own home, or even have a gun in your hand, if it happens to be incompetent cops trying to break in.\n\nReally seems like the only sane response is to act like cops - shoot first and ask questions never. At least that might make them hesitate.",
                "They don't value life at all",
                "The judge is district court Judge Matthew Garcia.",
                "If the situation had ended differently and the homeowner killed the police and then called 911, would the homeowner have 'acted responsibly'?",
                "When police fuck up, you know, doing the police work, it should be an automatic disqualification of qualified immunity. They want legal protections for doing the job? Don't. Fuck. Up. The. Job. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "2 shot, 1 fatally, in Washington DC; Israeli embassy staffer believed to be among victims: police",
            "external_url": "https://abc7.com/post/2-shot-1-fatally-outside-capital-jewish-museum-washington-dc-israeli-embassy-staff-among-victims-police-say/16500500/",
            "upvotes": 11881,
            "date": "05/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16503737_052225-wpvi-dc-shooting-img.jpg?w=1600",
            "top_comments": [
                "Two embassy staffers are dead. A man and a woman. Shooter apprehended.\n\nhttps://www.cnn.com/2025/05/21/politics/individuals-connected-to-israeli-embassy-shot-in-dc-sources-says",
                "This is gonna be a world class shitshow.",
                "[\"Suspect chanted 'Free-Free Palestine' while in custody.\" ](https://www.youtube.com/live/nGVVRy0vimE?t=1113s) - Seems like a political motive is confirmed.",
                "Suspect identified as Elias Rodrigues from Chicago IL.",
                "Ahh shit this won’t be good",
                "Still not locked after 4 hours. I'm impressed. Usually topics of this nature get locked almost immediately.",
                "[removed]",
                "It would be nice if just one day this year could not be a shit show",
                "regardless of the debate of judaism vs zionism, this is going escalate things in a nerve wracking way.\n\nand with palestine as well as other things trump is doing, this is gonna be an interesting summer.",
                "The male victim, Yaron, was a classmate of mine. May his memory be a blessing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 9582,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "Always wear your seatbelt",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "In separate crashes, what are the odds of that? Poor kid.",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "That stretch of LA 67 has a long history of high‑severity crashes—especially in low‑light or early‑morning conditions. In 2022 they found that 47 crashes happened over just three years at the LA 67/72nd Avenue intersection—roughly 16 crashes per year. [Source](https://movebr.brla.gov/assets/documents/final-plans/Plank-Road%20-Design-Study%20-Report_02-28-2022-web.pdf?utm_source=chatgpt.com)",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 29905,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                "Maybe they will hire AI agents/bots to restock shelves and ai registers.  And maybe they can sell their goods exclusively to AI families.",
                "Maybe they should not have bent over for one group and their king?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "\"Go woke go broke, am I right?\" LMAO. It's hilarious to me these big corporations took the the threat of....broke ass people who don't spend any money in their stores anyway....seriously. Instead they decide to piss off the people who have money and \\*used\\* to shop there. \n\nKeep soaring, Costco!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "'Serious' accident at North Korea warship launch ceremony",
            "external_url": "https://www.channelnewsasia.com/east-asia/north-korea-warship-launch-serious-accident-5145951?cid=internal_sharetool_iphone_22052025_cna",
            "upvotes": 3167,
            "date": "05/22/2025",
            "thumbnail": "https://dam.mediacorp.sg/image/upload/s--grLCuTo7--/c_crop,h_450,w_800,x_0,y_61/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2025-05-22t011638z_3_lynxmpel4l00t_rtroptp_3_northkorea-navy.jpg?itok=IBofV_y-",
            "top_comments": [
                "The long and short of it is somebody fucked up and it messed up the bottom of the boat so it no longer was balanced correctly. Kim Jong-un said that it was basically a criminal act of carelessness and that shit is gonna be done about it.",
                "Someone is about to get killed by cannon fire again.",
                "A good steering wheel that doesn’t fly out of your hand while you’re sailing",
                "This is their brand new ship they've been bragging about. You've got to wonder if there was sabotage involved.",
                "Maybe Dennis Rodman can go over there and give him a pep talk",
                "Someone is going to be artillery’d to death.",
                "Did the front fall off?",
                "They should've slapped it and say, \"that will hold.\"",
                "No worry. This Korean nesting ship design. We open broken ship and slightly smaller not broken ship inside",
                "Do you think he’s just in a constant state of embarrassment?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/22/2025 16:11:18 UTC"
}