{
    "posts": [
        {
            "category": "HOT",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 11602,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.\n\n*edit\n\nI found some numbers. This isn’t scientific or even rigorous, but apparently ford reshored the production of the F-650 some years ago. It took about a year to get the plant going and the company sold 17,000 units that production year. That represents less than 1% of 2024 total unit sales. Good luck everyone.",
                "Is this winning and bringing manufacturing back to America…..?",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "Even if it's not the tariffs. Wasn't the point of electing this moron to IMPROVE the economy?\n\nOk, cool. It wasnt the tariffs. You're still not delivering on your promises",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                "This is what bringing manufacturing back to America looks like?!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Woman missing since 1962 found 'alive and well'",
            "external_url": "https://www.bbc.com/news/articles/cvgpjgwxlxwo",
            "upvotes": 1935,
            "date": "05/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/66f6/live/2ae0ff60-2901-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "*The group said that days before she went missing, Ms Backeberg, now 82, had filed a criminal complaint against her husband, whom she had married at the age of 15, alleging he had beaten her and threatened to kill her.  On the day she disappeared, she left home to pick up her pay cheque from the woollen mill where she worked.*\n\nI'm wondering what happened to her two children from that very early marriage. Anyway, the story makes lots of sense... she just hitch-hikes out of town with her baby-sitter... they split up and go their own ways...Backeberg out of state and lost almost forever.",
                "My grandmother effectively did this to her first two kids. her first husband was wealthy and influential. He was also abusive and controlling of her. He told her if she divorced him she would never see her children again. She left anyway and she wouldn't see her kids again until she was eighty years old after he died and her kids found out she was still alive (the husband told them she died). \n\nThe way she put it, the kids would have had a dead mother whether she stayed or not, so she chose to leave and live with the hope she would see them again one day instead of staying and either being killed by him or killing herself.",
                "Damn, there is so much more to this story that the article failed to answer. I feel left unsatisfied.",
                "So the 14 year-old babysitter went back to their hometown and kept that secret all these years? Impressive",
                "TLDR: She was in the last place they eventually looked.",
                "I wonder if her kids will contact her?",
                "It reminds the character played by Julianne Moore in the movie The Hours.",
                " >\"She sounded happy. Confident in her decision. No regrets.\"\n\nI would be fine with that...except she had 2 young children when she decided to disappear.\n\nEDIT: Ok, I guess that didn't come out right. What I meant is....The \"no regrets\" part got me. You can say you made the right decision but at the same time regret that you weren't able to see your kids ever again.\n\nHer statement made it seem like she didn't even care that she never got to see her kids again...ever.",
                "Happened to my grandfather. His dad died of TB right around the same time he was born. Mom had him stay with friends of the family while she got got settled.  When she came back she was told her kid was dead. She didn't meet mt grandfather again until he was in his 60s",
                "So she just abandoned her 2 kids with a man she claimed to be violent? Gross."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 3739,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Fuck Islam and any other religion that uses God as an excuse for violence and oppression",
                "Thousands of men rally…",
                "Islam trying to keep women from having rights...\n\nCan't say I'm shocked...\n\nThe muslim religion is stuck in ~~5AD~~ 610CE...  \n\nedit:  corrected the start date of Islam, thanks @[Alternative\\_Pin\\_7551](https://www.reddit.com/user/Alternative_Pin_7551/)",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way",
                "Thousands of humans, less than 100 combined total IQ"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 1725,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Radicalize the kids into what ideology exactly?",
                "Lady Gaga is my guilty pleasure\n\nGlad they foiled the attack!",
                "[deleted]",
                "Have Bomber-humans always existed or do we just have a new species of humans in the 20-21st century?\n\nFeels like they just multiply."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 36517,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "I had discitis after spine surgery it was the most painful thing I have ever ever in my life ever expeirenced.  Not one doctor believed me they all said I was drug seeking and told me to go to rehab.  I got to the point the pain was so bad that I would pass out from going from a laying to a sitting position.  My 5th visit to emerg a doctor finally believed me.  I was admitted to hospital for 8 months, had to be on a picc line for 18 months with constant infusion of antibiotics.  Because I was not treated for 6 weeks the infection had gotten so bad it went from the surgical site at l4 all the way to my c7.  I could no longer walk and had to use a wheelchair for 2 years.  I had to have 80 k in renos to my house to accomodate a wheelchair.  It took me 2 years to go back to work and 10 years to be out of the wheelchair.  All because 3 different doctors including the surgeon all thought I was a pill head looking for opiates.",
                "The discrimination towards younger patients is honestly sad",
                "In Canada a friend of mine in her late 20s knew she was at risk of breast cancer but couldn't find any place that would give her a preventative mastectomy without also booking in expensive reconstructive surgery which she couldn't afford. She died from breast cancer a few years later.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://edition.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 873,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hostage talks seem irrelevant to the rest of the headline, imho",
                "Is there anything left in Gaza? When is enough enough?",
                "Calling this a war is like calling a man assaulting a child a fight.",
                "When Israel rounds up civilians in Palestine and detains them indefinitely without trial: prisoners. When Hamas does it: hostages.\n\nThis shit is why literally nobody trusts the big news media anymore.",
                "They do not care about the hostages one bit. We all know what the goal is here.",
                "History books won’t be kind to Israel and the west that support/ignored the war in Gaza.",
                "Can't wait to do 20 years in prison for hurting the feelings of a bloodthirsty colonial state.",
                "[removed]",
                "Genocidal fucking Country, how much more do they have to take? How many more children, old women and men? Since the god damn Nakba!",
                "Now the weekend warriors get to kill babies"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Secretariat horse racing: Every horse in 2025 Kentucky Derby is descendant of legendary Triple Crown winner",
            "external_url": "https://www.cbssports.com/general/news/secretariat-horse-racing-every-horse-in-2025-kentucky-derby-is-descendant-of-legendary-triple-crown-winner/",
            "upvotes": 1000,
            "date": "05/04/2025",
            "thumbnail": "https://sportshub.cbsistatic.com/i/r/2025/05/03/ca8b7c0a-2ad0-4f4d-a839-ce861925960e/thumbnail/1200x675/46c2a5c9b943da2a7d06891d36190711/gettyimages-84388880.jpg",
            "top_comments": [
                "Horse racing’s Genghis Khan",
                "\"As the trainer of one of his opponents put it, 'The only chance we have is if he falls down.' \"\n\nSecretariat was unmatched. There's a reason his name is still known worldwide 35y after his death.",
                "Talk about sibling rivalry ...",
                "Never knew it was such an incestuous industry.",
                "There will never be another horse like Secretariat. His Belmont win? Are you kidding me: [“…Moving like a tremendous machine!”](https://youtu.be/AG_27cCW5bw?si=KYcDX_I6OHkOxF8d)",
                "Lexington in particular is an… interesting place. Even smaller (think standard ranch/bungalow/whatever), will have a horse or two. Obviously not EVERY home, but enough for you to notice the trend.",
                "Who’s that at the Door ?!!!!!\n\nhttps://youtu.be/bvlrvgus0Ww?si=1YVzGQh5-TYblQd6",
                "Weird. My recollection was that Secretariat was a terrible stud horse.  Maybe it was just the first generation.  He sired a lot but was not as successful as Northern Dancer.",
                "Citation rolling in his grave.",
                "They're going to do this with HorseRaceTesting. Fearsome Fate will be used to make the next generation"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Starbase: Elon Musk’s SpaceX launch site becomes an official Texas city",
            "external_url": "https://apnews.com/article/elon-musk-starbase-texas-city-7863bf3bac65e9718eef19b27978933b",
            "upvotes": 607,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "15 years from now:  How did a small Texas town became the largest Superfund site.",
                "How many weeks til employees are paid in scrip?",
                "https://en.wikipedia.org/wiki/Company_town \n\n[Sixteen Tons · Tennessee Ernie Ford](https://www.youtube.com/watch?v=BSvORvIjZiU)",
                "Company towns are back then. They were so great for everyone living in them last time. /s.",
                "Good, now let’s pack all of MAGA into Texas and Florida and pull a bugs bunny and saw along the state lines and send them seawarding.",
                "Didn't Republicans hate on Disney just last year or so because they ran a lot of services at their location that were normally done by the city, defacto making them their own city?",
                "And the seeds have been sown here in America. The techno-fascist oligarchs are one step closer to realizing their network states.",
                "Can’t wait for “Ketamine Days”!",
                "Guess we won't have to wait till mars to see what dystopian society musk has planned.",
                "What the absolute hell is that statue.  Does he have a mustache, or is his upper lip bulging out?  Why is he wearing a scarf and have a Glam Rock-esque paint streak under his eye?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 26698,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "Very sad story the cop wasn't even involved",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 6972,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "5 Virginia prison guards are injured by inmates accused of being MS-13 members",
            "external_url": "https://edition.cnn.com/2025/05/04/us/accused-ms-13-virginia-prison-inmates",
            "upvotes": 0,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-05-04-at-2-45-09-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Such a weird headline almost like....",
                "Well, that justifies any and all human rights violations Trump commits then, doesn't it? \n\nDon't fall for this propagandist bullshit. This is just trying to make people afraid and compliant."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "The Popemobile of Peace: Pope Francis’ final gift to Gaza",
            "external_url": "https://www.vaticannews.va/en/pope/news/2025-05/the-popemobile-of-peace-pope-francis-final-gift-to-gaza.html",
            "upvotes": 12,
            "date": "05/04/2025",
            "thumbnail": "https://www.vaticannews.va/content/dam/vaticannews/multimedia/2025/aprile/30/13.jpg/_jcr_content/renditions/cq5dam.thumbnail.cropped.1500.844.jpeg",
            "top_comments": [
                "Don't know how they're going to turn it into a health clinic and not be a target.",
                "Israel should take notes"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Woman missing since 1962 found 'alive and well'",
            "external_url": "https://www.bbc.com/news/articles/cvgpjgwxlxwo",
            "upvotes": 1933,
            "date": "05/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/66f6/live/2ae0ff60-2901-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "*The group said that days before she went missing, Ms Backeberg, now 82, had filed a criminal complaint against her husband, whom she had married at the age of 15, alleging he had beaten her and threatened to kill her.  On the day she disappeared, she left home to pick up her pay cheque from the woollen mill where she worked.*\n\nI'm wondering what happened to her two children from that very early marriage. Anyway, the story makes lots of sense... she just hitch-hikes out of town with her baby-sitter... they split up and go their own ways...Backeberg out of state and lost almost forever.",
                "My grandmother effectively did this to her first two kids. her first husband was wealthy and influential. He was also abusive and controlling of her. He told her if she divorced him she would never see her children again. She left anyway and she wouldn't see her kids again until she was eighty years old after he died and her kids found out she was still alive (the husband told them she died). \n\nThe way she put it, the kids would have had a dead mother whether she stayed or not, so she chose to leave and live with the hope she would see them again one day instead of staying and either being killed by him or killing herself.",
                "Damn, there is so much more to this story that the article failed to answer. I feel left unsatisfied.",
                "So the 14 year-old babysitter went back to their hometown and kept that secret all these years? Impressive",
                "TLDR: She was in the last place they eventually looked.",
                "I wonder if her kids will contact her?",
                "It reminds the character played by Julianne Moore in the movie The Hours.",
                " >\"She sounded happy. Confident in her decision. No regrets.\"\n\nI would be fine with that...except she had 2 young children when she decided to disappear.\n\nEDIT: Ok, I guess that didn't come out right. What I meant is....The \"no regrets\" part got me. You can say you made the right decision but at the same time regret that you weren't able to see your kids ever again.\n\nHer statement made it seem like she didn't even care that she never got to see her kids again...ever.",
                "Happened to my grandfather. His dad died of TB right around the same time he was born. Mom had him stay with friends of the family while she got got settled.  When she came back she was told her kid was dead. She didn't meet mt grandfather again until he was in his 60s",
                "So she just abandoned her 2 kids with a man she claimed to be violent? Gross."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://edition.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 874,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hostage talks seem irrelevant to the rest of the headline, imho",
                "Is there anything left in Gaza? When is enough enough?",
                "Calling this a war is like calling a man assaulting a child a fight.",
                "When Israel rounds up civilians in Palestine and detains them indefinitely without trial: prisoners. When Hamas does it: hostages.\n\nThis shit is why literally nobody trusts the big news media anymore.",
                "They do not care about the hostages one bit. We all know what the goal is here.",
                "History books won’t be kind to Israel and the west that support/ignored the war in Gaza.",
                "Can't wait to do 20 years in prison for hurting the feelings of a bloodthirsty colonial state.",
                "[removed]",
                "Genocidal fucking Country, how much more do they have to take? How many more children, old women and men? Since the god damn Nakba!",
                "Now the weekend warriors get to kill babies"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 1728,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Radicalize the kids into what ideology exactly?",
                "Lady Gaga is my guilty pleasure\n\nGlad they foiled the attack!",
                "[deleted]",
                "Have Bomber-humans always existed or do we just have a new species of humans in the 20-21st century?\n\nFeels like they just multiply."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Starbase: Elon Musk’s SpaceX launch site becomes an official Texas city",
            "external_url": "https://apnews.com/article/elon-musk-starbase-texas-city-7863bf3bac65e9718eef19b27978933b",
            "upvotes": 603,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "15 years from now:  How did a small Texas town became the largest Superfund site.",
                "How many weeks til employees are paid in scrip?",
                "https://en.wikipedia.org/wiki/Company_town \n\n[Sixteen Tons · Tennessee Ernie Ford](https://www.youtube.com/watch?v=BSvORvIjZiU)",
                "Company towns are back then. They were so great for everyone living in them last time. /s.",
                "Good, now let’s pack all of MAGA into Texas and Florida and pull a bugs bunny and saw along the state lines and send them seawarding.",
                "Didn't Republicans hate on Disney just last year or so because they ran a lot of services at their location that were normally done by the city, defacto making them their own city?",
                "And the seeds have been sown here in America. The techno-fascist oligarchs are one step closer to realizing their network states.",
                "Can’t wait for “Ketamine Days”!",
                "Guess we won't have to wait till mars to see what dystopian society musk has planned.",
                "What the absolute hell is that statue.  Does he have a mustache, or is his upper lip bulging out?  Why is he wearing a scarf and have a Glam Rock-esque paint streak under his eye?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 11595,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.\n\n*edit\n\nI found some numbers. This isn’t scientific or even rigorous, but apparently ford reshored the production of the F-650 some years ago. It took about a year to get the plant going and the company sold 17,000 units that production year. That represents less than 1% of 2024 total unit sales. Good luck everyone.",
                "Is this winning and bringing manufacturing back to America…..?",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "Even if it's not the tariffs. Wasn't the point of electing this moron to IMPROVE the economy?\n\nOk, cool. It wasnt the tariffs. You're still not delivering on your promises",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                "This is what bringing manufacturing back to America looks like?!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Secretariat horse racing: Every horse in 2025 Kentucky Derby is descendant of legendary Triple Crown winner",
            "external_url": "https://www.cbssports.com/general/news/secretariat-horse-racing-every-horse-in-2025-kentucky-derby-is-descendant-of-legendary-triple-crown-winner/",
            "upvotes": 1002,
            "date": "05/04/2025",
            "thumbnail": "https://sportshub.cbsistatic.com/i/r/2025/05/03/ca8b7c0a-2ad0-4f4d-a839-ce861925960e/thumbnail/1200x675/46c2a5c9b943da2a7d06891d36190711/gettyimages-84388880.jpg",
            "top_comments": [
                "Horse racing’s Genghis Khan",
                "\"As the trainer of one of his opponents put it, 'The only chance we have is if he falls down.' \"\n\nSecretariat was unmatched. There's a reason his name is still known worldwide 35y after his death.",
                "Talk about sibling rivalry ...",
                "Never knew it was such an incestuous industry.",
                "There will never be another horse like Secretariat. His Belmont win? Are you kidding me: [“…Moving like a tremendous machine!”](https://youtu.be/AG_27cCW5bw?si=KYcDX_I6OHkOxF8d)",
                "Lexington in particular is an… interesting place. Even smaller (think standard ranch/bungalow/whatever), will have a horse or two. Obviously not EVERY home, but enough for you to notice the trend.",
                "Who’s that at the Door ?!!!!!\n\nhttps://youtu.be/bvlrvgus0Ww?si=1YVzGQh5-TYblQd6",
                "Weird. My recollection was that Secretariat was a terrible stud horse.  Maybe it was just the first generation.  He sired a lot but was not as successful as Northern Dancer.",
                "Citation rolling in his grave.",
                "They're going to do this with HorseRaceTesting. Fearsome Fate will be used to make the next generation"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 3744,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Fuck Islam and any other religion that uses God as an excuse for violence and oppression",
                "Thousands of men rally…",
                "Islam trying to keep women from having rights...\n\nCan't say I'm shocked...\n\nThe muslim religion is stuck in ~~5AD~~ 610CE...  \n\nedit:  corrected the start date of Islam, thanks @[Alternative\\_Pin\\_7551](https://www.reddit.com/user/Alternative_Pin_7551/)",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way",
                "Thousands of humans, less than 100 combined total IQ"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 36521,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "I had discitis after spine surgery it was the most painful thing I have ever ever in my life ever expeirenced.  Not one doctor believed me they all said I was drug seeking and told me to go to rehab.  I got to the point the pain was so bad that I would pass out from going from a laying to a sitting position.  My 5th visit to emerg a doctor finally believed me.  I was admitted to hospital for 8 months, had to be on a picc line for 18 months with constant infusion of antibiotics.  Because I was not treated for 6 weeks the infection had gotten so bad it went from the surgical site at l4 all the way to my c7.  I could no longer walk and had to use a wheelchair for 2 years.  I had to have 80 k in renos to my house to accomodate a wheelchair.  It took me 2 years to go back to work and 10 years to be out of the wheelchair.  All because 3 different doctors including the surgeon all thought I was a pill head looking for opiates.",
                "The discrimination towards younger patients is honestly sad",
                "In Canada a friend of mine in her late 20s knew she was at risk of breast cancer but couldn't find any place that would give her a preventative mastectomy without also booking in expensive reconstructive surgery which she couldn't afford. She died from breast cancer a few years later.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 1737,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Radicalize the kids into what ideology exactly?",
                "Lady Gaga is my guilty pleasure\n\nGlad they foiled the attack!",
                "[deleted]",
                "Have Bomber-humans always existed or do we just have a new species of humans in the 20-21st century?\n\nFeels like they just multiply."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Woman missing since 1962 found 'alive and well'",
            "external_url": "https://www.bbc.com/news/articles/cvgpjgwxlxwo",
            "upvotes": 1940,
            "date": "05/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/66f6/live/2ae0ff60-2901-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "*The group said that days before she went missing, Ms Backeberg, now 82, had filed a criminal complaint against her husband, whom she had married at the age of 15, alleging he had beaten her and threatened to kill her.  On the day she disappeared, she left home to pick up her pay cheque from the woollen mill where she worked.*\n\nI'm wondering what happened to her two children from that very early marriage. Anyway, the story makes lots of sense... she just hitch-hikes out of town with her baby-sitter... they split up and go their own ways...Backeberg out of state and lost almost forever.",
                "My grandmother effectively did this to her first two kids. her first husband was wealthy and influential. He was also abusive and controlling of her. He told her if she divorced him she would never see her children again. She left anyway and she wouldn't see her kids again until she was eighty years old after he died and her kids found out she was still alive (the husband told them she died). \n\nThe way she put it, the kids would have had a dead mother whether she stayed or not, so she chose to leave and live with the hope she would see them again one day instead of staying and either being killed by him or killing herself.",
                "Damn, there is so much more to this story that the article failed to answer. I feel left unsatisfied.",
                "So the 14 year-old babysitter went back to their hometown and kept that secret all these years? Impressive",
                "TLDR: She was in the last place they eventually looked.",
                "I wonder if her kids will contact her?",
                "It reminds the character played by Julianne Moore in the movie The Hours.",
                " >\"She sounded happy. Confident in her decision. No regrets.\"\n\nI would be fine with that...except she had 2 young children when she decided to disappear.\n\nEDIT: Ok, I guess that didn't come out right. What I meant is....The \"no regrets\" part got me. You can say you made the right decision but at the same time regret that you weren't able to see your kids ever again.\n\nHer statement made it seem like she didn't even care that she never got to see her kids again...ever.",
                "Happened to my grandfather. His dad died of TB right around the same time he was born. Mom had him stay with friends of the family while she got got settled.  When she came back she was told her kid was dead. She didn't meet mt grandfather again until he was in his 60s",
                "So she just abandoned her 2 kids with a man she claimed to be violent? Gross."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://edition.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 875,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hostage talks seem irrelevant to the rest of the headline, imho",
                "Is there anything left in Gaza? When is enough enough?",
                "Calling this a war is like calling a man assaulting a child a fight.",
                "When Israel rounds up civilians in Palestine and detains them indefinitely without trial: prisoners. When Hamas does it: hostages.\n\nThis shit is why literally nobody trusts the big news media anymore.",
                "They do not care about the hostages one bit. We all know what the goal is here.",
                "History books won’t be kind to Israel and the west that support/ignored the war in Gaza.",
                "Can't wait to do 20 years in prison for hurting the feelings of a bloodthirsty colonial state.",
                "[removed]",
                "Genocidal fucking Country, how much more do they have to take? How many more children, old women and men? Since the god damn Nakba!",
                "Now the weekend warriors get to kill babies"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 11594,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.\n\n*edit\n\nI found some numbers. This isn’t scientific or even rigorous, but apparently ford reshored the production of the F-650 some years ago. It took about a year to get the plant going and the company sold 17,000 units that production year. That represents less than 1% of 2024 total unit sales. Good luck everyone.",
                "Is this winning and bringing manufacturing back to America…..?",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "Even if it's not the tariffs. Wasn't the point of electing this moron to IMPROVE the economy?\n\nOk, cool. It wasnt the tariffs. You're still not delivering on your promises",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                "This is what bringing manufacturing back to America looks like?!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 3743,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Fuck Islam and any other religion that uses God as an excuse for violence and oppression",
                "Thousands of men rally…",
                "Islam trying to keep women from having rights...\n\nCan't say I'm shocked...\n\nThe muslim religion is stuck in ~~5AD~~ 610CE...  \n\nedit:  corrected the start date of Islam, thanks @[Alternative\\_Pin\\_7551](https://www.reddit.com/user/Alternative_Pin_7551/)",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way",
                "Thousands of humans, less than 100 combined total IQ"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Secretariat horse racing: Every horse in 2025 Kentucky Derby is descendant of legendary Triple Crown winner",
            "external_url": "https://www.cbssports.com/general/news/secretariat-horse-racing-every-horse-in-2025-kentucky-derby-is-descendant-of-legendary-triple-crown-winner/",
            "upvotes": 1007,
            "date": "05/04/2025",
            "thumbnail": "https://sportshub.cbsistatic.com/i/r/2025/05/03/ca8b7c0a-2ad0-4f4d-a839-ce861925960e/thumbnail/1200x675/46c2a5c9b943da2a7d06891d36190711/gettyimages-84388880.jpg",
            "top_comments": [
                "Horse racing’s Genghis Khan",
                "\"As the trainer of one of his opponents put it, 'The only chance we have is if he falls down.' \"\n\nSecretariat was unmatched. There's a reason his name is still known worldwide 35y after his death.",
                "Talk about sibling rivalry ...",
                "Never knew it was such an incestuous industry.",
                "There will never be another horse like Secretariat. His Belmont win? Are you kidding me: [“…Moving like a tremendous machine!”](https://youtu.be/AG_27cCW5bw?si=KYcDX_I6OHkOxF8d)",
                "Lexington in particular is an… interesting place. Even smaller (think standard ranch/bungalow/whatever), will have a horse or two. Obviously not EVERY home, but enough for you to notice the trend.",
                "Who’s that at the Door ?!!!!!\n\nhttps://youtu.be/bvlrvgus0Ww?si=1YVzGQh5-TYblQd6",
                "Weird. My recollection was that Secretariat was a terrible stud horse.  Maybe it was just the first generation.  He sired a lot but was not as successful as Northern Dancer.",
                "Citation rolling in his grave.",
                "They're going to do this with HorseRaceTesting. Fearsome Fate will be used to make the next generation"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Starbase: Elon Musk’s SpaceX launch site becomes an official Texas city",
            "external_url": "https://apnews.com/article/elon-musk-starbase-texas-city-7863bf3bac65e9718eef19b27978933b",
            "upvotes": 608,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "15 years from now:  How did a small Texas town became the largest Superfund site.",
                "How many weeks til employees are paid in scrip?",
                "https://en.wikipedia.org/wiki/Company_town \n\n[Sixteen Tons · Tennessee Ernie Ford](https://www.youtube.com/watch?v=BSvORvIjZiU)",
                "Company towns are back then. They were so great for everyone living in them last time. /s.",
                "Good, now let’s pack all of MAGA into Texas and Florida and pull a bugs bunny and saw along the state lines and send them seawarding.",
                "Didn't Republicans hate on Disney just last year or so because they ran a lot of services at their location that were normally done by the city, defacto making them their own city?",
                "And the seeds have been sown here in America. The techno-fascist oligarchs are one step closer to realizing their network states.",
                "Can’t wait for “Ketamine Days”!",
                "Guess we won't have to wait till mars to see what dystopian society musk has planned.",
                "What the absolute hell is that statue.  Does he have a mustache, or is his upper lip bulging out?  Why is he wearing a scarf and have a Glam Rock-esque paint streak under his eye?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 36518,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "I had discitis after spine surgery it was the most painful thing I have ever ever in my life ever expeirenced.  Not one doctor believed me they all said I was drug seeking and told me to go to rehab.  I got to the point the pain was so bad that I would pass out from going from a laying to a sitting position.  My 5th visit to emerg a doctor finally believed me.  I was admitted to hospital for 8 months, had to be on a picc line for 18 months with constant infusion of antibiotics.  Because I was not treated for 6 weeks the infection had gotten so bad it went from the surgical site at l4 all the way to my c7.  I could no longer walk and had to use a wheelchair for 2 years.  I had to have 80 k in renos to my house to accomodate a wheelchair.  It took me 2 years to go back to work and 10 years to be out of the wheelchair.  All because 3 different doctors including the surgeon all thought I was a pill head looking for opiates.",
                "The discrimination towards younger patients is honestly sad",
                "In Canada a friend of mine in her late 20s knew she was at risk of breast cancer but couldn't find any place that would give her a preventative mastectomy without also booking in expensive reconstructive surgery which she couldn't afford. She died from breast cancer a few years later.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 26697,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "Very sad story the cop wasn't even involved",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 6978,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "05/04/2025 20:09:06 UTC"
}