{
    "posts": [
        {
            "category": "HOT",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 8924,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He let 83 die of measles in Samoa. He doesn't care.",
                "The fuck's he gonna do? Find a heroin dealer?",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Second worst trip a Kennedy made to Texas",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated.",
                "Killer showing up to the scene of his crime is a real psychopath move"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 33061,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "Pulled up carrying $220k. Dies in custody. No one follows procedures for a death in custody. I wonder where that $ is now. I wonder if it was $220k or a lot lot more.",
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "1971, Ahmed Timol, anti-apartheid activist, \"died by suicide in police custody\" UNTIL they discovered the truth in 2017. He was tortured and then thrown out of the 10th floor. 72 others \"died in police custody\" stories and many others in the  regime of South Africa. Along with countless others in violently oppressive regimes across history and the planet. \n\n[NPR article ](https://www.npr.org/sections/thetwo-way/2017/10/12/557399388/four-decades-later-south-african-court-rules-that-activist-was-murdered)",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I was told nothing like this would happen.\nEdit: Turns out my grandmas full of shit huh"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 2803,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "How were they a threat behind and closed chain link fence?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 5898,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "I bought a special Harriet Tubman stamp and every time I get a 20 dollar bill, I stamp it over old Andrew Jackson.",
                "It was never about DEI, it was never about abortion, it was never about Christianity, and it was never about bathrooms.\n\nIt’s been about white supremacy all along.",
                "Nazi’s doing Nazi stuff, fantastic",
                "That's General Tubman to you. "
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 8788,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "who cares. f the ruzzan comrade",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 6203,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "White house strategy is to argue against anything other than total power to the president.",
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "Those admin officials do not have immunity.  Lock them the fuck up until they return the guy",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "We need to reestablish the separation of powers and the fact that no one is above the law or the Constitution. \n\nTrump and his goons all have to follow the law, period. \n\nAlso, Kilmar's family is doing a great job of drawing attention to this. The pictures and signs are very effective. I hope they've contacted the ACLU, Amnesty International, and UN because this is a human rights issue.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "THE ONLY reason they are fighting this is that if they return this guy - which they should, should never have happened - They might wind up having to return them all, because giving any of them ANY process can lead to DUE process."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 2884,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 29401,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "The GOP has wanted to privatize Social Security since Reagan.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 295,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "What about the penguins? Who is going to defend them? 😱",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 4078,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "Veterinarian here- theres been plenty of talk from many of my colleagues about abandoning the US for Canada or other countries. Hell, im getting close to pulling the trigger myself.",
                "Scientists leaving, doctors leaving, regulatory agencies being dismantled, students being detained at Customs and abducted off the streets. What’s so great about Trump’s America and why on earth did we choose him over Kamala?",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "This president SUCKS, all his scum-suckers SUCK, the assholes who voted for him SUCK and they're RUINING our country!! Yes I have the misfortune of being American and I'm EMBARRASSED and EXHAUSTED from the constant bad news that affects us and our friends all around the world.\n\nAnd I have a transplant kid at home who was born with a nasty rare disease, and I am terrified! They're gutting the FDA that keeps her safe, and the doctors are leaving- and I don't blame them one bit! Not angry at anyone who's leaving! We're not doctors or anyone important enough to be accepted into another country. My husband works hard as a systems engineer and I've been fortunate enough to be able to stay home and take care of our kids, which has been necessary with her disease. We've started growing our own food, because our food supply is not safe now. But we've just started and my green thumb is very pale. IDK how to protect her, or our son who has AuDHD. There's no country in the world who would take our family, and I can't blame them. But we didn't vote for this, and we'd be protesting if we could but we get every illness, and we have been sick from the latest GI bug this weekend.\n\nThere are 27,000 pediatric transplant patients in the United States. That's in addition to all of the other medical reasons to be immunocompromised, and the adult transplant patients. \n\nI want to scream from a mountain top. And my in-laws have been drinking the conspiracy Kool Aid for a long time, and they voted against our daughter's well-being. Not to mention a lot of other people's! It all makes me sick."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 43,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 295,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "What about the penguins? Who is going to defend them? 😱",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 2804,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "How were they a threat behind and closed chain link fence?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 8924,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He let 83 die of measles in Samoa. He doesn't care.",
                "The fuck's he gonna do? Find a heroin dealer?",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Second worst trip a Kennedy made to Texas",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated.",
                "Killer showing up to the scene of his crime is a real psychopath move"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Sports betting surge leads to rise in online harassment of elite college athletes",
            "external_url": "https://www.pbs.org/newshour/show/sports-betting-surge-leads-to-rise-in-online-harassment-of-elite-college-athletes",
            "upvotes": 835,
            "date": "04/06/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/04/underpressure-1024x683.jpg",
            "top_comments": [
                "hence the commercial \"dont bully athletes for losing\"\n\nbut let's avoid the real problem here",
                "It feels like every advertisement during sports is for gambling. \n\nAnd think about this, ESPN has a sports betting app, AND they have a betting TV show and they put their little pretty sports betting expert in pop up windows mid game to give their opinion on things to bet on…why would the house feed you winners ? Think about it. If their betting show experts were great at tips, the house would lose a ton of money…don’t listen to TV betting experts, they aren’t working for you, you don’t pay their bills…well, losing pays their pills so actually you do…better yet just don’t bet, cause in the long run you will lose, it’s why they run all those ads, and pay for those ads, cause it’s worth it to them to pay for ads.",
                "Who could have possibly foreseen this?!",
                "It was a surreal moment when I saw an article in The Economist arguing that increased gambling was actually a positive benefit for society.\n\nArticle link:\n\nhttps://www.economist.com/leaders/2024/12/05/americas-gambling-boom-should-be-celebrated-not-feared",
                "Colleges should try to encourage college athletes to stay off social media. It'll just mess with their heads and affect their game.",
                "Betting sites have become a cancer in Brazil specially after the legalization",
                "So the literal losers are ranting online, doing loser stuff? Got it.",
                "I would love athletes to get the @ of the CEOs and board members of all the sports betting sites and just tell the people mad at them to @ those people instead. \n\n\nYou know, the people that are creating and allowing their websites to target susceptible people and pressuring them into these situations.",
                "Sports gambling is more degenerate than basically anything.",
                "Relevant: https://m.youtube.com/watch?v=EJT0NMYHeGw&pp=ygUcU291dGhwYXJrIGRyaW5rIHJlc3BvbnNpYmx5IA%3D%3D"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 6203,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "White house strategy is to argue against anything other than total power to the president.",
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "Those admin officials do not have immunity.  Lock them the fuck up until they return the guy",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "We need to reestablish the separation of powers and the fact that no one is above the law or the Constitution. \n\nTrump and his goons all have to follow the law, period. \n\nAlso, Kilmar's family is doing a great job of drawing attention to this. The pictures and signs are very effective. I hope they've contacted the ACLU, Amnesty International, and UN because this is a human rights issue.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "THE ONLY reason they are fighting this is that if they return this guy - which they should, should never have happened - They might wind up having to return them all, because giving any of them ANY process can lead to DUE process."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 5902,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "I bought a special Harriet Tubman stamp and every time I get a 20 dollar bill, I stamp it over old Andrew Jackson.",
                "It was never about DEI, it was never about abortion, it was never about Christianity, and it was never about bathrooms.\n\nIt’s been about white supremacy all along.",
                "Nazi’s doing Nazi stuff, fantastic",
                "That's General Tubman to you. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 2888,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 33054,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "Pulled up carrying $220k. Dies in custody. No one follows procedures for a death in custody. I wonder where that $ is now. I wonder if it was $220k or a lot lot more.",
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "1971, Ahmed Timol, anti-apartheid activist, \"died by suicide in police custody\" UNTIL they discovered the truth in 2017. He was tortured and then thrown out of the 10th floor. 72 others \"died in police custody\" stories and many others in the  regime of South Africa. Along with countless others in violently oppressive regimes across history and the planet. \n\n[NPR article ](https://www.npr.org/sections/thetwo-way/2017/10/12/557399388/four-decades-later-south-african-court-rules-that-activist-was-murdered)",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I was told nothing like this would happen.\nEdit: Turns out my grandmas full of shit huh"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 8790,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "who cares. f the ruzzan comrade",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 297,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "What about the penguins? Who is going to defend them? 😱",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 5902,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "I bought a special Harriet Tubman stamp and every time I get a 20 dollar bill, I stamp it over old Andrew Jackson.",
                "It was never about DEI, it was never about abortion, it was never about Christianity, and it was never about bathrooms.\n\nIt’s been about white supremacy all along.",
                "Nazi’s doing Nazi stuff, fantastic",
                "That's General Tubman to you. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 2801,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "How were they a threat behind and closed chain link fence?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 8932,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He let 83 die of measles in Samoa. He doesn't care.",
                "The fuck's he gonna do? Find a heroin dealer?",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Second worst trip a Kennedy made to Texas",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated.",
                "Killer showing up to the scene of his crime is a real psychopath move"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Sports betting surge leads to rise in online harassment of elite college athletes",
            "external_url": "https://www.pbs.org/newshour/show/sports-betting-surge-leads-to-rise-in-online-harassment-of-elite-college-athletes",
            "upvotes": 837,
            "date": "04/06/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/04/underpressure-1024x683.jpg",
            "top_comments": [
                "hence the commercial \"dont bully athletes for losing\"\n\nbut let's avoid the real problem here",
                "It feels like every advertisement during sports is for gambling. \n\nAnd think about this, ESPN has a sports betting app, AND they have a betting TV show and they put their little pretty sports betting expert in pop up windows mid game to give their opinion on things to bet on…why would the house feed you winners ? Think about it. If their betting show experts were great at tips, the house would lose a ton of money…don’t listen to TV betting experts, they aren’t working for you, you don’t pay their bills…well, losing pays their pills so actually you do…better yet just don’t bet, cause in the long run you will lose, it’s why they run all those ads, and pay for those ads, cause it’s worth it to them to pay for ads.",
                "Who could have possibly foreseen this?!",
                "It was a surreal moment when I saw an article in The Economist arguing that increased gambling was actually a positive benefit for society.\n\nArticle link:\n\nhttps://www.economist.com/leaders/2024/12/05/americas-gambling-boom-should-be-celebrated-not-feared",
                "Colleges should try to encourage college athletes to stay off social media. It'll just mess with their heads and affect their game.",
                "Betting sites have become a cancer in Brazil specially after the legalization",
                "So the literal losers are ranting online, doing loser stuff? Got it.",
                "I would love athletes to get the @ of the CEOs and board members of all the sports betting sites and just tell the people mad at them to @ those people instead. \n\n\nYou know, the people that are creating and allowing their websites to target susceptible people and pressuring them into these situations.",
                "Sports gambling is more degenerate than basically anything.",
                "Relevant: https://m.youtube.com/watch?v=EJT0NMYHeGw&pp=ygUcU291dGhwYXJrIGRyaW5rIHJlc3BvbnNpYmx5IA%3D%3D"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 33060,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "Pulled up carrying $220k. Dies in custody. No one follows procedures for a death in custody. I wonder where that $ is now. I wonder if it was $220k or a lot lot more.",
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "1971, Ahmed Timol, anti-apartheid activist, \"died by suicide in police custody\" UNTIL they discovered the truth in 2017. He was tortured and then thrown out of the 10th floor. 72 others \"died in police custody\" stories and many others in the  regime of South Africa. Along with countless others in violently oppressive regimes across history and the planet. \n\n[NPR article ](https://www.npr.org/sections/thetwo-way/2017/10/12/557399388/four-decades-later-south-african-court-rules-that-activist-was-murdered)",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I was told nothing like this would happen.\nEdit: Turns out my grandmas full of shit huh"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 8794,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "who cares. f the ruzzan comrade",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 6197,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "White house strategy is to argue against anything other than total power to the president.",
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "Those admin officials do not have immunity.  Lock them the fuck up until they return the guy",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "We need to reestablish the separation of powers and the fact that no one is above the law or the Constitution. \n\nTrump and his goons all have to follow the law, period. \n\nAlso, Kilmar's family is doing a great job of drawing attention to this. The pictures and signs are very effective. I hope they've contacted the ACLU, Amnesty International, and UN because this is a human rights issue.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "THE ONLY reason they are fighting this is that if they return this guy - which they should, should never have happened - They might wind up having to return them all, because giving any of them ANY process can lead to DUE process."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 2894,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 29394,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "The GOP has wanted to privatize Social Security since Reagan.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "I am looking foreword to my grandparents who voted trump to bemoan their missing social security payments"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/07/2025 08:13:02 UTC"
}