{
    "posts": [
        {
            "category": "HOT",
            "title": "Dollar General warns low-income Americans’ finances are getting worse",
            "external_url": "https://www.cnn.com/2025/03/13/business/dollar-general-shoppers-inflation/index.html",
            "upvotes": 5642,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1827147996-20250313141452450.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I grew up poor in the 80s, it must be frickin ruthless now.\n\nEdit: if my wife didn’t take care of me I’d be on the street. I’m a very lucky disabled person. Imagine making it in America on 800 bucks a month. It’s bonkers.",
                "Dollar General is part of the problem.\n\n> True, the chain pays its workers industry-low wages in under-staffed stores that can be magnets for armed burglary. And yes, Dollar Store management targets economically struggling communities, focusing on customers who make less than $40,000 a year and visit the store multiple times a week. “The economy is continuing to create more of our core customer,” CEO Todd Vasos said in 2018.\n\n> But to those working class consumers, Dollar General promises to deliver “everyday low prices.” \n\n> In reality, without knowing it, customers are often paying Whole Foods prices for dollar store groceries. \n\n\nhttps://perfectunion.us/dollar-general-prices/",
                "In the 1960s, the gov't launched a War on Poverty. Today, it's fighting against the poor.",
                "To be fair, Dollar General giving people a bad price/unit because they can’t afford to buy the standard bulk sizes doesn’t help, but I digress.",
                "All while paying poverty wages and cutting hours so bad it's really not worth working for them",
                "Because they are paying more for less at dollar general.",
                "The phrasing of that headline reads like Dollar General has a sign on the door saying \"Just a heads up y'all bitches getting poorer everyday out here!\"",
                "So they’re thrilled to swoop in to open thousands more stores?\n\nYa that’s the ticket",
                "People who have never been poor will never understand how stressful it is. Wish Republicans could even experience one day of what’s it like, have they ever came home from a school day to their power shut off even though your dad works 12 hour days+ in Alabama heat? That’s just one thing that can happen. It’s not for the weak. (I’m luckily an adult and in a much better situation now, but once you live through it your perspective changes forever).",
                "Dollar general says people they're exploiting have less money for them to take."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "USA asks Sweden for help in the egg crisis | Sweden Herald",
            "external_url": "https://swedenherald.com/article/usa-asks-denmark-for-help-in-the-egg-crisis",
            "upvotes": 3140,
            "date": "03/14/2025",
            "thumbnail": "https://static.swedenherald.com/d80b1181-68fe-46d7-8b7d-72128945bffa/d80b1181-68fe-46d7-8b7d-72128945bffa.jpg",
            "top_comments": [
                "If only they had a long time ally that's right beside them",
                "It seems like we might want a fully funded USDA, FDA, and CDC to fight avian flu. Ooh, I bet if we stop tracking numbers at all, we can claim that we're avian flu free!",
                "LOL\n\nAnd here's the thing with allies....when you keep actively trying to break up your alliances then you know what kind of answer is coming your way in a time of need.\n\nPersonally I hope Sweden asks the US to sign a rare earth mineral agreement before they hand over any fuking eggs.",
                "Audacity is the only word that comes to mind.\n\nYou want help, be a partner, not an adversary.",
                "> I don't think we will export. We also have an egg shortage in Europe and there we already have export channels we use. So it's rather that we export within Europe.\n\nA polite phrasing for they will export to long standing allies that haven't given them the finger. It's almost like us pissing everyone off has consequences.",
                "If the USA is struggling so much, maybe they should become a territory of a government that knows what they're doing? Denmark perhaps?",
                "Alrticle says Denmark. Why does post title says Sweden?",
                "Canada has plenty of eggs if you get on your knees and beg for forgiveness\n\n\n\nThen we will just say no",
                "I guess we don’t have the cards do we",
                "American conservatives are so unbelievably stupid. They screamed relentlessly about eggs all throughout the entire campaign of 2024. They screamed and cried every fucking day about egg prices. It became their entire personality and this bullshit platform that everyone knew was bullshit. They pretended that Joe Biden had a dial in the oval office that controlled egg prices along with gas prices. They had photoshoots in front of egg displays and grocery stores. At one point, Trump even claimed to have invented the word \"groceries\" and his cult ate it up. They loved making eggs their entire World.\n\nAnd now they all scream about how they don't need anything from anyone; muh independence....except eggs; and to shut up about egg prices.\n\nI'm so tired of this country. And I'm so tired of being surrounded by such sheer abundant stupidity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Newsmax agrees to pay $40m to settle defamation suit over false election claims",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/14/newsmax-smartmatic-settlement",
            "upvotes": 1249,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d293af4fb1c73e4056d80f11cbdb2cbc79938dc6/0_256_7689_4613/master/7689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b5e81cd116b62569b1e434137003bb",
            "top_comments": [
                "In case no one read past the headline, Newsmax is paying $40m to the voting machine maker Smartmatics.\n\nNewsmax claimed the election machines were compromised. Smartmatics sued for defamation. Newsmax lost the suit.\n\nThis is not the same as ABC/NBC paying Trump to settle their suit.",
                "So now both Fox News and also NewsMax have each had to pay millions of dollars for lying about the election. \n\nAnd conservatives still call every other station fake news",
                "After whatever Elon paid for the white house, this is the 2nd best deal of decade.",
                "Sounds like they got off awfully cheap to me.",
                "Is $40 mill significant or just a drop in the bucket?\n\nWhat's the precedent?",
                "Newsmax Breaking: Left-Wing Extremist Guardian Falsely Claims Newsmax Settled Lawsuit",
                "$40m seems about right as damages to Smartmatics. That's not nearly enough as damages to the USA.",
                "Wild how not one single \"election fraud\" claim has been prove true time and time again, with millions of dollars and man hours wasted on this bullshit, and yet your average Republican still can't admit it. \n\nSorry, not \"wild\", completely predictable and expected from my \"fiscally responsibility\" and \"personal responsibility\" friends.  Whatever it takes to appease god king Trump, eh?",
                "That’s it? Should have been way more.",
                "They aren’t news.  They are propaganda.  On top of the $40 million, they should be ordered to remove “News”from their company name"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "US consumer sentiment deteriorates sharply in March",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-deteriorates-sharply-march-2025-03-14/",
            "upvotes": 1300,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strangely enough, my job being threatened by illegal NIH grant cuts has triggered me to stop spending money and hoard cash.\n\nThat $30k I had pegged to remodel my bathroom would be churning into the economy if not for that.",
                "It’s almost like when the world is completely unpredictable and positions change by the second people are not able to plan for the future and are less likely to spend money outside of absolute needs. And it’s almost like when an economy is built entirely on the spending of its consumers and the confidence in systems that uncertainties hurt the whole economy.",
                "If the government won’t govern why should consumers consume?",
                "Trump and his administration has done nothing but harm to our country and certainly has not done anything good or beneficial. Unnecessary spending is completely off the table for the foreseeable future in our house.",
                "I am getting dizzy from all that winning....",
                "Yeah, levying sudden heavy federal sales taxes will do that. ",
                "Don’t underestimate how bad this is. \n\nYou can look at the historic data series, but once consumer sentiment falls, it takes a long time to get back to normal.\n\nAnd in an era where price signals, recession signals, and uncertainty signals are flashing, this could worsen an economic downturn.\n\nSource: economist.",
                "It’s almost like a blatant and mediocre conman is POTUS",
                "It's like you guys put a fucking traitor in the white house",
                "Can't risk egregious spending right now. For all I know we're gonna be back to fighting in the Thunderdome for toilet paper any moment."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 4641,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "The largest pork processor in the US is Smithfield and they're Chinese owned.  I wonder how that'll work.",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "So, China just need to do nothing (not renew export licences) and “...$US3 billion ($A4.77B) worth of beef, pork and poultry no longer eligible to export to China.”.  That is just so low effort with highly effective impact.  Maybe, other countries that are affected by the U.S. tariffs need to look at this as a tactic to defend their economy.",
                "Good for China. The US gets what it voted for.",
                "So much winning, non stop winning. The voters must be so proud",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "China gets a lot of it's good import meat from New Zealand and Australia anyways. This won't affect anyone but America.",
                "Looks like American decisions in the ballot box have consequences..."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Fierce protests as eight-year-old rape victim dies in Bangladesh",
            "external_url": "https://www.bbc.com/news/articles/ce30k9g6x2eo",
            "upvotes": 921,
            "date": "03/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1897/live/ebd12f00-0094-11f0-93cc-fd4e777d3e70.jpg",
            "top_comments": [
                "Horrific \n\nwtf is wrong with people",
                "Her heart stopped 3 times, and on the third time they couldn’t bring her back.\n\nAs if the rape of an 8-year-old wasn’t bad enough, what on Earth did they do to her to cause that much damage to her heart?!\n\nThere is a special place in hell for people that do this sort of thing.",
                "She was just a little kid visiting her big sister. Jesus. \n\nI am so tired of the horrors we inflict on one another.",
                "Humanity is a mistake.",
                "When you smother a country in a religion that respects nothing but male dominance, this is what you get.",
                "At least their home was burnt down.  There is a lot to be desired in how Asian countries handle sexual assault and women’s rights.",
                "[removed]"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "Influencer who snatched baby wombat leaves Australia",
            "external_url": "https://www.abc.net.au/news/2025-03-14/sam-jones-baby-wombat-video-leaves-australia/105051630",
            "upvotes": 2643,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/cfd3459afa4febabed3f2ab124a7eb6c?impolicy=wcms_watermark_news&cropH=336&cropW=597&xPos=0&yPos=45&width=862&height=485&imformat=generic",
            "top_comments": [
                "*On her profile, she describes herself as a \"wildlife biologist and environmental scientist\", an \"outdoor enthusiast\" and a hunter*.\n\nthe only thing i believe is the hunter part",
                "Can we stop calling them Influencers and just refer to them as attention seeking idiots?",
                "These influencers should be banned from having any form of social media etc when they pull shit like this. That’s the only way to stop them doing shit for attention.",
                "Insert Australian Northern Territory tourism slogan here.",
                "should not have been allowed to leave the country without paying some sort of fine imo",
                "She went from something like 2k followers to almost 100k. Thats completely gross. She got exactly what she wanted.",
                "Influencer who snatched baby wombat *flees* Australia",
                "Nothing but ignorance.  Imagine gaining notoriety through lack of decency and pure stupidity.",
                "Whenever someone is described as an “influencer”, my respect for them automatically goes down by like 95%",
                "Can we not allow her back in the US?"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 9225,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "Because they're making shit up.",
                "Conservatives: The rules were you weren't going to fact-check!",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "The don't know what malfeasance means so ...",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "Don: \"Your honor, climate change is a hoax. Therefore all money spent on fighting it is malfeasance. My evidence is Fox News. You got to stop spending money on making frogs gay, I got that from Alex Jones... that's what the EPA is really doing, finding ways to make frogs gay so they can put it in our drinking water.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 34390,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "If they say “yes” to him, Then the constitution no longer matters.",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "Just so everyone is aware, if you look up [the 14th amendment, the very first sentence is](https://constitution.congress.gov/constitution/amendment-14/):\n\n> **All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.** No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n\nIt does not get any clearer than that. If this is anything except a unanimous \"go fuck yourself\", we've got a (yet another) constitutional crisis on our hands.",
                "He’s only a generation removed from birthright citizenship. What a crock of shit.",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "America’s automakers aren’t rushing to move production to US factories to avoid tariffs",
            "external_url": "https://www.cnn.com/business/automakers-tariffs-new-us-plants/index.html",
            "upvotes": 588,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-04t175159z-2098714084-rc2h6daud9v7-rtrmadp-3-usa-trump-tariffs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I remember when Ford promised to move production factories to the US right after Trump negotiated and signed the USMCA.   A few months later Ford moved more jobs to mexico.   \n   \nOf course they aren’t going to build plants in the US.  Tariffs are turned on and off by the hour, it takes longer than that to build one.",
                "People that think tariffs will change manufacturing locations think you can spin up a factory in a few weeks, lol",
                "By the time any new manufacturing plant would be up and running, the orange clown would have ended his current term.",
                "It takes ages to spin up a new factory. Why would they change their plans suddenly when in four years policy might dramatically change again?",
                "It will take longer than four years to move manufacturing home, and the next administration could just change everything again.",
                "I used to work supplying automotive and their supply networks are vast and complicated. Even if they move the plants to the US (which is costly and there's good economic reason they have plants in Canada and Mexico) they'd then have to entirely rebuild their supply networks to get all the parts and materials they need. It's impossible to divorce the US auto industry from the Canadian and Mexican auto industries. ",
                "They can’t move manufacturing overnight, and they definitely won’t be moving it as long as we keep having these month to month tariff adjustments. As long as these companies don’t know what the tariff situation is going to look like in the long term, they’re just going to pay the import tax and raise prices.\n\nIf you want to move manufacturing back to the US the best way would be to announce tariffs that are set to take effect in 6 months to a year, and in the meantime give a strong incentive (likely through some kind of tax break or rebate) to open manufacturing facilities in the US, and offer another tax break for consumers who purchase cars manufactured in the US. Companies would be more inclined to relocate plants if they know what the future looks like, and if it looks like future profits would benefit from manufacturing in the US.",
                "The ironic thing is all the Euro, Japanese, and Korean plants are in the US for the US market but the domestic brands outsource. If you want to buy made in America, don’t buy an American car brand.",
                "Leave factories where they are, pass on tariff costs to customers. Then (if it would be cheaper for you) move factories into the US to eliminate the tariff impact, but leave the tariff pricing customers are now used to in place. Profit.",
                "Trump is erratic and unreliable. Auto makers can’t make decisions like those based on the daily dose of chaos Trump creates."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Arlington Cemetery website drops links for Black, Hispanic, and women veterans",
            "external_url": "https://taskandpurpose.com/news/arlington-cemetery-scrubs-website-dei/",
            "upvotes": 44,
            "date": "03/14/2025",
            "thumbnail": "https://taskandpurpose.com/wp-content/uploads/2025/03/Versace-Arlington.jpg",
            "top_comments": [
                "Post this under malicious compliance.",
                "Once the military is the racist and misogynistic cesspool that they are striving for I wonder what their recruiting plans are.",
                "That’s what MAGA wants. A place where only European-Americans are celebrated",
                "Governing with scientific ignorance, religious bigotry, misogyny, patriarchy, homophobia, transphobia, xenophobia, and racism.",
                "arlington cemetery is dead to me",
                "What a fucking disgrace... albeit just another on the ever growing pile at this point.",
                "What about the special women veterans building? I wondered if Trump would close it.?",
                "Whitewashing national information. Fantastic."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Passengers on an American Airlines flight were evacuated on to the tarmac of an airport in Colorado as a fire broke out on the plane, sending smoke billowing into the air.",
            "external_url": "https://www.bbc.com/news/articles/c981j6e34wwo",
            "upvotes": 29,
            "date": "03/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4621/live/8f404bc0-0073-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Isn't the wing where all the fuel is. I'd be gettin off that wing asap. ",
                "“Footage of the evacuation showed passengers huddled on the wing of the Boeing airliner, some holding bags, with flames burning near the bottom of the plane.\nThere were no reports of serious injuries, although the airport later confirmed 12 people were taken to hospital for minor injuries.”\n\nI’ve never been afraid of flying but I think I’ll ground myself for a while.",
                " Boeing…….is that you again…….",
                "“Passengers with bags” -no idea of self preservation.",
                "Anytime I see news about a plane crash or similar, I always assume that it is American or United. And I'm right 80% of the time. They cut corners everywhere. I only fly Delta, regardless of cost."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Mark Carney sworn in as Canada’s PM after Trudeau steps down",
            "external_url": "https://www.cnn.com/2025/03/14/americas/canada-carney-prime-minister-trudeau-resigns-intl-latam?Date=20250314&Profile=cnnbrk&utm_content=1741967012&utm_medium=social&utm_source=twitter",
            "upvotes": 190,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-09t233949z-1493832281-rc2s9daeyq4b-rtrmadp-3-canada-politics.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Trudeau may have not been great for Canada for a while domestically \n\nBut I really think he stepped up against Trump in the last few months in a way few others did \n\nHope the new guy is as resolute",
                "Trudeau seemingly got a lot of shit from Canadians for his domestic policies, but dude was a masterclass in Canadian international relations. Gonna miss seeing him on the news representing Canada.",
                "Prime Minister Mark Carney is an extremely well educated and experienced man. I am wishing him the most success in steering our Country down the right path in these uncertain times.\n\nLong Live Canada 🇨🇦",
                "I really hope Mark is the answer we have been looking for. Too many people in politics don’t understand the real world. This guy seems to get it.",
                "Finally.  A Carney to manage the Trump circus.",
                "Finally, an expert who actually knows things running the show.",
                "I’ve never liked carneys. Small hands… smell like cabbage."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Towering Wyoming statesman Alan Simpson dies at 93",
            "external_url": "https://wyofile.com/towering-wyoming-statesman-alan-simpson-dies-at-93/",
            "upvotes": 9,
            "date": "03/14/2025",
            "thumbnail": "https://wyofile.com/wp-content/uploads/2023/08/SimpsonMedalofHonor.jpeg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Newsmax agrees to pay $40m to settle defamation suit over false election claims",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/14/newsmax-smartmatic-settlement",
            "upvotes": 1242,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d293af4fb1c73e4056d80f11cbdb2cbc79938dc6/0_256_7689_4613/master/7689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b5e81cd116b62569b1e434137003bb",
            "top_comments": [
                "In case no one read past the headline, Newsmax is paying $40m to the voting machine maker Smartmatics.\n\nNewsmax claimed the election machines were compromised. Smartmatics sued for defamation. Newsmax lost the suit.\n\nThis is not the same as ABC/NBC paying Trump to settle their suit.",
                "So now both Fox News and also NewsMax have each had to pay millions of dollars for lying about the election. \n\nAnd conservatives still call every other station fake news",
                "After whatever Elon paid for the white house, this is the 2nd best deal of decade.",
                "Sounds like they got off awfully cheap to me.",
                "Is $40 mill significant or just a drop in the bucket?\n\nWhat's the precedent?",
                "Newsmax Breaking: Left-Wing Extremist Guardian Falsely Claims Newsmax Settled Lawsuit",
                "$40m seems about right as damages to Smartmatics. That's not nearly enough as damages to the USA.",
                "Wild how not one single \"election fraud\" claim has been prove true time and time again, with millions of dollars and man hours wasted on this bullshit, and yet your average Republican still can't admit it. \n\nSorry, not \"wild\", completely predictable and expected from my \"fiscally responsibility\" and \"personal responsibility\" friends.  Whatever it takes to appease god king Trump, eh?",
                "That’s it? Should have been way more.",
                "They aren’t news.  They are propaganda.  On top of the $40 million, they should be ordered to remove “News”from their company name"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "USA asks Sweden for help in the egg crisis | Sweden Herald",
            "external_url": "https://swedenherald.com/article/usa-asks-denmark-for-help-in-the-egg-crisis",
            "upvotes": 3146,
            "date": "03/14/2025",
            "thumbnail": "https://static.swedenherald.com/d80b1181-68fe-46d7-8b7d-72128945bffa/d80b1181-68fe-46d7-8b7d-72128945bffa.jpg",
            "top_comments": [
                "If only they had a long time ally that's right beside them",
                "It seems like we might want a fully funded USDA, FDA, and CDC to fight avian flu. Ooh, I bet if we stop tracking numbers at all, we can claim that we're avian flu free!",
                "LOL\n\nAnd here's the thing with allies....when you keep actively trying to break up your alliances then you know what kind of answer is coming your way in a time of need.\n\nPersonally I hope Sweden asks the US to sign a rare earth mineral agreement before they hand over any fuking eggs.",
                "Audacity is the only word that comes to mind.\n\nYou want help, be a partner, not an adversary.",
                "> I don't think we will export. We also have an egg shortage in Europe and there we already have export channels we use. So it's rather that we export within Europe.\n\nA polite phrasing for they will export to long standing allies that haven't given them the finger. It's almost like us pissing everyone off has consequences.",
                "If the USA is struggling so much, maybe they should become a territory of a government that knows what they're doing? Denmark perhaps?",
                "Alrticle says Denmark. Why does post title says Sweden?",
                "Canada has plenty of eggs if you get on your knees and beg for forgiveness\n\n\n\nThen we will just say no",
                "I guess we don’t have the cards do we",
                "American conservatives are so unbelievably stupid. They screamed relentlessly about eggs all throughout the entire campaign of 2024. They screamed and cried every fucking day about egg prices. It became their entire personality and this bullshit platform that everyone knew was bullshit. They pretended that Joe Biden had a dial in the oval office that controlled egg prices along with gas prices. They had photoshoots in front of egg displays and grocery stores. At one point, Trump even claimed to have invented the word \"groceries\" and his cult ate it up. They loved making eggs their entire World.\n\nAnd now they all scream about how they don't need anything from anyone; muh independence....except eggs; and to shut up about egg prices.\n\nI'm so tired of this country. And I'm so tired of being surrounded by such sheer abundant stupidity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Armenia and Azerbaijan agree to peace treaty after nearly four decades of war",
            "external_url": "https://www.cnn.com/2025/03/13/europe/armenia-and-azerbaijan-peace-agreement-conditions-intl-latam/index.html",
            "upvotes": 280,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1683926061.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's still sad that Azerbaijan managed to ethnically cleanse the Armenians of Nagorno-Karabakh.\n\n Almost no one knows about this because just 1 week later the Israel-Hamas war started, taking everyone's attention completely off of this conflict.",
                "The article doesn't state the reason for the diplomatic breakthrough after so many decades, but it seems to be a result of both Azerbaijan retaking Nagorno-Karabakh, and I'd assume Russian imperialism. It's probably best to settle your border disputes in order to focus on bigger picture threats.",
                "Inb4 trump takes credit",
                "“Now that we’ve ethnically cleansed your enclaves, let’s call it a draw.”",
                "It says nearly 4 decades… people have had enough time to know about it. If it’s not Israel or Ukraine, nobody gives a shit.",
                "I visited both countries a couple of months ago - loved them both, nice people. Except for that corrupt cop in Baku.\n\nI have a YouTube with same name as my Reddit, if anyone’s interested. I’m a nomad that’s been to 40 countries.",
                "How will trump take credit for this…",
                "What a disgusting shame on europe that conflict has been.\n\nAzerbaijan has essentially been allowed to genocide Armenians, publically and proudly, and nothing was done.\n\nWe should have nuked Baku long ago."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US consumer sentiment deteriorates sharply in March",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-deteriorates-sharply-march-2025-03-14/",
            "upvotes": 1300,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strangely enough, my job being threatened by illegal NIH grant cuts has triggered me to stop spending money and hoard cash.\n\nThat $30k I had pegged to remodel my bathroom would be churning into the economy if not for that.",
                "It’s almost like when the world is completely unpredictable and positions change by the second people are not able to plan for the future and are less likely to spend money outside of absolute needs. And it’s almost like when an economy is built entirely on the spending of its consumers and the confidence in systems that uncertainties hurt the whole economy.",
                "If the government won’t govern why should consumers consume?",
                "Trump and his administration has done nothing but harm to our country and certainly has not done anything good or beneficial. Unnecessary spending is completely off the table for the foreseeable future in our house.",
                "I am getting dizzy from all that winning....",
                "Yeah, levying sudden heavy federal sales taxes will do that. ",
                "Don’t underestimate how bad this is. \n\nYou can look at the historic data series, but once consumer sentiment falls, it takes a long time to get back to normal.\n\nAnd in an era where price signals, recession signals, and uncertainty signals are flashing, this could worsen an economic downturn.\n\nSource: economist.",
                "It’s almost like a blatant and mediocre conman is POTUS",
                "It's like you guys put a fucking traitor in the white house",
                "Can't risk egregious spending right now. For all I know we're gonna be back to fighting in the Thunderdome for toilet paper any moment."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Dollar General warns low-income Americans’ finances are getting worse",
            "external_url": "https://www.cnn.com/2025/03/13/business/dollar-general-shoppers-inflation/index.html",
            "upvotes": 5659,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1827147996-20250313141452450.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I grew up poor in the 80s, it must be frickin ruthless now.\n\nEdit: if my wife didn’t take care of me I’d be on the street. I’m a very lucky disabled person. Imagine making it in America on 800 bucks a month. It’s bonkers.",
                "Dollar General is part of the problem.\n\n> True, the chain pays its workers industry-low wages in under-staffed stores that can be magnets for armed burglary. And yes, Dollar Store management targets economically struggling communities, focusing on customers who make less than $40,000 a year and visit the store multiple times a week. “The economy is continuing to create more of our core customer,” CEO Todd Vasos said in 2018.\n\n> But to those working class consumers, Dollar General promises to deliver “everyday low prices.” \n\n> In reality, without knowing it, customers are often paying Whole Foods prices for dollar store groceries. \n\n\nhttps://perfectunion.us/dollar-general-prices/",
                "In the 1960s, the gov't launched a War on Poverty. Today, it's fighting against the poor.",
                "To be fair, Dollar General giving people a bad price/unit because they can’t afford to buy the standard bulk sizes doesn’t help, but I digress.",
                "All while paying poverty wages and cutting hours so bad it's really not worth working for them",
                "Because they are paying more for less at dollar general.",
                "The phrasing of that headline reads like Dollar General has a sign on the door saying \"Just a heads up y'all bitches getting poorer everyday out here!\"",
                "So they’re thrilled to swoop in to open thousands more stores?\n\nYa that’s the ticket",
                "People who have never been poor will never understand how stressful it is. Wish Republicans could even experience one day of what’s it like, have they ever came home from a school day to their power shut off even though your dad works 12 hour days+ in Alabama heat? That’s just one thing that can happen. It’s not for the weak. (I’m luckily an adult and in a much better situation now, but once you live through it your perspective changes forever).",
                "Dollar general says people they're exploiting have less money for them to take."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Tariffs raising U.S. steel, aluminum prices on Kentucky businesses",
            "external_url": "https://www.lpm.org/news/2025-03-14/tariffs-raising-u-s-steel-aluminum-prices-on-kentucky-businesses",
            "upvotes": 192,
            "date": "03/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/1ebade9/2147483647/strip/true/crop/5366x2817+0+255/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F42%2Ff7%2F38fb2eff41b9b3a6c742c87ddb2a%2Fjmh3571-2.jpg",
            "top_comments": [
                "Welp, Kentucky voted overwhelmingly for trump (nearly 65%) so they must love this.\n\nSpeaking of KY, the red states might to wanna squirrel some away - cause that orange clown is gonna screw them hard",
                ">Clark Packard, a researcher at the Cato Institute says the answer is pretty simple: U.S. metal makers are raising prices because they can.\n\n>”It ultimately comes down to competition, right?” Packard said. “By raising prices of foreign steel and aluminum through tariffs, domestic producers are given a sort of green light to raise their own prices.”\n\nSomething something free market something something capitalism blah blah MAKE AMERICA GREAT AGAIN",
                "Why doesn't Kentucky vote him out?\n\nThey don't mind prices as long as it owns the libs?\n\nYour business will go under and they're proud they voted Trump?\n\nLook at their bourbon",
                "Thanks for fucking the rest of us while you fucked yourself, Kentucky.",
                "Evidently, the fine people of Kentucky did not, in fact, get tired of winning, and are anxious for another round of owning the Libs.",
                "Well well well, if it isn't the consequences of your actions, KY.",
                "Here comes red states begging for blue state money.",
                "All while liquor sales plummet. \nGood thing nobody lives there, I guess 🤭",
                "It's ok, they wanted this.",
                "You made your shit sandwich, you eat your shit sandwich."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Newsmax agrees to pay $40m to settle defamation suit over false election claims",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/14/newsmax-smartmatic-settlement",
            "upvotes": 1246,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d293af4fb1c73e4056d80f11cbdb2cbc79938dc6/0_256_7689_4613/master/7689.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=63b5e81cd116b62569b1e434137003bb",
            "top_comments": [
                "In case no one read past the headline, Newsmax is paying $40m to the voting machine maker Smartmatics.\n\nNewsmax claimed the election machines were compromised. Smartmatics sued for defamation. Newsmax lost the suit.\n\nThis is not the same as ABC/NBC paying Trump to settle their suit.",
                "So now both Fox News and also NewsMax have each had to pay millions of dollars for lying about the election. \n\nAnd conservatives still call every other station fake news",
                "After whatever Elon paid for the white house, this is the 2nd best deal of decade.",
                "Sounds like they got off awfully cheap to me.",
                "Is $40 mill significant or just a drop in the bucket?\n\nWhat's the precedent?",
                "Newsmax Breaking: Left-Wing Extremist Guardian Falsely Claims Newsmax Settled Lawsuit",
                "$40m seems about right as damages to Smartmatics. That's not nearly enough as damages to the USA.",
                "Wild how not one single \"election fraud\" claim has been prove true time and time again, with millions of dollars and man hours wasted on this bullshit, and yet your average Republican still can't admit it. \n\nSorry, not \"wild\", completely predictable and expected from my \"fiscally responsibility\" and \"personal responsibility\" friends.  Whatever it takes to appease god king Trump, eh?",
                "That’s it? Should have been way more.",
                "They aren’t news.  They are propaganda.  On top of the $40 million, they should be ordered to remove “News”from their company name"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Mark Carney sworn in as Canada’s PM after Trudeau steps down",
            "external_url": "https://www.cnn.com/2025/03/14/americas/canada-carney-prime-minister-trudeau-resigns-intl-latam?Date=20250314&Profile=cnnbrk&utm_content=1741967012&utm_medium=social&utm_source=twitter",
            "upvotes": 198,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-09t233949z-1493832281-rc2s9daeyq4b-rtrmadp-3-canada-politics.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Trudeau may have not been great for Canada for a while domestically \n\nBut I really think he stepped up against Trump in the last few months in a way few others did \n\nHope the new guy is as resolute",
                "Trudeau seemingly got a lot of shit from Canadians for his domestic policies, but dude was a masterclass in Canadian international relations. Gonna miss seeing him on the news representing Canada.",
                "Prime Minister Mark Carney is an extremely well educated and experienced man. I am wishing him the most success in steering our Country down the right path in these uncertain times.\n\nLong Live Canada 🇨🇦",
                "I really hope Mark is the answer we have been looking for. Too many people in politics don’t understand the real world. This guy seems to get it.",
                "Finally.  A Carney to manage the Trump circus.",
                "Finally, an expert who actually knows things running the show.",
                "I’ve never liked carneys. Small hands… smell like cabbage."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Dollar General warns low-income Americans’ finances are getting worse",
            "external_url": "https://www.cnn.com/2025/03/13/business/dollar-general-shoppers-inflation/index.html",
            "upvotes": 5656,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1827147996-20250313141452450.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I grew up poor in the 80s, it must be frickin ruthless now.\n\nEdit: if my wife didn’t take care of me I’d be on the street. I’m a very lucky disabled person. Imagine making it in America on 800 bucks a month. It’s bonkers.",
                "Dollar General is part of the problem.\n\n> True, the chain pays its workers industry-low wages in under-staffed stores that can be magnets for armed burglary. And yes, Dollar Store management targets economically struggling communities, focusing on customers who make less than $40,000 a year and visit the store multiple times a week. “The economy is continuing to create more of our core customer,” CEO Todd Vasos said in 2018.\n\n> But to those working class consumers, Dollar General promises to deliver “everyday low prices.” \n\n> In reality, without knowing it, customers are often paying Whole Foods prices for dollar store groceries. \n\n\nhttps://perfectunion.us/dollar-general-prices/",
                "In the 1960s, the gov't launched a War on Poverty. Today, it's fighting against the poor.",
                "To be fair, Dollar General giving people a bad price/unit because they can’t afford to buy the standard bulk sizes doesn’t help, but I digress.",
                "All while paying poverty wages and cutting hours so bad it's really not worth working for them",
                "Because they are paying more for less at dollar general.",
                "The phrasing of that headline reads like Dollar General has a sign on the door saying \"Just a heads up y'all bitches getting poorer everyday out here!\"",
                "So they’re thrilled to swoop in to open thousands more stores?\n\nYa that’s the ticket",
                "People who have never been poor will never understand how stressful it is. Wish Republicans could even experience one day of what’s it like, have they ever came home from a school day to their power shut off even though your dad works 12 hour days+ in Alabama heat? That’s just one thing that can happen. It’s not for the weak. (I’m luckily an adult and in a much better situation now, but once you live through it your perspective changes forever).",
                "Dollar general says people they're exploiting have less money for them to take."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Armenia and Azerbaijan agree to peace treaty after nearly four decades of war",
            "external_url": "https://www.cnn.com/2025/03/13/europe/armenia-and-azerbaijan-peace-agreement-conditions-intl-latam/index.html",
            "upvotes": 282,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1683926061.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's still sad that Azerbaijan managed to ethnically cleanse the Armenians of Nagorno-Karabakh.\n\n Almost no one knows about this because just 1 week later the Israel-Hamas war started, taking everyone's attention completely off of this conflict.",
                "The article doesn't state the reason for the diplomatic breakthrough after so many decades, but it seems to be a result of both Azerbaijan retaking Nagorno-Karabakh, and I'd assume Russian imperialism. It's probably best to settle your border disputes in order to focus on bigger picture threats.",
                "Inb4 trump takes credit",
                "“Now that we’ve ethnically cleansed your enclaves, let’s call it a draw.”",
                "It says nearly 4 decades… people have had enough time to know about it. If it’s not Israel or Ukraine, nobody gives a shit.",
                "I visited both countries a couple of months ago - loved them both, nice people. Except for that corrupt cop in Baku.\n\nI have a YouTube with same name as my Reddit, if anyone’s interested. I’m a nomad that’s been to 40 countries.",
                "How will trump take credit for this…",
                "What a disgusting shame on europe that conflict has been.\n\nAzerbaijan has essentially been allowed to genocide Armenians, publically and proudly, and nothing was done.\n\nWe should have nuked Baku long ago."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "US consumer sentiment deteriorates sharply in March",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-deteriorates-sharply-march-2025-03-14/",
            "upvotes": 1305,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strangely enough, my job being threatened by illegal NIH grant cuts has triggered me to stop spending money and hoard cash.\n\nThat $30k I had pegged to remodel my bathroom would be churning into the economy if not for that.",
                "It’s almost like when the world is completely unpredictable and positions change by the second people are not able to plan for the future and are less likely to spend money outside of absolute needs. And it’s almost like when an economy is built entirely on the spending of its consumers and the confidence in systems that uncertainties hurt the whole economy.",
                "If the government won’t govern why should consumers consume?",
                "Trump and his administration has done nothing but harm to our country and certainly has not done anything good or beneficial. Unnecessary spending is completely off the table for the foreseeable future in our house.",
                "I am getting dizzy from all that winning....",
                "Yeah, levying sudden heavy federal sales taxes will do that. ",
                "Don’t underestimate how bad this is. \n\nYou can look at the historic data series, but once consumer sentiment falls, it takes a long time to get back to normal.\n\nAnd in an era where price signals, recession signals, and uncertainty signals are flashing, this could worsen an economic downturn.\n\nSource: economist.",
                "It’s almost like a blatant and mediocre conman is POTUS",
                "It's like you guys put a fucking traitor in the white house",
                "Can't risk egregious spending right now. For all I know we're gonna be back to fighting in the Thunderdome for toilet paper any moment."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "USA asks Sweden for help in the egg crisis | Sweden Herald",
            "external_url": "https://swedenherald.com/article/usa-asks-denmark-for-help-in-the-egg-crisis",
            "upvotes": 3133,
            "date": "03/14/2025",
            "thumbnail": "https://static.swedenherald.com/d80b1181-68fe-46d7-8b7d-72128945bffa/d80b1181-68fe-46d7-8b7d-72128945bffa.jpg",
            "top_comments": [
                "If only they had a long time ally that's right beside them",
                "It seems like we might want a fully funded USDA, FDA, and CDC to fight avian flu. Ooh, I bet if we stop tracking numbers at all, we can claim that we're avian flu free!",
                "LOL\n\nAnd here's the thing with allies....when you keep actively trying to break up your alliances then you know what kind of answer is coming your way in a time of need.\n\nPersonally I hope Sweden asks the US to sign a rare earth mineral agreement before they hand over any fuking eggs.",
                "Audacity is the only word that comes to mind.\n\nYou want help, be a partner, not an adversary.",
                "> I don't think we will export. We also have an egg shortage in Europe and there we already have export channels we use. So it's rather that we export within Europe.\n\nA polite phrasing for they will export to long standing allies that haven't given them the finger. It's almost like us pissing everyone off has consequences.",
                "If the USA is struggling so much, maybe they should become a territory of a government that knows what they're doing? Denmark perhaps?",
                "Alrticle says Denmark. Why does post title says Sweden?",
                "Canada has plenty of eggs if you get on your knees and beg for forgiveness\n\n\n\nThen we will just say no",
                "I guess we don’t have the cards do we",
                "American conservatives are so unbelievably stupid. They screamed relentlessly about eggs all throughout the entire campaign of 2024. They screamed and cried every fucking day about egg prices. It became their entire personality and this bullshit platform that everyone knew was bullshit. They pretended that Joe Biden had a dial in the oval office that controlled egg prices along with gas prices. They had photoshoots in front of egg displays and grocery stores. At one point, Trump even claimed to have invented the word \"groceries\" and his cult ate it up. They loved making eggs their entire World.\n\nAnd now they all scream about how they don't need anything from anyone; muh independence....except eggs; and to shut up about egg prices.\n\nI'm so tired of this country. And I'm so tired of being surrounded by such sheer abundant stupidity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Fierce protests as eight-year-old rape victim dies in Bangladesh",
            "external_url": "https://www.bbc.com/news/articles/ce30k9g6x2eo",
            "upvotes": 926,
            "date": "03/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1897/live/ebd12f00-0094-11f0-93cc-fd4e777d3e70.jpg",
            "top_comments": [
                "Horrific \n\nwtf is wrong with people",
                "Her heart stopped 3 times, and on the third time they couldn’t bring her back.\n\nAs if the rape of an 8-year-old wasn’t bad enough, what on Earth did they do to her to cause that much damage to her heart?!\n\nThere is a special place in hell for people that do this sort of thing.",
                "She was just a little kid visiting her big sister. Jesus. \n\nI am so tired of the horrors we inflict on one another.",
                "Humanity is a mistake.",
                "When you smother a country in a religion that respects nothing but male dominance, this is what you get.",
                "At least their home was burnt down.  There is a lot to be desired in how Asian countries handle sexual assault and women’s rights.",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "America’s automakers aren’t rushing to move production to US factories to avoid tariffs",
            "external_url": "https://www.cnn.com/business/automakers-tariffs-new-us-plants/index.html",
            "upvotes": 584,
            "date": "03/14/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-04t175159z-2098714084-rc2h6daud9v7-rtrmadp-3-usa-trump-tariffs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I remember when Ford promised to move production factories to the US right after Trump negotiated and signed the USMCA.   A few months later Ford moved more jobs to mexico.   \n   \nOf course they aren’t going to build plants in the US.  Tariffs are turned on and off by the hour, it takes longer than that to build one.",
                "People that think tariffs will change manufacturing locations think you can spin up a factory in a few weeks, lol",
                "By the time any new manufacturing plant would be up and running, the orange clown would have ended his current term.",
                "It takes ages to spin up a new factory. Why would they change their plans suddenly when in four years policy might dramatically change again?",
                "It will take longer than four years to move manufacturing home, and the next administration could just change everything again.",
                "I used to work supplying automotive and their supply networks are vast and complicated. Even if they move the plants to the US (which is costly and there's good economic reason they have plants in Canada and Mexico) they'd then have to entirely rebuild their supply networks to get all the parts and materials they need. It's impossible to divorce the US auto industry from the Canadian and Mexican auto industries. ",
                "They can’t move manufacturing overnight, and they definitely won’t be moving it as long as we keep having these month to month tariff adjustments. As long as these companies don’t know what the tariff situation is going to look like in the long term, they’re just going to pay the import tax and raise prices.\n\nIf you want to move manufacturing back to the US the best way would be to announce tariffs that are set to take effect in 6 months to a year, and in the meantime give a strong incentive (likely through some kind of tax break or rebate) to open manufacturing facilities in the US, and offer another tax break for consumers who purchase cars manufactured in the US. Companies would be more inclined to relocate plants if they know what the future looks like, and if it looks like future profits would benefit from manufacturing in the US.",
                "The ironic thing is all the Euro, Japanese, and Korean plants are in the US for the US market but the domestic brands outsource. If you want to buy made in America, don’t buy an American car brand.",
                "Leave factories where they are, pass on tariff costs to customers. Then (if it would be cheaper for you) move factories into the US to eliminate the tariff impact, but leave the tariff pricing customers are now used to in place. Profit.",
                "Trump is erratic and unreliable. Auto makers can’t make decisions like those based on the daily dose of chaos Trump creates."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Five people killed in 17-vehicle crash on I-35 in North Austin, closing southbound lanes",
            "external_url": "https://www.kut.org/austin/2025-03-14/austin-tx-crash-deaths-i-35-parmer-lane",
            "upvotes": 197,
            "date": "03/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/6bb36cc/2147483647/strip/true/crop/2157x1132+0+144/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbc%2F03%2Fcfa0f7784714938a21748ac68360%2Fi-35crashpresser-031425.png",
            "top_comments": [
                "Other articles point out it was a runaway semi truck that smashed into a bunch of other vehicles.",
                "This is devastating. Losing five lives, including children, is just unimaginable. I’ve heard so much about how dangerous I-35 can be, and it makes me wonder if better road design, stricter speed enforcement, or improved public transit could help prevent tragedies like this. My heart goes out to the families affected, no one should have to experience such a loss.",
                "It happened in Austin so Abbott's 2 working hands gave 2 Fuck You's",
                "What is abbot doing about road safety? it seems to me the governor of Texas is stuck on his ass and is unwillingly to stand for the health and safety of the Texas people",
                "It sounds like it was a TXdot Fuck Up. There is no room to merge, they knew it was unsafe but rolled the dice. They should be sued to oblivion!!!",
                "Was this weather related? Wild to see such a devastating accident with no apparent cause."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 4641,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "The largest pork processor in the US is Smithfield and they're Chinese owned.  I wonder how that'll work.",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "So, China just need to do nothing (not renew export licences) and “...$US3 billion ($A4.77B) worth of beef, pork and poultry no longer eligible to export to China.”.  That is just so low effort with highly effective impact.  Maybe, other countries that are affected by the U.S. tariffs need to look at this as a tactic to defend their economy.",
                "Good for China. The US gets what it voted for.",
                "So much winning, non stop winning. The voters must be so proud",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "China gets a lot of it's good import meat from New Zealand and Australia anyways. This won't affect anyone but America.",
                "Looks like American decisions in the ballot box have consequences..."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/14/2025 16:10:01 UTC"
}