{
    "posts": [
        {
            "category": "HOT",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 16442,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Fuck traitor trump and his weak unamerican sheep",
                "He will not comply. Asked to pause would be a better title.",
                "Hard to be a shittier American than a Trump supporter these days",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 1288,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "How exactly did they achieve boiling water?",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days...  José Salvador Alvarenga did 438 days in an 24 foot open fishing boat with a cooler, drifting from a storm in Mexico to the Marshall islands."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 14735,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "If the library has a donation page I’ll happily donate",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "Now the library will buy those books again to replace them and the authors get double the income.",
                "Burning books because you hate what they teach doesn’t make you powerful, it proves you’re scared of knowledge.",
                "Most literate Trump supporter"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 318,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Should never have been arrested.",
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "What customers can expect as Rite Aid closes or sells all its drugstores",
            "external_url": "https://abcnews.go.com/Business/wireStory/customers-expect-rite-aid-closes-sells-drugstores-121523923",
            "upvotes": 1078,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a17ed33b-23ca-48ee-9c02-b7c18e673857/wirestory_e524d3cc1b02e878c656bef75a8120b1_16x9.jpg?w=1600",
            "top_comments": [
                "Expect other pharmacies in the area to get more expensive, as happened when Eckerd was eliminated from competition.",
                "They’ve been bound to fail for 20 years after a bad acquisition and their executive management being old as dirt.  \n\nWhile not the worst thing per se, I remember winning a 30 million dollar contract with them. They had us fly out from California to Harrisburg, PA just to give a 2 minute speech to 4 groups, shake our hands and then we left.  \n\nWhen we got back I asked my contact, “that was it, they just wanted a hand shake? That’s why we flew across the country?”  \n\nThat was why. This sums up how they did everything, old school and antiquated.",
                "Article by Tom Murphy\n\n>Rite Aid customers can expect their local store to close or change ownership in the next few months, as the struggling drugstore chain goes through [another bankruptcy filing](https://apnews.com/article/rite-aid-bankruptcy-drugstores-challenges-6f69b6041fa8db6d1b835b894f3c0d2d).\n\n>The company plans to sell customer prescription files, inventory and other assets as it closes distribution centers and unloads store locations. Stores will remain open for now, but the company isn’t buying new inventory so bare shelves are likely become more common.\n\n>“I think what we’ll progressively see is the stores will become more and more spartan,” said retail analyst Neil Saunders.\n\n>The company runs 1,245 stores in 15 states, according to its website. It has a heavy presence in New York, Pennsylvania and California, which alone has 347 locations.\n\n>Here’s what customers can expect next.\n\n>Rite Aid says a few months for most of its stores. All locations will eventually close or be sold to a new owner.\n\n>Until then, customers will still be able to fill prescriptions, get immunizations and shop in the stores or online.\n\n>Rite Aid has said that it will stop issuing customer rewards points for purchases. It also will no longer honor gift cards or accept returns or exchanges starting next month.\n\n>Rite Aid will try to sell them to another drugstore, grocer or retailer with a pharmacy. The company says it is working to put together a “smooth transfer” of customer prescriptions to other pharmacies.\n\n>But there’s no guarantee those files will wind up at a retailer near the location that is closing.\n\n>That may be challenging because some Rite Aid stores are in rural areas, miles away from another pharmacy, noted Saunders, managing director of the consulting and data analysis firm GlobalData.\n\n>Prescription files can be valuable assets because they can connect the acquiring drugstore with a regular customer if that person sticks with the new store.\n\n>Philadelphia-based Rite Aid had been closing stores and struggling with losses for years before its first bankruptcy filing in 2023. The company says its “only viable path forward” is a return to Chapter 11 bankruptcy proceedings.\n\n>The company said in letter to vendors that it has been hit with several financial challenges that have grown more intense.\n\n>Rite Aid and its competitors have been dealing with tighter profits on their prescriptions, increased theft, [court settlements over opioid prescriptions](https://apnews.com/article/business-health-ohio-lawsuits-cleveland-21762b10e14a24bf0c67a4da04bdf606) and customers who are drifting to online shopping and discount retailers.\n\n>[Walgreens](https://apnews.com/general-news-64dd17e17aa147adb1fd83510f747139), which has more than six times as many stores as Rite Aid, [agreed in March](https://apnews.com/article/walgreens-buyout-private-sycamore-drugstore-4f4b33c34e61fe0e1b111107db4830fa) to be acquired by the private equity firm Sycamore Partners.\n\n>CVS Health [also has closed stores](https://apnews.com/article/drugstore-closings-cvs-walgreens-independent-pharmacies-6b54d4bd1564b2bff7a55a624da61c19).",
                "Absolutely FUCK Rite Aid. I wish execs that drove businesses into the ground would go to prison for it.\n\nThey sure deserve it. Rite Aid bought our absolutely awesome local pharmacy and then ruined it, taking a functioning and healthy local service into a dysfunctional l, empty-shelf value extraction endeavor. And now not even that shell of a pharmacy will survive.",
                "Brick and mortar pharmacy is getting rarer and rarer making it more difficult for people to get their medication unless you live in a major city or have access to internet to order online.",
                "We lost our CVS years ago and it got turned into a shoe store. The local walgreen closed over a year ago and sits empty. Now we’re losing rite aid too? I don’t even live in a small town, I live in suburban Los Angeles and they’ve taken all our drugstores. Wild.",
                "They closed the store right down the street from my mom. She had a pending prescription filled that she wasn’t getting an alert for, called and was told the store is shutting down in a couple days and they will fill her prescription, but she had til 8pm that day to pick it up or they would have to toss it. She was supposed to be notified, but never did get that notification.\nNot surprised the company failed, there were always better options in most of the areas they operated.",
                "What happens to thrifty ice cream?",
                "I literally didn’t know they even existed anymore. The last one in my area went under years ago.",
                "My local Rite Aid has had half empty shelves for a few years. I'm surprised it took this long to put the final nail in the coffin. I will miss making same-day appointments for flu shots and walking in with no waits."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Indian Air Marshal's response to question about Rafale jets being 'shot down': 'Losses are part of fighting'",
            "external_url": "https://www.bbc.com/urdu/live/ckgn0py3ynzt",
            "upvotes": 234,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/e275/live/0f58bb10-2e75-11f0-8f57-b7237f6a66e6.png",
            "top_comments": [
                "When a journalist asked Indian Air Marshal AK Bharti about Pakistan's claim of shooting down Indian Rafale jets, he said, \"I will not comment on this at this time because we are in a state of war. If I comment, it will benefit the enemy.\"",
                "Some of you may die, but it's a sacrifice I am willing to make.",
                "While numbers were not provided, it is safe to assume that there have been losses on both sides.\n\nHe also confirmed that all pilots are back home and safe.\n\nEquipment losses are a part of war! Lets not go crazy over this.",
                "How to say yes without saying yes. These dudes lost three 300m Fighter jets to 30m cheap Chinese tech. Massive L",
                "All pilots returned safely for our side, jets can be replaced but the people cannot be replaced for their families.",
                "I don't understand Pakistan's obsession with shooting down a single jet especially when nearly all their airbases were hit & decimated. Their economy is surviving on IMF bailout packages,  their Senior Military officials seen attending Terrorists funeral & Indian missiles routinely breach their air defense systems.",
                "he also confirmed multiple pakistan jets were down"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ukraine 'ready to meet' Russia after Putin call for peace talks on Thursday, says Zelenskyy",
            "external_url": "https://news.sky.com/story/ukraine-ready-to-meet-russia-after-putin-call-for-peace-talks-on-thursday-says-zelenskyy-13365659",
            "upvotes": 780,
            "date": "05/11/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-world-ukraine_6896135.jpg?20250425093939",
            "top_comments": [
                "Hope he doesn't eat or drink anything while there.",
                "In terms of areas in where peace talks can occur. Turkey is okay territory for Ukraine. As security there might be lax it's more favourable and slanted to the west than Belarus",
                "“Ukraine is ready to stop having its citizens murdered over territorial disputes inflicted on them them by a hateful, disgusting dictator”",
                "Putin looks older and more tired in that picture.",
                "\"Peace talks\". How did that go the last several times? Oh that's right, Russia used them to remobilize and attack.",
                "I see an article like this every day, I hope so but doubtful.",
                "Moscow gets attacked by drones - \"alright we need to talk\"",
                "Peace is eady, withdraw from Ukraine.",
                "I mean, usually, putler, almost never lies, sometimes.",
                "Did y’all never watch the beginning to Braveheart?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 4483,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 32642,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "Gorman County, Oregon.",
                "The children yearn for the mines",
                "This was discovered several years ago. It's not news.",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "If you've ever been out there - it seems like nothing but desert and high desert/mountains,  but look at the area as the watershed that feeds into the Columbia river and the underground aquifers that also feed into the Columbia river and all the tributaries hence forth.\n\nThey can't just go in their and extract it if it's going to hurt the watersheds of the west.\n\nI worked near two superfund sites - I live near superfund site about 15 miles south of me.\n\nExamples:\n\nThe entire south end of Vashon Island and Ruston area (Tacoma WA metro) is contaminated with exaust tailings to the point where plants harvested there contain those chemicals like lead to this day. (There's a summer camp there that predates the smokestacks that kids roll around in the dirt right THERE.) \n\nIn Butte, Montana and subsequently a 200 mile radius and anywhere in the MT/WY/NV area there are both smokestack areas of contamination and pools of deadly chemicals leftover from the 1800s-1970s. Pools of arsenic and lead. If you've been there you know.  Cows and horses just walk around grazing in these areas.\n\nPicher, Oklahoma - \"the most toxic ghost town\" in the USA. The entire story is a trip. Silent Hill type stuff. I went to a museum exhibit on it in Norman.\n\nEdmond, OK - currently having to treat it's watershed contaminated with fracking juices - oh but they won't tell you that.  They just want to see you bougie houses and ride out the earthquakes.  (source - Geologist who works for oil company who quit over it I dated - so dubious.) \n\nQuestion is not \"We make money now\"\n\nbut \"Where will we live AFTER the mine closes and we don't make money anymore?\"\n\nExample of Lithium Extract- from source:\n\n# Brine Extraction\n\nBrine extraction is another method of extracting lithium. This method involves pumping brine from underground aquifers into evaporation ponds. The sun and wind evaporate the water, leaving behind lithium and other minerals. The following are the steps involved in brine extraction:\n\n* Drilling: Wells are drilled into the ground to access the brine.\n* Pumping: The brine is pumped to the surface and transported to the evaporation ponds.\n* Evaporation: The brine is evaporated in the ponds, leaving behind lithium and other minerals.\n* Processing: The extracted lithium is then processed to produce lithium carbonate or other lithium compounds.\n\nBrine extraction is a less costly and less energy-intensive method of extracting lithium. It is also less harmful to the environment than hard rock mining. However, it is highly dependent on weather conditions, and the process can take several months to complete.\n\nOverall, both hard rock mining and brine extraction have their advantages and disadvantages. Companies choose the method that suits their needs and resources.\n\n#",
                "For those unaware, the U.S. has lithium in a ton of places but as of now the only real site that is extracting lithium in any meaningful capacity is in Nevada. There is a site that has been identified for development in Arizona as well.\n\nBut all of that is sort of moot because right now virtually all REFINING of lithium has to go through China so absent developing that domestic refining we won’t be gaining independence any time soon.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 30148,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Not a problem. We'll just build a bunch of factories and make stuff here. Let's see, now.. Gonna need some steel, some machines, some...oops.",
                "And remember everyone!:\n\n**ONCE THE PRICES GO UP, THEY AIN'T GONNA BRING EM BACK DOWN**",
                "The guy who unintentionally crashed the economy by mismanaging the pandemic was  re-elected so he can intentionally crash the economy by mismanaging a a recovery.\n\nSeriously. He blames Obama and Biden for everything, but both of them handed him a rising economy for him to destroy. And he didnt even say thank you.",
                "Here come the shortages.  I don't think most people realize how bad this is going to get and just assume everything will be fine.",
                "The next couple months are going to be really interesting , as summer kicks off and people are going to start feeling the effects of their leaders decisions.\n\nI expect a lot of angry , confused Americans will be flooding social media looking for answers. \n\nGet your popcorn ready",
                "Remember, we saw insane inflation as an aftereffect from the pandemic. Supply disruptions don't immediately hit hard due to buffer inventories along the supply chains. When  this eventually affects us, it will be insane and likely cause another massive recession.\n\nAlso, other countries are adapting to the US playing games by securing deals with new partner countries. It will probably take decades for the US to undo the damage.",
                "Medicine and medical supplies are at the very top of my concerns. Stupid disposal stuff like gauze, sutures, sterilization bags, PPE. So much of it is from China.",
                "Back-to-school is going to be fun… no shoes, no computers, no backpacks, no supplies, no dorm-room accoutrements, at prices that even vaguely resemble what parents are used to paying, when they can get them at all.\n\nBut it’ll be Biden’s Fault somehow.",
                "Watch this earthcam stream, been only two ships per day when there's normally 10-15, lots of people are losing jobs over this crap.\n\n[https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2](https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2)",
                "Trucking and warehousing on the verge of collapse. I’ll be faced with laying off people who I manage, if I survive myself. Are we great yet?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Indian Air Marshal's response to question about Rafale jets being 'shot down': 'Losses are part of fighting'",
            "external_url": "https://www.bbc.com/urdu/live/ckgn0py3ynzt",
            "upvotes": 238,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/e275/live/0f58bb10-2e75-11f0-8f57-b7237f6a66e6.png",
            "top_comments": [
                "When a journalist asked Indian Air Marshal AK Bharti about Pakistan's claim of shooting down Indian Rafale jets, he said, \"I will not comment on this at this time because we are in a state of war. If I comment, it will benefit the enemy.\"",
                "Some of you may die, but it's a sacrifice I am willing to make.",
                "While numbers were not provided, it is safe to assume that there have been losses on both sides.\n\nHe also confirmed that all pilots are back home and safe.\n\nEquipment losses are a part of war! Lets not go crazy over this.",
                "How to say yes without saying yes. These dudes lost three 300m Fighter jets to 30m cheap Chinese tech. Massive L",
                "All pilots returned safely for our side, jets can be replaced but the people cannot be replaced for their families.",
                "I don't understand Pakistan's obsession with shooting down a single jet especially when nearly all their airbases were hit & decimated. Their economy is surviving on IMF bailout packages,  their Senior Military officials seen attending Terrorists funeral & Indian missiles routinely breach their air defense systems.",
                "he also confirmed multiple pakistan jets were down"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 319,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Should never have been arrested.",
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Turkey ready to host Russia-Ukraine negotiations, Erdogan tells Macron",
            "external_url": "https://www.reuters.com/world/turkey-ready-host-russia-ukraine-negotiations-erdogan-tells-macron-2025-05-11/?utm_source=reddit.com",
            "upvotes": 124,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "US-Ukraine deal happens and all of a sudden people are ready to make attempts so that they can claim major role in ending the conflict."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 1289,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "How exactly did they achieve boiling water?",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days...  José Salvador Alvarenga did 438 days in an 24 foot open fishing boat with a cooler, drifting from a storm in Mexico to the Marshall islands."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ukraine 'ready to meet' Russia after Putin call for peace talks on Thursday, says Zelenskyy",
            "external_url": "https://news.sky.com/story/ukraine-ready-to-meet-russia-after-putin-call-for-peace-talks-on-thursday-says-zelenskyy-13365659",
            "upvotes": 785,
            "date": "05/11/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-world-ukraine_6896135.jpg?20250425093939",
            "top_comments": [
                "Hope he doesn't eat or drink anything while there.",
                "In terms of areas in where peace talks can occur. Turkey is okay territory for Ukraine. As security there might be lax it's more favourable and slanted to the west than Belarus",
                "“Ukraine is ready to stop having its citizens murdered over territorial disputes inflicted on them them by a hateful, disgusting dictator”",
                "Putin looks older and more tired in that picture.",
                "\"Peace talks\". How did that go the last several times? Oh that's right, Russia used them to remobilize and attack.",
                "I see an article like this every day, I hope so but doubtful.",
                "Moscow gets attacked by drones - \"alright we need to talk\"",
                "Peace is eady, withdraw from Ukraine.",
                "I mean, usually, putler, almost never lies, sometimes.",
                "Did y’all never watch the beginning to Braveheart?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "What customers can expect as Rite Aid closes or sells all its drugstores",
            "external_url": "https://abcnews.go.com/Business/wireStory/customers-expect-rite-aid-closes-sells-drugstores-121523923",
            "upvotes": 1082,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a17ed33b-23ca-48ee-9c02-b7c18e673857/wirestory_e524d3cc1b02e878c656bef75a8120b1_16x9.jpg?w=1600",
            "top_comments": [
                "Expect other pharmacies in the area to get more expensive, as happened when Eckerd was eliminated from competition.",
                "They’ve been bound to fail for 20 years after a bad acquisition and their executive management being old as dirt.  \n\nWhile not the worst thing per se, I remember winning a 30 million dollar contract with them. They had us fly out from California to Harrisburg, PA just to give a 2 minute speech to 4 groups, shake our hands and then we left.  \n\nWhen we got back I asked my contact, “that was it, they just wanted a hand shake? That’s why we flew across the country?”  \n\nThat was why. This sums up how they did everything, old school and antiquated.",
                "Article by Tom Murphy\n\n>Rite Aid customers can expect their local store to close or change ownership in the next few months, as the struggling drugstore chain goes through [another bankruptcy filing](https://apnews.com/article/rite-aid-bankruptcy-drugstores-challenges-6f69b6041fa8db6d1b835b894f3c0d2d).\n\n>The company plans to sell customer prescription files, inventory and other assets as it closes distribution centers and unloads store locations. Stores will remain open for now, but the company isn’t buying new inventory so bare shelves are likely become more common.\n\n>“I think what we’ll progressively see is the stores will become more and more spartan,” said retail analyst Neil Saunders.\n\n>The company runs 1,245 stores in 15 states, according to its website. It has a heavy presence in New York, Pennsylvania and California, which alone has 347 locations.\n\n>Here’s what customers can expect next.\n\n>Rite Aid says a few months for most of its stores. All locations will eventually close or be sold to a new owner.\n\n>Until then, customers will still be able to fill prescriptions, get immunizations and shop in the stores or online.\n\n>Rite Aid has said that it will stop issuing customer rewards points for purchases. It also will no longer honor gift cards or accept returns or exchanges starting next month.\n\n>Rite Aid will try to sell them to another drugstore, grocer or retailer with a pharmacy. The company says it is working to put together a “smooth transfer” of customer prescriptions to other pharmacies.\n\n>But there’s no guarantee those files will wind up at a retailer near the location that is closing.\n\n>That may be challenging because some Rite Aid stores are in rural areas, miles away from another pharmacy, noted Saunders, managing director of the consulting and data analysis firm GlobalData.\n\n>Prescription files can be valuable assets because they can connect the acquiring drugstore with a regular customer if that person sticks with the new store.\n\n>Philadelphia-based Rite Aid had been closing stores and struggling with losses for years before its first bankruptcy filing in 2023. The company says its “only viable path forward” is a return to Chapter 11 bankruptcy proceedings.\n\n>The company said in letter to vendors that it has been hit with several financial challenges that have grown more intense.\n\n>Rite Aid and its competitors have been dealing with tighter profits on their prescriptions, increased theft, [court settlements over opioid prescriptions](https://apnews.com/article/business-health-ohio-lawsuits-cleveland-21762b10e14a24bf0c67a4da04bdf606) and customers who are drifting to online shopping and discount retailers.\n\n>[Walgreens](https://apnews.com/general-news-64dd17e17aa147adb1fd83510f747139), which has more than six times as many stores as Rite Aid, [agreed in March](https://apnews.com/article/walgreens-buyout-private-sycamore-drugstore-4f4b33c34e61fe0e1b111107db4830fa) to be acquired by the private equity firm Sycamore Partners.\n\n>CVS Health [also has closed stores](https://apnews.com/article/drugstore-closings-cvs-walgreens-independent-pharmacies-6b54d4bd1564b2bff7a55a624da61c19).",
                "Absolutely FUCK Rite Aid. I wish execs that drove businesses into the ground would go to prison for it.\n\nThey sure deserve it. Rite Aid bought our absolutely awesome local pharmacy and then ruined it, taking a functioning and healthy local service into a dysfunctional l, empty-shelf value extraction endeavor. And now not even that shell of a pharmacy will survive.",
                "Brick and mortar pharmacy is getting rarer and rarer making it more difficult for people to get their medication unless you live in a major city or have access to internet to order online.",
                "We lost our CVS years ago and it got turned into a shoe store. The local walgreen closed over a year ago and sits empty. Now we’re losing rite aid too? I don’t even live in a small town, I live in suburban Los Angeles and they’ve taken all our drugstores. Wild.",
                "They closed the store right down the street from my mom. She had a pending prescription filled that she wasn’t getting an alert for, called and was told the store is shutting down in a couple days and they will fill her prescription, but she had til 8pm that day to pick it up or they would have to toss it. She was supposed to be notified, but never did get that notification.\nNot surprised the company failed, there were always better options in most of the areas they operated.",
                "What happens to thrifty ice cream?",
                "I literally didn’t know they even existed anymore. The last one in my area went under years ago.",
                "My local Rite Aid has had half empty shelves for a few years. I'm surprised it took this long to put the final nail in the coffin. I will miss making same-day appointments for flu shots and walking in with no waits."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Putin says Russia ready for ‘direct talks’ with Ukraine as US and European leaders press for a ceasefire",
            "external_url": "https://www.cnn.com/2025/05/10/europe/putin-russia-ukraine-direct-talks-intl-hnk",
            "upvotes": 241,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213751837.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Had to check the date because it seems like this is said by that monster daily",
                "In other words, boy cries wolf again",
                "Stall tactic on us and European sanctions. He's agreed to no ceasefire and we all already know these talks will be unproductive. \" give us everything we want any concessions are unacceptable\" and drag that out while continuing to bomb the shit out of civilians.",
                "No talks are necessary just gtfo and then turn yourself in for all your war criming you absolute trashcan.",
                "\"Lay down your weapons, I won't kill you a lot\", \"Look even the Murican president believes me\", \n\n/s",
                "Stall tactics, they can stop attacking any time and be miserable in Russia.",
                "trump getting ready to lift sancions",
                "[ Removed by Reddit ]",
                "Russia - we are ready to negotiate\n\nRussia - give in to all our demands with nothing in return\n\nRussia - see, they don't want to negotiate\n\nRinse and repeat",
                "I'm sure that any side in any war in history in russias current position would accept this 30 day unconditional ceasefire. From a Russian pov it would be utter madness.\n\nFrom a Ukrainian pov it would be a brilliant deal. Defences and be dug...New kit imported. New conscripts trained.\n\nI just don't see how anyone in their right mind can expect putin to sign it after the previous 17 rounds of sanctions that...well Russia still has plenty of cash and all the copium propagandists that said russias economy would collapse...unfortunately they still have enough money to pay their soldiers a relative fortune...and carry this stupid war on."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 16442,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Fuck traitor trump and his weak unamerican sheep",
                "He will not comply. Asked to pause would be a better title.",
                "Hard to be a shittier American than a Trump supporter these days",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
            "external_url": "https://www.bbc.co.uk/news/articles/cvg9d913v20o",
            "upvotes": 583,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Surprising exactly no one",
                "So do all the bots brigading.",
                "\"In wartime, truth is so precious that she should always be attended by a bodyguard of lies.\"\n\n\n--Winston Churchill",
                "isn't it 'funny' how Trump jumped into this within days, yet he's let Russia bomb the shit out of Ukraine and basically done nothing but try to rob them",
                "These stupid, ignorant, idiotic men are exactly why we need more women in politics all over the world.",
                "They probably did 🤷‍♂️.",
                "[removed]",
                "Nobody would give a fuck if none of them had spicy bombs. This childish behavior is just annoying at this point.   \nOtherwise i would just say to just get it over with already.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Putin suggests Russia and Ukraine have 'direct' talks next week - BBC News",
            "external_url": "https://www.bbc.co.uk/news/articles/ce821nl3251o",
            "upvotes": 602,
            "date": "05/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3277/live/25599930-2e47-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "\"It's a trap!\" -- Admiral Ackbar",
                "This is the same president who has violated multiple ceasefires, has gotten other countries to fight his war for him and commited *several* war crimes and only now he  wants to have “direct talks”\n\nPutin is insane, he's definitely going to try and get a deal which is in the benefit of Russia, or in the unlikely scenario Putin has finally realized the game is up and wants to actually stop either way, I don't see this ending well for Ukraine at all.\n\nedit: wording",
                "More stalling tactics from the Russian methinks.",
                "Yeah, man. Come to Ukraine. They’d love to see your murderous ass.",
                "If Zelensky agrees, it'd better be on the first floor of neutral soil and he refuses all refreshments.",
                "So he can poison Zelensky?",
                "> \"We seek serious talks... to remove the root causes of the conflict and start moving towards a lasting, strong peace\"\n\nDo you think he's ever seen a mirror? Just fucking go home!",
                "He wants to have tea with Zelensky I'm sure.",
                "The Europeam Union was able to accomplish this by threatening sanctions and increased aid to Ukraine. \n\nDon’t let anyone say Trump did this.",
                "Maybe they’re bringing in the showstopper, Mr. Art of the Deal himself, Donald “dirty diaper” Trump, to finally defuckify this mess. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 319,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Should never have been arrested.",
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Indian Air Marshal's response to question about Rafale jets being 'shot down': 'Losses are part of fighting'",
            "external_url": "https://www.bbc.com/urdu/live/ckgn0py3ynzt",
            "upvotes": 236,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/e275/live/0f58bb10-2e75-11f0-8f57-b7237f6a66e6.png",
            "top_comments": [
                "When a journalist asked Indian Air Marshal AK Bharti about Pakistan's claim of shooting down Indian Rafale jets, he said, \"I will not comment on this at this time because we are in a state of war. If I comment, it will benefit the enemy.\"",
                "Some of you may die, but it's a sacrifice I am willing to make.",
                "While numbers were not provided, it is safe to assume that there have been losses on both sides.\n\nHe also confirmed that all pilots are back home and safe.\n\nEquipment losses are a part of war! Lets not go crazy over this.",
                "How to say yes without saying yes. These dudes lost three 300m Fighter jets to 30m cheap Chinese tech. Massive L",
                "All pilots returned safely for our side, jets can be replaced but the people cannot be replaced for their families.",
                "I don't understand Pakistan's obsession with shooting down a single jet especially when nearly all their airbases were hit & decimated. Their economy is surviving on IMF bailout packages,  their Senior Military officials seen attending Terrorists funeral & Indian missiles routinely breach their air defense systems.",
                "he also confirmed multiple pakistan jets were down"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 1285,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "How exactly did they achieve boiling water?",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days...  José Salvador Alvarenga did 438 days in an 24 foot open fishing boat with a cooler, drifting from a storm in Mexico to the Marshall islands."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ukraine 'ready to meet' Russia after Putin call for peace talks on Thursday, says Zelenskyy",
            "external_url": "https://news.sky.com/story/ukraine-ready-to-meet-russia-after-putin-call-for-peace-talks-on-thursday-says-zelenskyy-13365659",
            "upvotes": 780,
            "date": "05/11/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-world-ukraine_6896135.jpg?20250425093939",
            "top_comments": [
                "Hope he doesn't eat or drink anything while there.",
                "In terms of areas in where peace talks can occur. Turkey is okay territory for Ukraine. As security there might be lax it's more favourable and slanted to the west than Belarus",
                "“Ukraine is ready to stop having its citizens murdered over territorial disputes inflicted on them them by a hateful, disgusting dictator”",
                "Putin looks older and more tired in that picture.",
                "\"Peace talks\". How did that go the last several times? Oh that's right, Russia used them to remobilize and attack.",
                "I see an article like this every day, I hope so but doubtful.",
                "Moscow gets attacked by drones - \"alright we need to talk\"",
                "Peace is eady, withdraw from Ukraine.",
                "I mean, usually, putler, almost never lies, sometimes.",
                "Did y’all never watch the beginning to Braveheart?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Putin says Russia ready for ‘direct talks’ with Ukraine as US and European leaders press for a ceasefire",
            "external_url": "https://www.cnn.com/2025/05/10/europe/putin-russia-ukraine-direct-talks-intl-hnk",
            "upvotes": 236,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213751837.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Had to check the date because it seems like this is said by that monster daily",
                "In other words, boy cries wolf again",
                "Stall tactic on us and European sanctions. He's agreed to no ceasefire and we all already know these talks will be unproductive. \" give us everything we want any concessions are unacceptable\" and drag that out while continuing to bomb the shit out of civilians.",
                "No talks are necessary just gtfo and then turn yourself in for all your war criming you absolute trashcan.",
                "\"Lay down your weapons, I won't kill you a lot\", \"Look even the Murican president believes me\", \n\n/s",
                "Stall tactics, they can stop attacking any time and be miserable in Russia.",
                "trump getting ready to lift sancions",
                "[ Removed by Reddit ]",
                "Russia - we are ready to negotiate\n\nRussia - give in to all our demands with nothing in return\n\nRussia - see, they don't want to negotiate\n\nRinse and repeat",
                "I'm sure that any side in any war in history in russias current position would accept this 30 day unconditional ceasefire. From a Russian pov it would be utter madness.\n\nFrom a Ukrainian pov it would be a brilliant deal. Defences and be dug...New kit imported. New conscripts trained.\n\nI just don't see how anyone in their right mind can expect putin to sign it after the previous 17 rounds of sanctions that...well Russia still has plenty of cash and all the copium propagandists that said russias economy would collapse...unfortunately they still have enough money to pay their soldiers a relative fortune...and carry this stupid war on."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "What customers can expect as Rite Aid closes or sells all its drugstores",
            "external_url": "https://abcnews.go.com/Business/wireStory/customers-expect-rite-aid-closes-sells-drugstores-121523923",
            "upvotes": 1081,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a17ed33b-23ca-48ee-9c02-b7c18e673857/wirestory_e524d3cc1b02e878c656bef75a8120b1_16x9.jpg?w=1600",
            "top_comments": [
                "Expect other pharmacies in the area to get more expensive, as happened when Eckerd was eliminated from competition.",
                "They’ve been bound to fail for 20 years after a bad acquisition and their executive management being old as dirt.  \n\nWhile not the worst thing per se, I remember winning a 30 million dollar contract with them. They had us fly out from California to Harrisburg, PA just to give a 2 minute speech to 4 groups, shake our hands and then we left.  \n\nWhen we got back I asked my contact, “that was it, they just wanted a hand shake? That’s why we flew across the country?”  \n\nThat was why. This sums up how they did everything, old school and antiquated.",
                "Article by Tom Murphy\n\n>Rite Aid customers can expect their local store to close or change ownership in the next few months, as the struggling drugstore chain goes through [another bankruptcy filing](https://apnews.com/article/rite-aid-bankruptcy-drugstores-challenges-6f69b6041fa8db6d1b835b894f3c0d2d).\n\n>The company plans to sell customer prescription files, inventory and other assets as it closes distribution centers and unloads store locations. Stores will remain open for now, but the company isn’t buying new inventory so bare shelves are likely become more common.\n\n>“I think what we’ll progressively see is the stores will become more and more spartan,” said retail analyst Neil Saunders.\n\n>The company runs 1,245 stores in 15 states, according to its website. It has a heavy presence in New York, Pennsylvania and California, which alone has 347 locations.\n\n>Here’s what customers can expect next.\n\n>Rite Aid says a few months for most of its stores. All locations will eventually close or be sold to a new owner.\n\n>Until then, customers will still be able to fill prescriptions, get immunizations and shop in the stores or online.\n\n>Rite Aid has said that it will stop issuing customer rewards points for purchases. It also will no longer honor gift cards or accept returns or exchanges starting next month.\n\n>Rite Aid will try to sell them to another drugstore, grocer or retailer with a pharmacy. The company says it is working to put together a “smooth transfer” of customer prescriptions to other pharmacies.\n\n>But there’s no guarantee those files will wind up at a retailer near the location that is closing.\n\n>That may be challenging because some Rite Aid stores are in rural areas, miles away from another pharmacy, noted Saunders, managing director of the consulting and data analysis firm GlobalData.\n\n>Prescription files can be valuable assets because they can connect the acquiring drugstore with a regular customer if that person sticks with the new store.\n\n>Philadelphia-based Rite Aid had been closing stores and struggling with losses for years before its first bankruptcy filing in 2023. The company says its “only viable path forward” is a return to Chapter 11 bankruptcy proceedings.\n\n>The company said in letter to vendors that it has been hit with several financial challenges that have grown more intense.\n\n>Rite Aid and its competitors have been dealing with tighter profits on their prescriptions, increased theft, [court settlements over opioid prescriptions](https://apnews.com/article/business-health-ohio-lawsuits-cleveland-21762b10e14a24bf0c67a4da04bdf606) and customers who are drifting to online shopping and discount retailers.\n\n>[Walgreens](https://apnews.com/general-news-64dd17e17aa147adb1fd83510f747139), which has more than six times as many stores as Rite Aid, [agreed in March](https://apnews.com/article/walgreens-buyout-private-sycamore-drugstore-4f4b33c34e61fe0e1b111107db4830fa) to be acquired by the private equity firm Sycamore Partners.\n\n>CVS Health [also has closed stores](https://apnews.com/article/drugstore-closings-cvs-walgreens-independent-pharmacies-6b54d4bd1564b2bff7a55a624da61c19).",
                "Absolutely FUCK Rite Aid. I wish execs that drove businesses into the ground would go to prison for it.\n\nThey sure deserve it. Rite Aid bought our absolutely awesome local pharmacy and then ruined it, taking a functioning and healthy local service into a dysfunctional l, empty-shelf value extraction endeavor. And now not even that shell of a pharmacy will survive.",
                "Brick and mortar pharmacy is getting rarer and rarer making it more difficult for people to get their medication unless you live in a major city or have access to internet to order online.",
                "We lost our CVS years ago and it got turned into a shoe store. The local walgreen closed over a year ago and sits empty. Now we’re losing rite aid too? I don’t even live in a small town, I live in suburban Los Angeles and they’ve taken all our drugstores. Wild.",
                "They closed the store right down the street from my mom. She had a pending prescription filled that she wasn’t getting an alert for, called and was told the store is shutting down in a couple days and they will fill her prescription, but she had til 8pm that day to pick it up or they would have to toss it. She was supposed to be notified, but never did get that notification.\nNot surprised the company failed, there were always better options in most of the areas they operated.",
                "What happens to thrifty ice cream?",
                "I literally didn’t know they even existed anymore. The last one in my area went under years ago.",
                "My local Rite Aid has had half empty shelves for a few years. I'm surprised it took this long to put the final nail in the coffin. I will miss making same-day appointments for flu shots and walking in with no waits."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 16444,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Fuck traitor trump and his weak unamerican sheep",
                "He will not comply. Asked to pause would be a better title.",
                "Hard to be a shittier American than a Trump supporter these days",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 14736,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "If the library has a donation page I’ll happily donate",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "Now the library will buy those books again to replace them and the authors get double the income.",
                "Burning books because you hate what they teach doesn’t make you powerful, it proves you’re scared of knowledge.",
                "Most literate Trump supporter"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 4486,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 32646,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "Gorman County, Oregon.",
                "The children yearn for the mines",
                "This was discovered several years ago. It's not news.",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "If you've ever been out there - it seems like nothing but desert and high desert/mountains,  but look at the area as the watershed that feeds into the Columbia river and the underground aquifers that also feed into the Columbia river and all the tributaries hence forth.\n\nThey can't just go in their and extract it if it's going to hurt the watersheds of the west.\n\nI worked near two superfund sites - I live near superfund site about 15 miles south of me.\n\nExamples:\n\nThe entire south end of Vashon Island and Ruston area (Tacoma WA metro) is contaminated with exaust tailings to the point where plants harvested there contain those chemicals like lead to this day. (There's a summer camp there that predates the smokestacks that kids roll around in the dirt right THERE.) \n\nIn Butte, Montana and subsequently a 200 mile radius and anywhere in the MT/WY/NV area there are both smokestack areas of contamination and pools of deadly chemicals leftover from the 1800s-1970s. Pools of arsenic and lead. If you've been there you know.  Cows and horses just walk around grazing in these areas.\n\nPicher, Oklahoma - \"the most toxic ghost town\" in the USA. The entire story is a trip. Silent Hill type stuff. I went to a museum exhibit on it in Norman.\n\nEdmond, OK - currently having to treat it's watershed contaminated with fracking juices - oh but they won't tell you that.  They just want to see you bougie houses and ride out the earthquakes.  (source - Geologist who works for oil company who quit over it I dated - so dubious.) \n\nQuestion is not \"We make money now\"\n\nbut \"Where will we live AFTER the mine closes and we don't make money anymore?\"\n\nExample of Lithium Extract- from source:\n\n# Brine Extraction\n\nBrine extraction is another method of extracting lithium. This method involves pumping brine from underground aquifers into evaporation ponds. The sun and wind evaporate the water, leaving behind lithium and other minerals. The following are the steps involved in brine extraction:\n\n* Drilling: Wells are drilled into the ground to access the brine.\n* Pumping: The brine is pumped to the surface and transported to the evaporation ponds.\n* Evaporation: The brine is evaporated in the ponds, leaving behind lithium and other minerals.\n* Processing: The extracted lithium is then processed to produce lithium carbonate or other lithium compounds.\n\nBrine extraction is a less costly and less energy-intensive method of extracting lithium. It is also less harmful to the environment than hard rock mining. However, it is highly dependent on weather conditions, and the process can take several months to complete.\n\nOverall, both hard rock mining and brine extraction have their advantages and disadvantages. Companies choose the method that suits their needs and resources.\n\n#",
                "For those unaware, the U.S. has lithium in a ton of places but as of now the only real site that is extracting lithium in any meaningful capacity is in Nevada. There is a site that has been identified for development in Arizona as well.\n\nBut all of that is sort of moot because right now virtually all REFINING of lithium has to go through China so absent developing that domestic refining we won’t be gaining independence any time soon.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/11/2025 16:09:18 UTC"
}