{
    "posts": [
        {
            "category": "HOT",
            "title": "ICE detains University of Alabama doctoral student as government's college crackdown continues",
            "external_url": "https://www.nbcnews.com/news/us-news/university-alabama-doctoral-student-detained-ice-governments-college-c-rcna198320",
            "upvotes": 16892,
            "date": "03/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Alireza-Doroudi-mn-0745-bc5811.jpg",
            "top_comments": [
                "I remember hearing during winter break that exchange students should avoid going home because they might not be allowed back into the US.",
                "Man, I swear this is the kind of stuff that the right wing warned us would happen under liberal government....",
                "Where are the Don't Tread on Me guys now? This is rather...draconian.",
                "I earned my PhD a few years ago. One of the most stressful, engaging, and fucking stressful times of my life. To be suddenly deported? I can't imagine. So much of a PhD program is building and sustaining momentum. To be tanked out like this? These assholes are altering the lives of bright, intelligent, and young people.",
                "So we don't know where he is, what they say he's done, whether he has a lawyer, yet it's a \"crackdown\" as if there's something justifiable here in need of correction.\n\n\nFuck off. ",
                "Trump is making all of us less safe. He’s shredding the legal system and the constitution. And he’s crashing the economy.",
                "Whenever you get mad about this, remember that Congress (controlled by Republicans) could stop this at any time - and they choose not to because they like it.",
                "Abducted.  He was abducted not detained.",
                "This is 100% a trial run to cause some fear. This summer is going to have protests en masse and fully expect we'll start seeing even fully legal citizens start to disappear when those begin.",
                "This administration is lawless."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 2779,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                "At least they have enough whiskey to drown in.",
                "Keep destroying that local economy Kentucky. ",
                "I hope they get everything they voted for.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "I'm not sure of a more elegant way to say this, but every single \"lawmaker\" involved with this can go fuck themselves with a taxidermied porcupine encased in resin.",
                "Beshear is the only reason I can stand living in this state. I swear I’m so tired of the GOP and their bullshit.",
                "Small gov't, states rights!\n\n>Lawmakers overrode Behsear’s veto of [House Bill 398](https://apps.legislature.ky.gov/record/25rs/hb398.html), which would[ roll back enforcement](https://www.lpm.org/news/2025-03-13/kentucky-bill-to-cut-state-worker-protections-passes-senate-nears-final-passage) of any Kentucky worker safety regulations that are more stringent than federal minimums. Supporters say it will cut down on confusion for employers crossing state lines, but [Beshear argued](https://www.lpm.org/news/2025-03-25/beshear-vetoes-bill-that-would-strip-kentucky-worker-protections) that would come at the expense of state autonomy and worker safety.\n\nOh wait..."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump targets 'anti-American ideology' at Smithsonian museums",
            "external_url": "https://www.bbc.co.uk/news/articles/cdjy1jmvvwzo",
            "upvotes": 918,
            "date": "03/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07df/live/3430c980-0ba4-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "I can't wait to find out all about the Trail of Happy Fun Times on my next visit where the Native Americans willing gave up their lands to the settlers acknowledging their superiority and in return we gave them comfort in the form of blankets.  I think a few got sick.....no they're all alive still and opened a casino and it's all gravy baby.",
                "Trying to change history, and enforce self censorship. Classic fascism from a blooming dictator.",
                "Imagine thinking denying your past will make America great again.",
                "It’s not “anti-American” to accurately show our country & people’s history of doing terrible, terrible things — as well as very, very good things.\n\nWhat exactly are you so afraid of, Mr. President?",
                "Hey look, more nazi shit from the American nazi party, formerly known as the republican party.",
                "The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.",
                "What's he gonna do at the zoo, paint all the zebras fucking white?",
                "We've read about this in history class so many times. But never did I think that we would see white washing history right in front of our eyes.",
                "Maybe he’s going to offer visitors a bucket of sand to bury their heads into?",
                "I went to the Smithsonian in 2023 and saw pictures of the KKK gathering on the White House lawn, the text by the photo described the situation and date but was completely neutral about the event. They also have a smashed bus window from an integration era school bus, again, no social commentary, just a statement that it happened because Americans were unhappy with the decision. They also have a case showing a minstrel show suit and black face makeup which is very strange to immortalize. \n\nI understand that the black history museum is right next door but I really didn’t expect American history to be segregated like that. I mean I should have but that’s my white optimism for ya. I know better now."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Israeli soldier tells CBS News he was ordered to use Palestinians as human shields in Gaza",
            "external_url": "https://www.cbsnews.com/news/israeli-soldier-palestinians-human-shields-gaza/",
            "upvotes": 611,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/27/9043b153-7671-47e4-982f-7afa3a2f8870/thumbnail/1200x630/5d20706c78cad9cc8c025f6cab3cfe91/1743033727795.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                ">Tommy said his commander ordered his unit to use Gazan civilians to search buildings for explosives instead of dogs.\n\n>\"They were Palestinian,\" he said. \"We sent them in first to see if the building was clear and check for booby traps…They were trembling and shaking.\"\n\nI'd say it goes further than just using them as shields.",
                "*I was just following orders*\n\n\nThis sounds familiar now we're have I heard this before 🤔",
                "Uh oh, masked agents are going to kidnap CBS execs off the streets now",
                "Being against using human shields is antisemetic. (s/)",
                "If only that was the worst of the war crimes the IDF is committing.  But its not.\n\nEveryone knows they are deliberately committing genocide.  Imagine if during WWII the Americans went through Germany and killed as many civilians burning as possible burning down their homes using the the excuse that all the women and children supported Nazis.\n\nAnd I want to make it clear, most Jewish people I know are appalled at what the IDF is doing.  The IDF is not all Israelis.  Blaming all israelis is just as bad as blaming all palestinians.",
                "Its almost like the Israelis are the real terrorist and the other guys just were fighting back the only way they could against a superior force...\n\nOh wait yeah, Israel was literally founded by Zionist who called themselves terrorist and then the Israeli population elected the leader of a terrorist group as their prime Minister in 1983..\n\n  \nLehi Militant group and Irgun  for those uneducated on the reality of Israel..",
                "I'm confused. Who were the human shields to protect him from?",
                "“I was just following orders” didn’t fly the first time and it shouldn’t fly this time either",
                "Add that to the list of things which Hamas and the IDF have in common",
                "Bad as that sounds, that undersells how bad it is!\n\nIf you conduct activities in civilian areas so that the other side will not attack, that may be described as using human shields. But this soldier describes a protocol of ordering civilians (from the opposing side) into buildings to clear explosives, as this job was too dangerous for soldiers. Surely that's a specific crime beyond \"human shields.\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Criminology student who murdered woman in beach attack jailed for a minimum 39 years",
            "external_url": "https://news.sky.com/story/criminology-student-who-murdered-stranger-in-beach-attack-jailed-for-at-least-39-years-13336704",
            "upvotes": 608,
            "date": "03/28/2025",
            "thumbnail": "https://e3.365dm.com/24/12/1600x900/skynews-nasen-saadi-dorset-police_6779625.jpg?20241218152809",
            "top_comments": [
                ">Saadi was found guilty after a trial at Winchester Crown Court, which heard how Saadi, who was studying criminology at Greenwich University in London, was asked by one of his lecturers: “You’re not planning a murder, are you?”\n\n>He had asked teachers questions about self-defence for murder and how long DNA stays behind.\n\nMakes me think of all the people on here who are always banging on about how easy murder is to get away with if you target someone unconnected to you.",
                "He killed one person of a young, married couple without even knowing her and for absolutelxy no reason? This is heartbreaking.",
                "Why is it always the criminology students?",
                "\"Blacked out\" my ass, he planned this",
                "\"it's just for research\".",
                "Sounds like he found out, THEN fucked around.\n\n😎🕶️\n\nYEEEEAAAAAAAAHHHHHHH",
                "He’s now about to find out that life’s a beach.",
                "Did he know the women or was this just a random murder?\n\n\nNot a very smart guy to be studying all this and still ask his teacher very incriminating questions and attack near security cameras anyway. I'm glad criminals are dumb. But those poor ladies. =(",
                "The student has become the master.",
                "Leopold and Loeb have joined the chat. https://en.m.wikipedia.org/wiki/Leopold_and_Loeb "
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "NY county clerk refuses to file Texas' fine for doctor accused of prescribing abortion pills",
            "external_url": "https://apnews.com/article/abortion-pills-lawsuit-texas-new-york-carpenter-e97d5c38d9429083d03c2a7b385cbbfd",
            "upvotes": 16105,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, didn't they try this shit with the fugitive slave act? Wasn't there a war sometime after that?",
                ">“New York is shredding the Constitution to hide lawbreakers from justice, and it must end,” Paxton said on X. \n\nOh, New York is the one shredding the constitution, is it?",
                "And this sets up the fight they're looking for over NY's shield law, as well as whether they can punish someone in another state that engaged in behavior based in and legal in that state.\n\nIf they win that fight it will be a disaster, but particularly for trans health care and abortion in the short term.",
                "Ken Paxton is a crook who used his position as Texas AG to evade securities fraud charges. ",
                "Well kudos to this person. Putting your job on the line for your principles is courageous. America is going to need a lot more of this.",
                "Ken Paxton should be in jail.",
                "Just wait till Texas has a snatch squad or “bounty hunter” grab her and bring to Texas. Sure it would be illegal, but who’s going to stop them these days.? I’m sure a New York judge would issue an order for her to be brought back, which would swiftly be ignored.",
                "Every blue state should just be straight up refusing to comply and daring them to do something about it at this point.",
                ">Republican Texas State Attorney General Ken Paxton said he was outraged by the refusal and signaled he would take action.\n\nFunny, you don't seem to mind it when Trump ignores a court ruling.  And the ones he's ignoring are even valid!",
                "Sounds like somebody got the memo ... DO NOT COMPLY WITH FASCISTS👍"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to preserve Signal chat on Yemen strikes",
            "external_url": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
            "upvotes": 10028,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e844e726-deae-4aeb-b402-caceb8c47841/pete-hegseth-1-ht-gmh-250325_1742909596131_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Serious question, WTF is going to happen if they don't? I mean, they've already broken the law, disobeyed the Scotus... And... No repercussions.",
                "Jeffrey Goldberg has the chat in case the admin, er, \"loses\" it.",
                "Already deleted.\n\nI'll eat my own ass on camera if I'm wrong.",
                "They might want to think about going with their usual approach of deleting everything and lying.  I'm pretty sure a certain editor in chief will be very happy to share the complete chat with anyone who asks.  Then again, it apparently never occurred to them that if they lied about it he might drop the receipts, so I guess we'll see what happens.",
                "This will go over well",
                "Official communications by US Government employees is already REQUIRED to be preserved. Which is why WE DONT USE FUCKING SIGNAL IN THE FIRST PLACE. \n\nIn the immortal words of Jim Carrey, STOP BREAKING THE LAW, ASSHOLES!!!",
                "The only thing that can stop Trump is congress. And the current one is complicit. \n\nSo, if you want to establish a working system of checks and balances again then do not vote for the republican congressman that is supposed to be serving your district/state. They no longer work for you.",
                "Honestly I’m more afraid of what other things they’ve discussed/are still discussing in Signal that can’t be requested by FOIA.",
                "Just for reference, when Trump promised us all he was going to \"lock her up!!!\" (how's that project coming along, Donnie?), it was for technical violations of the Federal Records Act. The FBI investigated and concluded a) there was no criminal intent, it was simple incompetence, and b) there was no breach of national security.\n\nThere is a presidential version of the FRA called the Presidential Records Act, which is even more restrictive...and Trump violated it on damn near a weekly basis. Every time he tore up an official document--which he did a lot--or deleted a tweet, he was violating the PRA.\n\nAnd now his minions are back to trampling the FRA. What other (illegal) group chats have they had where they deleted the chat?\n\nThe chances this will ever be prosecuted are approximately zero, Republicans don't consider themselves to be responsible for stuff like that. When Colin Powell was SecState, he did pretty much the same thing Hillary Clinton did with the private email server, except he also deleted some *official* mails, which violated the FRA. I must have missed the Faux News OUTRAGE!!!! about that...",
                "but judge, we set the chat to self-delete...."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: FDA staff struggle to meet product review deadlines after DOGE layoffs",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/fda-staff-struggle-meet-product-review-deadlines-after-doge-layoffs-2025-03-27/",
            "upvotes": 6924,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This isn't a bug, it's a feature.\n\n1. Fire all the staff so they can't get their reviews and approvals done in a timely manner.  \n2. Publicly complain that the FDA approvals are taking too long and regulations are too onerous.  \n3. Remove regulations.",
                "3500 FDA employees will be laid off. This is in addition to those already let go",
                "Going back to when America was great and milk producers put formaldehyde in milk to extend the shelf life. Before the FDA all we could do was to plead with the companies to please stop killing kids.\n\nhttps://www.smithsonianmag.com/science-nature/19th-century-fight-bacteria-ridden-milk-embalming-fluid-180970473/",
                "I am a medical device auditor.  I can remember a time when a [483](https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/inspection-references/fda-form-483-frequently-asked-questions) was something to be feared by corporate executives.  Defending companies from the FDA was a career path. Now, it's barely even heard of.\n\nThe FDA was barely surviving as it was.  They were a good organization that [helped a lot of people](https://www.fda.gov/about-fda/fda-history-exhibits/frances-oldham-kelsey-medical-reviewer-famous-averting-public-health-tragedy).  But medical devices and especially pharmaceuticals went the way of Boeing back in [2017](https://en.wikipedia.org/wiki/Executive_Order_13771).  With his [newest deregulation efforts](https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/#:~:text=In%20his%20first%20term%2C%20President,for%20everyone%20new%20regulation%20issued.), it really is gone.  This is just another nail in the coffin.  Hopefully we can rebuild someday.",
                "1. Break government\n\n2. Claim government doesn't work\n\n3. Abandon regulatory agencies, privatize program administration.\n\nEnjoy Russia-West.",
                "Think about it this way......\n\nA health inspector isn't necessarily efficient for a business. But we need them to maintain food safety. It's not fraud, it's not a Kabal of deep state food molesters. It's a necessary protection. \n\nBut if everything is looked at through the lens of business and not country. Well, the health inspector can be made to look \"fraudulent\".",
                "I work at a medical device manufacturer and the documentation and safety guidelines are all targeted at FDA requirements. Audits at the facility are a huge deal, and any pushback on following process gets over ridden because the consequences of a failed audit are not worth the risk. I don't think most companies are going to backslide on purpose but when the watchdog isn't there it becomes much much easier.",
                "The plan to Make America Shittier is working.",
                "Get ready for more food borne illness!",
                "Exclusive: the federal government does in fact provide meaningful services to industry and consumers alike."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Measles case confirmed in person who rode Amtrak train to Washington, D.C., health officials say",
            "external_url": "https://www.cbsnews.com/news/measles-case-confirmed-dc-amtrak-passenger-train-union-station-health-officials/",
            "upvotes": 4969,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/07/14/23986ecc-2f39-4b9f-b257-396da71421b8/thumbnail/1200x630/f3dc1c1d2ba998f1aaafabd7333f28cb/GettyImages-1232126765.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Sure glad that I got a simple injection when I was a child that protects me from getting it",
                "For context, the average person with covid will infect about 3 people.\n\n\nThe average person with measles will infect 12.  It is wildly infectious, and it can kill kids.\n\n\nThere is a reason we worked so hard to get rid of it.",
                "Dude, just drink cod liver oil until you turn yellow and your liver quits",
                "Non responder.\nWe all have neighbors that are non responders to vaccinations.\nThat’s another part of the population that is at risk when people don’t vaccinate.\nPlease vaccinate to protect all of us.",
                "Even though I got my vax as a kid, I am TERRIFIED of catching it. It's, what, a 3% chance of getting it? However, with how it basically resets your immune system, it'd easily kill me. I'm chronically ill with multiple autoimmune disorders, I'm going full lock down if it's spotted in AZ",
                "We still have health officials?",
                "It would be poetic justice if RFK Jr gets it.",
                ">Before becoming contagious, the individual with measles had flown from Minnesota into Reagan National Airport, a spokesperson for the D.C. Health Department told CBS News. Neither the identity nor a description of the individual has been released, but the spokesperson said they were vaccinated against measles.\n\nWell that's scary in multiple ways.  Vaccination isn't 100% and immunity can fade with time, which is why a bunch of anti-vaxxers deciding they're going to make their arrogance everyone else's problem is such a bad scenario.",
                "PSA:\n\n* If you were vaccinated before 1968, get your immunity checked or just get the MMR vaccine. Two vaccines were introduced in 1963 but both were less effective than the 1968 vaccine we use today. Note: You might want to get two doses, since you've never had the MMR that includes the more effective vaccine.\n* If you were vaccinated between 1968 and 1989, get your immunity checked or just get another MMR vaccine. Before 1989, they only gave a single dose. Two doses are more effective. \n* If you were born before or in 1957, you've almost certainly been exposed already and you're immune. \n* If you were vaccinated after 1989, you're almost certainly good. But if your insurance pays for it and you're worried, get checked.",
                "Every state needs to just ban people from texas"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Core inflation in February hits 2.8%, higher than expected; spending increases 0.4%",
            "external_url": "https://www.cnbc.com/2025/03/28/pce-inflation-february-2025-.html",
            "upvotes": 222,
            "date": "03/28/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108122707-1743163583017-gettyimages-2206634387-PERSONAL_CONSUMPTION_EXPENDITURES.jpeg?v=1743163695&w=1920&h=1080",
            "top_comments": [
                "It should be noted that the 0.4% consumer spending increase is LOWER than the forecast of 0.5%",
                "Please note several things.\n\n1. The underlying report is incredibly informative.\n\n2. Half of the increase in month-over-month inflation growth is from shelters. However, there is a lag in this data reflecting supply and demand changes. \n\n3. Tremendous growth in food away from home (FAFH) and general services is likely indicative of broader trends that will become more apparent soon. \n\n4. Couple this with the UMich consumer sentiment and consumer expectations surveys. Both of which came in worse than expected, with inflation being a primary drag.\n\nAre we done winning yet?",
                "Atlanta Fed revised Q1 GDP decline to -2.8 again. Remarkable that it was +3.9 on Feb 2nd. We sure are winning!!",
                "Narrator- “And then it got worse”",
                "I tend to watch my weekly supermarket checkout, which has averaged $132 a week for 2 adults in January, $177 a week in February, and now $184 in March.… that’s almost a 40% jump in two months.",
                "Bad news? Sounds like a witch hunt to me. /s",
                "So its bad news on both fronts. Higher inflation, lower spending. All the lights are blinking red right now.",
                "In other news, \n\n\nDuh",
                "But hey, at least transgender kids can’t play sports now, so it all evens out. /s",
                "A week ago here in Idaho gas was about $3 for basic unleaded.  It's not $3.30.  Time to break out the \"I did that\" sticker yet?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Myanmar, Thailand Earthquakes: Latest Updates | Weather.com",
            "external_url": "https://weather.com/news/news/2025-03-28-powerful-earthquakes-thailand-myanmar",
            "upvotes": 1,
            "date": "03/28/2025",
            "thumbnail": "https://s.w-x.co/03MyanmarThailandEarthquakeAP03.28.2025.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Convicted founder of electric vehicle startup Nikola pardoned by Trump",
            "external_url": "https://apnews.com/article/nikola-trevor-milton-fraud-trump-pardon-3fcebb0a3820cecb205656f2dc3f6764",
            "upvotes": 1,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund less than a month before the November election, according to the Federal Election Commission,\n\nIn case you want to know what the current going rate for a pardon is, it's $1,800,000.00 for a four-year sentence.\n\n____\n>“I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\nA pardon doesn't grant innocence. Accepting one gives the pardoned person ['an imputation of guilt and acceptance of a confession of it'](https://en.wikipedia.org/wiki/Burdick_v._United_States#Decision)."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "140 People killed and 730 injured in Myanmar earthquake.",
            "external_url": "https://apnews.com/article/thailand-earthquake-bangkok-4fce87aced74b1fc0cf260fb5454d353",
            "upvotes": 130,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to be really, really bad isn’t it",
                "Sadly,This number will go higher as communication between location resume .\n\n7.6 can broke any infrastructure, the earth itself can open up or sinks (Soil liquefaction),mountains can literally slide away for hundreds of meters if the conditions are met, the only saving grace is this happens at working hours so most people are awake and can react as best as they can."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Core inflation in February hits 2.8%, higher than expected; spending increases 0.4%",
            "external_url": "https://www.cnbc.com/2025/03/28/pce-inflation-february-2025-.html",
            "upvotes": 220,
            "date": "03/28/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108122707-1743163583017-gettyimages-2206634387-PERSONAL_CONSUMPTION_EXPENDITURES.jpeg?v=1743163695&w=1920&h=1080",
            "top_comments": [
                "It should be noted that the 0.4% consumer spending increase is LOWER than the forecast of 0.5%",
                "Please note several things.\n\n1. The underlying report is incredibly informative.\n\n2. Half of the increase in month-over-month inflation growth is from shelters. However, there is a lag in this data reflecting supply and demand changes. \n\n3. Tremendous growth in food away from home (FAFH) and general services is likely indicative of broader trends that will become more apparent soon. \n\n4. Couple this with the UMich consumer sentiment and consumer expectations surveys. Both of which came in worse than expected, with inflation being a primary drag.\n\nAre we done winning yet?",
                "Atlanta Fed revised Q1 GDP decline to -2.8 again. Remarkable that it was +3.9 on Feb 2nd. We sure are winning!!",
                "Narrator- “And then it got worse”",
                "I tend to watch my weekly supermarket checkout, which has averaged $132 a week for 2 adults in January, $177 a week in February, and now $184 in March.… that’s almost a 40% jump in two months.",
                "Bad news? Sounds like a witch hunt to me. /s",
                "So its bad news on both fronts. Higher inflation, lower spending. All the lights are blinking red right now.",
                "In other news, \n\n\nDuh",
                "But hey, at least transgender kids can’t play sports now, so it all evens out. /s",
                "A week ago here in Idaho gas was about $3 for basic unleaded.  It's not $3.30.  Time to break out the \"I did that\" sticker yet?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Israeli soldier tells CBS News he was ordered to use Palestinians as human shields in Gaza",
            "external_url": "https://www.cbsnews.com/news/israeli-soldier-palestinians-human-shields-gaza/",
            "upvotes": 614,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/27/9043b153-7671-47e4-982f-7afa3a2f8870/thumbnail/1200x630/5d20706c78cad9cc8c025f6cab3cfe91/1743033727795.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                ">Tommy said his commander ordered his unit to use Gazan civilians to search buildings for explosives instead of dogs.\n\n>\"They were Palestinian,\" he said. \"We sent them in first to see if the building was clear and check for booby traps…They were trembling and shaking.\"\n\nI'd say it goes further than just using them as shields.",
                "*I was just following orders*\n\n\nThis sounds familiar now we're have I heard this before 🤔",
                "Uh oh, masked agents are going to kidnap CBS execs off the streets now",
                "Being against using human shields is antisemetic. (s/)",
                "If only that was the worst of the war crimes the IDF is committing.  But its not.\n\nEveryone knows they are deliberately committing genocide.  Imagine if during WWII the Americans went through Germany and killed as many civilians burning as possible burning down their homes using the the excuse that all the women and children supported Nazis.\n\nAnd I want to make it clear, most Jewish people I know are appalled at what the IDF is doing.  The IDF is not all Israelis.  Blaming all israelis is just as bad as blaming all palestinians.",
                "Its almost like the Israelis are the real terrorist and the other guys just were fighting back the only way they could against a superior force...\n\nOh wait yeah, Israel was literally founded by Zionist who called themselves terrorist and then the Israeli population elected the leader of a terrorist group as their prime Minister in 1983..\n\n  \nLehi Militant group and Irgun  for those uneducated on the reality of Israel..",
                "I'm confused. Who were the human shields to protect him from?",
                "“I was just following orders” didn’t fly the first time and it shouldn’t fly this time either",
                "Add that to the list of things which Hamas and the IDF have in common",
                "Bad as that sounds, that undersells how bad it is!\n\nIf you conduct activities in civilian areas so that the other side will not attack, that may be described as using human shields. But this soldier describes a protocol of ordering civilians (from the opposing side) into buildings to clear explosives, as this job was too dangerous for soldiers. Surely that's a specific crime beyond \"human shields.\""
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 2766,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                "At least they have enough whiskey to drown in.",
                "Keep destroying that local economy Kentucky. ",
                "I hope they get everything they voted for.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "I'm not sure of a more elegant way to say this, but every single \"lawmaker\" involved with this can go fuck themselves with a taxidermied porcupine encased in resin.",
                "Beshear is the only reason I can stand living in this state. I swear I’m so tired of the GOP and their bullshit.",
                "Small gov't, states rights!\n\n>Lawmakers overrode Behsear’s veto of [House Bill 398](https://apps.legislature.ky.gov/record/25rs/hb398.html), which would[ roll back enforcement](https://www.lpm.org/news/2025-03-13/kentucky-bill-to-cut-state-worker-protections-passes-senate-nears-final-passage) of any Kentucky worker safety regulations that are more stringent than federal minimums. Supporters say it will cut down on confusion for employers crossing state lines, but [Beshear argued](https://www.lpm.org/news/2025-03-25/beshear-vetoes-bill-that-would-strip-kentucky-worker-protections) that would come at the expense of state autonomy and worker safety.\n\nOh wait..."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "ICE detains University of Alabama doctoral student as government's college crackdown continues",
            "external_url": "https://www.nbcnews.com/news/us-news/university-alabama-doctoral-student-detained-ice-governments-college-c-rcna198320",
            "upvotes": 16928,
            "date": "03/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Alireza-Doroudi-mn-0745-bc5811.jpg",
            "top_comments": [
                "I remember hearing during winter break that exchange students should avoid going home because they might not be allowed back into the US.",
                "Man, I swear this is the kind of stuff that the right wing warned us would happen under liberal government....",
                "Where are the Don't Tread on Me guys now? This is rather...draconian.",
                "I earned my PhD a few years ago. One of the most stressful, engaging, and fucking stressful times of my life. To be suddenly deported? I can't imagine. So much of a PhD program is building and sustaining momentum. To be tanked out like this? These assholes are altering the lives of bright, intelligent, and young people.",
                "So we don't know where he is, what they say he's done, whether he has a lawyer, yet it's a \"crackdown\" as if there's something justifiable here in need of correction.\n\n\nFuck off. ",
                "Trump is making all of us less safe. He’s shredding the legal system and the constitution. And he’s crashing the economy.",
                "Whenever you get mad about this, remember that Congress (controlled by Republicans) could stop this at any time - and they choose not to because they like it.",
                "Abducted.  He was abducted not detained.",
                "This is 100% a trial run to cause some fear. This summer is going to have protests en masse and fully expect we'll start seeing even fully legal citizens start to disappear when those begin.",
                "This administration is lawless."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Thousands turn out for Turkey protests after more than 1,400 arrests",
            "external_url": "https://www.bbc.com/news/articles/ckgz58rz3k8o",
            "upvotes": 97,
            "date": "03/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2c91/live/24694950-09f6-11f0-ae79-e11fcf20b7c7.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "BBC reporter arrested and deported from Turkey",
            "external_url": "https://www.bbc.com/news/articles/cly34rg5ee5o",
            "upvotes": 61,
            "date": "03/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6b73/live/82d6b3e0-0b0b-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Europe imports more Russian gas, aiding wartime economy, report finds",
            "external_url": "https://www.aljazeera.com/news/2025/3/27/europe-imports-more-russian-gas-aiding-wartime-economy-report-finds",
            "upvotes": 88,
            "date": "03/28/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/03/2020-06-01T000000Z_95234624_RC2A0H941BSH_RTRMADP_3_BULGARIA-SERBIA-1743079679.jpg?resize=1920%2C1440",
            "top_comments": [
                "Put your nuclear reactors back online and return to energy independence.",
                "Imported*.\n\nThis is last year and already known.\n\nGas sources are limited, cutting gas without alternative is not possible. Overall Europe has lowered its gas imports.\n\nInstead of chasing gas imports, why don't you chase oil imports.\n\nhttps://energyandcleanair.org/wp/wp-content/uploads/2024/02/image-14.png\n\nAljazeeraNotBiased^tm",
                "This headline and article is kinda trash. Just for the fact that it disproves itself within the first couple paragraphs.\n\n*A report released on Thursday by Ember, an energy think tank, estimates that European purchases of Russian gas amounted to 21.9 billion euros ($23.6bn) last year, compared with 18.7 billion euros ($20.17bn) in financial aid to Ukraine.*\n\n*That figure did not include military aid.*\n\nImagine not including one of the biggest forms of aid going into Ukraine.\n\nNot to mention the two largest and consistent purchasers of Russian energy were Hungary and Slovakia, both currently being run by Pro-Russian leaders. If a nation should be chastised it should be France specifically because of their large increase of Russian LNG over the fall months of 2024, but overall they have greatly reduced their reliance on Russian energy. Just as the whole of the EU has.",
                "Why don't they just buy from Canada 🤷",
                "We are only being fed information about some ephemeral and terrible sanctions against Russia, but in reality business is still continuing and Russia's income has even begun to exceed pre-war levels.",
                "just cant figure it out now can you"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 2775,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                "At least they have enough whiskey to drown in.",
                "Keep destroying that local economy Kentucky. ",
                "I hope they get everything they voted for.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "I'm not sure of a more elegant way to say this, but every single \"lawmaker\" involved with this can go fuck themselves with a taxidermied porcupine encased in resin.",
                "Beshear is the only reason I can stand living in this state. I swear I’m so tired of the GOP and their bullshit.",
                "Small gov't, states rights!\n\n>Lawmakers overrode Behsear’s veto of [House Bill 398](https://apps.legislature.ky.gov/record/25rs/hb398.html), which would[ roll back enforcement](https://www.lpm.org/news/2025-03-13/kentucky-bill-to-cut-state-worker-protections-passes-senate-nears-final-passage) of any Kentucky worker safety regulations that are more stringent than federal minimums. Supporters say it will cut down on confusion for employers crossing state lines, but [Beshear argued](https://www.lpm.org/news/2025-03-25/beshear-vetoes-bill-that-would-strip-kentucky-worker-protections) that would come at the expense of state autonomy and worker safety.\n\nOh wait..."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Israeli soldier tells CBS News he was ordered to use Palestinians as human shields in Gaza",
            "external_url": "https://www.cbsnews.com/news/israeli-soldier-palestinians-human-shields-gaza/",
            "upvotes": 614,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/27/9043b153-7671-47e4-982f-7afa3a2f8870/thumbnail/1200x630/5d20706c78cad9cc8c025f6cab3cfe91/1743033727795.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                ">Tommy said his commander ordered his unit to use Gazan civilians to search buildings for explosives instead of dogs.\n\n>\"They were Palestinian,\" he said. \"We sent them in first to see if the building was clear and check for booby traps…They were trembling and shaking.\"\n\nI'd say it goes further than just using them as shields.",
                "*I was just following orders*\n\n\nThis sounds familiar now we're have I heard this before 🤔",
                "Uh oh, masked agents are going to kidnap CBS execs off the streets now",
                "Being against using human shields is antisemetic. (s/)",
                "If only that was the worst of the war crimes the IDF is committing.  But its not.\n\nEveryone knows they are deliberately committing genocide.  Imagine if during WWII the Americans went through Germany and killed as many civilians burning as possible burning down their homes using the the excuse that all the women and children supported Nazis.\n\nAnd I want to make it clear, most Jewish people I know are appalled at what the IDF is doing.  The IDF is not all Israelis.  Blaming all israelis is just as bad as blaming all palestinians.",
                "Its almost like the Israelis are the real terrorist and the other guys just were fighting back the only way they could against a superior force...\n\nOh wait yeah, Israel was literally founded by Zionist who called themselves terrorist and then the Israeli population elected the leader of a terrorist group as their prime Minister in 1983..\n\n  \nLehi Militant group and Irgun  for those uneducated on the reality of Israel..",
                "I'm confused. Who were the human shields to protect him from?",
                "“I was just following orders” didn’t fly the first time and it shouldn’t fly this time either",
                "Add that to the list of things which Hamas and the IDF have in common",
                "Bad as that sounds, that undersells how bad it is!\n\nIf you conduct activities in civilian areas so that the other side will not attack, that may be described as using human shields. But this soldier describes a protocol of ordering civilians (from the opposing side) into buildings to clear explosives, as this job was too dangerous for soldiers. Surely that's a specific crime beyond \"human shields.\""
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "RISING",
            "title": "Core inflation in February hits 2.8%, higher than expected; spending increases 0.4%",
            "external_url": "https://www.cnbc.com/2025/03/28/pce-inflation-february-2025-.html",
            "upvotes": 224,
            "date": "03/28/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108122707-1743163583017-gettyimages-2206634387-PERSONAL_CONSUMPTION_EXPENDITURES.jpeg?v=1743163695&w=1920&h=1080",
            "top_comments": [
                "It should be noted that the 0.4% consumer spending increase is LOWER than the forecast of 0.5%",
                "Please note several things.\n\n1. The underlying report is incredibly informative.\n\n2. Half of the increase in month-over-month inflation growth is from shelters. However, there is a lag in this data reflecting supply and demand changes. \n\n3. Tremendous growth in food away from home (FAFH) and general services is likely indicative of broader trends that will become more apparent soon. \n\n4. Couple this with the UMich consumer sentiment and consumer expectations surveys. Both of which came in worse than expected, with inflation being a primary drag.\n\nAre we done winning yet?",
                "Atlanta Fed revised Q1 GDP decline to -2.8 again. Remarkable that it was +3.9 on Feb 2nd. We sure are winning!!",
                "Narrator- “And then it got worse”",
                "I tend to watch my weekly supermarket checkout, which has averaged $132 a week for 2 adults in January, $177 a week in February, and now $184 in March.… that’s almost a 40% jump in two months.",
                "Bad news? Sounds like a witch hunt to me. /s",
                "So its bad news on both fronts. Higher inflation, lower spending. All the lights are blinking red right now.",
                "In other news, \n\n\nDuh",
                "But hey, at least transgender kids can’t play sports now, so it all evens out. /s",
                "A week ago here in Idaho gas was about $3 for basic unleaded.  It's not $3.30.  Time to break out the \"I did that\" sticker yet?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "ICE detains University of Alabama doctoral student as government's college crackdown continues",
            "external_url": "https://www.nbcnews.com/news/us-news/university-alabama-doctoral-student-detained-ice-governments-college-c-rcna198320",
            "upvotes": 16943,
            "date": "03/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Alireza-Doroudi-mn-0745-bc5811.jpg",
            "top_comments": [
                "I remember hearing during winter break that exchange students should avoid going home because they might not be allowed back into the US.",
                "Man, I swear this is the kind of stuff that the right wing warned us would happen under liberal government....",
                "Where are the Don't Tread on Me guys now? This is rather...draconian.",
                "I earned my PhD a few years ago. One of the most stressful, engaging, and fucking stressful times of my life. To be suddenly deported? I can't imagine. So much of a PhD program is building and sustaining momentum. To be tanked out like this? These assholes are altering the lives of bright, intelligent, and young people.",
                "So we don't know where he is, what they say he's done, whether he has a lawyer, yet it's a \"crackdown\" as if there's something justifiable here in need of correction.\n\n\nFuck off. ",
                "Trump is making all of us less safe. He’s shredding the legal system and the constitution. And he’s crashing the economy.",
                "Whenever you get mad about this, remember that Congress (controlled by Republicans) could stop this at any time - and they choose not to because they like it.",
                "Abducted.  He was abducted not detained.",
                "This is 100% a trial run to cause some fear. This summer is going to have protests en masse and fully expect we'll start seeing even fully legal citizens start to disappear when those begin.",
                "This administration is lawless."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Trump targets 'anti-American ideology' at Smithsonian museums",
            "external_url": "https://www.bbc.co.uk/news/articles/cdjy1jmvvwzo",
            "upvotes": 917,
            "date": "03/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07df/live/3430c980-0ba4-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "I can't wait to find out all about the Trail of Happy Fun Times on my next visit where the Native Americans willing gave up their lands to the settlers acknowledging their superiority and in return we gave them comfort in the form of blankets.  I think a few got sick.....no they're all alive still and opened a casino and it's all gravy baby.",
                "Trying to change history, and enforce self censorship. Classic fascism from a blooming dictator.",
                "Imagine thinking denying your past will make America great again.",
                "It’s not “anti-American” to accurately show our country & people’s history of doing terrible, terrible things — as well as very, very good things.\n\nWhat exactly are you so afraid of, Mr. President?",
                "Hey look, more nazi shit from the American nazi party, formerly known as the republican party.",
                "The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.",
                "What's he gonna do at the zoo, paint all the zebras fucking white?",
                "We've read about this in history class so many times. But never did I think that we would see white washing history right in front of our eyes.",
                "Maybe he’s going to offer visitors a bucket of sand to bury their heads into?",
                "I went to the Smithsonian in 2023 and saw pictures of the KKK gathering on the White House lawn, the text by the photo described the situation and date but was completely neutral about the event. They also have a smashed bus window from an integration era school bus, again, no social commentary, just a statement that it happened because Americans were unhappy with the decision. They also have a case showing a minstrel show suit and black face makeup which is very strange to immortalize. \n\nI understand that the black history museum is right next door but I really didn’t expect American history to be segregated like that. I mean I should have but that’s my white optimism for ya. I know better now."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "Criminology student who murdered woman in beach attack jailed for a minimum 39 years",
            "external_url": "https://news.sky.com/story/criminology-student-who-murdered-stranger-in-beach-attack-jailed-for-at-least-39-years-13336704",
            "upvotes": 612,
            "date": "03/28/2025",
            "thumbnail": "https://e3.365dm.com/24/12/1600x900/skynews-nasen-saadi-dorset-police_6779625.jpg?20241218152809",
            "top_comments": [
                ">Saadi was found guilty after a trial at Winchester Crown Court, which heard how Saadi, who was studying criminology at Greenwich University in London, was asked by one of his lecturers: “You’re not planning a murder, are you?”\n\n>He had asked teachers questions about self-defence for murder and how long DNA stays behind.\n\nMakes me think of all the people on here who are always banging on about how easy murder is to get away with if you target someone unconnected to you.",
                "He killed one person of a young, married couple without even knowing her and for absolutelxy no reason? This is heartbreaking.",
                "Why is it always the criminology students?",
                "\"Blacked out\" my ass, he planned this",
                "\"it's just for research\".",
                "Sounds like he found out, THEN fucked around.\n\n😎🕶️\n\nYEEEEAAAAAAAAHHHHHHH",
                "He’s now about to find out that life’s a beach.",
                "Did he know the women or was this just a random murder?\n\n\nNot a very smart guy to be studying all this and still ask his teacher very incriminating questions and attack near security cameras anyway. I'm glad criminals are dumb. But those poor ladies. =(",
                "The student has become the master.",
                "Leopold and Loeb have joined the chat. https://en.m.wikipedia.org/wiki/Leopold_and_Loeb "
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Federal agents try detaining healthcare contractor at DC public elementary school",
            "external_url": "https://wjla.com/news/local/federal-agents-dc-elemntary-school-homeland-security-hsi-cooke-dcps-immigration-enforcement-action-healthcare-contractor-student-faculty-safety-protest-resources-tools-support?fbclid=IwZXh0bgNhZW0CMTEAAR3QaTS3flLirFY6KpeS3I0wMmRlwpWr0glpTMKH6wjNtpS3nYRWLhFAFQs_aem_J7kkE8Cvwo9brWgbdN0BBA",
            "upvotes": 756,
            "date": "03/28/2025",
            "thumbnail": "https://wjla.com/resources/media2/16x9/751/986/0x62/90/93159f21-9e2d-4d9a-868a-fe2d34c8fece-HSIatschool.jpg",
            "top_comments": [
                "So they didn’t have warrants?",
                "Covering their faces should be illegal. Law enforcement should never be anonymous. If it is, they're not enforcing the law.",
                "Anyone else wondering when someone is gonna go half cocked and shoot an ICE agent?",
                "It's interesting that the enforcers wear masks, but their bosses don't. Makes me wonder if there would be fewer enforcers if they were unmasked somehow. Or if we'd just make them proudly unmask because that's how not-sees eventually adapt to scorn.",
                "I don't know. It seems like if masked men were coming for me, I'd have to assume they are a gang of criminals",
                "Eventually we will see the same situation as in V for Vendetta play out. People will arm and protect themselves against kidnappers who refuse to identify themselves. Since there is no way to distinguish between officials and gang members in this context and human trafficking is a real thing, expect to see a lot of self defense and shootouts. The administration wants this outcome explicitly so they can be be even more violent.",
                "Another attempted kidnapping.",
                "They're masked because it's fucking illegal",
                "Just training the parents and the students for OMON raids.",
                "I would love for Canada to access Minneapolis, Michigan Illinois and the northeastern border states (New York, Vermont, New Hampshire, Maine and Seattle on the west coast. We have this pesky issue though with making it happen and then having to deal with Wisconsin and Indiana.\n\nI hate this country now and am honestly working on my Japanese again as a possible game plan to work in Tokyo in the future. I have to wait though to hit 5 years on my house though. I really hate where this country has gone to."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Strong 7.7-magnitude earthquake strikes Myanmar, with tremors felt in neighbouring Thailand",
            "external_url": "https://www.theguardian.com/world/2025/mar/28/myanmar-earthquake-thailand-magnitude-thailand-tremors-bangkok",
            "upvotes": 742,
            "date": "03/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/719c4a4f8feea472a4490cf018a6742aec6a537b/0_0_5245_3147/master/5245.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0a3567dc7fdda54252a051579f1707b",
            "top_comments": [
                "I am burmese and I am pretty sure 3 happened in 30 minutes, the earthquakes happened in the centre, I live in Yangon which is about 350 miles away and it still shook very hard here, Sagaing Bridge which is a very long bridge collapsed, also in the centre, the 2nd most populous city in the country mandalay, there were so many buildings collapsed.",
                "This is really bad, the infrastructure won’t be up to a quake that big. It’ll be a few days before we’ll see the effects of this. Another brutal blow for Myanmar.",
                "Got evacuated in Bangkok and at least one construction building collapsed. It won’t be nice to read about casualties and more destruction in Myanmar :(",
                "I first found out about the news on low cost cosplay guy’s FB feed. Looks like he escaped wearing only a towel. Glad he is OK hoping the best for everyone in Thailand and Myanmar.",
                "can someone explain why, although the earthquake centre is in Myanmar, why every time it's mentioned Bangkok is the main focal point and only one being talked about?\n\nIs Myanmar pretty closed off?",
                "The footage of the high rise under construction collapsing in Bangkok is crazy, and that was \"Light Shaking\" from this quake according to USGS.",
                "This gave me so much anxiety. Gonna be days until we know the effects. Thoughts are with them.",
                "This looks really bad, [USGS](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pn9s/pager) is painting a really grim picture on potential casualties. Epicenter is right next to the second largest city in Myanmar. The people there has already gone through way too much in recent years.",
                "[removed]",
                "Have a friend there and no one can contact him"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A pig’s head and decapitated rats: a new era of intimidation dawns for journalists in Indonesia",
            "external_url": "https://www.theguardian.com/world/2025/mar/28/intimidation-journalists-indonesia-pig-heads-rats",
            "upvotes": 206,
            "date": "03/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32d624d8b06a59746f5674ce5c7a0e6447dc9e1a/0_119_5000_3002/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0dbc10b73eda83f6ed1ee24804a69bf3",
            "top_comments": [
                "Honesty I’m almost impressed someone found a pig’s head in the most populous Muslim country on earth, that takes some dedication",
                "You will see that start in the USA"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Man arrested in Las Vegas Tesla arson facing federal charges",
            "external_url": "https://abcnews.go.com/US/man-arrested-after-setting-teslas-fire-las-vegas/story?id=120220369",
            "upvotes": 1229,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5856050-9297-4c9c-9319-b15cf7789567/tesla-damage-suspect-ht-jt-250327_1743108280909_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "… why? Arson isnt federal…",
                "If you look at the conservative subreddit, the only posts up are about Tesla vandalism. It's the only thing they are allowed to talk about in America right now 🤐",
                "All cars matter!\n\nBest thing i ever got from reddit. And I hope it catches on. This whole thing is absurd.",
                "Violently attacking our nation's capitol to overthrow an election = \"freedom fighters\"\n\nSetting fire to a few cars that already have a [rep for self-immolation](https://www.nbcnews.com/business/business-news/tesla-car-battery-fire-needed-6000-gallons-water-to-extinguish-rcna68153) = \"dangerous terrorists\" \n\nRepublicans believe it's important to set standards; either double or very *very* low",
                "So when are you going to arrest all the people on Epstein's list? You're not? What a surprise!",
                "Trump sold the richest man in the world our federal gov't to be used as his personal police force. The level of cronyism and corruption is staggering.",
                "If the government makes the argument that musk works for the government.  Then by law he has to divest of all business holdings because government employees are not allowed to have controlling interest in private companies that do business with the government.",
                "[removed]",
                "No worries apparently when youre a domestic terrorist, the next president is supposed to pardon you",
                "He was at my house playing fifa."
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "03/28/2025 16:10:16 UTC"
}