{
    "posts": [
        {
            "category": "HOT",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 9805,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "Holy fuck this is horrible.",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable.",
                "heart goes out to everyone affected, this shit is horrible."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 7266,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Come on, her visa had just expired in 2017. Maybe she just needed another few years to get around to reapplying."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 12966,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">plotting sabotage\n\nIsn't that technically an act of war?",
                "hell, the US has two doing the same thing- can they take them too?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                "In America we pronounce it “republican”",
                "> the main aim was to undermine military support given by Germany to Ukraine\n\n> bombing and arson attacks on infrastructure used by the military and industrial sites in Germany\n\nHow would that undermine military support Ukraine? It would rather do the opposite and justify opposition to Russia because that kind of terrorism would be hard to defend even for Russia apologists in Germany.",
                "Article is from April 2024",
                "was it JD and Little Marco?",
                "I bet they were in Kegseth's Signal group.",
                "Germany giving me a freedom boner",
                "The russian operatives are sitting in every branch of Western societies and they destroy, sabotage, spy, manipulate... We need to find them, and get rid of them. Once and for all."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Protesters in Milwaukee decry FBI arrest of county judge",
            "external_url": "https://www.latimes.com/world-nation/story/2025-04-26/protesters-chant-after-arrest-of-judge-accused-of-helping-man-evade-immigration-authorities",
            "upvotes": 1292,
            "date": "04/27/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/c088135/2147483647/strip/true/crop/5490x2882+0+389/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbe%2F4f%2F59c88e690512105c2824d4a23bb2%2Ffa48e62bb0a84d8f8571da31f0552766",
            "top_comments": [
                "Not even the judges are safe.",
                "Just a reminder: Fascism isn't coming around the corner, it got here in January.",
                "ICE could have just waited outside the courthouse in a public space for Flores-Ruiz to leave.  They knew he was there.  They knew he’d exit the one area of the courthouse eventually.  They knew he’d not be a threat as he went through security on the way in.  \n\nInstead, they had to make a big show and arrest a county judge to try to intimidate others to do the government’s bidding.  Fight back!\n\nEdit: county, not federal",
                "Key takeaways regarding this situation (not necessarily from this particular article):\n\n* Wisconsin’s Department of Administration sent a recent memo advising state employees regarding ICE (item 4.c.i.):\n\nhttps://www.wpr.org/wp-content/uploads/2025/04/Information-for-State-Employees-Encountering-Federal-Agents-at-Work.pdf\n\n> Do not give your consent for the agent to enter into a non-public area. The agent must have a judicial warrant to do this, and your attorney will advise you on what areas are covered by a warrant.\n\n* A judicial warrant is different from an administrative warrant, the latter of which is issued by ICE itself.\n\n* There is dispute over whether the ICE agents who arrived on April 18 had a warrant. This is semantic obfuscation regarding the difference between judicial and administrative warrants.\n\n* This situation is following recent activity in Milwaukee, in which Immigrations and Customs Enforcement (ICE) agents entered the hallways of the Milwaukee County Courthouse to arrest two individuals on March 20 and April 3. \n\n* More generally, the federal government is escalating efforts to compel local officials to assist in immigration enforcement efforts. Specifically memos issued in January 2025 state that\n\nhttps://www.ice.gov/about-ice/ero/protected-areas\n\n> ICE officers or agents may conduct civil immigration enforcement actions in or near courthouses when they have credible information that leads them to believe the targeted alien(s) is or will be present at a specific location, and where such action is not precluded by laws imposed by the jurisdiction in which the civil immigration enforcement action will take place.\n\n* This is bad policy because immigrants who enter the courthouse might be there to access vital government services, or as a victim or witness to a crime. Any policy that prevents people from participating in the judicial system undermines due process.\n\n* The fight over Judge Dugan's incarceration is a fight over this policy.",
                "oh, hey, maybe she is going to be deported now...",
                "If ICE isn’t angry at you, are you really a Patriot?",
                "So she went out of her way to get into trouble to protect someone that is charged with three counts of battery and domestic abuse?\n\nLook I’m all for protecting people, but this guy fucked up regardless of the political tensions of immigration."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 8369,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 1199,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">written before it sank\n\nI'd be more impressed if it was written on the Titanic *after* it sank",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "\"Looks cool, I'll update after I use it.\"  - Titanic review April 10, 1912.",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "Amazing!",
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "“Delete my browser history”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 9054,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "[removed]",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Due process doesn't exist for enemies of the regime",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "A massive explosion at an Iranian port linked to missile fuel shipment kills 25, injures more than 800",
            "external_url": "https://www.nbcnews.com/world/iran/iran-port-massive-explosion-rcna203147",
            "upvotes": 107,
            "date": "04/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-iran-ch-1148-94d263.jpg",
            "top_comments": [
                "Darn.  That’s unfortunate.\n\nWhat’s everybody having for breakfast?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 95,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. "
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 2113,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "Don't they own a colour printer?",
                "to be fair, it was a print and not an original.",
                "Trash is what you can get away with",
                "inside theft, and a great coverup"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 95,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. "
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "A massive explosion at an Iranian port linked to missile fuel shipment kills 25, injures more than 800",
            "external_url": "https://www.nbcnews.com/world/iran/iran-port-massive-explosion-rcna203147",
            "upvotes": 107,
            "date": "04/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-iran-ch-1148-94d263.jpg",
            "top_comments": [
                "Darn.  That’s unfortunate.\n\nWhat’s everybody having for breakfast?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Protesters in Milwaukee decry FBI arrest of county judge",
            "external_url": "https://www.latimes.com/world-nation/story/2025-04-26/protesters-chant-after-arrest-of-judge-accused-of-helping-man-evade-immigration-authorities",
            "upvotes": 1295,
            "date": "04/27/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/c088135/2147483647/strip/true/crop/5490x2882+0+389/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbe%2F4f%2F59c88e690512105c2824d4a23bb2%2Ffa48e62bb0a84d8f8571da31f0552766",
            "top_comments": [
                "Not even the judges are safe.",
                "Just a reminder: Fascism isn't coming around the corner, it got here in January.",
                "ICE could have just waited outside the courthouse in a public space for Flores-Ruiz to leave.  They knew he was there.  They knew he’d exit the one area of the courthouse eventually.  They knew he’d not be a threat as he went through security on the way in.  \n\nInstead, they had to make a big show and arrest a county judge to try to intimidate others to do the government’s bidding.  Fight back!\n\nEdit: county, not federal",
                "Key takeaways regarding this situation (not necessarily from this particular article):\n\n* Wisconsin’s Department of Administration sent a recent memo advising state employees regarding ICE (item 4.c.i.):\n\nhttps://www.wpr.org/wp-content/uploads/2025/04/Information-for-State-Employees-Encountering-Federal-Agents-at-Work.pdf\n\n> Do not give your consent for the agent to enter into a non-public area. The agent must have a judicial warrant to do this, and your attorney will advise you on what areas are covered by a warrant.\n\n* A judicial warrant is different from an administrative warrant, the latter of which is issued by ICE itself.\n\n* There is dispute over whether the ICE agents who arrived on April 18 had a warrant. This is semantic obfuscation regarding the difference between judicial and administrative warrants.\n\n* This situation is following recent activity in Milwaukee, in which Immigrations and Customs Enforcement (ICE) agents entered the hallways of the Milwaukee County Courthouse to arrest two individuals on March 20 and April 3. \n\n* More generally, the federal government is escalating efforts to compel local officials to assist in immigration enforcement efforts. Specifically memos issued in January 2025 state that\n\nhttps://www.ice.gov/about-ice/ero/protected-areas\n\n> ICE officers or agents may conduct civil immigration enforcement actions in or near courthouses when they have credible information that leads them to believe the targeted alien(s) is or will be present at a specific location, and where such action is not precluded by laws imposed by the jurisdiction in which the civil immigration enforcement action will take place.\n\n* This is bad policy because immigrants who enter the courthouse might be there to access vital government services, or as a victim or witness to a crime. Any policy that prevents people from participating in the judicial system undermines due process.\n\n* The fight over Judge Dugan's incarceration is a fight over this policy.",
                "oh, hey, maybe she is going to be deported now...",
                "If ICE isn’t angry at you, are you really a Patriot?",
                "So she went out of her way to get into trouble to protect someone that is charged with three counts of battery and domestic abuse?\n\nLook I’m all for protecting people, but this guy fucked up regardless of the political tensions of immigration."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 9803,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "Holy fuck this is horrible.",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable.",
                "heart goes out to everyone affected, this shit is horrible."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 7262,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Come on, her visa had just expired in 2017. Maybe she just needed another few years to get around to reapplying."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 1199,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">written before it sank\n\nI'd be more impressed if it was written on the Titanic *after* it sank",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "\"Looks cool, I'll update after I use it.\"  - Titanic review April 10, 1912.",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "Amazing!",
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "“Delete my browser history”"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 12956,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">plotting sabotage\n\nIsn't that technically an act of war?",
                "hell, the US has two doing the same thing- can they take them too?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                "In America we pronounce it “republican”",
                "> the main aim was to undermine military support given by Germany to Ukraine\n\n> bombing and arson attacks on infrastructure used by the military and industrial sites in Germany\n\nHow would that undermine military support Ukraine? It would rather do the opposite and justify opposition to Russia because that kind of terrorism would be hard to defend even for Russia apologists in Germany.",
                "Article is from April 2024",
                "was it JD and Little Marco?",
                "I bet they were in Kegseth's Signal group.",
                "Germany giving me a freedom boner",
                "The russian operatives are sitting in every branch of Western societies and they destroy, sabotage, spy, manipulate... We need to find them, and get rid of them. Once and for all."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "India and Pakistan trade gunfire across Kashmir border after deadly attack",
            "external_url": "https://www.theguardian.com/world/2025/apr/26/india-and-pakistan-trade-gunfire-across-kashmir-border-after-deadly-attack",
            "upvotes": 1400,
            "date": "04/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d0dc540b39d00146bbeb9aac2fce2f5dd1301e1/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=816aca65bfa12301aab71f8bcd18d34e",
            "top_comments": [
                "Whiskey is for drinking.  Water is for fighting over.   Mark twain in a tale as old as time",
                "I didn't have the water wars to kicked off by india/pakistan on my bingo card... sigh.",
                "Just waiting for the nukes, this season of humanity should be the last",
                "For people too worried about this, this is largely a return to status quo on the LoC. \n\nAt one point in recent years the conflict was so intense that [the pakistani army was refusing ](https://www.dawn.com/news/1337974) to disclose casualties to their own government for morale reasons, with India claiming over 300 Pakistanis and 50 Indian soldiers had died that year alone.\n\nWhile this is escalation, it's not escalated anywhere near what it has been previously in recent years prior to the 2021 reinstatement of a ceasefire.",
                "Trump: “They never would have clashed if I was president!”",
                "A slow-moving disaster. Before long it will be on the Front Pages of all media, the world over. \n\nTime for UFOS to show up and disable all nuclear stockpile on the continent",
                "But Pakistan had cancelled all trade with India a few days back.",
                "trying to balance it out I guess, it's usually India and China having fist fights or shooting at each other",
                "Well that’s not great.",
                "I like it when they use sticks and other melee weapons, though! :("
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 2109,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "Don't they own a colour printer?",
                "to be fair, it was a print and not an original.",
                "Trash is what you can get away with",
                "inside theft, and a great coverup"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 8363,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Protesters in Milwaukee decry FBI arrest of county judge",
            "external_url": "https://www.latimes.com/world-nation/story/2025-04-26/protesters-chant-after-arrest-of-judge-accused-of-helping-man-evade-immigration-authorities",
            "upvotes": 1298,
            "date": "04/27/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/c088135/2147483647/strip/true/crop/5490x2882+0+389/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbe%2F4f%2F59c88e690512105c2824d4a23bb2%2Ffa48e62bb0a84d8f8571da31f0552766",
            "top_comments": [
                "Not even the judges are safe.",
                "Just a reminder: Fascism isn't coming around the corner, it got here in January.",
                "ICE could have just waited outside the courthouse in a public space for Flores-Ruiz to leave.  They knew he was there.  They knew he’d exit the one area of the courthouse eventually.  They knew he’d not be a threat as he went through security on the way in.  \n\nInstead, they had to make a big show and arrest a county judge to try to intimidate others to do the government’s bidding.  Fight back!\n\nEdit: county, not federal",
                "Key takeaways regarding this situation (not necessarily from this particular article):\n\n* Wisconsin’s Department of Administration sent a recent memo advising state employees regarding ICE (item 4.c.i.):\n\nhttps://www.wpr.org/wp-content/uploads/2025/04/Information-for-State-Employees-Encountering-Federal-Agents-at-Work.pdf\n\n> Do not give your consent for the agent to enter into a non-public area. The agent must have a judicial warrant to do this, and your attorney will advise you on what areas are covered by a warrant.\n\n* A judicial warrant is different from an administrative warrant, the latter of which is issued by ICE itself.\n\n* There is dispute over whether the ICE agents who arrived on April 18 had a warrant. This is semantic obfuscation regarding the difference between judicial and administrative warrants.\n\n* This situation is following recent activity in Milwaukee, in which Immigrations and Customs Enforcement (ICE) agents entered the hallways of the Milwaukee County Courthouse to arrest two individuals on March 20 and April 3. \n\n* More generally, the federal government is escalating efforts to compel local officials to assist in immigration enforcement efforts. Specifically memos issued in January 2025 state that\n\nhttps://www.ice.gov/about-ice/ero/protected-areas\n\n> ICE officers or agents may conduct civil immigration enforcement actions in or near courthouses when they have credible information that leads them to believe the targeted alien(s) is or will be present at a specific location, and where such action is not precluded by laws imposed by the jurisdiction in which the civil immigration enforcement action will take place.\n\n* This is bad policy because immigrants who enter the courthouse might be there to access vital government services, or as a victim or witness to a crime. Any policy that prevents people from participating in the judicial system undermines due process.\n\n* The fight over Judge Dugan's incarceration is a fight over this policy.",
                "oh, hey, maybe she is going to be deported now...",
                "If ICE isn’t angry at you, are you really a Patriot?",
                "So she went out of her way to get into trouble to protect someone that is charged with three counts of battery and domestic abuse?\n\nLook I’m all for protecting people, but this guy fucked up regardless of the political tensions of immigration."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 7266,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Come on, her visa had just expired in 2017. Maybe she just needed another few years to get around to reapplying."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 9825,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "Holy fuck this is horrible.",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable.",
                "heart goes out to everyone affected, this shit is horrible."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A letter written onboard the Titanic before it sank sells for almost $400,000 at auction",
            "external_url": "https://apnews.com/article/titanic-letter-auction-553f1f51da688913379b0d66d0d9ab3e",
            "upvotes": 1203,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">written before it sank\n\nI'd be more impressed if it was written on the Titanic *after* it sank",
                "*Article Text:*\n\nLONDON — A lettercard penned by one of the Titanic’s most well-known survivors from onboard the ship, days before it sank, has sold for 300,000 pounds ($399,000) at auction.\n\nIn the note, written to the seller’s great-uncle on April 10, 1912, first-class passenger Archibald Gracie wrote of the ill-fated steamship: “It is a fine ship but I shall await my journeys end before I pass judgment on her.”\n\nThe letter was sold to a private collector from the United States on Saturday, according to auction house Henry Aldridge & Son in Wiltshire, England. The hammer price far exceeded the initial estimate price of 60,000 pounds.\n\nThe letter is believed to be the sole example in existence from Gracie from onboard the Titanic, which sank off Newfoundland after hitting an iceberg, killing about 1,500 people on its maiden voyage.\n\nAuctioneer Andrew Aldridge described it as an “exceptional museum grade piece.”\n\nGracie, who jumped from the ship and managed to scramble onto an overturned collapsible boat, was rescued by other passengers onboard a lifeboat and was taken to the R.M.S. Carpathia. He went on to write “The Truth about the Titanic,” an account of his experiences, when he returned to New York City.\n\nGracie boarded the Titanic in Southampton on April 10, 1912, and was assigned first-class cabin C51. His book is seen as one of the most detailed accounts of the events of the night the ship sank, Aldridge said. Gracie did not fully recover from the hypothermia he suffered, and died of complications from diabetes in late 1912.\n\nThe letter was postmarked Queenstown, Ireland, one of two stops the Titanic made before sinking.",
                "> before it sank\n\nAre they sure?",
                "\"Looks cool, I'll update after I use it.\"  - Titanic review April 10, 1912.",
                "I feel that something like this belongs in a museum, not a private collection. ",
                "Amazing!",
                "Dear Mildred:\n\nSend nudes.\n\n  \n\\- Franklin",
                "Idk. This feels gross to me. Don't get me wrong, the letter itself is an exceptionally cool piece of history, but a bunch of rich people and institutions auctioning off history at exorbitant prices while the world is collapsing is a *wild* dichotomy. That dichotomy says a lot of very negative things about those rich people, the culture they exist in, and the systems they build.",
                "History Hit did a video with the auction house about some of the items. https://youtu.be/x-PGO-dGSuA?si=RBzgo4sAC9tBF8ng",
                "“Delete my browser history”"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Germany arrests 2 for allegedly spying for Russia, plotting sabotage to undermine Ukraine aid",
            "external_url": "https://apnews.com/article/germany-russia-spying-sabotage-ukraine-arrests-927490085e244ba72d84e4a374ee198b",
            "upvotes": 12951,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">plotting sabotage\n\nIsn't that technically an act of war?",
                "hell, the US has two doing the same thing- can they take them too?",
                "Thank God they didn't give them a medal, they're all traitors and Russian assets.",
                "In America we pronounce it “republican”",
                "> the main aim was to undermine military support given by Germany to Ukraine\n\n> bombing and arson attacks on infrastructure used by the military and industrial sites in Germany\n\nHow would that undermine military support Ukraine? It would rather do the opposite and justify opposition to Russia because that kind of terrorism would be hard to defend even for Russia apologists in Germany.",
                "Article is from April 2024",
                "was it JD and Little Marco?",
                "I bet they were in Kegseth's Signal group.",
                "Germany giving me a freedom boner",
                "The russian operatives are sitting in every branch of Western societies and they destroy, sabotage, spy, manipulate... We need to find them, and get rid of them. Once and for all."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 8372,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Justice Department revokes Biden-era protections for reporters in leak investigations",
            "external_url": "https://www.npr.org/2025/04/25/nx-s1-5377624/pam-bondi-reporters-subpoena-leaks",
            "upvotes": 9054,
            "date": "04/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7836x4408+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2Fde%2F481878534d12b386c554f6a1a745%2Fgettyimages-2206692415.jpg",
            "top_comments": [
                "This is going to get bad very quickly. Bondi isn't interested in law, she's interested in inflicting harm",
                "I thought this administration was about transparency?",
                "I get that Biden is really, really old... but I don't think the 1st amendment is 'Biden Era'",
                "[removed]",
                "Trump treats his diapers better than our civil rights. At least he changes his diaper in between movements. ",
                "I kinda feel like by rolling back these protections, they're just going to pile on to the super shady shit they've been doing.",
                "Sources will still be protected.... but reporters will be arrested and tortured to give up the names of their informants. (Sounds exactly like 1930's Germany...)",
                "no warrants to search properties for \"illegal migrants\". An immense abuse of power there.\n\nno leak protections for journalists. Terrible!\n\nslowly, but surely going the way of the 3rd reich.",
                "Due process doesn't exist for enemies of the regime",
                "Plot twist: Trump appointed Gary Shapley—the guy who leaked information about the Hunter Biden tax investigation to the media—to the position of IRS Commissioner.\n\n\n\n\nTwist two: presented an elite member of the \"best people\" club and a personal recommendation by Co-president Musk, Garey Shapely's reign lasted 48 hours before he was ousted. \n\n\n\n\nHappy ending; Gary Shapley lands safely from his fall, does the fascist tuck-and-roll, and sashayed elegantly to the right side of Treasury Secretary Scott Basset as one his top advisors."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "A massive explosion at an Iranian port linked to missile fuel shipment kills 25, injures more than 800",
            "external_url": "https://www.nbcnews.com/world/iran/iran-port-massive-explosion-rcna203147",
            "upvotes": 108,
            "date": "04/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-iran-ch-1148-94d263.jpg",
            "top_comments": [
                "Darn.  That’s unfortunate.\n\nWhat’s everybody having for breakfast?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Dutch town hall says it may have accidentally thrown out Andy Warhol work",
            "external_url": "https://www.cnn.com/2025/04/26/style/dutch-town-hall-andy-warhol-intl-scli",
            "upvotes": 2110,
            "date": "04/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2177851616.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They also lost 45 other artworks, and others had suffered water damage by being stored in a basement. Seems like the main culprit was extreme incompetence.",
                "Being from Uden(one of the two municipalities that combined, the root cause of the negligence), the general attitude among us here learning this news back in November when they started the investigation is \"Yeah... that sounds like our mayor's finest alright\".\n\nIt's a damn shame and just woeful but the town hall has been renovated so often for no other reason other than posterity, its a fuckin' miracle that half their priceless stuff wasn't tossed decades ago.",
                "> It is unclear precisely how the lapse happened, and which officials were responsible for throwing out the works, which were valued at around 22,000 euros ($25,000) in total, NOS added.\nThe local authority discovered that the artworks were missing in November and reported their disappearance to the police, but it did not act quickly enough, the report investigating the incident concluded, according to NOS.\n\nWell that's more than an accident, that's negligence. To an embarrassing degree.",
                "How were they only worth $25k if it was a Warhol and 45 other pieces lol. The Warhol alone must be close to that value, if not more. What kind of shit art were they collecting here",
                "It's surprising to me how often the people in charge of prized art can't seem to keep the art from being lost, stolen, or destroyed. I have haphazardly moved a canvas painting my mom did around with me for the last 10 years of my whirlwind of a life, and it still hangs in perfect shape where I currently reside.",
                "Oh yeah right. It’s absolutely hanging in someone’s home right now. Probably an employee who was like: can you believe they were just going to throw this out???",
                "Don't they own a colour printer?",
                "to be fair, it was a print and not an original.",
                "Trash is what you can get away with",
                "inside theft, and a great coverup"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 95,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. "
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "04/27/2025 12:14:03 UTC"
}