{
    "posts": [
        {
            "category": "HOT",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 13745,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "This isn’t a mistake it’s a trial balloon",
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "An immigration attorney….seems suspicious.",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "I have a bridge to sell you if you think it was a mistake",
                "According to MAGA, if they're not white, they're illegal 🤷‍♀️"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 1784,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "They’ll sell it somewhere else.",
                "How long before the american public feels these effects? I wanna see the shocked pikachu faces of the trump supporters when they’re badly hit by all this",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "trump, playing 1-D chess",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "So when China said earlier to stop the nonsense, they meant in that they’ll make it fucking worse if they don’t."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 1677,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad he and his loved ones are alright.",
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "On Passover weekend, too. I believe he is Jewish.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "First night of Passover for a Jewish governor and his family…\n\n\nThis was definitely a hate crime",
                "This was a hate crime."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 2114,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0e6c/live/30aacb10-185d-11f0-b61e-cb0b76a18982.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?",
                "And now Donald Treump will give everything a war criminal ask."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 1594,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Well, no shit.  A Bell 206 helicopter [isn't required to have an FDR or voice recorder.](https://www.law.cornell.edu/cfr/text/14/91.609#:~:text=(1)%20No%20person%20may%20operate,8%20hours%20of%20aircraft%20operation).",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "The vast majority of helicopters operating under part 135 don't have flight recorders. This isn't news.",
                "wouldn’t be fitted, wouldn’t be expected. wouldn’t be a surprise.  move on",
                "This isn't news. They're not required for those operations.",
                "I have to admit that I'm surprised that commercial aircraft are not required by law to have flight recorders."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "US EV Sales Rise As Tesla Sales Fall",
            "external_url": "https://cleantechnica.com/2025/04/13/us-ev-sales-rise-as-tesla-sales-fall/",
            "upvotes": 518,
            "date": "04/13/2025",
            "thumbnail": "https://cleantechnica.com/wp-content/uploads/2024/03/2024-chevrolet-blazer-ev-rs-106.jpg",
            "top_comments": [
                "So we are definitely beyond needing Tesla to lead the charge (pun intended). \n\nThis is good all around.",
                "Tesla still has the most reliable and dependable charging network and a lot of the manufacturers moved over to the NACS standard or are in the process. Has anyone heard of any backing off that strategy?\n\nI sold my Tesla and won’t be buying a fully electric car anytime soon. It’s too risky to put my fate in the erratic hands of Elon Musk and the Trump administration has halted all the investment in charging that Biden pushed through. \n\nThat industry has been set back 10 years in the past eight weeks.",
                "Yeah, once the big automakers realized how much money there is to be made in proprietary charging cables and subscription-based software updates, Tesla's days at the top were numbered. Even presuming they stay relevant because of their self-driving data archive, I believe consumers would rather buy a car from a car company than a car from a software company.",
                "More confirmation that the Tesla killer is none other than Elon Musk, Tesla's own product offerings and strong products for all Tesla competitors. Most likely in that order too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Fan controversially rips ball from Mike Trout’s glove and Los Angeles Dodgers suffer record-breaking defeat",
            "external_url": "https://www.cnn.com/2025/04/13/sport/fan-snatches-mike-trout-catch-spt-intl/index.html?sp_amp_linker=1*tuyekw*amp_id*R2N3YUh3Qi1kYlA0SVdUdzktSWVFVV9Jbm5aTVQ5V1JBSTcwSmlXTEJtYnNOcmRUVWg0Ykp1NWJkNTR2SnNyZg..",
            "upvotes": 968,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25103036733621.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Poorly written title. Happened during an angels game vs Houston. ",
                "Just shoehorned the dodgers in there.",
                "The dad looks like Tim Robinson doing a bit",
                "Mike Trout, Dodgers legend.",
                "The picture (in article) of the guy as the security guard is approaching is too funny. Looks like a Rodney Dangerfield impersonator.",
                "And Trout met with the fan and his kid after the game, chatted them up, and was genuinely just a nice guy about all of it. I think he also gave the kid his bat.",
                "Headline writers: So, the incident had no effect on anything, so how should we write it?\n\nBoss: LIKE IT RUINED AN ENTIRELY DIFFERENT GAME IN A DIFFERENT CITY!",
                "Dodgers have had issues since visiting the White House. Almost like the Universe is telling them something.....",
                "White House curse continues. \n\nFirst the Chiefs, now the Dodgers.",
                "Those are two entirely different events"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "King's College scientists' lab-grown human teeth breakthrough",
            "external_url": "https://www.bbc.com/news/articles/cj9ejj3jzrwo",
            "upvotes": 457,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/81f1/live/3ae8ad00-116d-11f0-a3a8-cd0c869b6aeb.jpg",
            "top_comments": [
                "Unfortunately teeth are considered luxury bones depending on where you live. Damaged teeth are an immense source of constant stress, pain, and focus for people with those issues and with Americans mostly living paycheck to paycheck, you can guess how it affects them constantly when coupled with the lower standards for food, further leading to tooth damage.\n\nI hope I live long enough to see this matter, but I feel I'll just see this breakthrough forced into obscurity.",
                "Why is this pop up always there pestering me to REGISTERRRRR",
                "So I can finally have the built-in castanets I’ve always dreamed of?! \n\nMy flamenco routine is gonna be GREAT",
                "New set of teeth in 24 hours!",
                "We’ll never hear about it again for at least 11 years. For commonality, that is. -THE HS."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 1607,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Democracies which tolerate conservatism will be destroyed by it",
                "Just another demonstration of the failure of the American justice system. This is what happens when partisan judges ignore the law and contort their interpretations to fit the demands of their partisan leaders. When you elect judges and not have formal conflict of interest guidelines you get a predictable result.",
                "They aren't imprisoning criminals. They are selling slaves.",
                "I'd like to have the bottled water concession at his grave site.",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "China’s Xi tells Spanish PM that partnership needed, no mention of talks with US",
            "external_url": "https://apnews.com/article/spain-sanchez-china-tariffs-eu-trade-war-edbd71d8359c86fb01f953728527d0a5?utm_source=copy&utm_medium=share",
            "upvotes": 334,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The current US President found a way to make Xi look reasonable and statesmanlike. New achievement unlocked.",
                "If EU members can't work with the US, they'll work with someone else.",
                "*U.S. Treasury Secretary Scott Bessent called out Spain for its move toward China, saying on Tuesday that Spain — or any country that tries to get closer to China — would be “cutting their own throat” because Chinese manufacturers will be looking to dump goods that they can’t sell in the U.S.*\n\nWhile other countries pursue cooperation during this trade chaos, the imperial Bessent talks of \"cutting throats\" and refers to Chinese shipments to Europe as \"dumping.\"",
                "I would say that China is stealing all of the US's soft power, but that would imply that the US didn't abandon their soft power on the side of the road in the middle of nowhere.",
                "Art of the deal! Make everyone angry against you so they make deals behind your back.",
                "Good Olde Uncle Donnie, busy making America so great, the world is quickly leaving us so far behind, the dust bowl is starting to sound appealing.",
                "Why is he meeting with Spain? Spain is a small player.",
                "Well I mean if the US wants to isolate itself to the degree that it's acting like there really isn't a reason to ever talk to the US for anything other than \"get your airbase out of my country\"."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "US EV Sales Rise As Tesla Sales Fall",
            "external_url": "https://cleantechnica.com/2025/04/13/us-ev-sales-rise-as-tesla-sales-fall/",
            "upvotes": 520,
            "date": "04/13/2025",
            "thumbnail": "https://cleantechnica.com/wp-content/uploads/2024/03/2024-chevrolet-blazer-ev-rs-106.jpg",
            "top_comments": [
                "So we are definitely beyond needing Tesla to lead the charge (pun intended). \n\nThis is good all around.",
                "Tesla still has the most reliable and dependable charging network and a lot of the manufacturers moved over to the NACS standard or are in the process. Has anyone heard of any backing off that strategy?\n\nI sold my Tesla and won’t be buying a fully electric car anytime soon. It’s too risky to put my fate in the erratic hands of Elon Musk and the Trump administration has halted all the investment in charging that Biden pushed through. \n\nThat industry has been set back 10 years in the past eight weeks.",
                "Yeah, once the big automakers realized how much money there is to be made in proprietary charging cables and subscription-based software updates, Tesla's days at the top were numbered. Even presuming they stay relevant because of their self-driving data archive, I believe consumers would rather buy a car from a car company than a car from a software company.",
                "More confirmation that the Tesla killer is none other than Elon Musk, Tesla's own product offerings and strong products for all Tesla competitors. Most likely in that order too."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 1788,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "They’ll sell it somewhere else.",
                "How long before the american public feels these effects? I wanna see the shocked pikachu faces of the trump supporters when they’re badly hit by all this",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "trump, playing 1-D chess",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "So when China said earlier to stop the nonsense, they meant in that they’ll make it fucking worse if they don’t."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "China’s Xi tells Spanish PM that partnership needed, no mention of talks with US",
            "external_url": "https://apnews.com/article/spain-sanchez-china-tariffs-eu-trade-war-edbd71d8359c86fb01f953728527d0a5?utm_source=copy&utm_medium=share",
            "upvotes": 334,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The current US President found a way to make Xi look reasonable and statesmanlike. New achievement unlocked.",
                "If EU members can't work with the US, they'll work with someone else.",
                "*U.S. Treasury Secretary Scott Bessent called out Spain for its move toward China, saying on Tuesday that Spain — or any country that tries to get closer to China — would be “cutting their own throat” because Chinese manufacturers will be looking to dump goods that they can’t sell in the U.S.*\n\nWhile other countries pursue cooperation during this trade chaos, the imperial Bessent talks of \"cutting throats\" and refers to Chinese shipments to Europe as \"dumping.\"",
                "I would say that China is stealing all of the US's soft power, but that would imply that the US didn't abandon their soft power on the side of the road in the middle of nowhere.",
                "Art of the deal! Make everyone angry against you so they make deals behind your back.",
                "Good Olde Uncle Donnie, busy making America so great, the world is quickly leaving us so far behind, the dust bowl is starting to sound appealing.",
                "Why is he meeting with Spain? Spain is a small player.",
                "Well I mean if the US wants to isolate itself to the degree that it's acting like there really isn't a reason to ever talk to the US for anything other than \"get your airbase out of my country\"."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "King's College scientists' lab-grown human teeth breakthrough",
            "external_url": "https://www.bbc.com/news/articles/cj9ejj3jzrwo",
            "upvotes": 456,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/81f1/live/3ae8ad00-116d-11f0-a3a8-cd0c869b6aeb.jpg",
            "top_comments": [
                "Unfortunately teeth are considered luxury bones depending on where you live. Damaged teeth are an immense source of constant stress, pain, and focus for people with those issues and with Americans mostly living paycheck to paycheck, you can guess how it affects them constantly when coupled with the lower standards for food, further leading to tooth damage.\n\nI hope I live long enough to see this matter, but I feel I'll just see this breakthrough forced into obscurity.",
                "Why is this pop up always there pestering me to REGISTERRRRR",
                "So I can finally have the built-in castanets I’ve always dreamed of?! \n\nMy flamenco routine is gonna be GREAT",
                "New set of teeth in 24 hours!",
                "We’ll never hear about it again for at least 11 years. For commonality, that is. -THE HS."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 1676,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad he and his loved ones are alright.",
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "On Passover weekend, too. I believe he is Jewish.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "First night of Passover for a Jewish governor and his family…\n\n\nThis was definitely a hate crime",
                "This was a hate crime."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 13744,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "This isn’t a mistake it’s a trial balloon",
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "An immigration attorney….seems suspicious.",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "I have a bridge to sell you if you think it was a mistake",
                "According to MAGA, if they're not white, they're illegal 🤷‍♀️"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Fan controversially rips ball from Mike Trout’s glove and Los Angeles Dodgers suffer record-breaking defeat",
            "external_url": "https://www.cnn.com/2025/04/13/sport/fan-snatches-mike-trout-catch-spt-intl/index.html?sp_amp_linker=1*tuyekw*amp_id*R2N3YUh3Qi1kYlA0SVdUdzktSWVFVV9Jbm5aTVQ5V1JBSTcwSmlXTEJtYnNOcmRUVWg0Ykp1NWJkNTR2SnNyZg..",
            "upvotes": 965,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25103036733621.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Poorly written title. Happened during an angels game vs Houston. ",
                "Just shoehorned the dodgers in there.",
                "The dad looks like Tim Robinson doing a bit",
                "Mike Trout, Dodgers legend.",
                "The picture (in article) of the guy as the security guard is approaching is too funny. Looks like a Rodney Dangerfield impersonator.",
                "And Trout met with the fan and his kid after the game, chatted them up, and was genuinely just a nice guy about all of it. I think he also gave the kid his bat.",
                "Headline writers: So, the incident had no effect on anything, so how should we write it?\n\nBoss: LIKE IT RUINED AN ENTIRELY DIFFERENT GAME IN A DIFFERENT CITY!",
                "Dodgers have had issues since visiting the White House. Almost like the Universe is telling them something.....",
                "White House curse continues. \n\nFirst the Chiefs, now the Dodgers.",
                "Those are two entirely different events"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 1592,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Well, no shit.  A Bell 206 helicopter [isn't required to have an FDR or voice recorder.](https://www.law.cornell.edu/cfr/text/14/91.609#:~:text=(1)%20No%20person%20may%20operate,8%20hours%20of%20aircraft%20operation).",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "The vast majority of helicopters operating under part 135 don't have flight recorders. This isn't news.",
                "wouldn’t be fitted, wouldn’t be expected. wouldn’t be a surprise.  move on",
                "This isn't news. They're not required for those operations.",
                "I have to admit that I'm surprised that commercial aircraft are not required by law to have flight recorders."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 2113,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0e6c/live/30aacb10-185d-11f0-b61e-cb0b76a18982.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?",
                "And now Donald Treump will give everything a war criminal ask."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 1611,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Democracies which tolerate conservatism will be destroyed by it",
                "Just another demonstration of the failure of the American justice system. This is what happens when partisan judges ignore the law and contort their interpretations to fit the demands of their partisan leaders. When you elect judges and not have formal conflict of interest guidelines you get a predictable result.",
                "They aren't imprisoning criminals. They are selling slaves.",
                "I'd like to have the bottled water concession at his grave site.",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "US EV Sales Rise As Tesla Sales Fall",
            "external_url": "https://cleantechnica.com/2025/04/13/us-ev-sales-rise-as-tesla-sales-fall/",
            "upvotes": 528,
            "date": "04/13/2025",
            "thumbnail": "https://cleantechnica.com/wp-content/uploads/2024/03/2024-chevrolet-blazer-ev-rs-106.jpg",
            "top_comments": [
                "So we are definitely beyond needing Tesla to lead the charge (pun intended). \n\nThis is good all around.",
                "Tesla still has the most reliable and dependable charging network and a lot of the manufacturers moved over to the NACS standard or are in the process. Has anyone heard of any backing off that strategy?\n\nI sold my Tesla and won’t be buying a fully electric car anytime soon. It’s too risky to put my fate in the erratic hands of Elon Musk and the Trump administration has halted all the investment in charging that Biden pushed through. \n\nThat industry has been set back 10 years in the past eight weeks.",
                "Yeah, once the big automakers realized how much money there is to be made in proprietary charging cables and subscription-based software updates, Tesla's days at the top were numbered. Even presuming they stay relevant because of their self-driving data archive, I believe consumers would rather buy a car from a car company than a car from a software company.",
                "More confirmation that the Tesla killer is none other than Elon Musk, Tesla's own product offerings and strong products for all Tesla competitors. Most likely in that order too."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 1795,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "They’ll sell it somewhere else.",
                "How long before the american public feels these effects? I wanna see the shocked pikachu faces of the trump supporters when they’re badly hit by all this",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "trump, playing 1-D chess",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "So when China said earlier to stop the nonsense, they meant in that they’ll make it fucking worse if they don’t."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "King's College scientists' lab-grown human teeth breakthrough",
            "external_url": "https://www.bbc.com/news/articles/cj9ejj3jzrwo",
            "upvotes": 459,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/81f1/live/3ae8ad00-116d-11f0-a3a8-cd0c869b6aeb.jpg",
            "top_comments": [
                "Unfortunately teeth are considered luxury bones depending on where you live. Damaged teeth are an immense source of constant stress, pain, and focus for people with those issues and with Americans mostly living paycheck to paycheck, you can guess how it affects them constantly when coupled with the lower standards for food, further leading to tooth damage.\n\nI hope I live long enough to see this matter, but I feel I'll just see this breakthrough forced into obscurity.",
                "Why is this pop up always there pestering me to REGISTERRRRR",
                "So I can finally have the built-in castanets I’ve always dreamed of?! \n\nMy flamenco routine is gonna be GREAT",
                "New set of teeth in 24 hours!",
                "We’ll never hear about it again for at least 11 years. For commonality, that is. -THE HS."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "China’s Xi tells Spanish PM that partnership needed, no mention of talks with US",
            "external_url": "https://apnews.com/article/spain-sanchez-china-tariffs-eu-trade-war-edbd71d8359c86fb01f953728527d0a5?utm_source=copy&utm_medium=share",
            "upvotes": 334,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The current US President found a way to make Xi look reasonable and statesmanlike. New achievement unlocked.",
                "If EU members can't work with the US, they'll work with someone else.",
                "*U.S. Treasury Secretary Scott Bessent called out Spain for its move toward China, saying on Tuesday that Spain — or any country that tries to get closer to China — would be “cutting their own throat” because Chinese manufacturers will be looking to dump goods that they can’t sell in the U.S.*\n\nWhile other countries pursue cooperation during this trade chaos, the imperial Bessent talks of \"cutting throats\" and refers to Chinese shipments to Europe as \"dumping.\"",
                "I would say that China is stealing all of the US's soft power, but that would imply that the US didn't abandon their soft power on the side of the road in the middle of nowhere.",
                "Art of the deal! Make everyone angry against you so they make deals behind your back.",
                "Good Olde Uncle Donnie, busy making America so great, the world is quickly leaving us so far behind, the dust bowl is starting to sound appealing.",
                "Why is he meeting with Spain? Spain is a small player.",
                "Well I mean if the US wants to isolate itself to the degree that it's acting like there really isn't a reason to ever talk to the US for anything other than \"get your airbase out of my country\"."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 1680,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad he and his loved ones are alright.",
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "On Passover weekend, too. I believe he is Jewish.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "First night of Passover for a Jewish governor and his family…\n\n\nThis was definitely a hate crime",
                "This was a hate crime."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 2117,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0e6c/live/30aacb10-185d-11f0-b61e-cb0b76a18982.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?",
                "And now Donald Treump will give everything a war criminal ask."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 13749,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "This isn’t a mistake it’s a trial balloon",
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "An immigration attorney….seems suspicious.",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "I have a bridge to sell you if you think it was a mistake",
                "According to MAGA, if they're not white, they're illegal 🤷‍♀️"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 1589,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Well, no shit.  A Bell 206 helicopter [isn't required to have an FDR or voice recorder.](https://www.law.cornell.edu/cfr/text/14/91.609#:~:text=(1)%20No%20person%20may%20operate,8%20hours%20of%20aircraft%20operation).",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "The vast majority of helicopters operating under part 135 don't have flight recorders. This isn't news.",
                "wouldn’t be fitted, wouldn’t be expected. wouldn’t be a surprise.  move on",
                "This isn't news. They're not required for those operations.",
                "I have to admit that I'm surprised that commercial aircraft are not required by law to have flight recorders."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Fan controversially rips ball from Mike Trout’s glove and Los Angeles Dodgers suffer record-breaking defeat",
            "external_url": "https://www.cnn.com/2025/04/13/sport/fan-snatches-mike-trout-catch-spt-intl/index.html?sp_amp_linker=1*tuyekw*amp_id*R2N3YUh3Qi1kYlA0SVdUdzktSWVFVV9Jbm5aTVQ5V1JBSTcwSmlXTEJtYnNOcmRUVWg0Ykp1NWJkNTR2SnNyZg..",
            "upvotes": 971,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25103036733621.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Poorly written title. Happened during an angels game vs Houston. ",
                "Just shoehorned the dodgers in there.",
                "The dad looks like Tim Robinson doing a bit",
                "Mike Trout, Dodgers legend.",
                "The picture (in article) of the guy as the security guard is approaching is too funny. Looks like a Rodney Dangerfield impersonator.",
                "And Trout met with the fan and his kid after the game, chatted them up, and was genuinely just a nice guy about all of it. I think he also gave the kid his bat.",
                "Headline writers: So, the incident had no effect on anything, so how should we write it?\n\nBoss: LIKE IT RUINED AN ENTIRELY DIFFERENT GAME IN A DIFFERENT CITY!",
                "Dodgers have had issues since visiting the White House. Almost like the Universe is telling them something.....",
                "White House curse continues. \n\nFirst the Chiefs, now the Dodgers.",
                "Those are two entirely different events"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 1612,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Democracies which tolerate conservatism will be destroyed by it",
                "Just another demonstration of the failure of the American justice system. This is what happens when partisan judges ignore the law and contort their interpretations to fit the demands of their partisan leaders. When you elect judges and not have formal conflict of interest guidelines you get a predictable result.",
                "They aren't imprisoning criminals. They are selling slaves.",
                "I'd like to have the bottled water concession at his grave site.",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/13/2025 20:08:42 UTC"
}