{
    "posts": [
        {
            "category": "HOT",
            "title": "After killing unarmed man, Texas deputy told colleague: 'I just smoked a dude'",
            "external_url": "https://www.nbcnews.com/news/us-news/killing-unarmed-man-texas-deputy-told-colleague-just-smoked-dude-rcna194909",
            "upvotes": 17825,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250429-timothy-randall-mb-1057-678efa.jpg",
            "top_comments": [
                "The \"I just smoked a dude\" isn't even the worst part of this.\n\nThe video in the article is wild to watch.  The officer attacks the dude for no reason, falls to the ground with the suspect and then pulls out his gun and kills the guy.  The guy was barely \"fighting back\".  The fact that the officer was not prosecuted for this very obvious murder shows how bad our justice system is.",
                "How is this anything other than straight up murder. He murdered him. This is not an “officer involved shooting”. This officer murdered an innocent man.",
                "If your police talk about killing someone in the same way as a child playing Fortnite, that should be a hint that your hiring policies need some major reform.",
                ">“I just smoked a dude,” he said in a hushed voice.\"\n\nHey, back the blue folks: can we at least agree that not *everyone* is cut out to be a cop?",
                "If you want to escalate a situation and make it far worse, just involve a cop. That’s their speciality.",
                "Jesus. The same idiot who claims he fired because \"I saw him running at me so I shot\" when the victim is pretty clearly running AWAY probably shouldn't get to claim that he found a meth pipe on him off screen. \n\nDudes clearly not a reliable witness. Probably his personal pipe.",
                "This is 'warrior mindset'. They're at war with the citizens ",
                "Does anyone know how all the police body cam footage is stored? \nEverytime one of these videos is released its after years of trials and a court order. That's got to be a massive amount of footage to keep on hand and safely away from the people who would want it destroyed to protect themselves. \n\nJust curious.",
                "From a foreigner's perspective, Sheriffs and Deputies in the U.S. often appear to be above the law.\n\nThey can \"smoke\" others with impunity, they're shielded by powerful unions that protect them from internal scrutiny, while the media frequently justifies their actions, calling them \"heroes\" for literally shooting people in the back.\n\nIn every incident like this that I’ve witnessed, they have ended up walking free.",
                "Shane Iversen is a murderer. In a just world, he would be rotting in a cell. At least he’s been named now. He doesn’t get to fade into obscurity. That’s not much, but it’s something.\n\nSomeone should also dig into his combat record. If this is how he acts in the US, I can only imagine what he did to innocent civilians in Iraq and Afghanistan."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "UPS announces 20,000 job cuts, 73 facility closures as Amazon reduces volume",
            "external_url": "https://www.denver7.com/politics/economy/ups-announces-job-cuts-and-facility-closures-as-amazon-reduces-volume",
            "upvotes": 3625,
            "date": "04/29/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/2e70855/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5e%2Ff0%2Fdd74befa41c1b6008401f4110cd2%2Fshutterstock-2301462565.jpg",
            "top_comments": [
                "Can't wait to hear the White House spin on this one",
                "I bet the tariff does not help.",
                "There's been a lot of layoff headlines recently, but I don't recall seeing one this big. 20,000 lost jobs hurts.",
                "The slow slide into recession continues.  I'm trying to sock enough away to tank what's coming.",
                "> “As a trusted leader in global logistics, we will leverage our integrated network and trade expertise to assist our customers as they adapt to a changing trade environment. Further, the actions we are taking to reconfigure our network and reduce costs across our business could not be timelier. The macro environment may be uncertain, but with our actions, we will emerge as an even stronger, more nimble UPS.”\n\nGot to love when PR tries to put a positive spin on people losing their jobs in this economy.",
                "20,000 well paying jobs with good benefits and pensions out the door.  What an idiot.",
                "Marks slowing down economy, fear, moving away from US$, recession, financial crisis, and finally, collapse.",
                "That's a hostile and political act, so I have heard.",
                ">Earlier this year, UPS announced that Amazon would reduce its volume by over 50% by mid-2026. Tomé stated that Amazon is UPS' largest partner. In January, Tomé noted that Amazon represented 11.8% of the company's total revenue.\n\nThat's not the steepest cut. But as Amazon goes, other companies will follow. Seems like UPS is getting ahead of the whole thing before the ~~recession~~ amazing economic opportunity hits.",
                "Not buying Amazon paying off."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court weighs whether law enforcement can be held accountable for raid on wrong house",
            "external_url": "https://www.npr.org/2025/04/29/g-s1-62787/supreme-court-law-enforcement-raid",
            "upvotes": 2310,
            "date": "04/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8457x4757+0+440/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2F8e%2F2138380345e084d68d3d74e848d4%2Fgettyimages-1260961721.jpg",
            "top_comments": [
                ">The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations. \n\nYes, these armed LEOs can't be expected to make the same high-stakes determinations as, say, the pizza delivery guy",
                "If the answer to this is \"no,\" then it sets a precedent that \"law enforcement is not responsible for making mistakes that harm innocent people.\"\n\n\nStrange that this is even a discussion, let alone an issue that has to be brought to the Supreme Court. ",
                "Look man, I’m not asking for the world - I would just like our heavily militarized law enforcement agencies to be held to the same address identification standards we hold our Uber Eats drivers to. That bar is already pretty low.",
                "I am curious how this one is going to go. There are too many times the police knock on the wrong door and someone answers it with a gun and it doesn't go well for them and the cops are cleared for it.",
                "The U.S. government typically benefits from “sovereign immunity,” meaning it can’t be sued. But Congress passed the Federal Tort Claims Act in 1946 making an exception to allow lawsuits against the federal government for harms caused by its employees. The statute was amended in 1974, partly in response to two high-profile wrong-house FBI raids.\n\nThe question for the Supreme Court on Tuesday is whether the statute, as amended, now allows victims to sue, period. Or can they sue only if the perpetrators of the raid were following government orders, here orders from the FBI.",
                "Everyday we expect millions of packages, delivery food items to go to the right address.... \n\nBut somehow that minimum expectation is a bar too high for a group of heavily armed para-military forces with the authority to kill citizens as they see fit.",
                "\"The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations.\"\n\nThe FBI trained them. If they can't read a f'n mailbox number, that is a failure to train their agents for 'stressful situations.'\n\nThe CIA can train their agents to resist torture and having their fingers cut off but FBI can't figure out how to get their agents composed enough to read a street address? What are we doing?",
                "Incoming 5-4 with some scathing dissent sprinkled in",
                "I would like law enforcement agencies to do the work and have a strong case before going in on a warrant. That includes verify the residence.",
                "“So, today we’re going to be looking at whether we can expect accountability and lawful behaviour from the people we task with enforcing the law.”\n\n\\- Bought and paid-for SCOTUS, probably"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "LeapFrog founder Mike Wood dies by physician-assisted suicide following Alzheimer’s diagnosis",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/28/leapfrog-founder-mike-wood-dies-by-physician-assisted-suicide-following-alzheimers-diagnosis/",
            "upvotes": 31717,
            "date": "04/29/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/CYTEXYW4O5F7ZFDJ4IWK4NXRTU.png?auth=620058af96365699fe31f0d2ec9e41df68308255a47bb4f5ddb2408a1d5eaca3&width=1200&height=600&smart=true",
            "top_comments": [
                "Family was too poor to get me into preschool. Someone gifted me a leappad when I was real small. I know how to read in part because of this guy.\nI consume books like water nowadays, been through over 20 already this year. Reading is a treasure, thank you Mike!",
                "I didn't realise Switzerland offered assisted death for Alzheimer's patients.    \nIn Australia, once you have a dementia diagnosis you are no longer considered mentally capable of making the decision to access assisted dying. Which seems incredibly unfair considering what a horrific disease it is and that many people are still quite aware when they are diagnosed.",
                "California has assisted suicide, but not for Alzheimer’s or any dementia patients. Even if you chose it early. You can only choose assisted death if you have 6 months or less to live (and have two physicians sign off on it) and are of sound mind.  I think there should be a caveat for dementia patients who can’t afford Switzerland.  It’s a cruel death with little dignity 😢",
                "If you’ve ever known or cared for someone with Alzheimer’s, you’ll know what a selfless action this is for himself and his family. What a devastating diagnosis and decline for everyone. RIP, Mike Wood.",
                "I know this is controversial and will make some people uncomfortable, but I firmly believe that at some point in the future we will recognize that deciding to end your life is an exercise of body autonomy. It is a fundamental human right.",
                "Totally forgot about LeapFrog.  My first born had one and it was an excellent game and learning tool for a preschooler.  RIP innovator.",
                "[deleted]",
                "I'm the sole caregiver to my mother who has severe dementia, to the point where she cannot feed, bathe, or use the bathroom by herself. My sisters live on the other side of the country and can't or won't help, as they have families of their own now. I'm 35 and have no one, so this is my life now. The only thing staying my hand from myself is knowing that my mom would be even worse off without me. It's a horrible existence for both of us. I'm another inmate in the prison that is my mom's body and mind. My parents gave me everything and my biggest regret is having so little to offer in return at the end of their lives. Fuck Alzheimers and dementia. My mother never wanted to live like this, give people the chance to make the dignified choice while they are still capable of doing so.",
                "My autistic non-verbal child has a leappad and using it to spell words is the primary form of his communication it's his favorite toy or even item in our house.",
                "I made it from rural poverty to an Ivy League law degree and when I think of things that made it possible, I have to attribute so much to leapfrog. My mom spent what little money she had on secondhand leapfrog gear. I loved reading (and it’s pretty cheap when you’re not picky). RIP Mr. Wood."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "FBI starts using polygraph tests in internal leak investigations",
            "external_url": "https://www.reuters.com/world/us/fbi-starts-using-polygraph-tests-internal-leak-investigations-2025-04-29/",
            "upvotes": 4693,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why?  Is their astrologer on vacation?",
                "I have a buddy in counterintel who tells me these are basically used as intimidation tactics against people who don't know better",
                "Them: you seem nervous. \n\nMe: because polygraphs aren't conclusive, I'm in a tiny room surrounded by thugs and you fuckin guys are onboard with disappearing people with no warning.",
                "Man, our entire government really is just sprinting full speed ahead into the past, isn't it?  How long til RFK is recommending bloodletting to fix your bad humours and the Air Force is disbanded because if God had wanted us to fly he'd have given us wings?",
                "Shake the magic 8-ball to see if you’re guilty.  ",
                "Too expensive! Throw them in the reflecting pool; if they float they are guilty!",
                "Has the intelligence level dropped that far that fast?",
                "But who polygraphs the polygraphers?!",
                "Man 1 - \"Don't be nervous. It's just if I conclude that you're lying you will be sent to a South American prison for the rest of your life with no chance at release.\"\n\nMan 2 - \"But you're a professional, right? You won't make any mistakes, right?\"\n\nMan 1 - *removing the head of his Easter Bunny costume - \"Of course.\"",
                "So logically, if the agent weighs the same as a duck..."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Tens of thousands of Los Angeles County workers begin 2-day strike",
            "external_url": "https://apnews.com/article/la-county-public-workers-strike-b16c0e137ddbec42c83e9c3a3740112d",
            "upvotes": 1700,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“This is the workforce that got LA County through emergency after emergency: the January wildfires, public health emergencies, mental health emergencies, social service emergencies and more,” said union leader David Green in a statement. “That’s why we have had it with the labor law violations and demand respect for our workers.”\n\nThey've been through the ringer. I wonder why the county is holding out.\n\n>LA County says it’s facing “unprecedented stresses” on its budget, including a tentative $4 billion settlement of thousands of childhood sexual assault claims, a projected $2 billion in impacts related to the LA wildfires in January, and the potential loss of hundreds of millions in federal funding.\n\nOh, sexual assault payouts and Trump. I forgot it was 2025 for a second.",
                "I dont understand how effective a strike can really be if it has a predetermined end time.",
                "Good for them! LA county would be much better off if they defunded police programs and redirected that money to civil servants and social good programs. \n\nThe county supervisor all make huge salaries (over $250,000). They are self-inflated scumbags. Their stations in life depend on the working class.",
                "Nurse here who worked for LA county hospital for almost 5 years and recently quit. Wages haven’t caught up with cost of living and the system is just very very terrible and antiquated. A lot of administration don’t want to retire because of pension and their benefits albeit quite a few are doing their job horribly. The benefits now for new employees are also a joke. A job application takes 6-8 months to process. They constantly hire travel nurses when they are MORE expensive rather than increasing staff wages and hiring more supplemental staff (e.g., CNAs) to help with resourcing. There is a huge turnover for new grads, a lot of them don’t stay there more than 1-2 years. \n\nIt is incredibly sad after what we have sacrificed especially during COVID where we saw our own staff pass away from contracting the disease as well as passing it on to their families. The county needs serious help and reforming.",
                "Isn't California the 4th largest economy in the world? Surely they can spare some of that to make sure their counties run smoothly?",
                "It's not clear from the article what they're striking over, it just says failed negotiations. What are they striking about?",
                "Anddd the city is about to lay off a few hundred public works employees + contractors. That'll bode over well."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr. to End 'Godsend' Narcan Program That Helped Reduce Overdose Deaths Despite His Past Heroin Addiction",
            "external_url": "https://www.latintimes.com/rfk-jr-end-godsend-narcan-program-that-helped-reduce-overdose-deaths-despite-his-past-heroin-581846",
            "upvotes": 61589,
            "date": "04/28/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575177/rfk-jrs-autism-study-use-millions-americans-medical-records.jpg",
            "top_comments": [
                "His brother died of an overdose",
                "Ah yes the party of “I got mine, so screw you”",
                "Can't have those drug addicts getting autism.",
                "Yeah. The hallmark of modern republicans is the *open scorn* of empathy.",
                "absolute piece of shit garbage humanoid",
                "> Recent CDC data shows a nearly 24% drop in overdose deaths for the 12 months ending September 2024, the sharpest one-year decline in decades—an achievement partly attributed to widespread naloxone access.\n\nThat is a massive reduction in deaths. Imagine seeing that kind of positive data and still cutting funding.",
                ">Though Kennedy has previously praised interventions like Narcan as critical to saving lives, he now frames the crisis as one requiring deeper, spiritual and societal change rather than relying solely on “nuts and bolts” medical solutions.\n\n\nwhy have lifesaving medicine like narcan to help reduce overdose deaths when we can just not have that and rely solely on vibes instead?\n\nto be unmistakably clear - they hate you. they are reducing access to the single best weapon we have to treat overdose victims because they don’t want those people to live. if you are unfortunate enough to have lost someone you cared about to an opioid overdose, they want to make sure more people share your pain.\n\nwe are rapidly approaching the point where we need to have our own version of the nuremberg trials for this administration. every single one of them needs to rot in a cell or below one.",
                "Caroline Kennedy claims that RFK got his brother, 13 at the time, addicted to the heroin that killed him at 28.",
                "May as well get rid of all emergency inhalers and EpiPens too. Clearly those people should have rolled better stats on character creation!",
                "They're hardly making any pretenses anymore about the fact that they *want* people to die.\n\nIf you're not a healthy, god-fearing American, you're on your own. Good luck."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 24867,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Remember how Republicans screamed 'LOCK HER UP' for years and years and years - because Hillary used a private server for encrypted email?",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "[deleted]",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "So we can assume that russia has them too, now",
                "I swear Musk would fire a nuke just see what happens."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 8621,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "Hey, remember when the US invaded Iraq and then locals were like, \"OMG DAT DOOD A TERRORIST!\" and later they found out many of them were just neighbors who didn't like them and wanted them gone. I'm sure this isn't anything like that...",
                "Bolstering stats before the 100th day in office tomorrow",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "I have a strong feeling not all of those 800 arrested were illegal immigrants...",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "Just remember, ICE has insane quotas to meet each month. If you think the mistakes were few and far between, its going to get a lot worse, real quick.",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US Navy loses $60 million jet at sea after it fell overboard from aircraft carrier",
            "external_url": "https://www.cnn.com/2025/04/28/politics/us-navy-jet-overboard/index.html",
            "upvotes": 3999,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-8998056.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A US official said that initial reports from the scene indicated that the Truman made a hard turn to evade Houthi fire, which contributed to the fighter jet falling overboard. The Houthi rebel group claimed on Monday to have launched a drone and missile attack on the aircraft carrier, which is in the Red Sea as part of the US military’s major anti-Houthi operation. \n\nIf a carrier is turning to avoid fire, something is seriously wrong with the battlegroup and the ships that are supposed to be screening. \n\nThis response sounds like BS.",
                ">\"The F/A-18E was actively under tow in the hangar bay when the move crew lost control of the aircraft. The aircraft and tow tractor were lost overboard,\" the statement said. \"Sailors towing the aircraft took immediate action to move clear of the aircraft before it fell overboard. An investigation is underway.\"\n\nFrom inside the ship? So it like tumbled all the way out of one of those big side doors?",
                "Did anybody check if Hegseth was somewhere near it at the time?",
                "The Department of Defense swore to, \"find the DEI hire responsible.\"",
                "> *It (the Truman) made headlines in February when it collided with a merchant ship near Egypt; no injuries were reported. Another F/A-18 from the Truman was also “mistakenly fired” upon and shot down by the USS Gettysburg in the Red Sea in December.*\n\nIs this a common amount of “oppsie-daisies” for military deployments ?",
                "Welp, going to need to boot grandma from social security so they can buy two more.",
                "Did the jet even say thank you",
                "Did they try putting it in rice?",
                "A lot of people are saying you can turn a ship fast enough to avoid a missile, but you really can. A lot of big missiles are ballistic in trajectory, so unlike cruise missiles they don’t change course, only make minor corrections to stay on their trajectory, so very easy to predict. Also, unlike hellfires and TOW missiles they’re not actively guided, as in, receiving targeting updates. You give them a location, say have a blast, and send them on their way.\n\nThe math to avoid is fairly simple.\n\nTake an average ballistic missile, say an Iskander, max speed 2600 m/s. Remembering that max speed is going to be in the terminal, and that from launch to apogee (max ord) it’ll be starting from 0 and gaining speed. Let’s give the missile an average of 1500 m/s.\n\nAssuming the carrier strike group is 30 miles out to see, so, ~45km.\n\n45000 meters assuming a generous average of 1500 meters a second gives us 30 seconds to move the ship from where it was going to be to anywhere else. Even turning hard to simply bleed speed would work to move the 1092 ft long flight deck out of the predicted point of impact. Especially if you turn the ship perpendicular to the flight path now the target zone is only 252 feet wide and increases the likelihood the missile will over or under shoot the target. Artillery and missiles don’t average their impacts in circles, but in ovals with the greatest deviation based on the gun to target line (gtl).\n\nAllllll that said, this is still probably a “someone fucked up and we’re gonna try to play it off” thing. I can’t say I haven’t seen and done the same thing before, just, not to this scale.",
                "Whoops \n\nGlad to do my part with “defense” spending and national debt 💸"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "UPS announces 20,000 job cuts, 73 facility closures as Amazon reduces volume",
            "external_url": "https://www.denver7.com/politics/economy/ups-announces-job-cuts-and-facility-closures-as-amazon-reduces-volume",
            "upvotes": 3633,
            "date": "04/29/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/2e70855/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5e%2Ff0%2Fdd74befa41c1b6008401f4110cd2%2Fshutterstock-2301462565.jpg",
            "top_comments": [
                "Can't wait to hear the White House spin on this one",
                "I bet the tariff does not help.",
                "There's been a lot of layoff headlines recently, but I don't recall seeing one this big. 20,000 lost jobs hurts.",
                "The slow slide into recession continues.  I'm trying to sock enough away to tank what's coming.",
                "> “As a trusted leader in global logistics, we will leverage our integrated network and trade expertise to assist our customers as they adapt to a changing trade environment. Further, the actions we are taking to reconfigure our network and reduce costs across our business could not be timelier. The macro environment may be uncertain, but with our actions, we will emerge as an even stronger, more nimble UPS.”\n\nGot to love when PR tries to put a positive spin on people losing their jobs in this economy.",
                "20,000 well paying jobs with good benefits and pensions out the door.  What an idiot.",
                "Marks slowing down economy, fear, moving away from US$, recession, financial crisis, and finally, collapse.",
                "That's a hostile and political act, so I have heard.",
                ">Earlier this year, UPS announced that Amazon would reduce its volume by over 50% by mid-2026. Tomé stated that Amazon is UPS' largest partner. In January, Tomé noted that Amazon represented 11.8% of the company's total revenue.\n\nThat's not the steepest cut. But as Amazon goes, other companies will follow. Seems like UPS is getting ahead of the whole thing before the ~~recession~~ amazing economic opportunity hits.",
                "Not buying Amazon paying off."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court weighs whether law enforcement can be held accountable for raid on wrong house",
            "external_url": "https://www.npr.org/2025/04/29/g-s1-62787/supreme-court-law-enforcement-raid",
            "upvotes": 2305,
            "date": "04/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8457x4757+0+440/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2F8e%2F2138380345e084d68d3d74e848d4%2Fgettyimages-1260961721.jpg",
            "top_comments": [
                ">The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations. \n\nYes, these armed LEOs can't be expected to make the same high-stakes determinations as, say, the pizza delivery guy",
                "If the answer to this is \"no,\" then it sets a precedent that \"law enforcement is not responsible for making mistakes that harm innocent people.\"\n\n\nStrange that this is even a discussion, let alone an issue that has to be brought to the Supreme Court. ",
                "Look man, I’m not asking for the world - I would just like our heavily militarized law enforcement agencies to be held to the same address identification standards we hold our Uber Eats drivers to. That bar is already pretty low.",
                "I am curious how this one is going to go. There are too many times the police knock on the wrong door and someone answers it with a gun and it doesn't go well for them and the cops are cleared for it.",
                "The U.S. government typically benefits from “sovereign immunity,” meaning it can’t be sued. But Congress passed the Federal Tort Claims Act in 1946 making an exception to allow lawsuits against the federal government for harms caused by its employees. The statute was amended in 1974, partly in response to two high-profile wrong-house FBI raids.\n\nThe question for the Supreme Court on Tuesday is whether the statute, as amended, now allows victims to sue, period. Or can they sue only if the perpetrators of the raid were following government orders, here orders from the FBI.",
                "Everyday we expect millions of packages, delivery food items to go to the right address.... \n\nBut somehow that minimum expectation is a bar too high for a group of heavily armed para-military forces with the authority to kill citizens as they see fit.",
                "\"The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations.\"\n\nThe FBI trained them. If they can't read a f'n mailbox number, that is a failure to train their agents for 'stressful situations.'\n\nThe CIA can train their agents to resist torture and having their fingers cut off but FBI can't figure out how to get their agents composed enough to read a street address? What are we doing?",
                "Incoming 5-4 with some scathing dissent sprinkled in",
                "I would like law enforcement agencies to do the work and have a strong case before going in on a warrant. That includes verify the residence.",
                "“So, today we’re going to be looking at whether we can expect accountability and lawful behaviour from the people we task with enforcing the law.”\n\n\\- Bought and paid-for SCOTUS, probably"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "After killing unarmed man, Texas deputy told colleague: 'I just smoked a dude'",
            "external_url": "https://www.nbcnews.com/news/us-news/killing-unarmed-man-texas-deputy-told-colleague-just-smoked-dude-rcna194909",
            "upvotes": 17827,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250429-timothy-randall-mb-1057-678efa.jpg",
            "top_comments": [
                "The \"I just smoked a dude\" isn't even the worst part of this.\n\nThe video in the article is wild to watch.  The officer attacks the dude for no reason, falls to the ground with the suspect and then pulls out his gun and kills the guy.  The guy was barely \"fighting back\".  The fact that the officer was not prosecuted for this very obvious murder shows how bad our justice system is.",
                "How is this anything other than straight up murder. He murdered him. This is not an “officer involved shooting”. This officer murdered an innocent man.",
                "If your police talk about killing someone in the same way as a child playing Fortnite, that should be a hint that your hiring policies need some major reform.",
                ">“I just smoked a dude,” he said in a hushed voice.\"\n\nHey, back the blue folks: can we at least agree that not *everyone* is cut out to be a cop?",
                "If you want to escalate a situation and make it far worse, just involve a cop. That’s their speciality.",
                "Jesus. The same idiot who claims he fired because \"I saw him running at me so I shot\" when the victim is pretty clearly running AWAY probably shouldn't get to claim that he found a meth pipe on him off screen. \n\nDudes clearly not a reliable witness. Probably his personal pipe.",
                "This is 'warrior mindset'. They're at war with the citizens ",
                "Does anyone know how all the police body cam footage is stored? \nEverytime one of these videos is released its after years of trials and a court order. That's got to be a massive amount of footage to keep on hand and safely away from the people who would want it destroyed to protect themselves. \n\nJust curious.",
                "From a foreigner's perspective, Sheriffs and Deputies in the U.S. often appear to be above the law.\n\nThey can \"smoke\" others with impunity, they're shielded by powerful unions that protect them from internal scrutiny, while the media frequently justifies their actions, calling them \"heroes\" for literally shooting people in the back.\n\nIn every incident like this that I’ve witnessed, they have ended up walking free.",
                "Shane Iversen is a murderer. In a just world, he would be rotting in a cell. At least he’s been named now. He doesn’t get to fade into obscurity. That’s not much, but it’s something.\n\nSomeone should also dig into his combat record. If this is how he acts in the US, I can only imagine what he did to innocent civilians in Iraq and Afghanistan."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Cumbria tortoise found a mile from home nine months after going missing",
            "external_url": "https://www.theguardian.com/lifeandstyle/2025/apr/29/slow-news-cumbria-tortoise-found-a-mile-from-home-nine-months-after-going-missing",
            "upvotes": 264,
            "date": "04/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a6d6e5638a23d50d1ae9bf8332c4b5036a4dc0b0/0_321_1440_864/master/1440.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d0619f8a57bdc4eb0a0e982144f1ebac",
            "top_comments": [
                "The tortoise was said to have remarked,\" Son of a bitch, I almost made it.\"",
                " damn, thats .000152 miles an hour",
                "She got distracted and he wandered off … at an average speed of 20 feet per day",
                "Not quite a Proclaimer tortoise. ",
                "finally, some good news!",
                "I once reunited a Russian tortoise with its owners. It had also traveled like 1-2 city miles over months and we were all astonished. That is, until months later when someone only a block from where I found it finally (!) saw one of the signs I had put up all around their house and neighborhood. It was a case of mistaken identity (and we got it reunited with the real owners.)\n\nThe thing is, we had compared multiple pictures of its shell and body with great care before giving it to the wrong people. They really looked totally identical to each other, to the smallest detail, and ever since then I have to wonder about stories like this, and whether the reputation these creatures have for going on incredible journeys is proportional to how hard it is for humans to tell them apart.",
                "Homeward Bound: An Incredibly Slow Journey",
                "Leonardo must be like, teenage now? ",
                "LOL, this post reminds me of my community association’s Facebook page.  \n\nThere was a very similar incident and celebration that followed when a neighbor’s family pet tortoise (called Squirtle) that disappeared last October recent turned up in another neighbor’s backyard.  Their kids were crying tears of joy over Squirtle’s surprise rediscovery and return.  Wholesome. ",
                "Has anybody thought that maybe he was running away for a reason?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Tens of thousands of Los Angeles County workers begin 2-day strike",
            "external_url": "https://apnews.com/article/la-county-public-workers-strike-b16c0e137ddbec42c83e9c3a3740112d",
            "upvotes": 1701,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“This is the workforce that got LA County through emergency after emergency: the January wildfires, public health emergencies, mental health emergencies, social service emergencies and more,” said union leader David Green in a statement. “That’s why we have had it with the labor law violations and demand respect for our workers.”\n\nThey've been through the ringer. I wonder why the county is holding out.\n\n>LA County says it’s facing “unprecedented stresses” on its budget, including a tentative $4 billion settlement of thousands of childhood sexual assault claims, a projected $2 billion in impacts related to the LA wildfires in January, and the potential loss of hundreds of millions in federal funding.\n\nOh, sexual assault payouts and Trump. I forgot it was 2025 for a second.",
                "I dont understand how effective a strike can really be if it has a predetermined end time.",
                "Good for them! LA county would be much better off if they defunded police programs and redirected that money to civil servants and social good programs. \n\nThe county supervisor all make huge salaries (over $250,000). They are self-inflated scumbags. Their stations in life depend on the working class.",
                "Nurse here who worked for LA county hospital for almost 5 years and recently quit. Wages haven’t caught up with cost of living and the system is just very very terrible and antiquated. A lot of administration don’t want to retire because of pension and their benefits albeit quite a few are doing their job horribly. The benefits now for new employees are also a joke. A job application takes 6-8 months to process. They constantly hire travel nurses when they are MORE expensive rather than increasing staff wages and hiring more supplemental staff (e.g., CNAs) to help with resourcing. There is a huge turnover for new grads, a lot of them don’t stay there more than 1-2 years. \n\nIt is incredibly sad after what we have sacrificed especially during COVID where we saw our own staff pass away from contracting the disease as well as passing it on to their families. The county needs serious help and reforming.",
                "Isn't California the 4th largest economy in the world? Surely they can spare some of that to make sure their counties run smoothly?",
                "It's not clear from the article what they're striking over, it just says failed negotiations. What are they striking about?",
                "Anddd the city is about to lay off a few hundred public works employees + contractors. That'll bode over well."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "FBI starts using polygraph tests in internal leak investigations",
            "external_url": "https://www.reuters.com/world/us/fbi-starts-using-polygraph-tests-internal-leak-investigations-2025-04-29/",
            "upvotes": 4695,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why?  Is their astrologer on vacation?",
                "I have a buddy in counterintel who tells me these are basically used as intimidation tactics against people who don't know better",
                "Them: you seem nervous. \n\nMe: because polygraphs aren't conclusive, I'm in a tiny room surrounded by thugs and you fuckin guys are onboard with disappearing people with no warning.",
                "Man, our entire government really is just sprinting full speed ahead into the past, isn't it?  How long til RFK is recommending bloodletting to fix your bad humours and the Air Force is disbanded because if God had wanted us to fly he'd have given us wings?",
                "Shake the magic 8-ball to see if you’re guilty.  ",
                "Too expensive! Throw them in the reflecting pool; if they float they are guilty!",
                "Has the intelligence level dropped that far that fast?",
                "But who polygraphs the polygraphers?!",
                "Man 1 - \"Don't be nervous. It's just if I conclude that you're lying you will be sent to a South American prison for the rest of your life with no chance at release.\"\n\nMan 2 - \"But you're a professional, right? You won't make any mistakes, right?\"\n\nMan 1 - *removing the head of his Easter Bunny costume - \"Of course.\"",
                "So logically, if the agent weighs the same as a duck..."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Lufthansa confirms outlook, braces for possible trade fallout",
            "external_url": "https://www.reuters.com/markets/europe/lufthansa-reports-q1-loss-forecast-braces-possible-trade-fallout-2025-04-29/",
            "upvotes": 140,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Boeing has been getting planes sent back to them instead of being delivered, so they should be able to pick up those sales pretty easily.",
                "They still haven't recovered from 1978."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "LeapFrog founder Mike Wood dies by physician-assisted suicide following Alzheimer’s diagnosis",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/28/leapfrog-founder-mike-wood-dies-by-physician-assisted-suicide-following-alzheimers-diagnosis/",
            "upvotes": 31720,
            "date": "04/29/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/CYTEXYW4O5F7ZFDJ4IWK4NXRTU.png?auth=620058af96365699fe31f0d2ec9e41df68308255a47bb4f5ddb2408a1d5eaca3&width=1200&height=600&smart=true",
            "top_comments": [
                "Family was too poor to get me into preschool. Someone gifted me a leappad when I was real small. I know how to read in part because of this guy.\nI consume books like water nowadays, been through over 20 already this year. Reading is a treasure, thank you Mike!",
                "I didn't realise Switzerland offered assisted death for Alzheimer's patients.    \nIn Australia, once you have a dementia diagnosis you are no longer considered mentally capable of making the decision to access assisted dying. Which seems incredibly unfair considering what a horrific disease it is and that many people are still quite aware when they are diagnosed.",
                "California has assisted suicide, but not for Alzheimer’s or any dementia patients. Even if you chose it early. You can only choose assisted death if you have 6 months or less to live (and have two physicians sign off on it) and are of sound mind.  I think there should be a caveat for dementia patients who can’t afford Switzerland.  It’s a cruel death with little dignity 😢",
                "If you’ve ever known or cared for someone with Alzheimer’s, you’ll know what a selfless action this is for himself and his family. What a devastating diagnosis and decline for everyone. RIP, Mike Wood.",
                "I know this is controversial and will make some people uncomfortable, but I firmly believe that at some point in the future we will recognize that deciding to end your life is an exercise of body autonomy. It is a fundamental human right.",
                "Totally forgot about LeapFrog.  My first born had one and it was an excellent game and learning tool for a preschooler.  RIP innovator.",
                "[deleted]",
                "I'm the sole caregiver to my mother who has severe dementia, to the point where she cannot feed, bathe, or use the bathroom by herself. My sisters live on the other side of the country and can't or won't help, as they have families of their own now. I'm 35 and have no one, so this is my life now. The only thing staying my hand from myself is knowing that my mom would be even worse off without me. It's a horrible existence for both of us. I'm another inmate in the prison that is my mom's body and mind. My parents gave me everything and my biggest regret is having so little to offer in return at the end of their lives. Fuck Alzheimers and dementia. My mother never wanted to live like this, give people the chance to make the dignified choice while they are still capable of doing so.",
                "My autistic non-verbal child has a leappad and using it to spell words is the primary form of his communication it's his favorite toy or even item in our house.",
                "I made it from rural poverty to an Ivy League law degree and when I think of things that made it possible, I have to attribute so much to leapfrog. My mom spent what little money she had on secondhand leapfrog gear. I loved reading (and it’s pretty cheap when you’re not picky). RIP Mr. Wood."
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "NEW",
            "title": "Suspect in Vancouver ramming attack charged with eight counts of murder",
            "external_url": "https://www.theguardian.com/world/2025/apr/28/vancouver-festival-car-attack-suspect-kai-ji-adam-lo-charged-murder-ntwnfb",
            "upvotes": 590,
            "date": "04/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0d0434ef17e19621b4754753fa4806d6746bf7a/0_274_8263_4960/master/8263.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=33c7e7a4eb57a1cc0a09299911037807",
            "top_comments": [
                "*More charges were possible against Kai-Ji Adam Lo, 30, the British Columbia prosecution service said. Investigators ruled out terrorism and said Lo had a history of mental health issues.*\n\nThe most important point, apart from the multiple tragedies.",
                "Sad for the community, families, and everyone involved",
                "Never should have closed Riverview",
                "This is one of the cases where I think someone with mental issues got into a stressful situation and had a panic attack then fight or flight kicked in and caused a tragedy for the victims and the perpetrator.",
                "Can’t believe they didn’t install any concrete blocks or anything to prevent this. So stupid. ",
                "[removed]",
                "This is definitely strengthening the case for voting for a Filipino pope."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Four killed when vehicle crashes into after-school program site in Illinois",
            "external_url": "https://www.nbcnews.com/news/us-news/chatham-illinois-camp-deadly-crash-rcna203426",
            "upvotes": 2006,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-chatham-illinois-crash-ac-957p-621cc7.jpg",
            "top_comments": [
                "“Four people 4 to 18” four kids :(",
                "This was in my hometown…. Such a tight community. This breaks my heart.",
                "> Authorities have not indicated if they think the crash was intentional. \n\nWe live in a world where before I read the article and I saw just the headline, I legitimately have to question if this person did it on purpose or not.",
                "Sounds to me like someone too old to drive. Could be intentional but I doubt it. \n\nI've noticed a recent uptick in old drivers getting extra scary to drive around.",
                "This breaks my heart, 4 kids being ripped out of life and from their loved ones. \n\nRest in peace you beautiful souls and may the next plane of existence be better than this one. \n\nMy heart goes out to all of the families and their community, things like this not only shatter families but often the communities that surround them.",
                "Pray it's not intentional, down to reckless driving, and just a medical emergency (though that person will probably not wanns live once they know what they did).",
                "Friends for the love of god IF you drink stay at home.  What an irresponsible idiot!!",
                "How many times do we have to be taught this lesson? We need more public transit in this country.",
                "Why are people, anyone, hurting children? What the actual fuck.\n\nEdit: even if a freak accident (from the wording of the article) it’s still fucked up. Poor families",
                "I grew up my entire life in Chatham and my mom and I did home daycare there. Please for the love of everything don't be one of our kids..."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court weighs whether law enforcement can be held accountable for raid on wrong house",
            "external_url": "https://www.npr.org/2025/04/29/g-s1-62787/supreme-court-law-enforcement-raid",
            "upvotes": 2318,
            "date": "04/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8457x4757+0+440/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F75%2F8e%2F2138380345e084d68d3d74e848d4%2Fgettyimages-1260961721.jpg",
            "top_comments": [
                ">The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations. \n\nYes, these armed LEOs can't be expected to make the same high-stakes determinations as, say, the pizza delivery guy",
                "If the answer to this is \"no,\" then it sets a precedent that \"law enforcement is not responsible for making mistakes that harm innocent people.\"\n\n\nStrange that this is even a discussion, let alone an issue that has to be brought to the Supreme Court. ",
                "Look man, I’m not asking for the world - I would just like our heavily militarized law enforcement agencies to be held to the same address identification standards we hold our Uber Eats drivers to. That bar is already pretty low.",
                "I am curious how this one is going to go. There are too many times the police knock on the wrong door and someone answers it with a gun and it doesn't go well for them and the cops are cleared for it.",
                "The U.S. government typically benefits from “sovereign immunity,” meaning it can’t be sued. But Congress passed the Federal Tort Claims Act in 1946 making an exception to allow lawsuits against the federal government for harms caused by its employees. The statute was amended in 1974, partly in response to two high-profile wrong-house FBI raids.\n\nThe question for the Supreme Court on Tuesday is whether the statute, as amended, now allows victims to sue, period. Or can they sue only if the perpetrators of the raid were following government orders, here orders from the FBI.",
                "Everyday we expect millions of packages, delivery food items to go to the right address.... \n\nBut somehow that minimum expectation is a bar too high for a group of heavily armed para-military forces with the authority to kill citizens as they see fit.",
                "\"The government's argument is that the FBI officers were told to go to the right home, not the home they raided, and that the FBI should not be liable for every wrong judgment call a federal officer makes in these stressful situations.\"\n\nThe FBI trained them. If they can't read a f'n mailbox number, that is a failure to train their agents for 'stressful situations.'\n\nThe CIA can train their agents to resist torture and having their fingers cut off but FBI can't figure out how to get their agents composed enough to read a street address? What are we doing?",
                "Incoming 5-4 with some scathing dissent sprinkled in",
                "I would like law enforcement agencies to do the work and have a strong case before going in on a warrant. That includes verify the residence.",
                "“So, today we’re going to be looking at whether we can expect accountability and lawful behaviour from the people we task with enforcing the law.”\n\n\\- Bought and paid-for SCOTUS, probably"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "UPS announces 20,000 job cuts, 73 facility closures as Amazon reduces volume",
            "external_url": "https://www.denver7.com/politics/economy/ups-announces-job-cuts-and-facility-closures-as-amazon-reduces-volume",
            "upvotes": 3629,
            "date": "04/29/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/2e70855/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5e%2Ff0%2Fdd74befa41c1b6008401f4110cd2%2Fshutterstock-2301462565.jpg",
            "top_comments": [
                "Can't wait to hear the White House spin on this one",
                "I bet the tariff does not help.",
                "There's been a lot of layoff headlines recently, but I don't recall seeing one this big. 20,000 lost jobs hurts.",
                "The slow slide into recession continues.  I'm trying to sock enough away to tank what's coming.",
                "> “As a trusted leader in global logistics, we will leverage our integrated network and trade expertise to assist our customers as they adapt to a changing trade environment. Further, the actions we are taking to reconfigure our network and reduce costs across our business could not be timelier. The macro environment may be uncertain, but with our actions, we will emerge as an even stronger, more nimble UPS.”\n\nGot to love when PR tries to put a positive spin on people losing their jobs in this economy.",
                "20,000 well paying jobs with good benefits and pensions out the door.  What an idiot.",
                "Marks slowing down economy, fear, moving away from US$, recession, financial crisis, and finally, collapse.",
                "That's a hostile and political act, so I have heard.",
                ">Earlier this year, UPS announced that Amazon would reduce its volume by over 50% by mid-2026. Tomé stated that Amazon is UPS' largest partner. In January, Tomé noted that Amazon represented 11.8% of the company's total revenue.\n\nThat's not the steepest cut. But as Amazon goes, other companies will follow. Seems like UPS is getting ahead of the whole thing before the ~~recession~~ amazing economic opportunity hits.",
                "Not buying Amazon paying off."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Tens of thousands of Los Angeles County workers begin 2-day strike",
            "external_url": "https://apnews.com/article/la-county-public-workers-strike-b16c0e137ddbec42c83e9c3a3740112d",
            "upvotes": 1704,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“This is the workforce that got LA County through emergency after emergency: the January wildfires, public health emergencies, mental health emergencies, social service emergencies and more,” said union leader David Green in a statement. “That’s why we have had it with the labor law violations and demand respect for our workers.”\n\nThey've been through the ringer. I wonder why the county is holding out.\n\n>LA County says it’s facing “unprecedented stresses” on its budget, including a tentative $4 billion settlement of thousands of childhood sexual assault claims, a projected $2 billion in impacts related to the LA wildfires in January, and the potential loss of hundreds of millions in federal funding.\n\nOh, sexual assault payouts and Trump. I forgot it was 2025 for a second.",
                "I dont understand how effective a strike can really be if it has a predetermined end time.",
                "Good for them! LA county would be much better off if they defunded police programs and redirected that money to civil servants and social good programs. \n\nThe county supervisor all make huge salaries (over $250,000). They are self-inflated scumbags. Their stations in life depend on the working class.",
                "Nurse here who worked for LA county hospital for almost 5 years and recently quit. Wages haven’t caught up with cost of living and the system is just very very terrible and antiquated. A lot of administration don’t want to retire because of pension and their benefits albeit quite a few are doing their job horribly. The benefits now for new employees are also a joke. A job application takes 6-8 months to process. They constantly hire travel nurses when they are MORE expensive rather than increasing staff wages and hiring more supplemental staff (e.g., CNAs) to help with resourcing. There is a huge turnover for new grads, a lot of them don’t stay there more than 1-2 years. \n\nIt is incredibly sad after what we have sacrificed especially during COVID where we saw our own staff pass away from contracting the disease as well as passing it on to their families. The county needs serious help and reforming.",
                "Isn't California the 4th largest economy in the world? Surely they can spare some of that to make sure their counties run smoothly?",
                "It's not clear from the article what they're striking over, it just says failed negotiations. What are they striking about?",
                "Anddd the city is about to lay off a few hundred public works employees + contractors. That'll bode over well."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "After killing unarmed man, Texas deputy told colleague: 'I just smoked a dude'",
            "external_url": "https://www.nbcnews.com/news/us-news/killing-unarmed-man-texas-deputy-told-colleague-just-smoked-dude-rcna194909",
            "upvotes": 17823,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250429-timothy-randall-mb-1057-678efa.jpg",
            "top_comments": [
                "The \"I just smoked a dude\" isn't even the worst part of this.\n\nThe video in the article is wild to watch.  The officer attacks the dude for no reason, falls to the ground with the suspect and then pulls out his gun and kills the guy.  The guy was barely \"fighting back\".  The fact that the officer was not prosecuted for this very obvious murder shows how bad our justice system is.",
                "How is this anything other than straight up murder. He murdered him. This is not an “officer involved shooting”. This officer murdered an innocent man.",
                "If your police talk about killing someone in the same way as a child playing Fortnite, that should be a hint that your hiring policies need some major reform.",
                ">“I just smoked a dude,” he said in a hushed voice.\"\n\nHey, back the blue folks: can we at least agree that not *everyone* is cut out to be a cop?",
                "If you want to escalate a situation and make it far worse, just involve a cop. That’s their speciality.",
                "Jesus. The same idiot who claims he fired because \"I saw him running at me so I shot\" when the victim is pretty clearly running AWAY probably shouldn't get to claim that he found a meth pipe on him off screen. \n\nDudes clearly not a reliable witness. Probably his personal pipe.",
                "This is 'warrior mindset'. They're at war with the citizens ",
                "Does anyone know how all the police body cam footage is stored? \nEverytime one of these videos is released its after years of trials and a court order. That's got to be a massive amount of footage to keep on hand and safely away from the people who would want it destroyed to protect themselves. \n\nJust curious.",
                "From a foreigner's perspective, Sheriffs and Deputies in the U.S. often appear to be above the law.\n\nThey can \"smoke\" others with impunity, they're shielded by powerful unions that protect them from internal scrutiny, while the media frequently justifies their actions, calling them \"heroes\" for literally shooting people in the back.\n\nIn every incident like this that I’ve witnessed, they have ended up walking free.",
                "Shane Iversen is a murderer. In a just world, he would be rotting in a cell. At least he’s been named now. He doesn’t get to fade into obscurity. That’s not much, but it’s something.\n\nSomeone should also dig into his combat record. If this is how he acts in the US, I can only imagine what he did to innocent civilians in Iraq and Afghanistan."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Cumbria tortoise found a mile from home nine months after going missing",
            "external_url": "https://www.theguardian.com/lifeandstyle/2025/apr/29/slow-news-cumbria-tortoise-found-a-mile-from-home-nine-months-after-going-missing",
            "upvotes": 265,
            "date": "04/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a6d6e5638a23d50d1ae9bf8332c4b5036a4dc0b0/0_321_1440_864/master/1440.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d0619f8a57bdc4eb0a0e982144f1ebac",
            "top_comments": [
                "The tortoise was said to have remarked,\" Son of a bitch, I almost made it.\"",
                " damn, thats .000152 miles an hour",
                "She got distracted and he wandered off … at an average speed of 20 feet per day",
                "Not quite a Proclaimer tortoise. ",
                "finally, some good news!",
                "I once reunited a Russian tortoise with its owners. It had also traveled like 1-2 city miles over months and we were all astonished. That is, until months later when someone only a block from where I found it finally (!) saw one of the signs I had put up all around their house and neighborhood. It was a case of mistaken identity (and we got it reunited with the real owners.)\n\nThe thing is, we had compared multiple pictures of its shell and body with great care before giving it to the wrong people. They really looked totally identical to each other, to the smallest detail, and ever since then I have to wonder about stories like this, and whether the reputation these creatures have for going on incredible journeys is proportional to how hard it is for humans to tell them apart.",
                "Homeward Bound: An Incredibly Slow Journey",
                "Leonardo must be like, teenage now? ",
                "LOL, this post reminds me of my community association’s Facebook page.  \n\nThere was a very similar incident and celebration that followed when a neighbor’s family pet tortoise (called Squirtle) that disappeared last October recent turned up in another neighbor’s backyard.  Their kids were crying tears of joy over Squirtle’s surprise rediscovery and return.  Wholesome. ",
                "Has anybody thought that maybe he was running away for a reason?"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "FBI starts using polygraph tests in internal leak investigations",
            "external_url": "https://www.reuters.com/world/us/fbi-starts-using-polygraph-tests-internal-leak-investigations-2025-04-29/",
            "upvotes": 4692,
            "date": "04/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why?  Is their astrologer on vacation?",
                "I have a buddy in counterintel who tells me these are basically used as intimidation tactics against people who don't know better",
                "Them: you seem nervous. \n\nMe: because polygraphs aren't conclusive, I'm in a tiny room surrounded by thugs and you fuckin guys are onboard with disappearing people with no warning.",
                "Man, our entire government really is just sprinting full speed ahead into the past, isn't it?  How long til RFK is recommending bloodletting to fix your bad humours and the Air Force is disbanded because if God had wanted us to fly he'd have given us wings?",
                "Shake the magic 8-ball to see if you’re guilty.  ",
                "Too expensive! Throw them in the reflecting pool; if they float they are guilty!",
                "Has the intelligence level dropped that far that fast?",
                "But who polygraphs the polygraphers?!",
                "Man 1 - \"Don't be nervous. It's just if I conclude that you're lying you will be sent to a South American prison for the rest of your life with no chance at release.\"\n\nMan 2 - \"But you're a professional, right? You won't make any mistakes, right?\"\n\nMan 1 - *removing the head of his Easter Bunny costume - \"Of course.\"",
                "So logically, if the agent weighs the same as a duck..."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "LeapFrog founder Mike Wood dies by physician-assisted suicide following Alzheimer’s diagnosis",
            "external_url": "https://www.atlantanewsfirst.com/2025/04/28/leapfrog-founder-mike-wood-dies-by-physician-assisted-suicide-following-alzheimers-diagnosis/",
            "upvotes": 31727,
            "date": "04/29/2025",
            "thumbnail": "https://gray-wgcl-prod.gtv-cdn.com/resizer/v2/CYTEXYW4O5F7ZFDJ4IWK4NXRTU.png?auth=620058af96365699fe31f0d2ec9e41df68308255a47bb4f5ddb2408a1d5eaca3&width=1200&height=600&smart=true",
            "top_comments": [
                "Family was too poor to get me into preschool. Someone gifted me a leappad when I was real small. I know how to read in part because of this guy.\nI consume books like water nowadays, been through over 20 already this year. Reading is a treasure, thank you Mike!",
                "I didn't realise Switzerland offered assisted death for Alzheimer's patients.    \nIn Australia, once you have a dementia diagnosis you are no longer considered mentally capable of making the decision to access assisted dying. Which seems incredibly unfair considering what a horrific disease it is and that many people are still quite aware when they are diagnosed.",
                "California has assisted suicide, but not for Alzheimer’s or any dementia patients. Even if you chose it early. You can only choose assisted death if you have 6 months or less to live (and have two physicians sign off on it) and are of sound mind.  I think there should be a caveat for dementia patients who can’t afford Switzerland.  It’s a cruel death with little dignity 😢",
                "If you’ve ever known or cared for someone with Alzheimer’s, you’ll know what a selfless action this is for himself and his family. What a devastating diagnosis and decline for everyone. RIP, Mike Wood.",
                "I know this is controversial and will make some people uncomfortable, but I firmly believe that at some point in the future we will recognize that deciding to end your life is an exercise of body autonomy. It is a fundamental human right.",
                "Totally forgot about LeapFrog.  My first born had one and it was an excellent game and learning tool for a preschooler.  RIP innovator.",
                "[deleted]",
                "I'm the sole caregiver to my mother who has severe dementia, to the point where she cannot feed, bathe, or use the bathroom by herself. My sisters live on the other side of the country and can't or won't help, as they have families of their own now. I'm 35 and have no one, so this is my life now. The only thing staying my hand from myself is knowing that my mom would be even worse off without me. It's a horrible existence for both of us. I'm another inmate in the prison that is my mom's body and mind. My parents gave me everything and my biggest regret is having so little to offer in return at the end of their lives. Fuck Alzheimers and dementia. My mother never wanted to live like this, give people the chance to make the dignified choice while they are still capable of doing so.",
                "My autistic non-verbal child has a leappad and using it to spell words is the primary form of his communication it's his favorite toy or even item in our house.",
                "I made it from rural poverty to an Ivy League law degree and when I think of things that made it possible, I have to attribute so much to leapfrog. My mom spent what little money she had on secondhand leapfrog gear. I loved reading (and it’s pretty cheap when you’re not picky). RIP Mr. Wood."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr. to End 'Godsend' Narcan Program That Helped Reduce Overdose Deaths Despite His Past Heroin Addiction",
            "external_url": "https://www.latintimes.com/rfk-jr-end-godsend-narcan-program-that-helped-reduce-overdose-deaths-despite-his-past-heroin-581846",
            "upvotes": 61592,
            "date": "04/28/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575177/rfk-jrs-autism-study-use-millions-americans-medical-records.jpg",
            "top_comments": [
                "His brother died of an overdose",
                "Ah yes the party of “I got mine, so screw you”",
                "Can't have those drug addicts getting autism.",
                "Yeah. The hallmark of modern republicans is the *open scorn* of empathy.",
                "absolute piece of shit garbage humanoid",
                "> Recent CDC data shows a nearly 24% drop in overdose deaths for the 12 months ending September 2024, the sharpest one-year decline in decades—an achievement partly attributed to widespread naloxone access.\n\nThat is a massive reduction in deaths. Imagine seeing that kind of positive data and still cutting funding.",
                ">Though Kennedy has previously praised interventions like Narcan as critical to saving lives, he now frames the crisis as one requiring deeper, spiritual and societal change rather than relying solely on “nuts and bolts” medical solutions.\n\n\nwhy have lifesaving medicine like narcan to help reduce overdose deaths when we can just not have that and rely solely on vibes instead?\n\nto be unmistakably clear - they hate you. they are reducing access to the single best weapon we have to treat overdose victims because they don’t want those people to live. if you are unfortunate enough to have lost someone you cared about to an opioid overdose, they want to make sure more people share your pain.\n\nwe are rapidly approaching the point where we need to have our own version of the nuremberg trials for this administration. every single one of them needs to rot in a cell or below one.",
                "Caroline Kennedy claims that RFK got his brother, 13 at the time, addicted to the heroin that killed him at 28.",
                "May as well get rid of all emergency inhalers and EpiPens too. Clearly those people should have rolled better stats on character creation!",
                "They're hardly making any pretenses anymore about the fact that they *want* people to die.\n\nIf you're not a healthy, god-fearing American, you're on your own. Good luck."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 24867,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Remember how Republicans screamed 'LOCK HER UP' for years and years and years - because Hillary used a private server for encrypted email?",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "[deleted]",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "So we can assume that russia has them too, now",
                "I swear Musk would fire a nuke just see what happens."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 8625,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "Hey, remember when the US invaded Iraq and then locals were like, \"OMG DAT DOOD A TERRORIST!\" and later they found out many of them were just neighbors who didn't like them and wanted them gone. I'm sure this isn't anything like that...",
                "Bolstering stats before the 100th day in office tomorrow",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "I have a strong feeling not all of those 800 arrested were illegal immigrants...",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "Just remember, ICE has insane quotas to meet each month. If you think the mistakes were few and far between, its going to get a lot worse, real quick.",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/29/2025 16:11:10 UTC"
}