{
    "posts": [
        {
            "category": "HOT",
            "title": "US grants asylum to 54 white Afrikaner South Africans, reports say",
            "external_url": "https://www.theguardian.com/world/2025/may/09/us-grants-asylum-to-54-white-afrikaner-south-africans",
            "upvotes": 7288,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1d1c99da998b4f59038b80221c689beeec347fd1/938_14_4562_3651/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=835b1fe072a557dab0a80aef9adaec52",
            "top_comments": [
                ">On Thursday, US officials were trying to arrange a charter flight to land at Dulles international airport, with commercial flights being assessed as an alternative, NPR reported, citing unnamed sources.\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nI just don't know where to begin. They may, in fact, face discrimination. Maybe even violence. And that's terrible. But rolling out the red carpet for these people while Donald Trump, all by himself, cancelled 100,000 asylum claims is beyond the pale.",
                "I thought they hated giving free handouts to migrants. If what the NY Times found is true then what's all this:\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nThe fucking hypocrisy.",
                "💯  Elon Musk and Peter Thiel,  fucking nazis",
                "I didn't think we needed more obvious evidence that this country has been hijacked by white supremacists but here we are.",
                "It was never about legal versus illegal immigration.\n\nIt has always been about racism.",
                "Meanwhile We abandoned Afghans, many of whom assisted the US military, who are literally IN HIDING?\n\nhttps://apnews.com/article/afghanistan-refugees-qatar-trump-immigration-refugee-ban-006240c5700fa7a95e4c2f2dcf66ad4f\n\n\nQuestion- How many Afrikaner/White South Africans immigrate to the US per year normally? \n\nThis reminds me of the case of the German family who applied for US asylum because they homeschooled and that is/was illegal in Germany.\n\nBTW- It usually takes years of waiting and vetting to be granted asylum. This. is. a. joke.",
                "So let me get this straight, when it's POC looking for asylum in America its bad. But when it's white people, its good? And not to mention all the free shit their getting as well? Hypocrisy of the highest order.",
                "Literally can’t make this shit up 💀\n\n-asylum seekers from Mexico: NOO 😡 NOT CITIZENSS😠🤬GET OUT😤\n\n-white asylum seekers from South Africa: oh no! 😥 my sweet poor babies 😩 let me welcome you with open arms 🤗",
                "I think it’s fair to say they are just doing things to piss normal people off at this point right?",
                "This administration is a joke. These white people were handed asylum and are getting \"government handouts\" like housing. Yet POC who lived in \"shithole\" countries who were already in the process of being granted citizenship are sent to a concentration camp in El Salvador. Pathetic"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Two men found guilty of cutting down famous Sycamore Gap tree.",
            "external_url": "https://news.sky.com/story/two-men-found-guilty-of-cutting-down-famous-sycamore-gap-tree-13363450",
            "upvotes": 8464,
            "date": "05/09/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-sycamore-gap-tree-daniel-graham_6910985.jpg?20250509121507",
            "top_comments": [
                "Wanton destruction for destructions' sake. They cut a tree down *because* it was iconic, no other reason. Just to break a thing that people enjoyed. Purely selfish.",
                "I live on the other side of the planet and this really piss me off. I always wanted to go see Hadrians wall and this a stop I’ll make.",
                "After reading the online reactions the two men were sending each other texts saying their critics \"didnt have the minerals\" to do what they did. They cut down a tree in the middle of nowhere at night and these pair of cunts think they pulled off a heist in a Guy Ritchie movie.",
                "What absolute morons, ruining their lives for no reason at all. Enjoy the loss of your business, income, and any reputation you may have had. Plus possibly prison. Idiots.",
                "Drove thirty miles through a storm just to make the world a little uglier.\n\nYou fuckers, my faith in humanity is already on fumes",
                "Daniel Graham, 39, and Adam Carruthers, 32\n\nFucking useless pieces of shit. It’s not even like it was a few dumb teens. Throw away the key, these people are fucked",
                "They deserve to go to jail for this.",
                "Grown men doing something like that,, pathetic. They should have to pay for their destruction for the rest of their lives.",
                "I saw the tree three weeks before it was cut down. Glad I got to see it before this happened. Waited my whole life to see it.",
                "I’m glad they found these guys and convicted them."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Cargo thieves are attacking the U.S. supply chain at alarming rates",
            "external_url": "https://www.cnbc.com/2025/05/09/cargo-thieves-attack-supply-chain.html",
            "upvotes": 1990,
            "date": "05/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136177-1745508829713-Theft_Video_Overhaul.jpg?v=1745932246&w=1920&h=1080",
            "top_comments": [
                "Every day we inch closer to the cyberpunk universe... which sounds cool except that genre is a screaming thrashing industrial noised warning about a dystopian nightmare ruled by outrageously wealthy psychopaths.\n\n.. but at least we should get some good music out of it.",
                "With the tariff taxes will come smuggling and the increase of organized crime. Border patrol agents will get rich looking the other way as trucks roll across the boarders in remote locations.  However Trump will figure out how to get his cut as well.",
                "We’re going Mad Max way quicker than I thought.",
                "Did anyone check with Dom Toretto and his crew? They might be trying to steal VCRs, DVD players and camcorders again.",
                "When poverty increases, so does crime. Mass firings in the government. Huge layoffs in the private sector as businesses brace for the impacts of tariffs.",
                "with the direction tariffs are sending these prices, it will soon be the only way to get anything.",
                "With much of the law enforcement emphasis on immigrants and frankly targeting just regular people, I feel like these types of crimes are only going to increase.",
                "Hahahahahahahahahahaha they created a black market for normal shit. This timeline is so ridiculous 🤣",
                "Didn’t know it was a Comley truck. ",
                "Why go after these criminals when you can kidnap law abiding women on their way to work?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Radar screens at Newark airport went black again overnight",
            "external_url": "https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395",
            "upvotes": 1791,
            "date": "05/09/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/87c6775c-47c9-4a16-b499-2c93dab9fdaf/newark-gty-jef-250509_1746799790340_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "at this point, I'm waiting to wake up to the headline of a massive tragedy happening at the airport. seems like things are getting dire if there is pressure getting pushed to get this fixed; as it should be. I hope someone get's their head out of their ass and gets this prioritized a week ago.",
                "Statistics say its probably ok, but I still just changed my upcoming flight so I don't have to connect through Newark.",
                "> Transportation Secretary Sean Duffy said he hopes to have the system built in the next three to four years.\n  \nThat's the timeframe for fixing this problem?",
                "Huh, I remember the last president wanting to spend billions on reinvesting on FAA infrastructure. It even got bipartisan support... Odd they can't just use the money that is already promised to help with this",
                "Time to blame the previous administration for requesting **more** staff and modernization updates to prevent this happening.  Clearly that's the issue, not firing air traffic controllers and staff that keeps things running.",
                "Republicans have blocked funding for this for 20 years.",
                "Natural result of deferring upkeep of infrastructure maintenance in the chase of budget cuts.  Expect more of this as long as the conservative/libertarian ideology is making decisions.\n\nFifty years of the destructive meme that government needs to get out of the way of free enterprise.  You trust that your planes will fly, food & drugs will be safe, etc because of the regulatory state.",
                "\n\nThe Daily had a good episode on this a few days ago. Boils down to latency and lack of backup when their systems do go down and how easy it is for someone to just unplug these systems with no oversight. These systems are also old and need to be upgraded. Newark ATC employees were based in Long Island but FAA moved them to Philadelphia but kept the transmissions still going through Long Island and relaying to Philadelphia",
                "My friend told me at the beginning of this administration that they were no longer flying due to safety concerns.  At first I thought it was an overreaction, but after the Reagan airport issue and the recent air traffic controller decisions, I've also decided to not fly again.\n\nThis environment is primed for a major air disaster.",
                "I'm flying out of Newark twice in the next two weeks. Can't wait to roll the dice with my life lol."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Former Supreme Court Justice David Souter, a Republican who became a liberal darling, has died",
            "external_url": "https://apnews.com/article/supreme-court-justice-david-souter-dies-8cf552b7322297b03ef8c251a6a11d13",
            "upvotes": 2488,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> “What I worry about is that when problems are not addressed, people will not know who is responsible. And when the problems get bad enough ... some one person will come forward and say, ‘Give me total power and I will solve this problem.’ That is how the Roman republic fell,” Souter said in a 2012 interview. \n\n12 years later…",
                "Tradition says the American flag will fly at half staff starting from the day of death until internment. We'll see if Donald Trump orders this.\n\nUpdate: Two hours later and no order to lower the flag to half staff.\n\nUpdate: Four hours later and no order to lower the flag to half staff.",
                ">“What I worry about is that when problems are not addressed, people will not know who is responsible. And when the problems get bad enough ... some one person will come forward and say, ‘Give me total power and I will solve this problem.’ That is how the Roman republic fell,” Souter said in a 2012 interview.\n\nHe was a Republican Supreme Court Justice who made decisions on a case by case basis rather than mindlessly parroting the Republican party line, i.e., a vanishing species.",
                "“Aww, not *Souter*!”\n\n-Homer Jay Simpson",
                "Waiting for Mitch McConnell to declare this obviously means 7 new SCOTUS appointments for Trump.",
                "One of the GOATs, rest in peace.\n\nHe held on because of the debacle with Alito being forced on to the bench by the conservative GOP rebellion against W. He was terrified of what the GOP was becoming.",
                "Why do I have a feeling that he had just met with JD Vance?",
                "Souter, in every sense of the word, was a true republican. Same for Justice Stevens, another republican often mischaracterized as a liberal simply because his opinions favored liberty and equality.\n\nRepublican is a philosophy about our structure of government. It favors judicial review and emphasizes the separation of powers and federalism.\n\nPolitical rhetoric equating republican with bigot and liberal with human rights must stop. It is the reason why our social and political discourse is at an impasse. We need to return to the understanding of what forms of government republican and democrat represent rather than engaging in a manufactured culture war.",
                "I had 53 heart attacks reading this because i thought one of the 3 liberal justices right now passed away , making the Scotus even more red.",
                "One Republican future for every future stolen.  That's the only justice you have left."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Cigma denies man life-saving lung transplant shortly before scheduled operation.",
            "external_url": "https://abc7.la/44oVLpE",
            "upvotes": 34158,
            "date": "05/09/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16348273_050625-kabc-11pm-lung-transplant-denial-vid.jpg?w=1600",
            "top_comments": [
                "Cigna has done this *exact same thing before* in 2023, but changed their mind after a social media outcry: https://clearhealthcosts.com/blog/2023/11/cigna-denies-transplant-then-approves-after-social-media-campaign/\n\nUnfortunately the lungs were no longer available for transplant after they changed their mind. She did eventually get the transplant and was reported to be cancer free several months later in 2024. \n\nSupporters of the woman who was denied care emailed the CEO directly: david.cordani@cigna.com.",
                "Is this one of those “death panels” they warned us about?",
                "\"Our coverage guidelines are grounded in national clinical standards to help ensure the best possible outcomes for patients.\"\n\n…and we’ve decided that the best possible outcome for this patient would be for him to just fucking die already.  ",
                "A man battling stage 4 lung cancer was preparing to fly across the country for a life-changing double-lung transplant when his insurance company denied him coverage.",
                "I had a knee surgery denied because I didn’t try not having knee surgery long enough. My meniscus was shredded and stuck between the joint. Fuck these ghouls.",
                "For the record, the company is Cigna, not Cigma.  It’s the same company that *my* company uses to provide our health insurance with the $5,000 deductible.  It’s fucking worthless.",
                "I’m enjoying the fact that several people are calling it Cigma because the title had a typo",
                "United healthcare denied my mother in law's mastectomy when she was diagnosed with breast cancer. She had the much less expensive lumpectomy. The reason the doctors prefer to do a mastectomy is because it's easy to miss some cancer cells doing a lumpectomy and then the cancer can return. Sure enough, they missed some and the cancer came roaring back. Only this time it spread well beyond her breasts, and by the time they realized it was back it had spread to inoperable areas. She has to do a monthly chemo pill to keep it under control and is constantly having to chase the newest treatment once hers stops working. Recently her hair all fell out, after decades of hanging on. We are very lucky to still have her after 20 years post diagnosis, but this cancer will kill her. She is only in her early 60's. We should have another 20 years with her but I don't think she will be able to beat the cancer for that long given her recent decline. United healthcare gave her a death sentence years ago and we just keep trying to postpone it. She could have gone into remission, but instead she's had to live with cancer for decades and will die prematurely from it. We need single payer healthcare in this country YESTERDAY.",
                "The U.S. is alone among wealthy nations in making its citizens fear the doctor financially. Other countries may struggle with wait times or regional gaps in access, but not the constant anxiety over whether care will bankrupt you or be denied all together.",
                "For-profit healthcare in the US needs to die.  \n  \n**As an institution, for-profit healthcare in the US has externalized costs of at least 45,000 deaths per year, the suffering of countless more, and the stress of virtually every citizen. We cannot continue to accept this institutionalized carnage that does more harm to the populace than we can quantify. Any imaginable for-profit institution would be shut down by a remotely sensible society far before they managed to rack up such a destructive, bloodstained track record as has the modern for-profit American medical system**  \n  \nFor-profit healthcare in the US needs to die."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Two arrested after neighbors try to stop ICE agents from detaining Worcester mother",
            "external_url": "https://www.boston.com/news/local-news/2025/05/08/two-arrested-after-neighbors-try-to-stop-ice-agents-from-detaining-worcester-mother/",
            "upvotes": 25229,
            "date": "05/09/2025",
            "thumbnail": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/Police_Civil_Rights_Violations_53988-681d42cba076d-768x432.jpg",
            "top_comments": [
                "Something tells me it's going to be a hot, hot summer.",
                "\"Terrible things are happening outside. At any time of night and day, poor helpless people are being dragged out of their homes. They’re allowed to take only a knapsack and a little cash with them, and even then, they’re robbed of these possessions on the way. Families are torn apart; men, women and children are separated. Children come home from school to find that their parents have disappeared. Women return from shopping to find their houses sealed, their families gone.\" - Anne Frank, The Diary of a Young Girl.",
                "I like how this neighborhood is full of people that are ride-or-die, should serve as an example for us all. I want to see some videos of this.",
                "They're charging her with assault and battery with a dangerous weapon for throwing a drink at the cops. What a fucking crock of shit.",
                "Not unprecedented. [Boston, 1834](https://newenglandhistoricalsociety.com/boston-slave-riot-1854/)",
                "Video of it here:\n\n[https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd\\_in\\_worcester\\_ma\\_tries\\_to\\_interfere\\_with\\_ice/](https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd_in_worcester_ma_tries_to_interfere_with_ice/)\n\nIt's a chaotic scene, but it looks like one of the arrests is happening as they pull a woman away. Crazy how many cops they had out there--totally intimidating and unnecessary.",
                "\"Two arrested including a candidate for Worcester School Committee\" \n\nMan, that's the kind of arrest  you can point to the show that you have empathy and are willing to stand up for those who are marginalized in our society. She should be elected by a landslide. \n\n In some circles it would be seen as a bonus to stand up to this tyrannical regime.\n\nAlso noticed that one woman was charged with reckless endangerment of a child, what absolute b*******. The only ones recklessly endangering children are the agents and police themselves.",
                "My great grandmother once held off US Army troops with a broom to buy time for her Japanese neighbors to put their house in trust, thus keeping it out of government hands; they were some of the few who had a home to come back to after the war thanks in part to her. \n\nI hope that I'll be as brave as she was and these people are when the time comes.",
                "This is how “hiding people in the attic” began…",
                "May they be blessed forever doing what was right when it was not easy."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Founder of crypto lender Celsius sentenced to 12 years in prison",
            "external_url": "https://www.cnn.com/2025/05/09/business/founder-crypto-celsius-network-prison-sentence-intl",
            "upvotes": 603,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213431760.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The crypto space is just filled with conmen and criminals.",
                "Here comes the pardon.",
                "I think we found the new head of the Federal Reserve",
                "Lots of money and no regulation.\n\nBased on the history of humankind, what do people think is going to happen? And why do they think \"crypto\" will be any different?",
                "Trump will pardon this dude within 3 months once they reach a \"deal\".",
                "Trump: “Another criminal! I will appoint him head honcho at my new crypto bro agency. I need to get this Kleptocracy off the ground”",
                "I hear that the Fahrenheit guy is in hiding.",
                "Feels like every facet of life is filled with cons and scalpers I hate this shit",
                "Trump will be bought for a small paltry amount of one million dollars. No such thing as hard on white collar crime in this administration",
                "This is 2025, he'll donate $1M to dolls-for-Donny and magically catch a pardon, along with 1-2 all-caps tweets about how he was persecuted for being maga."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 377,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "OMG time to arrest Trump",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "‘Tone deaf’: US tech company responsible for global IT outage to cut jobs and use AI",
            "external_url": "https://www.theguardian.com/technology/2025/may/09/crowdstrike-to-cut-jobs-and-use-ai?CMP=Share_AndroidApp_Other",
            "upvotes": 2345,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/66039334838193480af0983b762c74df167be850/315_0_3566_2854/master/3566.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=47a365ad05df64e317f8d62cb1ef1e45",
            "top_comments": [
                "can not wait for \"Vibe security\" to become the new trend.",
                "A major IT company is tone deaf? How unusual.",
                "They aren't. They are using AI as an excuse to lay off employees. AI isn't there yet. Not even close. It makes some devs more efficient, but it won't replace very many people. It still makes terrible mistakes all the time and ChatGPTs code never runs right out of the box. I use it mainly to generate unit test dummy data, and it fucks up a lot.\n\nWhy use AI as an excuse to lay off employees? It's an easy win. Make investors excited, and less backlash. Companies lay off employees all the time.",
                "What could possiblie go wrong.",
                "Offshore IT - yup!\nReplace IT with AI - yup!\nFuck your employees - yup!\nFuck your customers - yup!\nGood luck with that, assholes.",
                "I'm sure this isn't so much tone deaf as it is apathetic and greedy. Let's not bless them the credit of ignorance. They knew what they were doing; cutting corners to get richer.",
                "Well, guess I can stop looking at CrowdStrike as a vendor. Least they make it easier to choose!",
                "How to lose the rest of your customer base with this one easy trick",
                "Riiight, “AI” did this, not the epic fuckup that probably lost them a significant portion of their customers and future revenue.\n\nAI is the new excuse they’re giving when laying people off, whether it’s really true or not. “Don’t be mad at me, be mad at AI!”\n\nI don’t buy it. ",
                "Can’t wait till it happens again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 32,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/gettyimages-2213257649-scaled.jpg?ve=1&tl=1",
            "top_comments": [
                "This administration is disgusting",
                "Mayor is running for governor and wanted a publicity stunt."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 384,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "OMG time to arrest Trump",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tufts student Rümeysa Öztürk ordered freed from immigration detention",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5393055/tufts-student-rumeysa-ozturk-ordered-freed-from-immigration-detention",
            "upvotes": 160,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1625x915+0+124/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4d%2F69%2F6d72d63f4e4b80765e9fde5d4ce1%2Fap25085809320001.jpg",
            "top_comments": [
                "More good news. Even if you are against these students causes, you should be against those unlawful attempts at intimidation If you value your right of free speech.",
                "What will compel the Trump administration to comply with these orders? They are not following the court decisions in other cases. Trump voters ensured he doesn't have to face consequences so why would he now? This administration is criminal and the only government body (aka Congress) meant to regulate illegal actions in the executive branch actions is complicit in the crimes. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas measles outbreak: Spread appears to slow in West Texas",
            "external_url": "https://www.fox4news.com/news/texas-measles-outbreak-may-9",
            "upvotes": 91,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/05/1280/720/gettyimages-2201696856.jpg?ve=1&tl=1",
            "top_comments": [
                "We were supposed to have flying cars and space travel by now. What did we get instead? The measles are back. Thanks America, very cool.",
                "When you stop testing, the numbers go down. Well, duh! /s",
                "Nothing flourishes in west Texas except oil and gas.",
                "well, hell. don't tell them that. they'd probably see it as a sign to pack up their little disease vectors, go forth, and share some more anti vax love."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Founder of crypto lender Celsius sentenced to 12 years in prison",
            "external_url": "https://www.cnn.com/2025/05/09/business/founder-crypto-celsius-network-prison-sentence-intl",
            "upvotes": 607,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213431760.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The crypto space is just filled with conmen and criminals.",
                "Here comes the pardon.",
                "I think we found the new head of the Federal Reserve",
                "Lots of money and no regulation.\n\nBased on the history of humankind, what do people think is going to happen? And why do they think \"crypto\" will be any different?",
                "Trump will pardon this dude within 3 months once they reach a \"deal\".",
                "Trump: “Another criminal! I will appoint him head honcho at my new crypto bro agency. I need to get this Kleptocracy off the ground”",
                "I hear that the Fahrenheit guy is in hiding.",
                "Feels like every facet of life is filled with cons and scalpers I hate this shit",
                "Trump will be bought for a small paltry amount of one million dollars. No such thing as hard on white collar crime in this administration",
                "This is 2025, he'll donate $1M to dolls-for-Donny and magically catch a pardon, along with 1-2 all-caps tweets about how he was persecuted for being maga."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US admits its new aid plan would initially only feed 60% of Gaza, as UN rejects proposal | CNN",
            "external_url": "https://www.cnn.com/2025/05/09/middleeast/us-gaza-aid-plan-un-rejection-intl",
            "upvotes": 433,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/04-gettyimages-2209255040.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So it's better to reject the plan all together and feed 0% of Gaza? Forgive me if I fail to see the logic in this.",
                "It’s crazy that this was rejected because of US wariness and the stigma that they’ll fail to feed the proposed percentage, so what?? Even if it was just 1% it’s still better than nothing! Why does the US have to constantly be the one feeding the world’s needy?!!? The US can’t even feed its own people at home in the first place. \n\nI don’t usually comment on this news feed but as someone that grew up in a food insecure house where for the first 5 years of my life I was fed solid food once every 3 days at most I say shame on anyone for denying this through. \n\nIm sure there’s more to it and experts at higher levels know what they’re doing, god I hope so cause they sure failed me, but this makes me so angry I can hardly type let alone think.",
                "Where the hell is the pro Palestine movement? If Biden or Kamala were in office, this would be a big deal and it would be their fault. Pro Palestine literally does nothing to oppose Trump's plans to harm Palestinians. ",
                "Since when was it our job to feed 100% of Gaza?",
                "Better starve them to death? How low can UN go.",
                "Why should the US have to feed Israel's mess?  Let Israel feed them, or don't and let the world see what they really are--monsters.",
                "well its a start, how fkn hard is it",
                "The plan is to reach 100 once enough gazans have starved to death. Subtext people!",
                "60% of those who have survived so far! The numbers are subject to change."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ten explosions near Srinagar International Airport, according to Reuters",
            "external_url": "https://news.sky.com/story/ten-explosions-near-international-airport-in-india-administered-part-of-kashmir-officials-say-13364562",
            "upvotes": 251,
            "date": "05/09/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-india-pakistan-jammu_6911361.jpg?20250509182545",
            "top_comments": [
                "I have said before saying it again the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with.",
                "Wonder if this will lead to an incursion into either country, or worse: nukes being used.",
                "The \"Line of Control\".  Why do I always think of Get Smart when I hear that?\n\nLower the cone of silence!!!",
                "I remember how final fantasy xii had this entire subplot about how the bujerbans were training rebels under the guise of military exercises and sending them out to raid archades, which led to continued escalation because a lot of the bujerban rebels were actually just deniable rosarrian assets for the rosarian empire. the idea being bujerba harbored and trained them as bujerban military then they'd go out and raid archades as an independent faction of \"rebels\" under no specific flag.\n\n\nvayne solidor's solution to this was to take a giant fuckoff tornado generating magic sky fortress called sky fortress bahamut and eviscerate them over the skies of dalmasca in what was supposed to be a devastating, violent blow to the pretext of the rosarian invasion. vayne was already in a bad place having killed his father and pinned it on the senate as part of a plan to take over the empire as an autocrat, so he wasn't ready for a group of pesky sky pirates and their playboy bunny mascot to suddenly slip into his heavily defended magic sky fort patrolled by killer robots and then single handedly beat his ass. \n\nbut the parallels between that overall plot and this is fascinating because the terrorists being harbored by the pakistani government feels like much the same situation, train a plausibly deniable military unit which will then repeatedly raid and weaken the nation. you don't dare break out into all out war over some pesky bandits, even suspiciously well equipped and well-trained ones. the indian government's response is about as blunt as vayne solidor's too, \"fuck the rules let's just blow them up to scare the fight out of them\"",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Radar screens at Newark airport went black again overnight",
            "external_url": "https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395",
            "upvotes": 1791,
            "date": "05/09/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/87c6775c-47c9-4a16-b499-2c93dab9fdaf/newark-gty-jef-250509_1746799790340_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "at this point, I'm waiting to wake up to the headline of a massive tragedy happening at the airport. seems like things are getting dire if there is pressure getting pushed to get this fixed; as it should be. I hope someone get's their head out of their ass and gets this prioritized a week ago.",
                "Statistics say its probably ok, but I still just changed my upcoming flight so I don't have to connect through Newark.",
                "> Transportation Secretary Sean Duffy said he hopes to have the system built in the next three to four years.\n  \nThat's the timeframe for fixing this problem?",
                "Huh, I remember the last president wanting to spend billions on reinvesting on FAA infrastructure. It even got bipartisan support... Odd they can't just use the money that is already promised to help with this",
                "Time to blame the previous administration for requesting **more** staff and modernization updates to prevent this happening.  Clearly that's the issue, not firing air traffic controllers and staff that keeps things running.",
                "Republicans have blocked funding for this for 20 years.",
                "Natural result of deferring upkeep of infrastructure maintenance in the chase of budget cuts.  Expect more of this as long as the conservative/libertarian ideology is making decisions.\n\nFifty years of the destructive meme that government needs to get out of the way of free enterprise.  You trust that your planes will fly, food & drugs will be safe, etc because of the regulatory state.",
                "\n\nThe Daily had a good episode on this a few days ago. Boils down to latency and lack of backup when their systems do go down and how easy it is for someone to just unplug these systems with no oversight. These systems are also old and need to be upgraded. Newark ATC employees were based in Long Island but FAA moved them to Philadelphia but kept the transmissions still going through Long Island and relaying to Philadelphia",
                "My friend told me at the beginning of this administration that they were no longer flying due to safety concerns.  At first I thought it was an overreaction, but after the Reagan airport issue and the recent air traffic controller decisions, I've also decided to not fly again.\n\nThis environment is primed for a major air disaster.",
                "I'm flying out of Newark twice in the next two weeks. Can't wait to roll the dice with my life lol."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cargo thieves are attacking the U.S. supply chain at alarming rates",
            "external_url": "https://www.cnbc.com/2025/05/09/cargo-thieves-attack-supply-chain.html",
            "upvotes": 1984,
            "date": "05/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136177-1745508829713-Theft_Video_Overhaul.jpg?v=1745932246&w=1920&h=1080",
            "top_comments": [
                "Every day we inch closer to the cyberpunk universe... which sounds cool except that genre is a screaming thrashing industrial noised warning about a dystopian nightmare ruled by outrageously wealthy psychopaths.\n\n.. but at least we should get some good music out of it.",
                "With the tariff taxes will come smuggling and the increase of organized crime. Border patrol agents will get rich looking the other way as trucks roll across the boarders in remote locations.  However Trump will figure out how to get his cut as well.",
                "We’re going Mad Max way quicker than I thought.",
                "Did anyone check with Dom Toretto and his crew? They might be trying to steal VCRs, DVD players and camcorders again.",
                "When poverty increases, so does crime. Mass firings in the government. Huge layoffs in the private sector as businesses brace for the impacts of tariffs.",
                "with the direction tariffs are sending these prices, it will soon be the only way to get anything.",
                "With much of the law enforcement emphasis on immigrants and frankly targeting just regular people, I feel like these types of crimes are only going to increase.",
                "Hahahahahahahahahahaha they created a black market for normal shit. This timeline is so ridiculous 🤣",
                "Didn’t know it was a Comley truck. ",
                "Why go after these criminals when you can kidnap law abiding women on their way to work?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US-designated terrorist Hafiz Rauf conducts funeral prayers with Pakistan’s military",
            "external_url": "https://www.cnbctv18.com/world/us-designated-terrorist-hafiz-rauf-conducts-funeral-prayers-with-pak-army-at-muridke-camp-india-hit-watch-19601270.htm",
            "upvotes": 168,
            "date": "05/09/2025",
            "thumbnail": "https://images.cnbctv18.com/uploads/2025/05/ap25127099346764-2025-05-b6065255e01290bce8e0327cd39d27f6-scaled.jpg?im=FitAndFill,width=500,height=300",
            "top_comments": [
                "Ik I'm gonna get downvotes to oblivion by Indians, but it's not the same guy. The one who's funeral was attended was a local cleric.",
                "This guy is Hafiz Abur Rauf, a local cleric. Not the one being referred to by the Indians and their dumbass diplomat in UK. Do some research.",
                "Is this a real terrorist, or just a political label? Hard to tell what is real and what's not anymore with the US government",
                "[deleted]",
                "Designated terrorist?  Did this guy talk shit about Elon on Xitter?",
                "[removed]",
                "Go check your news and check out ours."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 385,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "OMG time to arrest Trump",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US admits its new aid plan would initially only feed 60% of Gaza, as UN rejects proposal | CNN",
            "external_url": "https://www.cnn.com/2025/05/09/middleeast/us-gaza-aid-plan-un-rejection-intl",
            "upvotes": 436,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/04-gettyimages-2209255040.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So it's better to reject the plan all together and feed 0% of Gaza? Forgive me if I fail to see the logic in this.",
                "It’s crazy that this was rejected because of US wariness and the stigma that they’ll fail to feed the proposed percentage, so what?? Even if it was just 1% it’s still better than nothing! Why does the US have to constantly be the one feeding the world’s needy?!!? The US can’t even feed its own people at home in the first place. \n\nI don’t usually comment on this news feed but as someone that grew up in a food insecure house where for the first 5 years of my life I was fed solid food once every 3 days at most I say shame on anyone for denying this through. \n\nIm sure there’s more to it and experts at higher levels know what they’re doing, god I hope so cause they sure failed me, but this makes me so angry I can hardly type let alone think.",
                "Where the hell is the pro Palestine movement? If Biden or Kamala were in office, this would be a big deal and it would be their fault. Pro Palestine literally does nothing to oppose Trump's plans to harm Palestinians. ",
                "Since when was it our job to feed 100% of Gaza?",
                "Better starve them to death? How low can UN go.",
                "Why should the US have to feed Israel's mess?  Let Israel feed them, or don't and let the world see what they really are--monsters.",
                "well its a start, how fkn hard is it",
                "The plan is to reach 100 once enough gazans have starved to death. Subtext people!",
                "60% of those who have survived so far! The numbers are subject to change."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Radar screens at Newark airport went black again overnight",
            "external_url": "https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395",
            "upvotes": 1788,
            "date": "05/09/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/87c6775c-47c9-4a16-b499-2c93dab9fdaf/newark-gty-jef-250509_1746799790340_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "at this point, I'm waiting to wake up to the headline of a massive tragedy happening at the airport. seems like things are getting dire if there is pressure getting pushed to get this fixed; as it should be. I hope someone get's their head out of their ass and gets this prioritized a week ago.",
                "Statistics say its probably ok, but I still just changed my upcoming flight so I don't have to connect through Newark.",
                "> Transportation Secretary Sean Duffy said he hopes to have the system built in the next three to four years.\n  \nThat's the timeframe for fixing this problem?",
                "Huh, I remember the last president wanting to spend billions on reinvesting on FAA infrastructure. It even got bipartisan support... Odd they can't just use the money that is already promised to help with this",
                "Time to blame the previous administration for requesting **more** staff and modernization updates to prevent this happening.  Clearly that's the issue, not firing air traffic controllers and staff that keeps things running.",
                "Republicans have blocked funding for this for 20 years.",
                "Natural result of deferring upkeep of infrastructure maintenance in the chase of budget cuts.  Expect more of this as long as the conservative/libertarian ideology is making decisions.\n\nFifty years of the destructive meme that government needs to get out of the way of free enterprise.  You trust that your planes will fly, food & drugs will be safe, etc because of the regulatory state.",
                "\n\nThe Daily had a good episode on this a few days ago. Boils down to latency and lack of backup when their systems do go down and how easy it is for someone to just unplug these systems with no oversight. These systems are also old and need to be upgraded. Newark ATC employees were based in Long Island but FAA moved them to Philadelphia but kept the transmissions still going through Long Island and relaying to Philadelphia",
                "My friend told me at the beginning of this administration that they were no longer flying due to safety concerns.  At first I thought it was an overreaction, but after the Reagan airport issue and the recent air traffic controller decisions, I've also decided to not fly again.\n\nThis environment is primed for a major air disaster.",
                "I'm flying out of Newark twice in the next two weeks. Can't wait to roll the dice with my life lol."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Founder of crypto lender Celsius sentenced to 12 years in prison",
            "external_url": "https://www.cnn.com/2025/05/09/business/founder-crypto-celsius-network-prison-sentence-intl",
            "upvotes": 605,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213431760.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The crypto space is just filled with conmen and criminals.",
                "Here comes the pardon.",
                "I think we found the new head of the Federal Reserve",
                "Lots of money and no regulation.\n\nBased on the history of humankind, what do people think is going to happen? And why do they think \"crypto\" will be any different?",
                "Trump will pardon this dude within 3 months once they reach a \"deal\".",
                "Trump: “Another criminal! I will appoint him head honcho at my new crypto bro agency. I need to get this Kleptocracy off the ground”",
                "I hear that the Fahrenheit guy is in hiding.",
                "Feels like every facet of life is filled with cons and scalpers I hate this shit",
                "Trump will be bought for a small paltry amount of one million dollars. No such thing as hard on white collar crime in this administration",
                "This is 2025, he'll donate $1M to dolls-for-Donny and magically catch a pardon, along with 1-2 all-caps tweets about how he was persecuted for being maga."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Cargo thieves are attacking the U.S. supply chain at alarming rates",
            "external_url": "https://www.cnbc.com/2025/05/09/cargo-thieves-attack-supply-chain.html",
            "upvotes": 1984,
            "date": "05/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136177-1745508829713-Theft_Video_Overhaul.jpg?v=1745932246&w=1920&h=1080",
            "top_comments": [
                "Every day we inch closer to the cyberpunk universe... which sounds cool except that genre is a screaming thrashing industrial noised warning about a dystopian nightmare ruled by outrageously wealthy psychopaths.\n\n.. but at least we should get some good music out of it.",
                "With the tariff taxes will come smuggling and the increase of organized crime. Border patrol agents will get rich looking the other way as trucks roll across the boarders in remote locations.  However Trump will figure out how to get his cut as well.",
                "We’re going Mad Max way quicker than I thought.",
                "Did anyone check with Dom Toretto and his crew? They might be trying to steal VCRs, DVD players and camcorders again.",
                "When poverty increases, so does crime. Mass firings in the government. Huge layoffs in the private sector as businesses brace for the impacts of tariffs.",
                "with the direction tariffs are sending these prices, it will soon be the only way to get anything.",
                "With much of the law enforcement emphasis on immigrants and frankly targeting just regular people, I feel like these types of crimes are only going to increase.",
                "Hahahahahahahahahahaha they created a black market for normal shit. This timeline is so ridiculous 🤣",
                "Didn’t know it was a Comley truck. ",
                "Why go after these criminals when you can kidnap law abiding women on their way to work?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Former Supreme Court Justice David Souter, a Republican who became a liberal darling, has died",
            "external_url": "https://apnews.com/article/supreme-court-justice-david-souter-dies-8cf552b7322297b03ef8c251a6a11d13",
            "upvotes": 2488,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> “What I worry about is that when problems are not addressed, people will not know who is responsible. And when the problems get bad enough ... some one person will come forward and say, ‘Give me total power and I will solve this problem.’ That is how the Roman republic fell,” Souter said in a 2012 interview. \n\n12 years later…",
                "Tradition says the American flag will fly at half staff starting from the day of death until internment. We'll see if Donald Trump orders this.\n\nUpdate: Two hours later and no order to lower the flag to half staff.\n\nUpdate: Four hours later and no order to lower the flag to half staff.",
                ">“What I worry about is that when problems are not addressed, people will not know who is responsible. And when the problems get bad enough ... some one person will come forward and say, ‘Give me total power and I will solve this problem.’ That is how the Roman republic fell,” Souter said in a 2012 interview.\n\nHe was a Republican Supreme Court Justice who made decisions on a case by case basis rather than mindlessly parroting the Republican party line, i.e., a vanishing species.",
                "“Aww, not *Souter*!”\n\n-Homer Jay Simpson",
                "Waiting for Mitch McConnell to declare this obviously means 7 new SCOTUS appointments for Trump.",
                "One of the GOATs, rest in peace.\n\nHe held on because of the debacle with Alito being forced on to the bench by the conservative GOP rebellion against W. He was terrified of what the GOP was becoming.",
                "Why do I have a feeling that he had just met with JD Vance?",
                "Souter, in every sense of the word, was a true republican. Same for Justice Stevens, another republican often mischaracterized as a liberal simply because his opinions favored liberty and equality.\n\nRepublican is a philosophy about our structure of government. It favors judicial review and emphasizes the separation of powers and federalism.\n\nPolitical rhetoric equating republican with bigot and liberal with human rights must stop. It is the reason why our social and political discourse is at an impasse. We need to return to the understanding of what forms of government republican and democrat represent rather than engaging in a manufactured culture war.",
                "I had 53 heart attacks reading this because i thought one of the 3 liberal justices right now passed away , making the Scotus even more red.",
                "One Republican future for every future stolen.  That's the only justice you have left."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US grants asylum to 54 white Afrikaner South Africans, reports say",
            "external_url": "https://www.theguardian.com/world/2025/may/09/us-grants-asylum-to-54-white-afrikaner-south-africans",
            "upvotes": 7288,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1d1c99da998b4f59038b80221c689beeec347fd1/938_14_4562_3651/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=835b1fe072a557dab0a80aef9adaec52",
            "top_comments": [
                ">On Thursday, US officials were trying to arrange a charter flight to land at Dulles international airport, with commercial flights being assessed as an alternative, NPR reported, citing unnamed sources.\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nI just don't know where to begin. They may, in fact, face discrimination. Maybe even violence. And that's terrible. But rolling out the red carpet for these people while Donald Trump, all by himself, cancelled 100,000 asylum claims is beyond the pale.",
                "I thought they hated giving free handouts to migrants. If what the NY Times found is true then what's all this:\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nThe fucking hypocrisy.",
                "💯  Elon Musk and Peter Thiel,  fucking nazis",
                "I didn't think we needed more obvious evidence that this country has been hijacked by white supremacists but here we are.",
                "It was never about legal versus illegal immigration.\n\nIt has always been about racism.",
                "Meanwhile We abandoned Afghans, many of whom assisted the US military, who are literally IN HIDING?\n\nhttps://apnews.com/article/afghanistan-refugees-qatar-trump-immigration-refugee-ban-006240c5700fa7a95e4c2f2dcf66ad4f\n\n\nQuestion- How many Afrikaner/White South Africans immigrate to the US per year normally? \n\nThis reminds me of the case of the German family who applied for US asylum because they homeschooled and that is/was illegal in Germany.\n\nBTW- It usually takes years of waiting and vetting to be granted asylum. This. is. a. joke.",
                "So let me get this straight, when it's POC looking for asylum in America its bad. But when it's white people, its good? And not to mention all the free shit their getting as well? Hypocrisy of the highest order.",
                "Literally can’t make this shit up 💀\n\n-asylum seekers from Mexico: NOO 😡 NOT CITIZENSS😠🤬GET OUT😤\n\n-white asylum seekers from South Africa: oh no! 😥 my sweet poor babies 😩 let me welcome you with open arms 🤗",
                "I think it’s fair to say they are just doing things to piss normal people off at this point right?",
                "This administration is a joke. These white people were handed asylum and are getting \"government handouts\" like housing. Yet POC who lived in \"shithole\" countries who were already in the process of being granted citizenship are sent to a concentration camp in El Salvador. Pathetic"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "DEA impersonators targeting medical offices and everyday citizens with fake fines",
            "external_url": "https://www.denver7.com/us-news/crime/dea-impersonators-targeting-medical-offices-and-everyday-citizens-with-fake-fines",
            "upvotes": 865,
            "date": "05/09/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/4dda421/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F3e%2Fd8%2F8106f34146b8bb0a1873420a34a7%2Fshutterstock-2248369109.jpg",
            "top_comments": [
                "Please pay your fine in Apple Gift cards.\n\ndummy\"okay\"",
                "I was called by my local “Sheriff’s office” saying I had a warrant out for my arrest for not showing up for jury duty.  They claimed they had a copy of the notice that I had received and signed.  I told them to go ahead and send a cop to arrest me.  I’m still waiting….",
                ">\"Where they get a call from someone saying they're with the DEA and that a rental car has been found on the border that was written in your name and it contains a ton of drugs and if you don't pay this fine, we're going to come after you and lock you up,\" McNeal said.\n\nIt's always urgent and they front load the conversation with the threat of fines and/or arrest. \n\n>“Part of it was when he hung up, he said ‘God bless America,’” said Gladys Moore, a practice administrator at Affiliated Troy Dermatologists.\n\nThe 'God bless America' is pretty solid. Scammers are bad, but that's a pretty good way to end the call.",
                "\"What's my name and address, then?\"",
                "The best way to determine if it’s a scam is if the agent is wearing a body cam. Then you know for sure it’s a scam.",
                "Look at how ICE operates and dresses, no reason to think they are anything more than random thugs trying to harm you.  Oh, hmmm...",
                "I answer the phone in a new language every time and my scammer calls have dropped from 10 a week to 1 a month.  I'm doing Klingon on the next one.\n\nnuqneH...    'e' yIjatlhqa'...             not yap wa' Hol\n\nHello,...     Please say that again...     One language is never enough\n\nThere are a lot of very confused scammers when they get done talking to me.",
                "Oh, can I just come get my drugs back then?",
                "God bless America, right before asking for $10K? That’s a new level of bold",
                "It’s gotten to the point where I will immediately hang up the moment I hear an Accent. And I will cuss at them before I hang up if it is a crappy *American* accent."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ten explosions near Srinagar International Airport, according to Reuters",
            "external_url": "https://news.sky.com/story/ten-explosions-near-international-airport-in-india-administered-part-of-kashmir-officials-say-13364562",
            "upvotes": 250,
            "date": "05/09/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-india-pakistan-jammu_6911361.jpg?20250509182545",
            "top_comments": [
                "I have said before saying it again the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with.",
                "Wonder if this will lead to an incursion into either country, or worse: nukes being used.",
                "The \"Line of Control\".  Why do I always think of Get Smart when I hear that?\n\nLower the cone of silence!!!",
                "I remember how final fantasy xii had this entire subplot about how the bujerbans were training rebels under the guise of military exercises and sending them out to raid archades, which led to continued escalation because a lot of the bujerban rebels were actually just deniable rosarrian assets for the rosarian empire. the idea being bujerba harbored and trained them as bujerban military then they'd go out and raid archades as an independent faction of \"rebels\" under no specific flag.\n\n\nvayne solidor's solution to this was to take a giant fuckoff tornado generating magic sky fortress called sky fortress bahamut and eviscerate them over the skies of dalmasca in what was supposed to be a devastating, violent blow to the pretext of the rosarian invasion. vayne was already in a bad place having killed his father and pinned it on the senate as part of a plan to take over the empire as an autocrat, so he wasn't ready for a group of pesky sky pirates and their playboy bunny mascot to suddenly slip into his heavily defended magic sky fort patrolled by killer robots and then single handedly beat his ass. \n\nbut the parallels between that overall plot and this is fascinating because the terrorists being harbored by the pakistani government feels like much the same situation, train a plausibly deniable military unit which will then repeatedly raid and weaken the nation. you don't dare break out into all out war over some pesky bandits, even suspiciously well equipped and well-trained ones. the indian government's response is about as blunt as vayne solidor's too, \"fuck the rules let's just blow them up to scare the fight out of them\"",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Large investors increased stake in Trump Media by hundreds of millions",
            "external_url": "https://www.theguardian.com/us-news/2025/may/09/trump-media-tmtg-shares",
            "upvotes": 634,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/bb265f35173810966104c1e98466a283e8502825/1722_759_1352_1082/master/1352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4dc865320087d0c8124b109ae311d387",
            "top_comments": [
                "If decent people ever get another chance to be president of the US, i wonder if they too will rape and pillage the emoluments clause. He’s opened a dangerous door with his open grift.",
                "the article lists Charles Schwab as an investor.  Sounds like investment companies are taking our money we gave them to put into mutual funds to help us make money as a client of them - into trumps businesses.  Is that right?\n\nIf so, how is it legal for them to do that?  They are supposed to be serving us, their clients.  Trumps stocks will likely tank the moment he's out of office or dies.  They are knowingly investing their client money into something for a reason other than serving their client. \n\nSomeone needs to start a boycott of any company that invests in trump Companies.  If we're tough like with tesla, it'll, make a difference.\n\nIf you're with Charles schwab, I'd leave them now.",
                "Remember when Jimmy Carter got shit for having a peanut farm and had to sell it?",
                "The real money for these institutions investing in DJT is selling derivatives to retail traders. The premiums on options for that stock is insane.",
                "When Trump dies what will those investments be worth?  You know it is brides, pay to play.",
                "Oligarchy at work here, people!",
                "oh ffs at some point why not just pay the damn taxes??",
                "Would be interesting to know what businesses those investors have interests in.  Expect laws to favor them.",
                "So in his last administration when he shredded the emoluments clause it really was to set up the grift for his second admin.",
                "There are laws against this, but they seem to be made to be applied at the President's discretion or something."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/09/2025 20:10:09 UTC"
}