{
    "posts": [
        {
            "category": "HOT",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 12197,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 4635,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "What happened to ‘we just want them to come the legal way’?",
                "You got to wonder and ask, \"Who is next?\"",
                "I thought the issue was with ILLEGAL immigrants. If they’re kicking out half a million LEGAL immigrants, then isn’t the only reasoning left xenophobia & racism?",
                "It was never about illegal immigrants. It was always about racism. Enjoy roofing in the summer white people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 5455,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 980,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "Bummer. I always liked her. RIP",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "I rode an elevator with her once. We nodded !",
                "She was so great in M\\*A\\*S\\*H. She really took that role from ditzy \"Hotlips\" to Margaret Houlihan. with solid character development. RIP Loretta",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "RIP Hot Lips Houlihan!",
                "Aw man. Thanks for all of the laughs, and some tears, Loretta! I watched every episode!",
                "I read somewhere Swit was the original Christine Cagney from Cagney & Lacey.  Is there anyway to see that original tv movie?",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.)."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 1419,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "What's everyone's guess on the \"friendly\" foreign country?  \n\nMy first thought was Israel, but upon closer review of the available info, I'm leaning towards Canada or a big EU country like U.K., France, or Germany.",
                "IT specialist should have stored the info in boxes in the bathroom then invited foreign government people over.",
                "Is that even a crime anymore??"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 1792,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ah yes, the true reason for the fracture in Expedition 33",
                "About 5 years ago my city in Canada (Halifax) passed a law to force people to smoke only in designated areas, and everybody just ignored it. Most people have already forgotten about it, even though the law is probably still on the books. Smoking is banned on sidewalk patios though, unlike in France, and that law does get enforced.",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "So what is a chic-looking man in a striped shirt with a tiny mustache supposed to do while sitting at an outdoor cafe?",
                "But wait how will Paris maintain its outdoor carpet of cigarette butts? Will people have to walk on bare ground like barbarians?",
                "[deleted]",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This sounds unenforceable.",
                "That sounds like a monumental task in a country where 1/3 of the population smokes.\n\nEdit: curious why this guy downvoted, literally just pointing out the % of smokers in France and saying this won’t be easy, didn’t even say if I was for or against. Seems like a weird thing to downvote unless you think I’m lying about how prevalent smoking is there which you can google to verify.",
                "Makes no sense if they’re not going to have proper designated smoking areas at regular intervals at least. Everyone will just ignore this if it’s too restrictive "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 22007,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "A government so small it can take your land and rights on a whim.",
                "So….. years ago almost all property in Boca chica village was acquired by SpaceX in buyouts. All of the residents were bought out and left. There were a few holdouts, some of the property is uninhabited but SpaceX does not own it. They had to build the factory around a few parcels because of it. \n\nThe people that live there now are employees and their families in houses built by the company. They are also building apartment complexes down the road. \n\nI would bet this notice is a legal thing.",
                "Here’s the text of the zoning memo sent to Starbase residents:\n\nMay 21, 2025\n\nDear Starbase Property Owner/Property Occupant,\n\nNotice is hereby given that the City Commission for the City of Starbase will conduct a Public Hearing on Monday, June 23, 2025, at 9:00 a.m., at the City of Starbase temporary city hall located at 39046 LBJ Boulevard, Brownsville, TX 78521, to hear public comments, consider and act upon the adoption of a Comprehensive Zoning Ordinance and city wide Zoning Map.\n\nOur goal is to ensure that the zoning plan reflects the City’s vision for balanced growth, protecting critical economic drivers, ensuring public safety, and preserving green spaces. You are receiving this notice because you own the above listed property that will be located in the “Mixed Use District” and will be impacted if the zoning ordinance is approved. \n\nThe Mixed Use District allows for a blend of residential, office, retail, and small-scale service uses. A proposed zoning map is enclosed with this notice. You may view the draft zoning ordinance on the City’s website 72 hours prior to the above listed public hearing.\n\nThe City is required by Texas law to notify you of the following: THE CITY OF STARBASE IS HOLDING A HEARING THAT WILL DETERMINE WHETHER YOU MAY LOSE THE RIGHT TO CONTINUE USING YOUR PROPERTY FOR ITS CURRENT USE, PLEASE READ THIS NOTICE CAREFULLY. The foregoing notice is required by Texas Local Government Code section 211.006(a-1). The proposed zoning ordinance is based on current and existing uses.\n\nPlease contact City Administrator Kent Myers [email address redacted] with any questions or written comments. Your written comments must be submitted by 3:00 pm on June 22, 2025. Public comments may also be given at the above listed public hearing.\n\n \n\nBest Wishes, \n\nKent Myers\n\nCity Administrator, City of Starbase\n\n[addresses redacted]\n\ncityofstarbase-texas.com",
                "Another day older and deeper in debt",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                "Are we surprised? No, not at all.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 370,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "Well, at least it's an *aFordable* mistake",
                "Basically everything built during the chip shortage, interesting",
                "Did they try turning it off and back on again? ",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 619,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "dude needs to go buy some lottery tix.",
                "This is an incredible story. I encourage everyone to read the article. We should all be so lucky as to have a spouse (or friend) like his wife. What an incredible woman. 3 hours in cold water holding her husband’s head so he can breathe. Had to wipe my eyes there for a  moment.",
                "Man almost got nutty puttied 💀",
                "Stuck between a rock and a wet place",
                "A good reminder to stay on trails and *don't hike alone*.",
                "That’s the youngest looking 60 yr olds I’ve ever seen!",
                "If “god” was looking out for him wouldn’t that “god” have prevented him from being pinned in the first place?",
                "Im pretty sure my wife would hold my head out of the icy water to prevent me from dying but I think she'd mull it over for a couple seconds first.."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 829,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "“Tax cheat and insurrectionist, Bernard Kerik, kicks the bucket”",
                "Oh.  No.\n\nBack to what I was doing",
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "No memorial for Kerik would be complete without remembering how he commandeered an apartment intended for 9/11 rescue workers and used it as a fuck pad for him and his mistress.\n\nhttps://www.smh.com.au/world/kerik-took-over-apartment-donated-to-rescue-workers-20041216-gdkbqk.html",
                "[removed]",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "I know the sub rule is to keep the title as the headline, but man that headline is putting in a lot of work to try and spin him as a heroic figure first and foremost.  He was not, and was more a villain",
                "This helps drain the swamp a little",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "Rest in piss..\n\n\nDude a total piece of shit. Fuck him."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hamas official says it will reject new US Gaza ceasefire plan backed by Israel",
            "external_url": "https://www.bbc.com/news/articles/c0qg5yzqle9o",
            "upvotes": 37,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ea8f/live/873b7210-3ce6-11f0-b6e6-4ddb91039da1.jpg",
            "top_comments": [
                "The headline is purposely inflammatory. \n\n“The Hamas official said the proposal did not satisfy core demands, including an end to the war, and that it would respond in due course.” \n\nFraming it as “Hamas rejects peace” is just classic headline bait. Of course they’d want a permanent ceasefire, not some half-measure that allows Israel to resume bombing afterwards.",
                "Free Palestine from Hamas",
                "From the article:\n\n“However, a senior Hamas official later said the deal contradicted previous discussions between the group's negotiators and Witkoff.\n\nThe official told the BBC that the offer did not include guarantees the temporary truce would lead to a permanent ceasefire, nor a return to the humanitarian protocol that allowed hundreds of trucks of aid into Gaza daily during the last ceasefire.\"\n\nSeems that Israel unilaterally changed the conditions agreed with Witkoff, being the most important, at least for me, the part concerning the entrance of Aid into Gaza.",
                "Why do these articles always bury the reason for rejections? After reading the article it seems like the main contention is that Hamas wants an end to the war not just a pause in the killing which is all this offers.",
                "Didn't Israel break the last cease fire by bombing a hospital? The hospital in question, israel said was an IDF stronghold. But it was, infact, being used as an IDF stronghold since the beginning of the invasion. Then the IDF left, let palatine's use it as a hospital, and then bombed it, ending the cease fire. \n\nI'd be pretty suspicious of negotiations if my enemy had a history of going back on negotiations they made in the past.",
                "I wonder how Islamist propagandists will spin this.",
                "Hamas claims this is due to no permanent ceasefire negotiations being placed within the agreement, but the agreement also omits Hamas surrendering and disarming. \n\n\nThis agreement seems like a decent start to at least allow some humanitarian aid to flow to the strip. ",
                "Under the current administration, US sponsored peace deals seems to be wildly one sided and change like the  wind. See Ukraine. I predict the next set of proposals will be welcomed by Hamas but rejected by Israel.",
                "Can't wait to see how Hasan justifies this one"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 987,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "Bummer. I always liked her. RIP",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "I rode an elevator with her once. We nodded !",
                "She was so great in M\\*A\\*S\\*H. She really took that role from ditzy \"Hotlips\" to Margaret Houlihan. with solid character development. RIP Loretta",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "RIP Hot Lips Houlihan!",
                "Aw man. Thanks for all of the laughs, and some tears, Loretta! I watched every episode!",
                "I read somewhere Swit was the original Christine Cagney from Cagney & Lacey.  Is there anyway to see that original tv movie?",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.)."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 367,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "Well, at least it's an *aFordable* mistake",
                "Basically everything built during the chip shortage, interesting",
                "Did they try turning it off and back on again? ",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 4633,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "What happened to ‘we just want them to come the legal way’?",
                "You got to wonder and ask, \"Who is next?\"",
                "I thought the issue was with ILLEGAL immigrants. If they’re kicking out half a million LEGAL immigrants, then isn’t the only reasoning left xenophobia & racism?",
                "It was never about illegal immigrants. It was always about racism. Enjoy roofing in the summer white people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 616,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "dude needs to go buy some lottery tix.",
                "This is an incredible story. I encourage everyone to read the article. We should all be so lucky as to have a spouse (or friend) like his wife. What an incredible woman. 3 hours in cold water holding her husband’s head so he can breathe. Had to wipe my eyes there for a  moment.",
                "Man almost got nutty puttied 💀",
                "Stuck between a rock and a wet place",
                "A good reminder to stay on trails and *don't hike alone*.",
                "That’s the youngest looking 60 yr olds I’ve ever seen!",
                "If “god” was looking out for him wouldn’t that “god” have prevented him from being pinned in the first place?",
                "Im pretty sure my wife would hold my head out of the icy water to prevent me from dying but I think she'd mull it over for a couple seconds first.."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Argentine court declares mistrial over death of soccer star Maradona",
            "external_url": "https://www.abc.net.au/news/2025-05-30/mistrial-declared-in-death-of-soccer-star-maradona/105356336",
            "upvotes": 194,
            "date": "05/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5ddc7453aae2006dd80f67f52ac9de96?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=437&width=862&height=485&imformat=generic",
            "top_comments": [
                "Bro was face deep in cocaine since he retired. Don't think any amount of care would have helped.",
                "He was killed by the hand of God.",
                "Maradona would’ve loved watching Messi win the World Cup for Argentina in 2022.",
                ">The defendants say Maradona was a difficult patient who did not allow himself to be treated.\n\nNo coke for you if you're in the hospital.",
                "She deserves it for what she did to Weird Al."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 1420,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "What's everyone's guess on the \"friendly\" foreign country?  \n\nMy first thought was Israel, but upon closer review of the available info, I'm leaning towards Canada or a big EU country like U.K., France, or Germany.",
                "IT specialist should have stored the info in boxes in the bathroom then invited foreign government people over.",
                "Is that even a crime anymore??"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 12206,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 5447,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 834,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "“Tax cheat and insurrectionist, Bernard Kerik, kicks the bucket”",
                "Oh.  No.\n\nBack to what I was doing",
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "No memorial for Kerik would be complete without remembering how he commandeered an apartment intended for 9/11 rescue workers and used it as a fuck pad for him and his mistress.\n\nhttps://www.smh.com.au/world/kerik-took-over-apartment-donated-to-rescue-workers-20041216-gdkbqk.html",
                "[removed]",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "I know the sub rule is to keep the title as the headline, but man that headline is putting in a lot of work to try and spin him as a heroic figure first and foremost.  He was not, and was more a villain",
                "This helps drain the swamp a little",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "Rest in piss..\n\n\nDude a total piece of shit. Fuck him."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Loretta Swit, Emmy-winner who played Houlihan on pioneering TV series ‘M.A.S.H.,’ has died at 87",
            "external_url": "https://apnews.com/article/loretta-swit-dead-mash-09a0a00b8076256b57b27baf231b2240",
            "upvotes": 995,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Awwwwww. RIP Hot Lips",
                "Bummer. I always liked her. RIP",
                "Just started watching again the series two week ago,and googled the cast...she was alive.RIP",
                "I rode an elevator with her once. We nodded !",
                "She was so great in M\\*A\\*S\\*H. She really took that role from ditzy \"Hotlips\" to Margaret Houlihan. with solid character development. RIP Loretta",
                "RIP Loretta Swit     Fond memories of M*A*S*H*",
                "RIP Hot Lips Houlihan!",
                "Aw man. Thanks for all of the laughs, and some tears, Loretta! I watched every episode!",
                "I read somewhere Swit was the original Christine Cagney from Cagney & Lacey.  Is there anyway to see that original tv movie?",
                "I've often used her and Larry Linville as an example of outstanding interpersonal chemistry in acting. Go through any of the old episodes and just pay really close attention to them. They're fucking brilliant together, just incredible. Great lines too. One of my favorites is when she says to Linville, \"Oh Frank you're so above average.\"\n\nAs others have noted her character's arc on the show is arguably the most involved and the most profound.\n\nRIP Loretta watching you was a real treat (I also liked you in S.O.B.)."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ford recalls more than 1 million vehicles for camera glitch",
            "external_url": "https://abcnews.go.com/Business/wireStory/ford-recalls-million-vehicles-software-glitch-makes-rearview-122310364",
            "upvotes": 369,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/674bf0b5-0ee6-4e8c-960f-aaa4fcb14c3a/wirestory_95c4b06d0ef6d7b86b96c17fb8fee9a5_16x9.jpg?w=1600",
            "top_comments": [
                "Maverick owner here and shocked we're not on the list.  I haven't had an issue yet but there have been a bunch of recalls and the dealership has worked on my truck several times for software updates.  But maybe that put us ahead of the curve and everyone else has to catch up...",
                "*The software error... may cause the rearview camera image to delay, freeze or not display when the vehicle is in reverse.*\n\nA very definite safety problem. (better to put your left hand on the dash, and crane your neck to SEE with your god-given eyes)",
                "They really need to find a way to separate a \"recall\" where they ask for the cars back vs an \"over the air software update\"\n\n\"The problem will be fixed by a dealer or via an “over-the-air” update at a later date. A preliminary letter notifying owners of the safety risk is expected to be mailed June 16, with a second letter to be sent once the update is available, expected sometime in the third quarter of 2025.\"",
                "Well, at least it's an *aFordable* mistake",
                "Basically everything built during the chip shortage, interesting",
                "Did they try turning it off and back on again? ",
                "This tracks. When we shopped cars last weekend. The Ford dealership had row after row of cars with signs saying\n\nNot For Sale. Manufacture Recall\n\nAnd their cars feel really cheap for a premium price.",
                "Is this why I’m getting so many texts from the dealership to ‘fix’ my Sync3 system today? Get me in for a minor recall and fix this critical one?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 12187,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "I have had discussions with Trump supporters when things like this come up. Whenever something is shown to be made up, the answer is almost always, \"It doesn't matter. It still makes an important point.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 4632,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "unfortunately status granted by executive order can be simply be undone by executive order",
                "Of all the things Trump has done, this is probably one of the least illegal. An Executive order can be undone by the next president. ",
                "Ultimately this is because we all have allowed Congress to shirk its actual duties. If we put 10% of the focus we put on the Presidency onto our representatives and Senators, half of the problems in the country would go away.",
                "Cuba, Haiti, Nicaragua and Venezuela. \n\nIt makes more sense that Bukele is cooperating with Trump. Also, twist his rubber arm.\n\nOtherwise all visas for folks from El Salvador will be revoked and he will have to deal with a mass influx of citizens.",
                "Wonder what the Cubans in Florida who voted for the felon think about this?",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "What happened to ‘we just want them to come the legal way’?",
                "You got to wonder and ask, \"Who is next?\"",
                "I thought the issue was with ILLEGAL immigrants. If they’re kicking out half a million LEGAL immigrants, then isn’t the only reasoning left xenophobia & racism?",
                "It was never about illegal immigrants. It was always about racism. Enjoy roofing in the summer white people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 1419,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "What's everyone's guess on the \"friendly\" foreign country?  \n\nMy first thought was Israel, but upon closer review of the available info, I'm leaning towards Canada or a big EU country like U.K., France, or Germany.",
                "IT specialist should have stored the info in boxes in the bathroom then invited foreign government people over.",
                "Is that even a crime anymore??"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 5447,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 617,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "dude needs to go buy some lottery tix.",
                "This is an incredible story. I encourage everyone to read the article. We should all be so lucky as to have a spouse (or friend) like his wife. What an incredible woman. 3 hours in cold water holding her husband’s head so he can breathe. Had to wipe my eyes there for a  moment.",
                "Man almost got nutty puttied 💀",
                "Stuck between a rock and a wet place",
                "A good reminder to stay on trails and *don't hike alone*.",
                "That’s the youngest looking 60 yr olds I’ve ever seen!",
                "If “god” was looking out for him wouldn’t that “god” have prevented him from being pinned in the first place?",
                "Im pretty sure my wife would hold my head out of the icy water to prevent me from dying but I think she'd mull it over for a couple seconds first.."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 1788,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ah yes, the true reason for the fracture in Expedition 33",
                "About 5 years ago my city in Canada (Halifax) passed a law to force people to smoke only in designated areas, and everybody just ignored it. Most people have already forgotten about it, even though the law is probably still on the books. Smoking is banned on sidewalk patios though, unlike in France, and that law does get enforced.",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "So what is a chic-looking man in a striped shirt with a tiny mustache supposed to do while sitting at an outdoor cafe?",
                "But wait how will Paris maintain its outdoor carpet of cigarette butts? Will people have to walk on bare ground like barbarians?",
                "[deleted]",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This sounds unenforceable.",
                "That sounds like a monumental task in a country where 1/3 of the population smokes.\n\nEdit: curious why this guy downvoted, literally just pointing out the % of smokers in France and saying this won’t be easy, didn’t even say if I was for or against. Seems like a weird thing to downvote unless you think I’m lying about how prevalent smoking is there which you can google to verify.",
                "Makes no sense if they’re not going to have proper designated smoking areas at regular intervals at least. Everyone will just ignore this if it’s too restrictive "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Argentine court declares mistrial over death of soccer star Maradona",
            "external_url": "https://www.abc.net.au/news/2025-05-30/mistrial-declared-in-death-of-soccer-star-maradona/105356336",
            "upvotes": 197,
            "date": "05/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5ddc7453aae2006dd80f67f52ac9de96?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=437&width=862&height=485&imformat=generic",
            "top_comments": [
                "Bro was face deep in cocaine since he retired. Don't think any amount of care would have helped.",
                "He was killed by the hand of God.",
                "Maradona would’ve loved watching Messi win the World Cup for Argentina in 2022.",
                ">The defendants say Maradona was a difficult patient who did not allow himself to be treated.\n\nNo coke for you if you're in the hospital.",
                "She deserves it for what she did to Weird Al."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 834,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "“Tax cheat and insurrectionist, Bernard Kerik, kicks the bucket”",
                "Oh.  No.\n\nBack to what I was doing",
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "No memorial for Kerik would be complete without remembering how he commandeered an apartment intended for 9/11 rescue workers and used it as a fuck pad for him and his mistress.\n\nhttps://www.smh.com.au/world/kerik-took-over-apartment-donated-to-rescue-workers-20041216-gdkbqk.html",
                "[removed]",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "I know the sub rule is to keep the title as the headline, but man that headline is putting in a lot of work to try and spin him as a heroic figure first and foremost.  He was not, and was more a villain",
                "This helps drain the swamp a little",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "Rest in piss..\n\n\nDude a total piece of shit. Fuck him."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/30/2025 20:09:59 UTC"
}