{
    "posts": [
        {
            "category": "HOT",
            "title": "Tesla whistleblower wins latest legal battle in fight against Musk",
            "external_url": "https://www.bbc.com/news/articles/cevdz4yxpd9o",
            "upvotes": 5229,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/057d/live/f4e7a3a0-1af0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "As someone who was also diagnosed with an advanced cancer at a young age, I am in awe of this woman.  She is doing a good, but extremely challenging thing during her darkest days.  I’m routing for her, and hope she gets a resolution sooner rather than later.  I’m also wishing her positive outcomes with her treatment and outcome battling cancer.",
                "Hope she wins, no one deserves to wrongfully lose their job for bringing up concerns to a supervisor.",
                "> \"I wish Elon Musk had the decency to apologise.\"\n\nDon't we all wish the world's richest person had some decency.",
                "Darkest Prediction: \nWin the legal battle, lose the \"not getting sent to El Salvador prison\" war.",
                "Hard to be a shittier American than a Trump/Elon supporter these days",
                "What a stupid thing to get fired over. Fix the e carpets",
                "“I wish Elon Musk has the decency to apologize”\nHahahahahaha",
                "What’s the deal with the mats?  My mat curls and slides under the pedals.  I have to pull it down every single time I get in the car.",
                ">the chance to take on Elon Musk in front of a jury and judge\n\nThis thought delights me to the extreme.",
                "And the regime has sent her to their foreign gulag"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "2 Defense Department officials, including senior adviser to Pete Hegseth, put on leave amid leak investigation",
            "external_url": "https://www.cbsnews.com/news/dan-caldwell-pentagon-leak-investigation-on-leave/",
            "upvotes": 1266,
            "date": "04/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/37068e63-d5d8-44de-a1f5-d962712cccf3/thumbnail/1200x630/18120fcbb01fc5c0cb9650e2ab0af4fe/gettyimages-2203658198.jpg?v=412b48b2e3085db78364e6e02a7dc2b8",
            "top_comments": [
                ">A source familiar says Caldwell is accused of sharing classified documents with reporters.\n\nOh, is that a problem for Hegseth now?",
                "Such a mess. 0 Professionalism",
                "What about Hegseth? Shouldn't he be on leave too?",
                "WHISKEY LEAKS\nRemember: Trump only hires the best. ",
                "Damn, I got excited when I misread \"including Pete hegseth\"... then I remembered he's already at the top of that chain",
                "This DEI-less experiment seems to be a disaster.  Can we go back to being really good at things again?",
                "Every top official on that chat knew it was illegal to use for classified information. All of them, including the VP, needs to be impeached, removed from office, and prosecuted.",
                "Imagine being the one in the chat, leaking information, and then it's your assistant that gets suspended...Much accountability, much wow.",
                "Paid vacation for being bad at their jobs.",
                "\"Tyranny requires constant effort. It breaks, it leaks. Authority is brittle. Oppression is the mask of fear.\"\n\n-Nemik's Manifesto, Andor"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Judge scraps US rule capping credit card late fees at $8",
            "external_url": "https://www.reuters.com/business/finance/judge-scraps-us-rule-capping-credit-card-late-fees-8-2025-04-15/",
            "upvotes": 11681,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“A federal judge in Texas” is going to be on our tombstone",
                "Just in time for the upcoming recession.",
                "Call me shocked..  let's tank the markets and let banks raise late fees...",
                "The people who are poor and voted for this will say it’s because “they had to” because “of the democrats” which is why this country is destined to become worse and worse",
                "Any and every action possible to fuck over people who are struggling with money.",
                "Who the fuck does this benefit aside from corporations? \n\nLike what scumbag does rhis",
                "They sure are undoing a lot of stuff from a President who “didn’t do anything”",
                "MAGA bros erupt in cheers all over the country.   Nobody knows why",
                "You Americans always say \"we need guns when the government is coming for us.\"\n\nBruh, every branch of government is coming for your poor ass now.\n\nI am more curious to see some jackass defending the ruling of scraping the cap though.",
                "I thought judges shouldn’t dictate policies or whatever the clown in office says?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US judge finds Google holds illegal online ad tech monopolies",
            "external_url": "https://www.reuters.com/technology/us-judge-finds-google-holds-illegal-online-ad-tech-monopolies-2025-04-17/",
            "upvotes": 912,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kinda hard to get upset at this stage considering we've just let every mega corporation buy each other the last two decades. There is only like one competitor and it's meta for online ads, yeah? I mean Bing exists but.. It's Bing.",
                "I sense a completely unrelated trip to Mar-a-Lago and then things will get 'sorted' out.",
                "I predict this will go away after a trip to maraloago",
                "Time for Sundar Pichai to buy Clarence Thomas a new house.",
                "There are judges and law in the US?",
                "Every day is groundhogs day from 2016 on",
                "Will Democrats now go after Big Tech? Lol trump",
                "Yeah no shit. Now do Meta.",
                "I was at a focus group put on by Google to test how their defense worked. On the dolts in the session, it worked like a charm. Only a few saw through the defense.",
                "Predictable follow up headline, they get a $700m fine which sounds crazy but is actually the amount of money they make in 1 day."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Temu and Shein will raise prices for US customers due to Trump's tariffs",
            "external_url": "https://apnews.com/article/temu-shein-price-increases-trump-tariffs-066a3e729c971fdf9e929bb8a94eea67",
            "upvotes": 1210,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Guess people are only going to be shoppinng like millionaires, maybe even thousandaires, instead of billionaires at Temu",
                "I can't wait until the \"haul culture\" dies, what a waste that is.",
                "Didn’t buy that shit before and I really won’t now.",
                "This must come as a huge shock to Americans who have been told by their leadership that China pays the tariffs, not Americans.",
                "I'll be honest, if you're someone that buys random things off of Instagram ads because you think they're functional or cute or useful, literally every single one of those things that you're seeing are sold on Temu infinitely cheaper - in some cases 90-95% cheaper for the exact same item. I've seen a bunch of Instagram ads for an ear wax removal tool with a camera so you can see what you're picking at for 59 dollars on some vendor, and the exact same item on Temu was $3.45.\n\nI don't use it for everything, clothes especially, but I've bought a number of Temu goods that I'm pretty happy with. And a number of those things I've had for years and they still work just as well.",
                "I guess if there’s one silver lining is that junk producers may go away. Fast fashion may disappear. \n\nBut then the flip side is that if you can’t afford lots then Temu and SHEIN are your only hope.",
                "Maybe a positive aspect of this is that temu goes out of business ",
                "This probably won’t deter many of their customers, who are apparently addicted to this fast fashion garbage.",
                "I dont feel bad for these 2 companies hurt by tariffs. They only sell single use craps.\n\nShein’s return rate is crazy high and those returned stuff mostly end up in some landfill in Africa. Just sad.",
                "So the exact same backpack that sells for 65$ on amazon will now cost me 30$ rather than the 20$ it used too.... oh well."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Two infants die of whooping cough in Louisiana as cases climb nationally",
            "external_url": "https://www.cnn.com/2025/04/02/health/whooping-cough-pertussis-louisiana/index.html",
            "upvotes": 1813,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-541052350.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If only there were a way to stop it.",
                "it's like a revival of all the sicknesses",
                "It's sad for the children who die because it is so obviously preventable.  Kids can't control whether or not their parents are anti vaxxers.   As for any parent who has a child who dies because you decided to not vaccinate them, I have zero sympathy.  \n\nClearly there are parts of the population who for various reasons cannot be vaccinated, such as immunocompromized.  That's understandable and legitimate in my opinion",
                "Measles, whooping cough. Conservatives are getting what they wanted. The good old days are coming back.",
                "We've seen a rise of whooping cough cases in my highschool, we had three or four notices sent home that there were \ncases this school year. You have to get your TDAP vaccine every 10 years, it's an easy one to forget about.\n\n\nYou can get it at your local pharmacy, and if you plan on being around any newborns it doesn't hurt to get revaccinated.",
                "[Infant girl with whooping cough](https://youtu.be/S3oZrMGDMMw?si=SmUSkPnBy55QZKO2)\n\nWatch if you don't believe in vaccinations.",
                "Pregnant people can get the TDaP vaccine during each pregnancy to give their baby some protection when they're too young to be vaccinated.",
                "I want to stop playing The Oregon Trail for real now, please.",
                "Copied my comment from another sub:\n\nI got whooping cough when I was 16.\n\nI cannot stress that please for the love of god, ensure you and your children are immunized for it. It was the worst cough I'd ever had in my life, and you might say \"Why Tycho-Celchu, coughs aren't that bad, it's more of a minor annoyance when you're sick.\" and I cannot stress enough: No it is fucking horrible. It's horrible racking coughs that feel like any second your lung tissue is about to be expunged. I would get coughing fits so bad my stomach would contract and I'd throw up. Imagine with every cough you're vomiting more and more and when there's nothing left you're just retching with every hack.\n\nOh and you know what the alternative name for whooping cough is? The cough of a hundred days. And trust me, you feel everyone of those hundred days. I missed the last month of grade 10 because of it, I went to class once and I coughed so hard I wasn't able to breathe and the entire class panicked and thought I was going to die, complete with my teacher trying frantically to call 911 while I'm trying to stop her. When I showed up for the 1st day in grade 11, there were people I weren't friends with stopping to chat with me because I didn't come back to school after that and they thought I had died.",
                "I got whooping cough when I was six, almost died from it, and no doubt have lasting effects. This was *before* a vaccine was widely prescribed/available. These people are fucking idiots."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Man Who Set Fire to Shapiro’s Mansion Cited Treatment of Palestinians, Police Say",
            "external_url": "https://www.nytimes.com/2025/04/16/us/cody-balmer-motive-arson-gaza-palestinian-shapiro.html?unlocked_article_code=1.AU8.Urgu.PkzlAQXT8lQK&smid=nytcore-ios-share&referringSource=articleShare&sgrp=p",
            "upvotes": 1292,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's weird that they keep referring to this as \"Shapiro's Mansion\". \n\nIt's not HIS mansion, it's the governor's mansion. All Pennsylvania governors live there during their terms. \n\nIt would be like referring to the white house as \"Trump's House\".",
                "The guy is nuts. Have you seen him?",
                "Is there anything Governor Shapiro personally did to mistreat Palestinians, other than simply be Jewish?",
                "That makes sense, because I totally remember when Josh Shapiro personally flew over to Gaza and shot a few before hopping on a plane home.",
                "Naw.  I'm pretty sure that progressives already fixed that  whole \"mistreatment of Palestinians\" thing when they refused to vote for Harris and ended up getting Trump elected instead.  \n\nEverything is much better now, right?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US IRS planning to rescind Harvard's tax-exempt status",
            "external_url": "https://www.reuters.com/world/us/us-irs-planning-rescind-harvards-tax-exempt-status-cnn-reports-2025-04-16/",
            "upvotes": 33034,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to be drawn out in court for a long time. Harvard isn't likely to back down.",
                "Isn't it illegal for the president to get the IRS to do that?\n\n\"Prohibition on executive branch influence over taxpayer audits and other investigations\"\n\n[Stated here](https://www.law.cornell.edu/uscode/text/26/7217)",
                "All is fair then when the shoe is on the other foot...every church that participated in preaching about voting (at all for anyone) should lose their tax exempt status too",
                "Remember when conservatives cried persecution because the IRS showed extra scrutiny to conservative groups based on keyword usage? (The IRS also did the same for liberal groups as well but conservatives just ignored that since it didn't support their worldview)",
                "That's great! That means the next time we have a democratic president in we can just start pulling the tax exempt status of churches right? Just whomever we don't like?",
                "How about megachurches next?",
                "Harvard may know some lawyers who can represent them in court.",
                "\"The essence of fascism is to make laws forbidding everything and then enforce them selectively against your enemies.\" - John Lescroart, A Plague of Secrets.",
                "Oh, good.  The dollar is collapsing, U.S. bonds are becoming more unstable and disfavored globally every day, stock market volatility is off the charts with every indication that the bottom is going to fall out, the FED chairman just cautioned that Trump's tariffs are putting the country on track for devastating stagflation ... and instead of dealing with any of this the White House is hyper-focused on abusing the power of the federal government to exact petty retributions against perceived political enemies.  Any Trump supporters want to defend this daily shitshow?",
                "I'm very glad Harvard decided to be the one to stick out its neck. I was having conversations with my former colleagues at smaller state universities at the R2 level. Many wanted to defy the federal government but did not have the resource to do so. Now that Harvard did this and MIT followed suit, a lot more universities can just follow their footsteps. White House cannot possibly target every single college."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Toby Carvery owner 'sorry' after cutting down 500 year old oak.",
            "external_url": "https://www.bbc.com/news/articles/ce8g6lj8343o",
            "upvotes": 642,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bdae/live/c7f3b800-1b74-11f0-b015-f17d4d024f76.jpg",
            "top_comments": [
                "How hard was it for these folks to just not cut the tree down Jfc",
                "Note: he’s sorry they upset the public. He never says sorry for cutting it down.",
                "Revoke the license of the Toby. Hit them where it hurts. The fines are pathetic.",
                "He's sorry he got caught, not that he cut it down.",
                "He’s not sorry for cutting it down. He’s sorry people are mad at him for being a dick. I’m sure the extremely light punishment will deter him going forward.",
                "The contractors that suggested cutting the thing down need their licenses revoking and stiff fines as well as the Toby Carvery owner - there are rules for cutting down mature trees in the UK",
                "no they are not sorry.",
                "He should be sorry about serving up that slop in his carvery. He should hang his head in shame for cutting down that tree",
                "In NYC, the restitution value of that tree by Parks would be in the hundreds of thousands of dollars.\n\nFine them to oblivion.",
                "the only way shit like this is going to stop is if we determine the individuals who are responsible and put them in prison, or otherwise punish them.  strip them of all assets, and make them work as a janitor at a national park, or something like that.  people having the ability to hide from personal liability behind the corporate wall has got to end."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump administration plans to end the IRS Direct File program for free tax filing, AP sources say",
            "external_url": "https://apnews.com/article/irs-direct-file-tax-returns-free-trump-4bb0bca02fab9b3d06ae6f45ac67b7ab",
            "upvotes": 32690,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money\"*  \n\nThe places that are making money from filing taxes and selling peoples information are saying it's a waste of taxpayer money.   As a taxpayer I disagree with them.",
                "“We want the worst for everyone!”\n\n“We are just plain evil”",
                "> The program developed during Joe Biden’s presidency was credited by users with making tax filing easy, fast and economical. But Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money because free filing programs already exist, although they are hard to use.\n\nPeople who like this software: users\n\nPeople who don’t: Republican lawmakers and tax preparation software companies (TurboTax)\n\nPick a side, folks.",
                "What if I just don't do my taxes correctly like him?",
                "MAGA : Let's remove DirectFile, which people like and makes sense.\n\nMAGA : Let's not go after TurboTax though, which is outright scamming us.",
                "Every decision, the benefit of our enemies.",
                "I filed my taxes with this in less than 30 minutes and got my return in less than week. Obviously its a terrible inefficient program that needs to go. /s",
                "I wonder how much Intuit and H&R Block paid for this. It doesn't help anyone but them to get rid of this service.",
                "It cost $100 to file taxes under H&R Block services. That is insane when the IRS already has our information! It’s ridiculous.",
                "Been using freetaxusa"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "2 Defense Department officials, including senior adviser to Pete Hegseth, put on leave amid leak investigation",
            "external_url": "https://www.cbsnews.com/news/dan-caldwell-pentagon-leak-investigation-on-leave/",
            "upvotes": 1249,
            "date": "04/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/37068e63-d5d8-44de-a1f5-d962712cccf3/thumbnail/1200x630/18120fcbb01fc5c0cb9650e2ab0af4fe/gettyimages-2203658198.jpg?v=412b48b2e3085db78364e6e02a7dc2b8",
            "top_comments": [
                ">A source familiar says Caldwell is accused of sharing classified documents with reporters.\n\nOh, is that a problem for Hegseth now?",
                "Such a mess. 0 Professionalism",
                "What about Hegseth? Shouldn't he be on leave too?",
                "WHISKEY LEAKS\nRemember: Trump only hires the best. ",
                "Damn, I got excited when I misread \"including Pete hegseth\"... then I remembered he's already at the top of that chain",
                "This DEI-less experiment seems to be a disaster.  Can we go back to being really good at things again?",
                "Every top official on that chat knew it was illegal to use for classified information. All of them, including the VP, needs to be impeached, removed from office, and prosecuted.",
                "Imagine being the one in the chat, leaking information, and then it's your assistant that gets suspended...Much accountability, much wow.",
                "Paid vacation for being bad at their jobs.",
                "\"Tyranny requires constant effort. It breaks, it leaks. Authority is brittle. Oppression is the mask of fear.\"\n\n-Nemik's Manifesto, Andor"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "American woman who killed man in Kaiserslautern train station stabbing gets probation",
            "external_url": "https://www.stripes.com/theaters/europe/2025-04-17/kaiserslautern-stabbing-sentence-17495326.html",
            "upvotes": 35,
            "date": "04/17/2025",
            "thumbnail": "https://www.stripes.com/incoming/mv4a5p-170425ktn-sentencephoto01.jpg/alternates/LANDSCAPE_480/170425KTN-SENTENCEphoto01.jpg",
            "top_comments": [
                "Misleading headline, the man had sexually assaulted her. This makes it sound like the stabbing was unprovoked.\n\nTry \"Sexual Predator dies after being stabbed by victim\" \n\nIf he'd kept his hands to himself, he'd still be alive.",
                "Finally, some good news.",
                "2 years probation for manslaughter - yes, sounds about right. \n\n\nI guess that means I'll go to a train station now, wait until someone is being an asshole to me, and i get to murder the for free!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US judge finds Google holds illegal online ad tech monopolies",
            "external_url": "https://www.reuters.com/technology/us-judge-finds-google-holds-illegal-online-ad-tech-monopolies-2025-04-17/",
            "upvotes": 918,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kinda hard to get upset at this stage considering we've just let every mega corporation buy each other the last two decades. There is only like one competitor and it's meta for online ads, yeah? I mean Bing exists but.. It's Bing.",
                "I sense a completely unrelated trip to Mar-a-Lago and then things will get 'sorted' out.",
                "I predict this will go away after a trip to maraloago",
                "Time for Sundar Pichai to buy Clarence Thomas a new house.",
                "There are judges and law in the US?",
                "Every day is groundhogs day from 2016 on",
                "Will Democrats now go after Big Tech? Lol trump",
                "Yeah no shit. Now do Meta.",
                "I was at a focus group put on by Google to test how their defense worked. On the dolts in the session, it worked like a charm. Only a few saw through the defense.",
                "Predictable follow up headline, they get a $700m fine which sounds crazy but is actually the amount of money they make in 1 day."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Target baby food recalled over lead contamination",
            "external_url": "https://www.denver7.com/life/recalls/target-baby-food-recalled-over-lead-contamination",
            "upvotes": 439,
            "date": "04/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/1e90499/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fac%2F2c%2F1a6290854e989967dce1a6486285%2F1710766284-4lr8vv.jpg",
            "top_comments": [
                "Don't worry! Next time there won't be any pesky recalls because the dept that investigates food safety got DOGE'd. Lead for all!",
                "And some Americans wonder why we don't want to buy their shitty, deregulated food products.",
                "Lead in baby food and I saw another article about lead in a lot of toothpastes just this morning.\n\nCool",
                "This is why we need to get rid of regulations. Then we won’t have these scary recalls. Problem solved, right? ",
                "That's probably not gonna help their declining sales. Whoops. ",
                "Good thing the USDA is getting gutted. God damn MAGA is made of fucking morons.",
                "How does lead get into this stuff in the first place? Crops grown in toxic soil?",
                "This is the US in a nutshell. Have them babies so we can kill them!",
                "Well I, for one, think that lead is very *manly* and that it should be in more things. A lot of very powerful people got where there are because of lead, you know.",
                "Cost cutting kills customers."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Toby Carvery owner 'sorry' after cutting down 500 year old oak.",
            "external_url": "https://www.bbc.com/news/articles/ce8g6lj8343o",
            "upvotes": 647,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bdae/live/c7f3b800-1b74-11f0-b015-f17d4d024f76.jpg",
            "top_comments": [
                "How hard was it for these folks to just not cut the tree down Jfc",
                "Note: he’s sorry they upset the public. He never says sorry for cutting it down.",
                "Revoke the license of the Toby. Hit them where it hurts. The fines are pathetic.",
                "He's sorry he got caught, not that he cut it down.",
                "He’s not sorry for cutting it down. He’s sorry people are mad at him for being a dick. I’m sure the extremely light punishment will deter him going forward.",
                "The contractors that suggested cutting the thing down need their licenses revoking and stiff fines as well as the Toby Carvery owner - there are rules for cutting down mature trees in the UK",
                "no they are not sorry.",
                "He should be sorry about serving up that slop in his carvery. He should hang his head in shame for cutting down that tree",
                "In NYC, the restitution value of that tree by Parks would be in the hundreds of thousands of dollars.\n\nFine them to oblivion.",
                "the only way shit like this is going to stop is if we determine the individuals who are responsible and put them in prison, or otherwise punish them.  strip them of all assets, and make them work as a janitor at a national park, or something like that.  people having the ability to hide from personal liability behind the corporate wall has got to end."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Florida principal and teacher charged after 100 minors were at house party with alcohol.",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-principal-teacher-charged-100-minors-house-party-alcohol-rcna201662",
            "upvotes": 209,
            "date": "04/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-Cocoa-Beach-Fla-Karly-Gayle-Anderson-police-bodycam-snip-ac-813p-9e776a.jpg",
            "top_comments": [
                "There are photos of DeSantis at a high school party drinking with his underage students, but i guess it's different if you're elected Governor after the fact.",
                "A third grade teacher and the principal hosting 100+ high schoolers. What even is this?",
                "Man, I think about all the times this happened at my high school and wonder how nothing ever came to light about it. We had an art teacher who also doubled as the surf club (yes, that was a real thing) advisor, and he regularly allowed us to have a couple of beers at his beach house after club outings. This was the late 80's, so obviously a \"different time\", but the thought of telling anyone about it never occurred to any of us.",
                "This is the Florida I grew up in. Crooked ass state. I had a teacher that traded grades for drugs. Another one that slept with their students. Of course a few party with the students as well.",
                "Wait...they got charged? Must have been using preferred pronouns.",
                "School I worked at had principal throwing parties with beer and weed. 2 teachers married their high school students summer after graduation and then worked together at same high school. Administrators drinking during staff meeting days and school events. Small town shit never changes.",
                "Hold up so these kids were at the principals home completely wasted. Oh hell nah, throw the whole school away. What the fuck even is this.",
                "so many questions ........how can this kinda stuff happen ?",
                "One of the security people at my HS was caught doing something similar, but not at this scale. He was friends with the photography teacher and class and was known for buying students booze."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Temu and Shein will raise prices for US customers due to Trump's tariffs",
            "external_url": "https://apnews.com/article/temu-shein-price-increases-trump-tariffs-066a3e729c971fdf9e929bb8a94eea67",
            "upvotes": 1210,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Guess people are only going to be shoppinng like millionaires, maybe even thousandaires, instead of billionaires at Temu",
                "I can't wait until the \"haul culture\" dies, what a waste that is.",
                "Didn’t buy that shit before and I really won’t now.",
                "This must come as a huge shock to Americans who have been told by their leadership that China pays the tariffs, not Americans.",
                "I'll be honest, if you're someone that buys random things off of Instagram ads because you think they're functional or cute or useful, literally every single one of those things that you're seeing are sold on Temu infinitely cheaper - in some cases 90-95% cheaper for the exact same item. I've seen a bunch of Instagram ads for an ear wax removal tool with a camera so you can see what you're picking at for 59 dollars on some vendor, and the exact same item on Temu was $3.45.\n\nI don't use it for everything, clothes especially, but I've bought a number of Temu goods that I'm pretty happy with. And a number of those things I've had for years and they still work just as well.",
                "I guess if there’s one silver lining is that junk producers may go away. Fast fashion may disappear. \n\nBut then the flip side is that if you can’t afford lots then Temu and SHEIN are your only hope.",
                "Maybe a positive aspect of this is that temu goes out of business ",
                "This probably won’t deter many of their customers, who are apparently addicted to this fast fashion garbage.",
                "I dont feel bad for these 2 companies hurt by tariffs. They only sell single use craps.\n\nShein’s return rate is crazy high and those returned stuff mostly end up in some landfill in Africa. Just sad.",
                "So the exact same backpack that sells for 65$ on amazon will now cost me 30$ rather than the 20$ it used too.... oh well."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Man Who Set Fire to Shapiro’s Mansion Cited Treatment of Palestinians, Police Say",
            "external_url": "https://www.nytimes.com/2025/04/16/us/cody-balmer-motive-arson-gaza-palestinian-shapiro.html?unlocked_article_code=1.AU8.Urgu.PkzlAQXT8lQK&smid=nytcore-ios-share&referringSource=articleShare&sgrp=p",
            "upvotes": 1288,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's weird that they keep referring to this as \"Shapiro's Mansion\". \n\nIt's not HIS mansion, it's the governor's mansion. All Pennsylvania governors live there during their terms. \n\nIt would be like referring to the white house as \"Trump's House\".",
                "The guy is nuts. Have you seen him?",
                "Is there anything Governor Shapiro personally did to mistreat Palestinians, other than simply be Jewish?",
                "That makes sense, because I totally remember when Josh Shapiro personally flew over to Gaza and shot a few before hopping on a plane home.",
                "Naw.  I'm pretty sure that progressives already fixed that  whole \"mistreatment of Palestinians\" thing when they refused to vote for Harris and ended up getting Trump elected instead.  \n\nEverything is much better now, right?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Two infants die of whooping cough in Louisiana as cases climb nationally",
            "external_url": "https://www.cnn.com/2025/04/02/health/whooping-cough-pertussis-louisiana/index.html",
            "upvotes": 1808,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-541052350.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If only there were a way to stop it.",
                "it's like a revival of all the sicknesses",
                "It's sad for the children who die because it is so obviously preventable.  Kids can't control whether or not their parents are anti vaxxers.   As for any parent who has a child who dies because you decided to not vaccinate them, I have zero sympathy.  \n\nClearly there are parts of the population who for various reasons cannot be vaccinated, such as immunocompromized.  That's understandable and legitimate in my opinion",
                "Measles, whooping cough. Conservatives are getting what they wanted. The good old days are coming back.",
                "We've seen a rise of whooping cough cases in my highschool, we had three or four notices sent home that there were \ncases this school year. You have to get your TDAP vaccine every 10 years, it's an easy one to forget about.\n\n\nYou can get it at your local pharmacy, and if you plan on being around any newborns it doesn't hurt to get revaccinated.",
                "[Infant girl with whooping cough](https://youtu.be/S3oZrMGDMMw?si=SmUSkPnBy55QZKO2)\n\nWatch if you don't believe in vaccinations.",
                "Pregnant people can get the TDaP vaccine during each pregnancy to give their baby some protection when they're too young to be vaccinated.",
                "I want to stop playing The Oregon Trail for real now, please.",
                "Copied my comment from another sub:\n\nI got whooping cough when I was 16.\n\nI cannot stress that please for the love of god, ensure you and your children are immunized for it. It was the worst cough I'd ever had in my life, and you might say \"Why Tycho-Celchu, coughs aren't that bad, it's more of a minor annoyance when you're sick.\" and I cannot stress enough: No it is fucking horrible. It's horrible racking coughs that feel like any second your lung tissue is about to be expunged. I would get coughing fits so bad my stomach would contract and I'd throw up. Imagine with every cough you're vomiting more and more and when there's nothing left you're just retching with every hack.\n\nOh and you know what the alternative name for whooping cough is? The cough of a hundred days. And trust me, you feel everyone of those hundred days. I missed the last month of grade 10 because of it, I went to class once and I coughed so hard I wasn't able to breathe and the entire class panicked and thought I was going to die, complete with my teacher trying frantically to call 911 while I'm trying to stop her. When I showed up for the 1st day in grade 11, there were people I weren't friends with stopping to chat with me because I didn't come back to school after that and they thought I had died.",
                "I got whooping cough when I was six, almost died from it, and no doubt have lasting effects. This was *before* a vaccine was widely prescribed/available. These people are fucking idiots."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Tesla whistleblower wins latest legal battle in fight against Musk",
            "external_url": "https://www.bbc.com/news/articles/cevdz4yxpd9o",
            "upvotes": 5230,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/057d/live/f4e7a3a0-1af0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "As someone who was also diagnosed with an advanced cancer at a young age, I am in awe of this woman.  She is doing a good, but extremely challenging thing during her darkest days.  I’m routing for her, and hope she gets a resolution sooner rather than later.  I’m also wishing her positive outcomes with her treatment and outcome battling cancer.",
                "Hope she wins, no one deserves to wrongfully lose their job for bringing up concerns to a supervisor.",
                "> \"I wish Elon Musk had the decency to apologise.\"\n\nDon't we all wish the world's richest person had some decency.",
                "Darkest Prediction: \nWin the legal battle, lose the \"not getting sent to El Salvador prison\" war.",
                "Hard to be a shittier American than a Trump/Elon supporter these days",
                "What a stupid thing to get fired over. Fix the e carpets",
                "“I wish Elon Musk has the decency to apologize”\nHahahahahaha",
                "What’s the deal with the mats?  My mat curls and slides under the pedals.  I have to pull it down every single time I get in the car.",
                ">the chance to take on Elon Musk in front of a jury and judge\n\nThis thought delights me to the extreme.",
                "And the regime has sent her to their foreign gulag"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "2 Defense Department officials, including senior adviser to Pete Hegseth, put on leave amid leak investigation",
            "external_url": "https://www.cbsnews.com/news/dan-caldwell-pentagon-leak-investigation-on-leave/",
            "upvotes": 1264,
            "date": "04/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/37068e63-d5d8-44de-a1f5-d962712cccf3/thumbnail/1200x630/18120fcbb01fc5c0cb9650e2ab0af4fe/gettyimages-2203658198.jpg?v=412b48b2e3085db78364e6e02a7dc2b8",
            "top_comments": [
                ">A source familiar says Caldwell is accused of sharing classified documents with reporters.\n\nOh, is that a problem for Hegseth now?",
                "Such a mess. 0 Professionalism",
                "What about Hegseth? Shouldn't he be on leave too?",
                "WHISKEY LEAKS\nRemember: Trump only hires the best. ",
                "Damn, I got excited when I misread \"including Pete hegseth\"... then I remembered he's already at the top of that chain",
                "This DEI-less experiment seems to be a disaster.  Can we go back to being really good at things again?",
                "Every top official on that chat knew it was illegal to use for classified information. All of them, including the VP, needs to be impeached, removed from office, and prosecuted.",
                "Imagine being the one in the chat, leaking information, and then it's your assistant that gets suspended...Much accountability, much wow.",
                "Paid vacation for being bad at their jobs.",
                "\"Tyranny requires constant effort. It breaks, it leaks. Authority is brittle. Oppression is the mask of fear.\"\n\n-Nemik's Manifesto, Andor"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "RISING",
            "title": "US judge finds Google holds illegal online ad tech monopolies",
            "external_url": "https://www.reuters.com/technology/us-judge-finds-google-holds-illegal-online-ad-tech-monopolies-2025-04-17/",
            "upvotes": 915,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Kinda hard to get upset at this stage considering we've just let every mega corporation buy each other the last two decades. There is only like one competitor and it's meta for online ads, yeah? I mean Bing exists but.. It's Bing.",
                "I sense a completely unrelated trip to Mar-a-Lago and then things will get 'sorted' out.",
                "I predict this will go away after a trip to maraloago",
                "Time for Sundar Pichai to buy Clarence Thomas a new house.",
                "There are judges and law in the US?",
                "Every day is groundhogs day from 2016 on",
                "Will Democrats now go after Big Tech? Lol trump",
                "Yeah no shit. Now do Meta.",
                "I was at a focus group put on by Google to test how their defense worked. On the dolts in the session, it worked like a charm. Only a few saw through the defense.",
                "Predictable follow up headline, they get a $700m fine which sounds crazy but is actually the amount of money they make in 1 day."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Target baby food recalled over lead contamination",
            "external_url": "https://www.denver7.com/life/recalls/target-baby-food-recalled-over-lead-contamination",
            "upvotes": 439,
            "date": "04/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/1e90499/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fac%2F2c%2F1a6290854e989967dce1a6486285%2F1710766284-4lr8vv.jpg",
            "top_comments": [
                "Don't worry! Next time there won't be any pesky recalls because the dept that investigates food safety got DOGE'd. Lead for all!",
                "And some Americans wonder why we don't want to buy their shitty, deregulated food products.",
                "Lead in baby food and I saw another article about lead in a lot of toothpastes just this morning.\n\nCool",
                "This is why we need to get rid of regulations. Then we won’t have these scary recalls. Problem solved, right? ",
                "That's probably not gonna help their declining sales. Whoops. ",
                "Good thing the USDA is getting gutted. God damn MAGA is made of fucking morons.",
                "How does lead get into this stuff in the first place? Crops grown in toxic soil?",
                "This is the US in a nutshell. Have them babies so we can kill them!",
                "Well I, for one, think that lead is very *manly* and that it should be in more things. A lot of very powerful people got where there are because of lead, you know.",
                "Cost cutting kills customers."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Temu and Shein will raise prices for US customers due to Trump's tariffs",
            "external_url": "https://apnews.com/article/temu-shein-price-increases-trump-tariffs-066a3e729c971fdf9e929bb8a94eea67",
            "upvotes": 1212,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Guess people are only going to be shoppinng like millionaires, maybe even thousandaires, instead of billionaires at Temu",
                "I can't wait until the \"haul culture\" dies, what a waste that is.",
                "Didn’t buy that shit before and I really won’t now.",
                "This must come as a huge shock to Americans who have been told by their leadership that China pays the tariffs, not Americans.",
                "I'll be honest, if you're someone that buys random things off of Instagram ads because you think they're functional or cute or useful, literally every single one of those things that you're seeing are sold on Temu infinitely cheaper - in some cases 90-95% cheaper for the exact same item. I've seen a bunch of Instagram ads for an ear wax removal tool with a camera so you can see what you're picking at for 59 dollars on some vendor, and the exact same item on Temu was $3.45.\n\nI don't use it for everything, clothes especially, but I've bought a number of Temu goods that I'm pretty happy with. And a number of those things I've had for years and they still work just as well.",
                "I guess if there’s one silver lining is that junk producers may go away. Fast fashion may disappear. \n\nBut then the flip side is that if you can’t afford lots then Temu and SHEIN are your only hope.",
                "Maybe a positive aspect of this is that temu goes out of business ",
                "This probably won’t deter many of their customers, who are apparently addicted to this fast fashion garbage.",
                "I dont feel bad for these 2 companies hurt by tariffs. They only sell single use craps.\n\nShein’s return rate is crazy high and those returned stuff mostly end up in some landfill in Africa. Just sad.",
                "So the exact same backpack that sells for 65$ on amazon will now cost me 30$ rather than the 20$ it used too.... oh well."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Tesla whistleblower wins latest legal battle in fight against Musk",
            "external_url": "https://www.bbc.com/news/articles/cevdz4yxpd9o",
            "upvotes": 5235,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/057d/live/f4e7a3a0-1af0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "As someone who was also diagnosed with an advanced cancer at a young age, I am in awe of this woman.  She is doing a good, but extremely challenging thing during her darkest days.  I’m routing for her, and hope she gets a resolution sooner rather than later.  I’m also wishing her positive outcomes with her treatment and outcome battling cancer.",
                "Hope she wins, no one deserves to wrongfully lose their job for bringing up concerns to a supervisor.",
                "> \"I wish Elon Musk had the decency to apologise.\"\n\nDon't we all wish the world's richest person had some decency.",
                "Darkest Prediction: \nWin the legal battle, lose the \"not getting sent to El Salvador prison\" war.",
                "Hard to be a shittier American than a Trump/Elon supporter these days",
                "What a stupid thing to get fired over. Fix the e carpets",
                "“I wish Elon Musk has the decency to apologize”\nHahahahahaha",
                "What’s the deal with the mats?  My mat curls and slides under the pedals.  I have to pull it down every single time I get in the car.",
                ">the chance to take on Elon Musk in front of a jury and judge\n\nThis thought delights me to the extreme.",
                "And the regime has sent her to their foreign gulag"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Two infants die of whooping cough in Louisiana as cases climb nationally",
            "external_url": "https://www.cnn.com/2025/04/02/health/whooping-cough-pertussis-louisiana/index.html",
            "upvotes": 1810,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-541052350.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If only there were a way to stop it.",
                "it's like a revival of all the sicknesses",
                "It's sad for the children who die because it is so obviously preventable.  Kids can't control whether or not their parents are anti vaxxers.   As for any parent who has a child who dies because you decided to not vaccinate them, I have zero sympathy.  \n\nClearly there are parts of the population who for various reasons cannot be vaccinated, such as immunocompromized.  That's understandable and legitimate in my opinion",
                "Measles, whooping cough. Conservatives are getting what they wanted. The good old days are coming back.",
                "We've seen a rise of whooping cough cases in my highschool, we had three or four notices sent home that there were \ncases this school year. You have to get your TDAP vaccine every 10 years, it's an easy one to forget about.\n\n\nYou can get it at your local pharmacy, and if you plan on being around any newborns it doesn't hurt to get revaccinated.",
                "[Infant girl with whooping cough](https://youtu.be/S3oZrMGDMMw?si=SmUSkPnBy55QZKO2)\n\nWatch if you don't believe in vaccinations.",
                "Pregnant people can get the TDaP vaccine during each pregnancy to give their baby some protection when they're too young to be vaccinated.",
                "I want to stop playing The Oregon Trail for real now, please.",
                "Copied my comment from another sub:\n\nI got whooping cough when I was 16.\n\nI cannot stress that please for the love of god, ensure you and your children are immunized for it. It was the worst cough I'd ever had in my life, and you might say \"Why Tycho-Celchu, coughs aren't that bad, it's more of a minor annoyance when you're sick.\" and I cannot stress enough: No it is fucking horrible. It's horrible racking coughs that feel like any second your lung tissue is about to be expunged. I would get coughing fits so bad my stomach would contract and I'd throw up. Imagine with every cough you're vomiting more and more and when there's nothing left you're just retching with every hack.\n\nOh and you know what the alternative name for whooping cough is? The cough of a hundred days. And trust me, you feel everyone of those hundred days. I missed the last month of grade 10 because of it, I went to class once and I coughed so hard I wasn't able to breathe and the entire class panicked and thought I was going to die, complete with my teacher trying frantically to call 911 while I'm trying to stop her. When I showed up for the 1st day in grade 11, there were people I weren't friends with stopping to chat with me because I didn't come back to school after that and they thought I had died.",
                "I got whooping cough when I was six, almost died from it, and no doubt have lasting effects. This was *before* a vaccine was widely prescribed/available. These people are fucking idiots."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Man Who Set Fire to Shapiro’s Mansion Cited Treatment of Palestinians, Police Say",
            "external_url": "https://www.nytimes.com/2025/04/16/us/cody-balmer-motive-arson-gaza-palestinian-shapiro.html?unlocked_article_code=1.AU8.Urgu.PkzlAQXT8lQK&smid=nytcore-ios-share&referringSource=articleShare&sgrp=p",
            "upvotes": 1291,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's weird that they keep referring to this as \"Shapiro's Mansion\". \n\nIt's not HIS mansion, it's the governor's mansion. All Pennsylvania governors live there during their terms. \n\nIt would be like referring to the white house as \"Trump's House\".",
                "The guy is nuts. Have you seen him?",
                "Is there anything Governor Shapiro personally did to mistreat Palestinians, other than simply be Jewish?",
                "That makes sense, because I totally remember when Josh Shapiro personally flew over to Gaza and shot a few before hopping on a plane home.",
                "Naw.  I'm pretty sure that progressives already fixed that  whole \"mistreatment of Palestinians\" thing when they refused to vote for Harris and ended up getting Trump elected instead.  \n\nEverything is much better now, right?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Toby Carvery owner 'sorry' after cutting down 500 year old oak.",
            "external_url": "https://www.bbc.com/news/articles/ce8g6lj8343o",
            "upvotes": 647,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bdae/live/c7f3b800-1b74-11f0-b015-f17d4d024f76.jpg",
            "top_comments": [
                "How hard was it for these folks to just not cut the tree down Jfc",
                "Note: he’s sorry they upset the public. He never says sorry for cutting it down.",
                "Revoke the license of the Toby. Hit them where it hurts. The fines are pathetic.",
                "He's sorry he got caught, not that he cut it down.",
                "He’s not sorry for cutting it down. He’s sorry people are mad at him for being a dick. I’m sure the extremely light punishment will deter him going forward.",
                "The contractors that suggested cutting the thing down need their licenses revoking and stiff fines as well as the Toby Carvery owner - there are rules for cutting down mature trees in the UK",
                "no they are not sorry.",
                "He should be sorry about serving up that slop in his carvery. He should hang his head in shame for cutting down that tree",
                "In NYC, the restitution value of that tree by Parks would be in the hundreds of thousands of dollars.\n\nFine them to oblivion.",
                "the only way shit like this is going to stop is if we determine the individuals who are responsible and put them in prison, or otherwise punish them.  strip them of all assets, and make them work as a janitor at a national park, or something like that.  people having the ability to hide from personal liability behind the corporate wall has got to end."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Florida principal and teacher charged after 100 minors were at house party with alcohol.",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-principal-teacher-charged-100-minors-house-party-alcohol-rcna201662",
            "upvotes": 206,
            "date": "04/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-Cocoa-Beach-Fla-Karly-Gayle-Anderson-police-bodycam-snip-ac-813p-9e776a.jpg",
            "top_comments": [
                "There are photos of DeSantis at a high school party drinking with his underage students, but i guess it's different if you're elected Governor after the fact.",
                "A third grade teacher and the principal hosting 100+ high schoolers. What even is this?",
                "Man, I think about all the times this happened at my high school and wonder how nothing ever came to light about it. We had an art teacher who also doubled as the surf club (yes, that was a real thing) advisor, and he regularly allowed us to have a couple of beers at his beach house after club outings. This was the late 80's, so obviously a \"different time\", but the thought of telling anyone about it never occurred to any of us.",
                "This is the Florida I grew up in. Crooked ass state. I had a teacher that traded grades for drugs. Another one that slept with their students. Of course a few party with the students as well.",
                "Wait...they got charged? Must have been using preferred pronouns.",
                "School I worked at had principal throwing parties with beer and weed. 2 teachers married their high school students summer after graduation and then worked together at same high school. Administrators drinking during staff meeting days and school events. Small town shit never changes.",
                "Hold up so these kids were at the principals home completely wasted. Oh hell nah, throw the whole school away. What the fuck even is this.",
                "so many questions ........how can this kinda stuff happen ?",
                "One of the security people at my HS was caught doing something similar, but not at this scale. He was friends with the photography teacher and class and was known for buying students booze."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Russia seizing thousands of homes in occupied Mariupol - BBC News",
            "external_url": "https://www.bbc.co.uk/news/resources/idt-ca98fa24-29a3-4c74-aa7d-ce38f756270d",
            "upvotes": 374,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/images/ic/raw/p0l4pfhc.png.webp",
            "top_comments": [
                "This is quite literally one of the grievances explicitly listed within the United States' declaration of Independence. \n\n\nI don't care how deep into \"well its way over there and ain't happening to me\" you are. \n\nThis, as an American, should be fundamentally repulsive to you.",
                "This is why after the war is over, and Ukraine is free of the Russians, you will see articles accusing Ukraine of \"ethnic cleansing\" of Russian people.  All of the Russians who \"bought\" homes from the Russian government which were stolen from the Ukrainian people will be displaced.  The Russians will use this as propaganda saying that they were right all along.  People in the west will buy it, too."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/17/2025 16:10:36 UTC"
}