{
    "posts": [
        {
            "category": "HOT",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 33701,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 12529,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "How many times has this company filed for bankruptcy?",
                "[removed]",
                "“I don’t know about you, but I’m feeling 22!”",
                "Not so forever anymore.",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while.",
                "A business that depends on importing clothing during Trump tariffs is doomed.",
                "JCPenney store section, here they come.\n\nThese are two-story layouts in most malls. It's gonna take a lot of escape rooms, arcade, and mini golf to fill this spot.\n\nMaybe Spirit of Halloween will get bold and start renting out mall space each year."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 4663,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "Guess I’ll stop drinking that now, thanks",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "let the enshittification begin",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "Functional drinks? What?\n\nIt's just overpriced meh flavored soda..\n\n\nSomeone just got the bag.",
                "BIGSODA yet gobbles up another competitor to diversify their brand portfolio. everyone has a price and you'd be crazy not to accept it bc they'll own you one way or another (supply chain/distribution/etc)."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 6735,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "How does a family making $200k afford a child going to Harvard?",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "All like 1-2% they accept. \n\nThey still have a student body that is like 20-30%, made up of the 1% of the richest families."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 22720,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "So we’re there. “Let them enforce it” is now reality.",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\".",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter",
                "How does this administration manage to chose the absolute wrong side of every single issue? They would be better if they just flipped a coin."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Texas AG announces arrest of woman for allegedly illegally providing abortions in Houston",
            "external_url": "https://abcnews.go.com/US/texas-ag-announces-arrest-woman-allegedly-illegally-providing/story?id=119888542",
            "upvotes": 2088,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/553b1cdc-8add-461f-80d4-06fd20cfbc75/paxton-gty-er-250317_1742242201847_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I can't wait to hear all the details from someone other than Ken Paxton.",
                "> Abortions are banned in Texas except if the woman has a life-threatening condition or is at risk of \"substantial impairment of a major bodily function.\"\nPatients are required to make two trips, one for an in-person counseling session and then 24 hours later for the abortion, according to the Guttmacher Institute, a research group that focuses on sexual and reproductive health.\n\n\n\n\n\nNothing says amazing life saving treatment in emergency situations like giving a minimum of 24 hours to wait. ",
                "IIRC, to get a legal abortion in Texas the doctor is arrested and then must prove to the jury that it was medically necessary. You can't prove to a court and then have the court order an abortion. This was attempted early on and this AG said he would ignore any court and arrest the doctor anyway because this was the procedure. There isn't some standard to be met where a woman's life is sufficiently at risk or the fetus is nonviable. Doctor gets arrested and argues in a court of law to a jury that it was medically necessary. Remember that when one of those pro-birth anti-women people try to tell you it's a doctor's fault when a woman dies because she couldn't get an abortion.",
                "*\"In Texas, life is sacred,\" Paxton said in a statement. \"I will always do everything in my power to protect the unborn, defend our state's pro-life laws, and work to ensure that unlicensed individuals endangering the lives of women by performing illegal abortions are fully prosecuted.\"*\n\nTexas leads the country every year in executions. And this \"unlicensed individual\" is a woman helping other women, who have been denied abortion in Texas.",
                "Offhand, it looks like a \"midwife\" of questionable credentials practicing medicine without a license in a back alley clinic. \n\nIf you make abortion illegal, abortion doesn't go away, it just goes underground.",
                "Wow, it’s like we are moving back in time 100 years …….the Republican Party is insane ….",
                "Why do all high-ranking Republicans lately look like the villain in an 80s action movie?",
                ">\"In Texas, life is sacred,\" Paxton said in a statement.\n\nIs that supposed to be a joke?  Unless the kids are dying of measles or getting shot in school, right?\n\nAh, is there even a point pointing out the hypocrisy anymore?  I wish they'd just say they want to control women and save us all the hassle of that dog & pony show.",
                "[from another article:](https://www.texastribune.org/2025/03/17/texas-abortion-midwife-arrested/)\n\n\n>Holly Shearman, a midwife who runs Tomball Birth Center, where Rojas worked part-time providing prenatal care, said she was “shocked” by the news of her arrest. She described Rojas as a devout Catholic and skilled midwife whose clinics provided health care to a primarily Spanish-speaking, low-income community.\n\n\nWill be interested to see what they consider \"practicing medicine.\"",
                "She’ll be stoned to death in Texas under their new Christian Sharia laws."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 3168,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "That is a good start.... but they need to start prosecuting rogue police officers, not just firing them. We need to get rid of qualified immunity. That is what has created the problem.",
                "Now do the LASD. And, good luck with it.",
                "Federal database needed .",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 1660,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "Did they try turning the water spigot on?",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Fire... in the winter?!? That cant be true because a Ex-Oklahoma Senator James Inhofe told me Climate Change is fake because there was snow in DC in Febuary. Surely he must have been telling the truth.",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "Why doesn’t Oklahoma manage this better?  They need to rake the ground.  Also please do not let FEMA do any work as Oklahoma uses more tax dollars than they provide.",
                "And all those tariffs just in time for rebuilding.",
                "Have they thought about putting tariffs on the fire?",
                "Good news is trump won an imaginary golf tournament that he probably cheated at.  I can’t believe I just typed that.  What a world."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 586,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "I'm glad he got so many years of peace after.",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir."
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "HOT",
            "title": "Prince Harry: Deadline looms for Homeland Security to release visa records",
            "external_url": "https://www.bbc.com/news/articles/c3w13w757lgo",
            "upvotes": 458,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ebd9/live/dd704db0-035a-11f0-bbde-f372f8924428.jpg",
            "top_comments": [
                ">President Donald Trump previously ruled out deporting Prince Harry in February, telling the New York Post \"**I'll leave him alone**... He's got enough problems with his wife. She's terrible.\"\n\nBehold the wonders of \"small\" government.",
                "So, they gonna kick out ketamine Klaus as well?",
                "On the one hand, fuck the heritage foundation. On the other, a royal having to obey the same rules as everyone else is kind of refreshing.",
                "What a complete load of absolute bs. The only reason The Heritage Foundation is trying to do this is to flex so their braindead supporters praise them.",
                "So just about every right wing foundation are practically low life schemers?  Why is this necessary or important?  A whole foundation is looking into this.  Not at the price of living or fired government employees or the katamine dodge destroying our government?",
                "Not going to look up who the judge is, but if he doesn’t immediately throw this FOIA request out because of exemption 6 for privacy, you know he is a conservative hack; probably appointed by trump, probably recommended by the heritage foundation.",
                "My God they're gonna deport Harry 🤦🏼‍♂️.  Not that I care, I don't, but this exemplifies how fucked our priorities are these days.",
                "I bet Andrew was so relieved when Harry married a woman who isn't white.\n\nThis is DEI, the Royal Version.",
                "he def got the ignorant gene to leave royalty to come to the us for president to claim he is king."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 585,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "I'm glad he got so many years of peace after.",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Prince Harry: Deadline looms for Homeland Security to release visa records",
            "external_url": "https://www.bbc.com/news/articles/c3w13w757lgo",
            "upvotes": 459,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ebd9/live/dd704db0-035a-11f0-bbde-f372f8924428.jpg",
            "top_comments": [
                ">President Donald Trump previously ruled out deporting Prince Harry in February, telling the New York Post \"**I'll leave him alone**... He's got enough problems with his wife. She's terrible.\"\n\nBehold the wonders of \"small\" government.",
                "So, they gonna kick out ketamine Klaus as well?",
                "On the one hand, fuck the heritage foundation. On the other, a royal having to obey the same rules as everyone else is kind of refreshing.",
                "What a complete load of absolute bs. The only reason The Heritage Foundation is trying to do this is to flex so their braindead supporters praise them.",
                "So just about every right wing foundation are practically low life schemers?  Why is this necessary or important?  A whole foundation is looking into this.  Not at the price of living or fired government employees or the katamine dodge destroying our government?",
                "Not going to look up who the judge is, but if he doesn’t immediately throw this FOIA request out because of exemption 6 for privacy, you know he is a conservative hack; probably appointed by trump, probably recommended by the heritage foundation.",
                "My God they're gonna deport Harry 🤦🏼‍♂️.  Not that I care, I don't, but this exemplifies how fucked our priorities are these days.",
                "I bet Andrew was so relieved when Harry married a woman who isn't white.\n\nThis is DEI, the Royal Version.",
                "he def got the ignorant gene to leave royalty to come to the us for president to claim he is king."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Air Force shoots down Houthi drones launched at Navy carrier strike group",
            "external_url": "https://taskandpurpose.com/news/air-force-truman-houthi-drones/",
            "upvotes": 352,
            "date": "03/17/2025",
            "thumbnail": "https://taskandpurpose.com/wp-content/uploads/2025/03/USS-Gettysburg-March-2025.jpg",
            "top_comments": [
                "Don’t touch the boats!",
                "Imagine thinking that your shitty drone can bypass US Navy carrier group anti-air defenses",
                "Don't shoot at shipping or naval vessels and that won't happen. Simple.",
                "They’re gonna get themselves obliterated. They _can’t_ be feeling like they have some advantage here. I remember the Houthis m saying they’d specifically be targeting US ships after that bomb drop the other day, but what kind of tech are they using to identify ships and verify hits? I’m imagining they’re using a telescope to spot ships and go after them.",
                "The Japanese have a saying \n\nThe nail that stands out, is the one that gets pounded down.",
                "Air Medals for everybody!",
                "Are they sure it was the Air Force?",
                "Houthi will have to launch lots of drones and missiles if it want to even have a chance at hitting US naval warships.",
                "I guess those strikes didn't do shit then. ",
                "Houthi & the blowfish"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Texas AG announces arrest of woman for allegedly illegally providing abortions in Houston",
            "external_url": "https://abcnews.go.com/US/texas-ag-announces-arrest-woman-allegedly-illegally-providing/story?id=119888542",
            "upvotes": 2088,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/553b1cdc-8add-461f-80d4-06fd20cfbc75/paxton-gty-er-250317_1742242201847_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I can't wait to hear all the details from someone other than Ken Paxton.",
                "> Abortions are banned in Texas except if the woman has a life-threatening condition or is at risk of \"substantial impairment of a major bodily function.\"\nPatients are required to make two trips, one for an in-person counseling session and then 24 hours later for the abortion, according to the Guttmacher Institute, a research group that focuses on sexual and reproductive health.\n\n\n\n\n\nNothing says amazing life saving treatment in emergency situations like giving a minimum of 24 hours to wait. ",
                "IIRC, to get a legal abortion in Texas the doctor is arrested and then must prove to the jury that it was medically necessary. You can't prove to a court and then have the court order an abortion. This was attempted early on and this AG said he would ignore any court and arrest the doctor anyway because this was the procedure. There isn't some standard to be met where a woman's life is sufficiently at risk or the fetus is nonviable. Doctor gets arrested and argues in a court of law to a jury that it was medically necessary. Remember that when one of those pro-birth anti-women people try to tell you it's a doctor's fault when a woman dies because she couldn't get an abortion.",
                "*\"In Texas, life is sacred,\" Paxton said in a statement. \"I will always do everything in my power to protect the unborn, defend our state's pro-life laws, and work to ensure that unlicensed individuals endangering the lives of women by performing illegal abortions are fully prosecuted.\"*\n\nTexas leads the country every year in executions. And this \"unlicensed individual\" is a woman helping other women, who have been denied abortion in Texas.",
                "Offhand, it looks like a \"midwife\" of questionable credentials practicing medicine without a license in a back alley clinic. \n\nIf you make abortion illegal, abortion doesn't go away, it just goes underground.",
                "Wow, it’s like we are moving back in time 100 years …….the Republican Party is insane ….",
                "Why do all high-ranking Republicans lately look like the villain in an 80s action movie?",
                ">\"In Texas, life is sacred,\" Paxton said in a statement.\n\nIs that supposed to be a joke?  Unless the kids are dying of measles or getting shot in school, right?\n\nAh, is there even a point pointing out the hypocrisy anymore?  I wish they'd just say they want to control women and save us all the hassle of that dog & pony show.",
                "[from another article:](https://www.texastribune.org/2025/03/17/texas-abortion-midwife-arrested/)\n\n\n>Holly Shearman, a midwife who runs Tomball Birth Center, where Rojas worked part-time providing prenatal care, said she was “shocked” by the news of her arrest. She described Rojas as a devout Catholic and skilled midwife whose clinics provided health care to a primarily Spanish-speaking, low-income community.\n\n\nWill be interested to see what they consider \"practicing medicine.\"",
                "She’ll be stoned to death in Texas under their new Christian Sharia laws."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 4667,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "Guess I’ll stop drinking that now, thanks",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "let the enshittification begin",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "Functional drinks? What?\n\nIt's just overpriced meh flavored soda..\n\n\nSomeone just got the bag.",
                "BIGSODA yet gobbles up another competitor to diversify their brand portfolio. everyone has a price and you'd be crazy not to accept it bc they'll own you one way or another (supply chain/distribution/etc)."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 1660,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "Did they try turning the water spigot on?",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Fire... in the winter?!? That cant be true because a Ex-Oklahoma Senator James Inhofe told me Climate Change is fake because there was snow in DC in Febuary. Surely he must have been telling the truth.",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "Why doesn’t Oklahoma manage this better?  They need to rake the ground.  Also please do not let FEMA do any work as Oklahoma uses more tax dollars than they provide.",
                "And all those tariffs just in time for rebuilding.",
                "Have they thought about putting tariffs on the fire?",
                "Good news is trump won an imaginary golf tournament that he probably cheated at.  I can’t believe I just typed that.  What a world."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 33674,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 6740,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "How does a family making $200k afford a child going to Harvard?",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "All like 1-2% they accept. \n\nThey still have a student body that is like 20-30%, made up of the 1% of the richest families."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Employee charged in killing of trucking CEO found after fire in Chicago suburb",
            "external_url": "https://www.cbsnews.com/chicago/news/employee-charged-killing-of-trucking-ceo-crestwood/",
            "upvotes": 824,
            "date": "03/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/17/1a39fdd1-24a5-49c7-8cd7-6b5888b0951e/thumbnail/1200x630/997c6d131cae3dc65a5c8e0ee40dc028/untitled-2025-03-17t093958-944.png?v=0f810147b409d4839bb6b9850f758494",
            "top_comments": [
                "[removed]",
                "framing an innocent employee for fire+accident death of ceo is peak USA,\nI think the ceo was not putting enough hours into his work and made a silly mistake that led to this.\nif they cut the salary of the CEO to the lowest earner of the company, then the real ceos who are in for the work and not to make money will succeed",
                "Just gonna put it out there, anyone in the trucking industry who knows anything about brokering loads knows that EVERY Chicago based Trucking company is a scam operation.\n\nMost freight brokers will automatically ban a company based out of Chicago because they are notoriously always scamers.",
                "Jeramie Bizzle.\n\nI wonder how it went growing up with that name?",
                "I’m not buyin it. Sounds like the guy was framed",
                "You don’t use dental floss on your throat. He also stored flammable materials in his house. Sounds like the employee is innocent and the CEO was just incompetent.",
                "Oh no! Not a job creator! Who’s going to create the jobs now?",
                "The CEO probably died accidentally from a lack of diligence, not being hardcore enough, or giving it less than 110%. We should take this as a learning opportunity and get back to work.",
                "These guys don't truck around.",
                "I knew a trucking CEO, they can be pretty ruthless just like the rest of them. They’ll make all sorts of promises just to get through the quarter then layoff 2/3rd’s of their staff for the winter and IF they bring them back it’s for less money."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 3170,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "That is a good start.... but they need to start prosecuting rogue police officers, not just firing them. We need to get rid of qualified immunity. That is what has created the problem.",
                "Now do the LASD. And, good luck with it.",
                "Federal database needed .",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Texas AG announces arrest of woman for allegedly illegally providing abortions in Houston",
            "external_url": "https://abcnews.go.com/US/texas-ag-announces-arrest-woman-allegedly-illegally-providing/story?id=119888542",
            "upvotes": 2092,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/553b1cdc-8add-461f-80d4-06fd20cfbc75/paxton-gty-er-250317_1742242201847_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I can't wait to hear all the details from someone other than Ken Paxton.",
                "> Abortions are banned in Texas except if the woman has a life-threatening condition or is at risk of \"substantial impairment of a major bodily function.\"\nPatients are required to make two trips, one for an in-person counseling session and then 24 hours later for the abortion, according to the Guttmacher Institute, a research group that focuses on sexual and reproductive health.\n\n\n\n\n\nNothing says amazing life saving treatment in emergency situations like giving a minimum of 24 hours to wait. ",
                "IIRC, to get a legal abortion in Texas the doctor is arrested and then must prove to the jury that it was medically necessary. You can't prove to a court and then have the court order an abortion. This was attempted early on and this AG said he would ignore any court and arrest the doctor anyway because this was the procedure. There isn't some standard to be met where a woman's life is sufficiently at risk or the fetus is nonviable. Doctor gets arrested and argues in a court of law to a jury that it was medically necessary. Remember that when one of those pro-birth anti-women people try to tell you it's a doctor's fault when a woman dies because she couldn't get an abortion.",
                "*\"In Texas, life is sacred,\" Paxton said in a statement. \"I will always do everything in my power to protect the unborn, defend our state's pro-life laws, and work to ensure that unlicensed individuals endangering the lives of women by performing illegal abortions are fully prosecuted.\"*\n\nTexas leads the country every year in executions. And this \"unlicensed individual\" is a woman helping other women, who have been denied abortion in Texas.",
                "Offhand, it looks like a \"midwife\" of questionable credentials practicing medicine without a license in a back alley clinic. \n\nIf you make abortion illegal, abortion doesn't go away, it just goes underground.",
                "Wow, it’s like we are moving back in time 100 years …….the Republican Party is insane ….",
                "Why do all high-ranking Republicans lately look like the villain in an 80s action movie?",
                ">\"In Texas, life is sacred,\" Paxton said in a statement.\n\nIs that supposed to be a joke?  Unless the kids are dying of measles or getting shot in school, right?\n\nAh, is there even a point pointing out the hypocrisy anymore?  I wish they'd just say they want to control women and save us all the hassle of that dog & pony show.",
                "[from another article:](https://www.texastribune.org/2025/03/17/texas-abortion-midwife-arrested/)\n\n\n>Holly Shearman, a midwife who runs Tomball Birth Center, where Rojas worked part-time providing prenatal care, said she was “shocked” by the news of her arrest. She described Rojas as a devout Catholic and skilled midwife whose clinics provided health care to a primarily Spanish-speaking, low-income community.\n\n\nWill be interested to see what they consider \"practicing medicine.\"",
                "She’ll be stoned to death in Texas under their new Christian Sharia laws."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 583,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "I'm glad he got so many years of peace after.",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 33689,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 3169,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "That is a good start.... but they need to start prosecuting rogue police officers, not just firing them. We need to get rid of qualified immunity. That is what has created the problem.",
                "Now do the LASD. And, good luck with it.",
                "Federal database needed .",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 1659,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "Did they try turning the water spigot on?",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Fire... in the winter?!? That cant be true because a Ex-Oklahoma Senator James Inhofe told me Climate Change is fake because there was snow in DC in Febuary. Surely he must have been telling the truth.",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "Why doesn’t Oklahoma manage this better?  They need to rake the ground.  Also please do not let FEMA do any work as Oklahoma uses more tax dollars than they provide.",
                "And all those tariffs just in time for rebuilding.",
                "Have they thought about putting tariffs on the fire?",
                "Good news is trump won an imaginary golf tournament that he probably cheated at.  I can’t believe I just typed that.  What a world."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 4672,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "Guess I’ll stop drinking that now, thanks",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "let the enshittification begin",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "Functional drinks? What?\n\nIt's just overpriced meh flavored soda..\n\n\nSomeone just got the bag.",
                "BIGSODA yet gobbles up another competitor to diversify their brand portfolio. everyone has a price and you'd be crazy not to accept it bc they'll own you one way or another (supply chain/distribution/etc)."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 6739,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "How does a family making $200k afford a child going to Harvard?",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "All like 1-2% they accept. \n\nThey still have a student body that is like 20-30%, made up of the 1% of the richest families."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 12531,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "How many times has this company filed for bankruptcy?",
                "[removed]",
                "“I don’t know about you, but I’m feeling 22!”",
                "Not so forever anymore.",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while.",
                "A business that depends on importing clothing during Trump tariffs is doomed.",
                "JCPenney store section, here they come.\n\nThese are two-story layouts in most malls. It's gonna take a lot of escape rooms, arcade, and mini golf to fill this spot.\n\nMaybe Spirit of Halloween will get bold and start renting out mall space each year."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Air Force shoots down Houthi drones launched at Navy carrier strike group",
            "external_url": "https://taskandpurpose.com/news/air-force-truman-houthi-drones/",
            "upvotes": 352,
            "date": "03/17/2025",
            "thumbnail": "https://taskandpurpose.com/wp-content/uploads/2025/03/USS-Gettysburg-March-2025.jpg",
            "top_comments": [
                "Don’t touch the boats!",
                "Imagine thinking that your shitty drone can bypass US Navy carrier group anti-air defenses",
                "Don't shoot at shipping or naval vessels and that won't happen. Simple.",
                "They’re gonna get themselves obliterated. They _can’t_ be feeling like they have some advantage here. I remember the Houthis m saying they’d specifically be targeting US ships after that bomb drop the other day, but what kind of tech are they using to identify ships and verify hits? I’m imagining they’re using a telescope to spot ships and go after them.",
                "The Japanese have a saying \n\nThe nail that stands out, is the one that gets pounded down.",
                "Air Medals for everybody!",
                "Are they sure it was the Air Force?",
                "Houthi will have to launch lots of drones and missiles if it want to even have a chance at hitting US naval warships.",
                "I guess those strikes didn't do shit then. ",
                "Houthi & the blowfish"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Employee charged in killing of trucking CEO found after fire in Chicago suburb",
            "external_url": "https://www.cbsnews.com/chicago/news/employee-charged-killing-of-trucking-ceo-crestwood/",
            "upvotes": 830,
            "date": "03/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/17/1a39fdd1-24a5-49c7-8cd7-6b5888b0951e/thumbnail/1200x630/997c6d131cae3dc65a5c8e0ee40dc028/untitled-2025-03-17t093958-944.png?v=0f810147b409d4839bb6b9850f758494",
            "top_comments": [
                "[removed]",
                "framing an innocent employee for fire+accident death of ceo is peak USA,\nI think the ceo was not putting enough hours into his work and made a silly mistake that led to this.\nif they cut the salary of the CEO to the lowest earner of the company, then the real ceos who are in for the work and not to make money will succeed",
                "Just gonna put it out there, anyone in the trucking industry who knows anything about brokering loads knows that EVERY Chicago based Trucking company is a scam operation.\n\nMost freight brokers will automatically ban a company based out of Chicago because they are notoriously always scamers.",
                "Jeramie Bizzle.\n\nI wonder how it went growing up with that name?",
                "I’m not buyin it. Sounds like the guy was framed",
                "You don’t use dental floss on your throat. He also stored flammable materials in his house. Sounds like the employee is innocent and the CEO was just incompetent.",
                "Oh no! Not a job creator! Who’s going to create the jobs now?",
                "The CEO probably died accidentally from a lack of diligence, not being hardcore enough, or giving it less than 110%. We should take this as a learning opportunity and get back to work.",
                "These guys don't truck around.",
                "I knew a trucking CEO, they can be pretty ruthless just like the rest of them. They’ll make all sorts of promises just to get through the quarter then layoff 2/3rd’s of their staff for the winter and IF they bring them back it’s for less money."
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "03/18/2025 00:40:21 UTC"
}