{
    "posts": [
        {
            "category": "HOT",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 11648,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death",
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                "Fuck. The poor surviving brother.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nThis is what the kid that brings a knife to school in case someone messes with him thinks is someone messing with him.",
                "Absolutely psychotic to murder someone over a mild inconvenience.",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "What a loving family he had.. Quoted from the article:\n\n“I’m not trying to judge, but what kind of parents did this child have? What was he taught? He brought a knife to a track meet and he murdered my son by stabbing him in the heart. The guy was in the wrong place and they asked him to move and he bowed up [became angry and aggressive]. This is murder,” Jeff Metcalf said.\n\n“You know what, I already forgive this person. Already. God takes care of things. God is going to take care of me. God is going to take care of my family,” he added.",
                "Wow way to ruin your life in a millisecond. Really makes you wonder about people"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 22822,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)\n\nEdit: [here is a working link to the letter, credit to u/MixedPotion for digging it up](https://web.archive.org/web/20121019011529/http://www.calgaryherald.com/opinion/letters/nose+hill+park+confrontation+makes+visitors+feel+unsafe/7050028/story.html)",
                "One of the safest countries I have ever been to.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "I cannot imagine living in a country where you have to take with you an item solely designed for taking another humans life with you at all times to the point where you *forget you have it on you*, just to feel safe.",
                "how do people \"forget\" where a gun is?",
                "how did it make it that far?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 5785,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "And none of the people involved with Signalgate",
                "It’s painful to be reminded of all d-list sycophants Trump had during his campaign. \n\nRFKjr, Keri Lake, Catturd, Comrade Tulsi, Kid Rock, Rob Schneider, Kash Patel, Pete Hegseth, Giuliani , Hulk Hogan, Vince McMahon etc.  \n\nThese guys were on their way out of public consciousness once Trump\nLost.  But enough people sat out the election and now he’s rewarding the absolute worst of humanity by giving them power and influence over the American people for no other reason than “the libs will hate this”. \n\nHearing Laura Loomers name is a reminder that he’s not close to being done getting his revenge on America.  (And no, not only the libs, on the entire country).",
                "she's only 31?! she looks like a refurbished 50 at *best*.",
                "He probably gets extra jazzy about getting away in the open with what Bill Clinton lost a portion of his legacy over. And so does anyone intentionally looking the other way.",
                "\"Come s my d and you can fire whoever you want\"",
                "It’s wild how much she turned herself into a goblin"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
            "external_url": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
            "upvotes": 4470,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124184-17435157572025-04-01t134226z_383673798_rc21pdav4zv2_rtrmadp_0_usa-trump-health.jpeg?v=1743515784&w=1920&h=1080",
            "top_comments": [
                "Lmao and the stock market is in free fall to own the Libs.",
                "I'm beginning to understand how this MF bankrupted an effing CASINO!",
                "Donald Trump is a terrorist. He is literally destroying everything in America.\n\nIs Trump being controlled by Putin?",
                "This bullshit is going to crush the business I work for. \nFuck everyone who voted for it.",
                "Burning down the economy at both ends",
                "> “It would have otherwise been a fairly quiet month for layoffs.”\nHowever, DOGE has continued to cut aggressively across the government.\nVarious reports have indicated that the Veterans Affairs department could lose 80,000 jobs, the IRS is in line for some 18,000 reductions and Treasury is expected to drop a “substantial” level of workers as well, according to a court filing.\nThe year to date tally for federal government announced layoffs represents a 672% increase from the same period in 2024, according to Challenger.\n\nA 672% increase is painful. Unemployment claims are going to take much longer, and people are going to struggle to find new jobs in an oversaturated market. Especially here in the DMW area.",
                "> U.S.-based employers announced 275,240 job cuts in March\n\n> Of that total, 216,670 were due to “DOGE Actions”\n\n> job cut announcements rose 60% month-on-month, and were 205% higher than in March 2024.\n\n> That’s a record high for any March, and the third-highest monthly total ever recorded.\n\n[Source](https://www.theguardian.com/us-news/live/2025/apr/03/business-news-live-updates-trump-tarrifs-asian-markets-nikkei-asx-wall-st-dow-jones-dollar-euro?page=with%3Ablock-67ee73148f08dc205ac3569c#block-67ee73148f08dc205ac3569c)",
                "The funny thing is Al Gore slashed 400,000 jobs from the federal government under Clinton,  through a combination of voluntary departures, attrition and a relatively small number of layoffs, but he did it in partnership with the agencies and wasn't sued once. Coincidentally, that was the last time the country had a budget surplus.",
                "And it's not even going to be saving the government money thanks to all the lost revenues",
                "Depression Donnie is just getting started."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Pentagon’s watchdog to review Hegseth’s use of Signal app to convey plans for Houthi strike",
            "external_url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06",
            "upvotes": 1129,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tomorrow:  DOGE fires Pentagon staff, cites \"wasteful spending\".",
                "He’ll be fine. They already shifted the blame.",
                "Now that we know Republicans will lie about Democrats \"weaponizing the justice system\" and that Republicans will absolutely weaponize the justice system, I'd like to see a Democratic candidate run on it.\n\nTheir entire campaign could be a laundry list of people like Hegseth who will be rounded up and sent to an El Salvadoran prison on day 1 of the new administration.",
                "“We’ve reviewed the illegal use of civilian social apps for classified information sharing of active military combat, and found no wrong doing”",
                "Trump appoints himself Pentagon watchdog.",
                "Oh boy, I sure am ready for absolutely nothing of consequence to happen to the secretary of drunkenness.",
                "I wouldn't be surprised if it is a made-up examination to say after a few days \"Nope, all easy. It wasn't that bad!\" to sweep the whole issue under the carpet for good...",
                "I mean, is this even a question? He violated federal laws and military regulations and created a massive OPSEC dataspill\n\nHe and everyone on that chat should be fired. ( except the reporter, they get a raise)",
                "There's a watchdog that hasn't been replaced by Sycophants?",
                "[deleted]"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Russia bans Elton John Aids Foundation over its support for LGBTQ+ rights",
            "external_url": "https://www.theguardian.com/world/2025/apr/03/russia-bans-elton-john-aids-foundation-support-lgbtq-rights",
            "upvotes": 2292,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1da710a393dbb0652e80593d9269e27b7c00d37e/650_325_3498_2099/master/3498.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95b5f956c29a4cce2aa1334b39d2c5ff",
            "top_comments": [
                "I am now confused between America and Russia. Seems both countries now have the same policies.",
                "My wish is one day Putin & Trump are playing cards in The Hague.",
                "Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.",
                "What a wild political time shift  I’ve lived. \n\nOld enough to watch Live Aid on tv live. \n\nOld enough to remember the Scorpions “Wind of Change” being a song of hope and renewal.\n\nOld enough to see some of my favorite peoples come through the “don’t touch them!” Era of AIDS and HIV, and , “God hates F*gs”  to the semi acceptance  of homosexuality except for the most hard core religious kooks and insecure males. \n\nOld enough to see women make gains in positions of power.\n\nOld enough to know people who went to see Roger Waters perform “the Wall” on the No man’s land Strip in Germany, where fleeing East Germans used to be shot dead, just for seeking freedom. \n\nOld enough to see the ISS come to fruition as a symbol of International scientific cooperation in space exploration.\n\nTo see it all destroyed in less than a decade, and to see my country wind the clock back to a time I never lived in, where minorities are stripped of their rights and their histories, where women are no longer autonomous humans, where lgbtq people have to hide in fear in some spaces again. \n\nI know the pendulum swings, but DAMN.",
                "Tomorrows Fox News Chryon: Impending US Recession caused by LGBTQ+ rights",
                "America will probably follow suit soon",
                "Stay classy Russia. Who are you invading next?",
                "#Saturday \n\n#Saturday\n\n#Saturday nights all right for fighting Nazis \n\n\n#SEE YOU IN THE STREETS APRIL 5",
                "I expect the Trump White House to follow suit, though RFK Jr is getting a head start making things deadlier over here already.\n\nIt’s so strange living in the era of the idiotic supervillain.",
                "Elton should thank Putin for helping raise awareness of his charity.\n\nThis is valuable free advertising."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US bans government personnel in China from romantic or sexual relations with Chinese citizens",
            "external_url": "https://apnews.com/article/chinese-beijing-honeypot-spies-diplomat-agent-intelligence-c077ef57b0f7ae43dd0db41bea92238b",
            "upvotes": 964,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Curious. This was put in place by the outgoing, Biden-appointed ambassador, Nicholas Burns. And it's an expansion of an earlier fraternization policy. Trump's nominee is unconfirmed at this moment.",
                "What about regular us citizens? Can we still smash?",
                "That's good.  Don't want to make Russia jealous.",
                "You can ban me all you want, you're just making it hotter!",
                "I'm not sure if they can legally do this. (Not that this would stop them)\n\nEdit- many people have kindly informed me that I'm wrong, and there are many circumstances where this is completely possible and appropriate.",
                "Honestly kinda surprised this wasn't already a thing due to risk of espionage",
                "No mentions of DoD, they asked Congress, Congress said ask the State Dept., State Dept. said nothing.\n\nArticle is deeply vague",
                "This isn't really that shocking, as long as the punishment is just losing their jobs and/or clearances. Many clearance applications already require you to have your close relationships scrutinized and investigated.",
                "We should be making our own honeypots not banning theirs wtf.",
                "The honey pot trap is legendary, I'm sure this is to combat Chinese spying."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Volkswagen to introduce 'import fee' on tariff-hit cars, WSJ reports",
            "external_url": "https://www.reuters.com/business/autos-transportation/volkswagen-introduce-import-fee-tariff-hit-cars-wsj-reports-2025-04-03/",
            "upvotes": 1168,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The other day I noticed on a US based clothing company, a line item for 'tariff' that added X% to the total bill. I hope over companies do this so consumers can see, directly, how they are impacted by this.",
                "Call it \"Import fee\" or \"Trump Tax\" whatever.  Inflation is going to skyrocket.",
                "Imagine trying to sell imported cars during this chaotic timeline. It takes around 4 weeks for RORO boats to arrive loaded with new cars. Tariffs change overnight whenever Trump is bored. Good luck to businesses trying to project sales and turn a profit.",
                "Call it a Trump Tax you fucking pussies",
                "Weird, I've been assured through magical alchemy that tariffs would not impact the cost of goods and that Americans wouldn't bear the burden of them...  \n\nSurely the people who told me Mexico is going to buy us a wall wouldn't have lied again...",
                "As a side question; presumably a massive amount of \"American made\" products use a shit load of foreign components - do tariffs get applied to any goods coming into the country, or only when the end product is supplied to the customer? If that's the case, aren't \"American made\" products going to just jump up in price now too because of those components costing the manufacturer more to acquire??",
                "Every business needs to add a \"Trump Tax\" line item.\n\nMake it cover the COGS increase due to tariffs.",
                "This should be the norm. Dont just raise prices. Set an additional fee equivalent to the tariff so people can see, at a glance, how much this administration has added in taxes on the american consumer.",
                "Jerry- But the car was already on the lot. Puddy- Yeah, that's right.",
                "It's a tax on all. Pass it along. The people will pay and the corporations will just get richer."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Stellantis idles plants in Mexico and Canada due to tariffs",
            "external_url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html",
            "upvotes": 1052,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124412-1743531991434-gettyimages-2207473532-_C3A5390CR2.jpeg?v=1743532113&w=1920&h=1080",
            "top_comments": [
                "900 \"US-represented\" employees laid off as of Monday. That's working out great.",
                "Donald Trump is officially an international economic terrorist.",
                "Honestly with how poorly jeeps been doing and other stellantis brands, won’t be shocked if this is a good excuse to slim down and blame tariffs rather than own up to stellantis being absolute dogshit. Just bottom of the barrel quality, with top tier prices- again looking at you Jeep, and you grand Durango ermmm grand wagoneer. Way to wreck an iconic vehicle.",
                "Stellantis was on the ropes already, at Dodge Hornet at 25% more dollars is simply not going to sell.",
                "Considering the current new car market, this may be a silver lining. The manufacturers don't have to worry too much on making new cars with so many sitting on the lots. If they're smart about this, they can retool, retrain, and up their Q.C. game. Just kidding, its stellantis.",
                "Anyone tired of winning yet?",
                "Stellantis was well on the road to being fucked before the tariffs were announced—Stupid upper management decisions over the course of the last decade have put them on the endangered list but this will end them in North America—a couple of the brands might survive under different ownership but, IMHO Stellantis will not survive these tariffs in North America. Goodbye Chrysler, Jeep, Ram, Dodge in their current form. Fiat, Alfa Romeo, Maserati were pretty much done anyway. The European brands will survive in Europe. Dodge and Ram might get sold to another manufacturer, Chrysler is extinct. Jeep will get to be yet another brand’s fair haired stepchild like it has been previously five or so times in the past.",
                "expect a lot more announcements like this one...",
                "Ha get ur parts and ur tariff now aholes! ~ Stellantis",
                "They aren’t going to survive, are they?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "15-year-old girl attacked by sea lion in California",
            "external_url": "https://abcnews.go.com/US/15-year-girl-attacked-sea-lion-california/story?id=120369992",
            "upvotes": 563,
            "date": "04/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/625f69ff-3d58-4bb8-a93c-51ca1b212260/sea-lion-1-ht-er-250402_1743614646916_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "from the article:\n\n>Phoebe Beltran, 15, has always been a \"water baby,\" according to her mom, Bibi Beltran.\n\n>In the middle of competing in the 1,000-yard swim test, she felt pain in her right arm.\n\n>\"My initial reaction was, 'I'm getting eaten in the middle of the water, it's a shark, I'm going to die,'\" Phoebe Beltran told ABC News.\n\n>Phoebe Beltran immediately screamed for help, which is when the animal -- she later found out was a sea lion -- let go of her arm.\n\n>She was assisted back to the shore and a lifeguard boat patrolling the water brought all the other swimmers to safety, according to the Long Beach Fire Department.\n\n>\"As I was getting up onto shore, that's when I stood up, the lifeguards saw that my arm was bleeding, they took me to the sand and started fixing me up before sending me to the ER,\" Phoebe Beltran said.\n\n>Her mom heard the screams, but didn't think it was her daughter until she saw her arm gushing with blood.\n\n>\"I don't have the words to explain the panic in a mom's heart when they see their child like that,\" Bibi Beltran said. \"It was a rollercoaster of emotions.\"\n\n>Phoebe Beltran had bites \"localized to her arms and extremities\" and was taken to the local hospital, but \"did not require advanced treatment,\" officials said.\n\n>Phoebe Beltran said she did not do \"anything that provoked\" the sea lion and she would not have swum next to it if she had seen the animal.\n\n>\"It came out of nowhere, I was surprised by it and so were other people,\" Phoebe Beltran said.",
                "I'm disappointed the article didn't include a random shot of a sea lion not looking sorry",
                "she's got a look on her face like \"fuck, now i'm gonna be on the news for being attacked by a sea lion\"",
                "They are basically feral ocean dogs.",
                ">This incident comes after sea lions on the California coast have reportedly been displaying strange behavior, likely due to a harmful algae bloom impacting the region, according to marine researchers.\n\n[Early Bloom of Toxic Algae off Southern California Sickens Hundreds of Sea Lions and Dolphins](https://www.fisheries.noaa.gov/feature-story/early-bloom-toxic-algae-southern-california-sickens-hundreds-sea-lions-and-dolphins)\n\n*The culprit in the strandings is domoic acid, a neurotoxin produced by the harmful algae Pseudo-nitzschia that can multiply quickly in the right conditions. Wind-driven upwelling of deep ocean water provides nutrients that fuel California’s rich marine ecosystem. That same upwelling can also feed rapid growth of the algae and the toxin it produces.*\n\nIsn't this almost the plot of The Happening?",
                "At first I thought she got bit for fucking with them. \n\nBut it turns out to be just a weird unavoidable event I guess. \n\nI don’t blame her for screaming I’d freak the fuck out too if something bit me in the middle of the ocean. Seaweed brushing my legs still freaks me out. ",
                "It wasn’t wearing a yellow bow tie, was it?",
                "Loose seal, loose seal!",
                "Probably was pissed about the tariffs on the Heard and McDonald islands.",
                "I was swimming in the ocean in Oregon as a teenager and I came face to face with a sea lion in the surf. It went “Aaaaaa” which, as an adult, not being in biting distance from a three hundred pound ocean going mammal probably just meant “Hello, young person!” In Sea Lion. Teenaged me teleported onto the beech."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "‘Potentially historic’ flooding threat looms after almost 100 tornadoes hit US",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/potentially-historic-flooding-threat-looms-almost-100-tornadoes-hit-us?fbclid=IwY2xjawJbwM5leHRuA2FlbQIxMAABHf0BvM5E8-X3l1OI-2P-MhoArZtVfmWk_VqPltvB_XT2bPfpe3kApMiBlg_aem_o40FYX2abRDOh2wxzsObJQ",
            "upvotes": 193,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/eef4db8a70a019076a43e6a27e0f1c7af9f4d14f/0_121_8000_4799/master/8000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26d925fec27c5adf0333e12f3487d811",
            "top_comments": [
                "Didn't DOGE recently put a stop to FEMA funding?  Said \"the states can take care of their own\"?\n\nThese people are screwed.",
                "As someone who lives in this so-called \"Bible Belt\", I wonder who/what the religious wackos here will blame this time for this happening.",
                "*The nationwide network of River Forecast Centers – operated by Noaa – have been especially hard hit by staffing cuts with five of the 12 offices currently having critical vacancies. This week’s heavy rains will be yet another example of how extreme weather is testing the increasingly weakened agency*\n\nFlooding and tornadoes reaching record-breaking numbers at a time when national and local responses have been limited or undermined by this out of control admin.",
                "A little FEMA would be good right about now.  Oh wait..",
                "They should have raked",
                "We're going to *screams* TARIFF THE TORNADOES. That would have never happened if sleepy Joe, remember sleepy Joe? was a president. ",
                "Hopefully there's a federal agency with enough funding and human resources to deal with such disasters, right?",
                "Once again, it will hit God's country",
                "Have you guys tried shooting the tornadoes?",
                "This looks like a Sim City news headline... it used to be funny"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Canada will match Trump’s 25% auto tariffs, Carney says",
            "external_url": "https://globalnews.ca/news/11113522/donald-trump-auto-tariffs-canada-april-3/",
            "upvotes": 73,
            "date": "04/03/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/trump-auto-tariffs.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "I challenge everybody. Do you know any businessman who has filed for bankruptcy at least six times?\n\nRight. He is handling America's economy right now.",
                "Inflation is going to go sky high. If you're planning to buy any foreign goods then I would do it very soon.",
                "Buy your car before it's too late to afford even a used dumpster ",
                "This is insane. Why allow the US to get away with this nonsense. Retaliation and standing up against a bully is not an option. Fight united against 🤡 Trump and his egotistical narcissism."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Court gives Drake access to Kendrick's contracts",
            "external_url": "https://www.bbc.com/news/articles/creqzpd0r97o",
            "upvotes": 159,
            "date": "04/03/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0c66/live/f83b30f0-1067-11f0-93d7-a3dd8019c0be.jpg",
            "top_comments": [
                ">According to a court filing, Drake's team is seeking documents including \"all contracts between UMG and Kendrick Lamar\" and the salaries and incentive plans for senior record label staff, going back to 2020.\n\nSounds like a fishing expedition.",
                "Amazing to see a guy lose a rap battle so bad he torches what's left of his own career to try to save a little dignity\n\nSeriously no record label is going to work with him after this",
                "Can't wait for Josh Johnson to talk about this so I can understand what's going on better!",
                "Not gonna win your case, Aubrey.",
                "“Let’s speak on percentages, show your your splits  I’ll make sure I double back with you”\nKendrick kinda already offered to show him the contracts lol",
                "Oh my God how much fucking punishment can this guy deal himself\n\n\nHe's already the biggest bitch in all of rap history, what does he think he's gonna accomplish? Let's say he finds some gotcha technical bs to sue Kendrick for, literally nobody is gonna give a fuck. They're just gonna chant A Minor",
                "The last thing you want to do when a beef happens is sue. Automatically makes you look like a loser",
                "Drake's been a baby soft b*tch in my mind ever since I saw this dash cam video. \n\n\nhttps://www.reddit.com/r/toronto/comments/6z5qsp/drakes_tiff_motorcade_bullying_their_way_through/\n\n\nKendrick publically handing him L's has been a welcome development. ",
                "i bet he feels like he won something \"my peoples are looking into your contracts!\" like he's going to find anything. dude couldnt even find any dirt on kendrick even with all his backing and connections. \n\ndrake is a bitch to the core",
                "There’s losing a rap beef, and there’s this level of self owning. And before anyone claims Kendrick is actually dragging this out for fame, I want to point you to Drakes treatment of Meek Mill"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Pentagon’s watchdog to review Hegseth’s use of Signal app to convey plans for Houthi strike",
            "external_url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06",
            "upvotes": 1128,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tomorrow:  DOGE fires Pentagon staff, cites \"wasteful spending\".",
                "He’ll be fine. They already shifted the blame.",
                "Now that we know Republicans will lie about Democrats \"weaponizing the justice system\" and that Republicans will absolutely weaponize the justice system, I'd like to see a Democratic candidate run on it.\n\nTheir entire campaign could be a laundry list of people like Hegseth who will be rounded up and sent to an El Salvadoran prison on day 1 of the new administration.",
                "“We’ve reviewed the illegal use of civilian social apps for classified information sharing of active military combat, and found no wrong doing”",
                "Trump appoints himself Pentagon watchdog.",
                "Oh boy, I sure am ready for absolutely nothing of consequence to happen to the secretary of drunkenness.",
                "I wouldn't be surprised if it is a made-up examination to say after a few days \"Nope, all easy. It wasn't that bad!\" to sweep the whole issue under the carpet for good...",
                "I mean, is this even a question? He violated federal laws and military regulations and created a massive OPSEC dataspill\n\nHe and everyone on that chat should be fired. ( except the reporter, they get a raise)",
                "There's a watchdog that hasn't been replaced by Sycophants?",
                "[deleted]"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Myanmar earthquake death toll rises to 3,145 as more bodies found",
            "external_url": "https://apnews.com/article/myanmar-thailand-earthquake-71d51dfc7339e017b1d116c105effab4",
            "upvotes": 152,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And they're stuck in the middle of a brutal civil war during this disaster, too. \n\nHorrifyingly awful.",
                "Jesus dude, they just can’t catch a break. Civill war, brutal dictatorship, coups, genocide, intentional targeting of civilians, etc.",
                "Thank God the US sent 3 people to help with this."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Georgia community fights rail company trying to seize property through eminent domain",
            "external_url": "https://www.cbsnews.com/news/sparta-georgia-railroad-eminent-domain-legal-battle/",
            "upvotes": 172,
            "date": "04/03/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/01/b85dfd22-e148-4dff-bbee-bf50434e8fc6/thumbnail/1200x630/fb228f17e55701eef8389f4205b4d477/henry-ga-eminent-domain-case-20250401-enp-copy-01-frame-65.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Fucking over poor people to build a goddamn shipping line and yet Atlanta can’t build any more MARTA rail for some reason",
                "Fun fact, thanks to the supreme court any corporation can petition the state/federal government to take over ANY property as long as they can prove that they will pay more in taxes on the land than the current owners. I guess it's not so fun.",
                "The community should get together and build a railroad on it first before the rail company gets a chance to build a railroad, and then sell it to the rail company for a huge mark up.",
                "The photo was unnecessary, we knew whose property it is.",
                "A rail line through that county isn't going to benefit anyone in it. What rural idiot politician believed that schpiel? ",
                "> The Smiths for years have been leading a coalition opposing a rail company's plan to carve through private property with four and a half miles of new track, citing eminent domain — a legal strategy the government or private utility can use to seize citizens' land in exchange for compensation if it's deemed for the public good.\n\nForcefully taking something from someone else, regardless of whether compensation is offered, is just wrong. If the rail companies need more land, then make it an investment; trade stock and dividends to property owners for annual use of the land."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US bans government personnel in China from romantic or sexual relations with Chinese citizens",
            "external_url": "https://apnews.com/article/chinese-beijing-honeypot-spies-diplomat-agent-intelligence-c077ef57b0f7ae43dd0db41bea92238b",
            "upvotes": 963,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Curious. This was put in place by the outgoing, Biden-appointed ambassador, Nicholas Burns. And it's an expansion of an earlier fraternization policy. Trump's nominee is unconfirmed at this moment.",
                "What about regular us citizens? Can we still smash?",
                "That's good.  Don't want to make Russia jealous.",
                "You can ban me all you want, you're just making it hotter!",
                "I'm not sure if they can legally do this. (Not that this would stop them)\n\nEdit- many people have kindly informed me that I'm wrong, and there are many circumstances where this is completely possible and appropriate.",
                "Honestly kinda surprised this wasn't already a thing due to risk of espionage",
                "No mentions of DoD, they asked Congress, Congress said ask the State Dept., State Dept. said nothing.\n\nArticle is deeply vague",
                "This isn't really that shocking, as long as the punishment is just losing their jobs and/or clearances. Many clearance applications already require you to have your close relationships scrutinized and investigated.",
                "We should be making our own honeypots not banning theirs wtf.",
                "The honey pot trap is legendary, I'm sure this is to combat Chinese spying."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "15-year-old girl attacked by sea lion in California",
            "external_url": "https://abcnews.go.com/US/15-year-girl-attacked-sea-lion-california/story?id=120369992",
            "upvotes": 564,
            "date": "04/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/625f69ff-3d58-4bb8-a93c-51ca1b212260/sea-lion-1-ht-er-250402_1743614646916_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "from the article:\n\n>Phoebe Beltran, 15, has always been a \"water baby,\" according to her mom, Bibi Beltran.\n\n>In the middle of competing in the 1,000-yard swim test, she felt pain in her right arm.\n\n>\"My initial reaction was, 'I'm getting eaten in the middle of the water, it's a shark, I'm going to die,'\" Phoebe Beltran told ABC News.\n\n>Phoebe Beltran immediately screamed for help, which is when the animal -- she later found out was a sea lion -- let go of her arm.\n\n>She was assisted back to the shore and a lifeguard boat patrolling the water brought all the other swimmers to safety, according to the Long Beach Fire Department.\n\n>\"As I was getting up onto shore, that's when I stood up, the lifeguards saw that my arm was bleeding, they took me to the sand and started fixing me up before sending me to the ER,\" Phoebe Beltran said.\n\n>Her mom heard the screams, but didn't think it was her daughter until she saw her arm gushing with blood.\n\n>\"I don't have the words to explain the panic in a mom's heart when they see their child like that,\" Bibi Beltran said. \"It was a rollercoaster of emotions.\"\n\n>Phoebe Beltran had bites \"localized to her arms and extremities\" and was taken to the local hospital, but \"did not require advanced treatment,\" officials said.\n\n>Phoebe Beltran said she did not do \"anything that provoked\" the sea lion and she would not have swum next to it if she had seen the animal.\n\n>\"It came out of nowhere, I was surprised by it and so were other people,\" Phoebe Beltran said.",
                "I'm disappointed the article didn't include a random shot of a sea lion not looking sorry",
                "she's got a look on her face like \"fuck, now i'm gonna be on the news for being attacked by a sea lion\"",
                "They are basically feral ocean dogs.",
                ">This incident comes after sea lions on the California coast have reportedly been displaying strange behavior, likely due to a harmful algae bloom impacting the region, according to marine researchers.\n\n[Early Bloom of Toxic Algae off Southern California Sickens Hundreds of Sea Lions and Dolphins](https://www.fisheries.noaa.gov/feature-story/early-bloom-toxic-algae-southern-california-sickens-hundreds-sea-lions-and-dolphins)\n\n*The culprit in the strandings is domoic acid, a neurotoxin produced by the harmful algae Pseudo-nitzschia that can multiply quickly in the right conditions. Wind-driven upwelling of deep ocean water provides nutrients that fuel California’s rich marine ecosystem. That same upwelling can also feed rapid growth of the algae and the toxin it produces.*\n\nIsn't this almost the plot of The Happening?",
                "At first I thought she got bit for fucking with them. \n\nBut it turns out to be just a weird unavoidable event I guess. \n\nI don’t blame her for screaming I’d freak the fuck out too if something bit me in the middle of the ocean. Seaweed brushing my legs still freaks me out. ",
                "It wasn’t wearing a yellow bow tie, was it?",
                "Loose seal, loose seal!",
                "Probably was pissed about the tariffs on the Heard and McDonald islands.",
                "I was swimming in the ocean in Oregon as a teenager and I came face to face with a sea lion in the surf. It went “Aaaaaa” which, as an adult, not being in biting distance from a three hundred pound ocean going mammal probably just meant “Hello, young person!” In Sea Lion. Teenaged me teleported onto the beech."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 11659,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death",
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                "Fuck. The poor surviving brother.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nThis is what the kid that brings a knife to school in case someone messes with him thinks is someone messing with him.",
                "Absolutely psychotic to murder someone over a mild inconvenience.",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "What a loving family he had.. Quoted from the article:\n\n“I’m not trying to judge, but what kind of parents did this child have? What was he taught? He brought a knife to a track meet and he murdered my son by stabbing him in the heart. The guy was in the wrong place and they asked him to move and he bowed up [became angry and aggressive]. This is murder,” Jeff Metcalf said.\n\n“You know what, I already forgive this person. Already. God takes care of things. God is going to take care of me. God is going to take care of my family,” he added.",
                "Wow way to ruin your life in a millisecond. Really makes you wonder about people"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 5786,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "And none of the people involved with Signalgate",
                "It’s painful to be reminded of all d-list sycophants Trump had during his campaign. \n\nRFKjr, Keri Lake, Catturd, Comrade Tulsi, Kid Rock, Rob Schneider, Kash Patel, Pete Hegseth, Giuliani , Hulk Hogan, Vince McMahon etc.  \n\nThese guys were on their way out of public consciousness once Trump\nLost.  But enough people sat out the election and now he’s rewarding the absolute worst of humanity by giving them power and influence over the American people for no other reason than “the libs will hate this”. \n\nHearing Laura Loomers name is a reminder that he’s not close to being done getting his revenge on America.  (And no, not only the libs, on the entire country).",
                "she's only 31?! she looks like a refurbished 50 at *best*.",
                "He probably gets extra jazzy about getting away in the open with what Bill Clinton lost a portion of his legacy over. And so does anyone intentionally looking the other way.",
                "\"Come s my d and you can fire whoever you want\"",
                "It’s wild how much she turned herself into a goblin"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Pentagon’s watchdog to review Hegseth’s use of Signal app to convey plans for Houthi strike",
            "external_url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06",
            "upvotes": 1133,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tomorrow:  DOGE fires Pentagon staff, cites \"wasteful spending\".",
                "He’ll be fine. They already shifted the blame.",
                "Now that we know Republicans will lie about Democrats \"weaponizing the justice system\" and that Republicans will absolutely weaponize the justice system, I'd like to see a Democratic candidate run on it.\n\nTheir entire campaign could be a laundry list of people like Hegseth who will be rounded up and sent to an El Salvadoran prison on day 1 of the new administration.",
                "“We’ve reviewed the illegal use of civilian social apps for classified information sharing of active military combat, and found no wrong doing”",
                "Trump appoints himself Pentagon watchdog.",
                "Oh boy, I sure am ready for absolutely nothing of consequence to happen to the secretary of drunkenness.",
                "I wouldn't be surprised if it is a made-up examination to say after a few days \"Nope, all easy. It wasn't that bad!\" to sweep the whole issue under the carpet for good...",
                "I mean, is this even a question? He violated federal laws and military regulations and created a massive OPSEC dataspill\n\nHe and everyone on that chat should be fired. ( except the reporter, they get a raise)",
                "There's a watchdog that hasn't been replaced by Sycophants?",
                "[deleted]"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 5786,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "And none of the people involved with Signalgate",
                "It’s painful to be reminded of all d-list sycophants Trump had during his campaign. \n\nRFKjr, Keri Lake, Catturd, Comrade Tulsi, Kid Rock, Rob Schneider, Kash Patel, Pete Hegseth, Giuliani , Hulk Hogan, Vince McMahon etc.  \n\nThese guys were on their way out of public consciousness once Trump\nLost.  But enough people sat out the election and now he’s rewarding the absolute worst of humanity by giving them power and influence over the American people for no other reason than “the libs will hate this”. \n\nHearing Laura Loomers name is a reminder that he’s not close to being done getting his revenge on America.  (And no, not only the libs, on the entire country).",
                "she's only 31?! she looks like a refurbished 50 at *best*.",
                "He probably gets extra jazzy about getting away in the open with what Bill Clinton lost a portion of his legacy over. And so does anyone intentionally looking the other way.",
                "\"Come s my d and you can fire whoever you want\"",
                "It’s wild how much she turned herself into a goblin"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US bans government personnel in China from romantic or sexual relations with Chinese citizens",
            "external_url": "https://apnews.com/article/chinese-beijing-honeypot-spies-diplomat-agent-intelligence-c077ef57b0f7ae43dd0db41bea92238b",
            "upvotes": 958,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Curious. This was put in place by the outgoing, Biden-appointed ambassador, Nicholas Burns. And it's an expansion of an earlier fraternization policy. Trump's nominee is unconfirmed at this moment.",
                "What about regular us citizens? Can we still smash?",
                "That's good.  Don't want to make Russia jealous.",
                "You can ban me all you want, you're just making it hotter!",
                "I'm not sure if they can legally do this. (Not that this would stop them)\n\nEdit- many people have kindly informed me that I'm wrong, and there are many circumstances where this is completely possible and appropriate.",
                "Honestly kinda surprised this wasn't already a thing due to risk of espionage",
                "No mentions of DoD, they asked Congress, Congress said ask the State Dept., State Dept. said nothing.\n\nArticle is deeply vague",
                "This isn't really that shocking, as long as the punishment is just losing their jobs and/or clearances. Many clearance applications already require you to have your close relationships scrutinized and investigated.",
                "We should be making our own honeypots not banning theirs wtf.",
                "The honey pot trap is legendary, I'm sure this is to combat Chinese spying."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "Russia bans Elton John Aids Foundation over its support for LGBTQ+ rights",
            "external_url": "https://www.theguardian.com/world/2025/apr/03/russia-bans-elton-john-aids-foundation-support-lgbtq-rights",
            "upvotes": 2290,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1da710a393dbb0652e80593d9269e27b7c00d37e/650_325_3498_2099/master/3498.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95b5f956c29a4cce2aa1334b39d2c5ff",
            "top_comments": [
                "I am now confused between America and Russia. Seems both countries now have the same policies.",
                "My wish is one day Putin & Trump are playing cards in The Hague.",
                "Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.",
                "What a wild political time shift  I’ve lived. \n\nOld enough to watch Live Aid on tv live. \n\nOld enough to remember the Scorpions “Wind of Change” being a song of hope and renewal.\n\nOld enough to see some of my favorite peoples come through the “don’t touch them!” Era of AIDS and HIV, and , “God hates F*gs”  to the semi acceptance  of homosexuality except for the most hard core religious kooks and insecure males. \n\nOld enough to see women make gains in positions of power.\n\nOld enough to know people who went to see Roger Waters perform “the Wall” on the No man’s land Strip in Germany, where fleeing East Germans used to be shot dead, just for seeking freedom. \n\nOld enough to see the ISS come to fruition as a symbol of International scientific cooperation in space exploration.\n\nTo see it all destroyed in less than a decade, and to see my country wind the clock back to a time I never lived in, where minorities are stripped of their rights and their histories, where women are no longer autonomous humans, where lgbtq people have to hide in fear in some spaces again. \n\nI know the pendulum swings, but DAMN.",
                "Tomorrows Fox News Chryon: Impending US Recession caused by LGBTQ+ rights",
                "America will probably follow suit soon",
                "Stay classy Russia. Who are you invading next?",
                "#Saturday \n\n#Saturday\n\n#Saturday nights all right for fighting Nazis \n\n\n#SEE YOU IN THE STREETS APRIL 5",
                "I expect the Trump White House to follow suit, though RFK Jr is getting a head start making things deadlier over here already.\n\nIt’s so strange living in the era of the idiotic supervillain.",
                "Elton should thank Putin for helping raise awareness of his charity.\n\nThis is valuable free advertising."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Volkswagen to introduce 'import fee' on tariff-hit cars, WSJ reports",
            "external_url": "https://www.reuters.com/business/autos-transportation/volkswagen-introduce-import-fee-tariff-hit-cars-wsj-reports-2025-04-03/",
            "upvotes": 1173,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The other day I noticed on a US based clothing company, a line item for 'tariff' that added X% to the total bill. I hope over companies do this so consumers can see, directly, how they are impacted by this.",
                "Call it \"Import fee\" or \"Trump Tax\" whatever.  Inflation is going to skyrocket.",
                "Imagine trying to sell imported cars during this chaotic timeline. It takes around 4 weeks for RORO boats to arrive loaded with new cars. Tariffs change overnight whenever Trump is bored. Good luck to businesses trying to project sales and turn a profit.",
                "Call it a Trump Tax you fucking pussies",
                "Weird, I've been assured through magical alchemy that tariffs would not impact the cost of goods and that Americans wouldn't bear the burden of them...  \n\nSurely the people who told me Mexico is going to buy us a wall wouldn't have lied again...",
                "As a side question; presumably a massive amount of \"American made\" products use a shit load of foreign components - do tariffs get applied to any goods coming into the country, or only when the end product is supplied to the customer? If that's the case, aren't \"American made\" products going to just jump up in price now too because of those components costing the manufacturer more to acquire??",
                "Every business needs to add a \"Trump Tax\" line item.\n\nMake it cover the COGS increase due to tariffs.",
                "This should be the norm. Dont just raise prices. Set an additional fee equivalent to the tariff so people can see, at a glance, how much this administration has added in taxes on the american consumer.",
                "Jerry- But the car was already on the lot. Puddy- Yeah, that's right.",
                "It's a tax on all. Pass it along. The people will pay and the corporations will just get richer."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
            "external_url": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
            "upvotes": 4466,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124184-17435157572025-04-01t134226z_383673798_rc21pdav4zv2_rtrmadp_0_usa-trump-health.jpeg?v=1743515784&w=1920&h=1080",
            "top_comments": [
                "Lmao and the stock market is in free fall to own the Libs.",
                "I'm beginning to understand how this MF bankrupted an effing CASINO!",
                "Donald Trump is a terrorist. He is literally destroying everything in America.\n\nIs Trump being controlled by Putin?",
                "This bullshit is going to crush the business I work for. \nFuck everyone who voted for it.",
                "Burning down the economy at both ends",
                "> “It would have otherwise been a fairly quiet month for layoffs.”\nHowever, DOGE has continued to cut aggressively across the government.\nVarious reports have indicated that the Veterans Affairs department could lose 80,000 jobs, the IRS is in line for some 18,000 reductions and Treasury is expected to drop a “substantial” level of workers as well, according to a court filing.\nThe year to date tally for federal government announced layoffs represents a 672% increase from the same period in 2024, according to Challenger.\n\nA 672% increase is painful. Unemployment claims are going to take much longer, and people are going to struggle to find new jobs in an oversaturated market. Especially here in the DMW area.",
                "> U.S.-based employers announced 275,240 job cuts in March\n\n> Of that total, 216,670 were due to “DOGE Actions”\n\n> job cut announcements rose 60% month-on-month, and were 205% higher than in March 2024.\n\n> That’s a record high for any March, and the third-highest monthly total ever recorded.\n\n[Source](https://www.theguardian.com/us-news/live/2025/apr/03/business-news-live-updates-trump-tarrifs-asian-markets-nikkei-asx-wall-st-dow-jones-dollar-euro?page=with%3Ablock-67ee73148f08dc205ac3569c#block-67ee73148f08dc205ac3569c)",
                "The funny thing is Al Gore slashed 400,000 jobs from the federal government under Clinton,  through a combination of voluntary departures, attrition and a relatively small number of layoffs, but he did it in partnership with the agencies and wasn't sued once. Coincidentally, that was the last time the country had a budget surplus.",
                "And it's not even going to be saving the government money thanks to all the lost revenues",
                "Depression Donnie is just getting started."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 11659,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death",
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                "Fuck. The poor surviving brother.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nThis is what the kid that brings a knife to school in case someone messes with him thinks is someone messing with him.",
                "Absolutely psychotic to murder someone over a mild inconvenience.",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "What a loving family he had.. Quoted from the article:\n\n“I’m not trying to judge, but what kind of parents did this child have? What was he taught? He brought a knife to a track meet and he murdered my son by stabbing him in the heart. The guy was in the wrong place and they asked him to move and he bowed up [became angry and aggressive]. This is murder,” Jeff Metcalf said.\n\n“You know what, I already forgive this person. Already. God takes care of things. God is going to take care of me. God is going to take care of my family,” he added.",
                "Wow way to ruin your life in a millisecond. Really makes you wonder about people"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Stellantis idles plants in Mexico and Canada due to tariffs",
            "external_url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html",
            "upvotes": 1047,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124412-1743531991434-gettyimages-2207473532-_C3A5390CR2.jpeg?v=1743532113&w=1920&h=1080",
            "top_comments": [
                "900 \"US-represented\" employees laid off as of Monday. That's working out great.",
                "Donald Trump is officially an international economic terrorist.",
                "Honestly with how poorly jeeps been doing and other stellantis brands, won’t be shocked if this is a good excuse to slim down and blame tariffs rather than own up to stellantis being absolute dogshit. Just bottom of the barrel quality, with top tier prices- again looking at you Jeep, and you grand Durango ermmm grand wagoneer. Way to wreck an iconic vehicle.",
                "Stellantis was on the ropes already, at Dodge Hornet at 25% more dollars is simply not going to sell.",
                "Considering the current new car market, this may be a silver lining. The manufacturers don't have to worry too much on making new cars with so many sitting on the lots. If they're smart about this, they can retool, retrain, and up their Q.C. game. Just kidding, its stellantis.",
                "Anyone tired of winning yet?",
                "Stellantis was well on the road to being fucked before the tariffs were announced—Stupid upper management decisions over the course of the last decade have put them on the endangered list but this will end them in North America—a couple of the brands might survive under different ownership but, IMHO Stellantis will not survive these tariffs in North America. Goodbye Chrysler, Jeep, Ram, Dodge in their current form. Fiat, Alfa Romeo, Maserati were pretty much done anyway. The European brands will survive in Europe. Dodge and Ram might get sold to another manufacturer, Chrysler is extinct. Jeep will get to be yet another brand’s fair haired stepchild like it has been previously five or so times in the past.",
                "expect a lot more announcements like this one...",
                "Ha get ur parts and ur tariff now aholes! ~ Stellantis",
                "They aren’t going to survive, are they?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "15-year-old girl attacked by sea lion in California",
            "external_url": "https://abcnews.go.com/US/15-year-girl-attacked-sea-lion-california/story?id=120369992",
            "upvotes": 569,
            "date": "04/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/625f69ff-3d58-4bb8-a93c-51ca1b212260/sea-lion-1-ht-er-250402_1743614646916_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "from the article:\n\n>Phoebe Beltran, 15, has always been a \"water baby,\" according to her mom, Bibi Beltran.\n\n>In the middle of competing in the 1,000-yard swim test, she felt pain in her right arm.\n\n>\"My initial reaction was, 'I'm getting eaten in the middle of the water, it's a shark, I'm going to die,'\" Phoebe Beltran told ABC News.\n\n>Phoebe Beltran immediately screamed for help, which is when the animal -- she later found out was a sea lion -- let go of her arm.\n\n>She was assisted back to the shore and a lifeguard boat patrolling the water brought all the other swimmers to safety, according to the Long Beach Fire Department.\n\n>\"As I was getting up onto shore, that's when I stood up, the lifeguards saw that my arm was bleeding, they took me to the sand and started fixing me up before sending me to the ER,\" Phoebe Beltran said.\n\n>Her mom heard the screams, but didn't think it was her daughter until she saw her arm gushing with blood.\n\n>\"I don't have the words to explain the panic in a mom's heart when they see their child like that,\" Bibi Beltran said. \"It was a rollercoaster of emotions.\"\n\n>Phoebe Beltran had bites \"localized to her arms and extremities\" and was taken to the local hospital, but \"did not require advanced treatment,\" officials said.\n\n>Phoebe Beltran said she did not do \"anything that provoked\" the sea lion and she would not have swum next to it if she had seen the animal.\n\n>\"It came out of nowhere, I was surprised by it and so were other people,\" Phoebe Beltran said.",
                "I'm disappointed the article didn't include a random shot of a sea lion not looking sorry",
                "she's got a look on her face like \"fuck, now i'm gonna be on the news for being attacked by a sea lion\"",
                "They are basically feral ocean dogs.",
                ">This incident comes after sea lions on the California coast have reportedly been displaying strange behavior, likely due to a harmful algae bloom impacting the region, according to marine researchers.\n\n[Early Bloom of Toxic Algae off Southern California Sickens Hundreds of Sea Lions and Dolphins](https://www.fisheries.noaa.gov/feature-story/early-bloom-toxic-algae-southern-california-sickens-hundreds-sea-lions-and-dolphins)\n\n*The culprit in the strandings is domoic acid, a neurotoxin produced by the harmful algae Pseudo-nitzschia that can multiply quickly in the right conditions. Wind-driven upwelling of deep ocean water provides nutrients that fuel California’s rich marine ecosystem. That same upwelling can also feed rapid growth of the algae and the toxin it produces.*\n\nIsn't this almost the plot of The Happening?",
                "At first I thought she got bit for fucking with them. \n\nBut it turns out to be just a weird unavoidable event I guess. \n\nI don’t blame her for screaming I’d freak the fuck out too if something bit me in the middle of the ocean. Seaweed brushing my legs still freaks me out. ",
                "It wasn’t wearing a yellow bow tie, was it?",
                "Loose seal, loose seal!",
                "Probably was pissed about the tariffs on the Heard and McDonald islands.",
                "I was swimming in the ocean in Oregon as a teenager and I came face to face with a sea lion in the surf. It went “Aaaaaa” which, as an adult, not being in biting distance from a three hundred pound ocean going mammal probably just meant “Hello, young person!” In Sea Lion. Teenaged me teleported onto the beech."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 22826,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)\n\nEdit: [here is a working link to the letter, credit to u/MixedPotion for digging it up](https://web.archive.org/web/20121019011529/http://www.calgaryherald.com/opinion/letters/nose+hill+park+confrontation+makes+visitors+feel+unsafe/7050028/story.html)",
                "One of the safest countries I have ever been to.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "I cannot imagine living in a country where you have to take with you an item solely designed for taking another humans life with you at all times to the point where you *forget you have it on you*, just to feel safe.",
                "how do people \"forget\" where a gun is?",
                "how did it make it that far?"
            ],
            "aggregate_sentiment": 67.0
        }
    ],
    "last_updated": "04/03/2025 20:09:31 UTC"
}