{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 7075,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "Elections have consequences.",
                "28 Americans are dead because an elderly diaper-wearing reality TV show host and a racist nepo baby from Apartheid South Africa gutted government services including NOAA and the National Weather Service. Get ready for an extremely entertaining and deadly hurricane season."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 36137,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Oh, we're doing this again...fuck these psychopaths.",
                "Caused by someone who is \"pro life\"",
                "Christian Domestic Terrorism.",
                "What the fuck? It looks like this place does IVF treatments. I don't even think it does abortions, which is what you'd think some lunatic would plant a bomb over. It legit just looks like they provide services to make MORE babies. [https://arcbabies.com/our-services/](https://arcbabies.com/our-services/)\n\nAre they mad about embryos being discarded potentially or something?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 4325,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25138069404635.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/8Blca](https://archive.is/8Blca)\n- *Edit: Link and content below updated.*\n\n# Around 20 injured after Mexican Navy training ship strikes Brooklyn Bridge, officials say\n\n>Around 20 people were injured when a Mexican Navy training ship carrying 277 passengers struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\n>The ship lost power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel towards the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\n>Video shows the Cuauhtémoc’s mast hitting the underside of the bridge and breaking as the vessel passes through, with pieces falling down towards the deck. No visible damage could be seen on the bridge itself, which was open to traffic Saturday night after shuttering briefly.\n\n>There were sailors on the bridge’s mast who were injured, Aramboles said.\n\n>New York City Mayor Eric Adams said 19 people were injured, including four with serious injuries. The Mexican Navy noted 22 were hurt in a post in Spanish on X, with 19 receiving medical attention at local hospitals.\n\n>“The status of the personnel and material is under review by naval and local authorities, who are providing support,” the Mexican Navy said.\n\n>The ship was on a training cruise, which takes place every year, Mexican Navy spokesman Capt. Juan Caballero told CNN.\n\n>All lanes of the Brooklyn Bridge were briefly closed in both directions after the incident but had reopened as of 10:30 p.m., according to New York emergency officials.\n\n>“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge at this time,” according to Fabien Levy, a spokesperson for Adams.\n\n>NYPD told residents to avoid the area of Brooklyn Bridge, South Street Seaport in Manhattan, and Dumbo in Brooklyn.  “Expect heavy traffic and a large presence of emergency vehicles in the surrounding area,” police said on X.\n\n>This is a developing story and will be updated.\n>CNN’s Mark Morales contributed to this report.",
                "Wonder how long he'll have caps lock on this time",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "There were people on the masts...",
                "Omg 🤦‍♀️ we all know where this is going…",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "prez is going to call it an international conflict /smh",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration closing iconic NASA research center in New York",
            "external_url": "https://www.axios.com/2025/05/17/trump-nasa-goddard-office",
            "upvotes": 4014,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "While the scientists have to vacate by the end of the month, the US government still continues to hold the lease for the building from Columbia University. So this will likely not save any money for taxpayers. [https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html](https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html)",
                "The reason is in the article.\n\n“Puts at risk the database of historical temperature readings going back to 1880”\n\nThe administration is angling climate research in a way that can be summarized with “There is no climate change if there is no data to say so.”\n\nHence the mass cuts to remote environmental sensing projects and related. He’ll they’ve even gone after DoD programs that do that for only the military",
                "Of course they are. They'll probably sell it to the trump org for $1.",
                "Someone needs to kepe track all the buildings sold to trump cronies for pennies so we can jail thrm",
                "This administration just wants to wreck everything. I find it hard to believe this is actually about saving money, but instead it’s about destroying history.",
                "I hope y’all know that these services are never coming back.",
                "Yep to sell off all our federal buildings to pay for their bullshit tax cut.",
                "It would be helpful if the journalist who wrote this article asked their White House sources where these scientists plan to work after they are vacated from the building. That’s the big issue- they now have nowhere office to work out of, which is insane.",
                "laying pathways towards idiocracy.",
                "Great work guys! Now take some brides from Qatar."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 14539,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sites cost what is now up to over 20 lives.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience",
                "Didn't DOGE cut the weather forecast services and one of the warnings of doing it would lead to people dying from the lack of hazardous weather warnings?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 1561,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5fd/live/4a9f25b0-3366-11f0-b738-f51320fcf8ba.jpg",
            "top_comments": [
                "Ack. I imagine avalanche would be a horrible way to die.",
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher.",
                "This is sad. It is also sad that civilians are currently being buried under rubble on an almost daily basis in Gaza.",
                "Mountain is unnecessary in the headline. “Swiss avalanche” tells us it’s on a mountain."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Central U.S. and New England Face Elevated Risk of Summer Power Shortages",
            "external_url": "https://reliancetech.net/central-u-s-and-new-england-face-elevated-risk-of-summer-power-shortages/",
            "upvotes": 129,
            "date": "05/18/2025",
            "thumbnail": "https://reliancetech.net/wp-content/uploads/2025/05/2-1000x600.png",
            "top_comments": [
                "Prob wasn’t such a smart move to attack Canada, the only country on the continent that can help with the surging energy demand. The winning just keeps on winning.",
                "And add in the Chinese kill switches in solar farms, it’s gonna be one hell of a summer"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 41913,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                "> “Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS,” Trump wrote. “This is a bad and dangerous day for America!”\n\nTrump continues to rage against the existence of the Constitution itself.\n\nThe Constitution does not bind the conduct of individuals. It's a non-exhaustive enumeration of individual rights, which proscribe *the government* from certain actions. Even if you, Dear Leader, really, really want to.\n\nObviously. Dumbass.",
                "Jesus….Alito and Thomas are human garbage",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "*“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a* [*post*](https://truthsocial.com/@realDonaldTrump/114519567610751944) *on Truth Social.*\n\nTrump trying to Intimidate the court.\n\n*Trump on Friday morning* [*vented frustration*](https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html) *toward the high court,* [*writing*](https://truthsocial.com/@realDonaldTrump/114517773720445162) *that it “IS BEING PLAYED BY THE RADICAL LEFT LOSERS” whose “ONLY HOPE IS THE INTIMIDATION OF THE COURT.”*\n\nTrump claiming the other side is trying to intimidate the court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 17196,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "Donald Trump is doing to America what he did to his casinos.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either.",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 1208,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up.",
                "***RFK has entered the chat***",
                "Where’s ace ventura when you need him?",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…",
                "I would check RFKs house 😉"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Central U.S. and New England Face Elevated Risk of Summer Power Shortages",
            "external_url": "https://reliancetech.net/central-u-s-and-new-england-face-elevated-risk-of-summer-power-shortages/",
            "upvotes": 130,
            "date": "05/18/2025",
            "thumbnail": "https://reliancetech.net/wp-content/uploads/2025/05/2-1000x600.png",
            "top_comments": [
                "Prob wasn’t such a smart move to attack Canada, the only country on the continent that can help with the surging energy demand. The winning just keeps on winning.",
                "And add in the Chinese kill switches in solar farms, it’s gonna be one hell of a summer"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 4327,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25138069404635.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/8Blca](https://archive.is/8Blca)\n- *Edit: Link and content below updated.*\n\n# Around 20 injured after Mexican Navy training ship strikes Brooklyn Bridge, officials say\n\n>Around 20 people were injured when a Mexican Navy training ship carrying 277 passengers struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\n>The ship lost power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel towards the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\n>Video shows the Cuauhtémoc’s mast hitting the underside of the bridge and breaking as the vessel passes through, with pieces falling down towards the deck. No visible damage could be seen on the bridge itself, which was open to traffic Saturday night after shuttering briefly.\n\n>There were sailors on the bridge’s mast who were injured, Aramboles said.\n\n>New York City Mayor Eric Adams said 19 people were injured, including four with serious injuries. The Mexican Navy noted 22 were hurt in a post in Spanish on X, with 19 receiving medical attention at local hospitals.\n\n>“The status of the personnel and material is under review by naval and local authorities, who are providing support,” the Mexican Navy said.\n\n>The ship was on a training cruise, which takes place every year, Mexican Navy spokesman Capt. Juan Caballero told CNN.\n\n>All lanes of the Brooklyn Bridge were briefly closed in both directions after the incident but had reopened as of 10:30 p.m., according to New York emergency officials.\n\n>“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge at this time,” according to Fabien Levy, a spokesperson for Adams.\n\n>NYPD told residents to avoid the area of Brooklyn Bridge, South Street Seaport in Manhattan, and Dumbo in Brooklyn.  “Expect heavy traffic and a large presence of emergency vehicles in the surrounding area,” police said on X.\n\n>This is a developing story and will be updated.\n>CNN’s Mark Morales contributed to this report.",
                "Wonder how long he'll have caps lock on this time",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "There were people on the masts...",
                "Omg 🤦‍♀️ we all know where this is going…",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "prez is going to call it an international conflict /smh",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 7098,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "Elections have consequences.",
                "28 Americans are dead because an elderly diaper-wearing reality TV show host and a racist nepo baby from Apartheid South Africa gutted government services including NOAA and the National Weather Service. Get ready for an extremely entertaining and deadly hurricane season."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration closing iconic NASA research center in New York",
            "external_url": "https://www.axios.com/2025/05/17/trump-nasa-goddard-office",
            "upvotes": 4007,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "While the scientists have to vacate by the end of the month, the US government still continues to hold the lease for the building from Columbia University. So this will likely not save any money for taxpayers. [https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html](https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html)",
                "The reason is in the article.\n\n“Puts at risk the database of historical temperature readings going back to 1880”\n\nThe administration is angling climate research in a way that can be summarized with “There is no climate change if there is no data to say so.”\n\nHence the mass cuts to remote environmental sensing projects and related. He’ll they’ve even gone after DoD programs that do that for only the military",
                "Of course they are. They'll probably sell it to the trump org for $1.",
                "Someone needs to kepe track all the buildings sold to trump cronies for pennies so we can jail thrm",
                "This administration just wants to wreck everything. I find it hard to believe this is actually about saving money, but instead it’s about destroying history.",
                "I hope y’all know that these services are never coming back.",
                "Yep to sell off all our federal buildings to pay for their bullshit tax cut.",
                "It would be helpful if the journalist who wrote this article asked their White House sources where these scientists plan to work after they are vacated from the building. That’s the big issue- they now have nowhere office to work out of, which is insane.",
                "laying pathways towards idiocracy.",
                "Great work guys! Now take some brides from Qatar."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 36147,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Oh, we're doing this again...fuck these psychopaths.",
                "Caused by someone who is \"pro life\"",
                "Christian Domestic Terrorism.",
                "What the fuck? It looks like this place does IVF treatments. I don't even think it does abortions, which is what you'd think some lunatic would plant a bomb over. It legit just looks like they provide services to make MORE babies. [https://arcbabies.com/our-services/](https://arcbabies.com/our-services/)\n\nAre they mad about embryos being discarded potentially or something?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 1555,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5fd/live/4a9f25b0-3366-11f0-b738-f51320fcf8ba.jpg",
            "top_comments": [
                "Ack. I imagine avalanche would be a horrible way to die.",
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher.",
                "This is sad. It is also sad that civilians are currently being buried under rubble on an almost daily basis in Gaza.",
                "Mountain is unnecessary in the headline. “Swiss avalanche” tells us it’s on a mountain."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 14533,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sites cost what is now up to over 20 lives.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience",
                "Didn't DOGE cut the weather forecast services and one of the warnings of doing it would lead to people dying from the lack of hazardous weather warnings?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 1206,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up.",
                "***RFK has entered the chat***",
                "Where’s ace ventura when you need him?",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…",
                "I would check RFKs house 😉"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Gunman pleads guilty to murder of bank teller Monica Leech during 1997 robbery in Thousand Oaks",
            "external_url": "https://abc7.com/post/kevin-ray-james-pleads-guilty-murder-bank-teller-monica-leech-during-1997-robbery-thousand-oaks/16441601/",
            "upvotes": 445,
            "date": "05/17/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16441475_051625-kabc-4pm-monica-leech-vid.jpg?w=1600",
            "top_comments": [
                "Monica was a relative of mine. The effect this murder had on the family can't be understated. It doesnt bring her back, but Im glad there's justice",
                "I remember this but never realized no one was charged.  Crazy",
                "I was wondering why it took so long. Turns out the evidence was very recently obtained.\n\n>The case remained cold for more than 20 years until new forensic evidence and investigative leads identified James as one of the suspects. On March 13, 2023, he was charged with Leech's murder.",
                "While it’s awful that this monster got to walk free for so long, I’m glad justice caught up to him.",
                "I wonder if the plea deal included James providing information on his accomplice.",
                "On April 28, 1997, two armed men disguised as construction workers with raincoats, hardhats, and pantyhose as masks entered Western Financial Bank on Thousand Oaks Boulevard. They forced employees, including Leech, into the vault room and demanded they open the safe, according to investigators.\n\nDuring the robbery, Leech and another bank employee were handcuffed by the suspects, forced to their knees, and Leech was fatally shot, prosecutors said. Leech, a resident of Camarillo, died at the scene.\n\nThey got away with $11k"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mother gets six years for Elkton townhouse fire that killed daughter, 10",
            "external_url": "https://www.cecildaily.com/news/mother-gets-six-years-for-elkton-townhouse-fire-that-killed-daughter-10/article_647550f6-966a-4fec-9f56-fab39f2a6afe.html",
            "upvotes": 828,
            "date": "05/17/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/cecildaily.com/content/tncms/assets/v3/editorial/d/db/ddbf8970-e4b3-42ad-a37e-95f201dcd39f/6824a54dc02fb.image.jpg?crop=770%2C404%2C0%2C279",
            "top_comments": [
                "Once again, though nobody’s also talking about the fact that this child and her two siblings should’ve been taken by social services, the school repeatedly reported that she was dirty and smelled like animal feces, and was being extremely neglected. One visit to the house would’ve shown that it’s not livable conditions for children. Social service has failed these kids as well.",
                "She created a hoarding situation, including pet hoarding, and overloaded electrical outlets. She created a dangerous situation and placed her daughter into it and now her girl is dead. It’s beyond negligence. I know it’s an accident and my heart goes out to the mom, but she is not blameless. It’s akin to driving drunk and getting your kid killed; you didn’t mean to do it, but you recklessly disregarded safety and now somebody is dead. Just tragic.",
                "It’s so sad to read that she had no friends at school, also due to the hoarding situation and hygiene. Her mother neglected her so badly, she kept this kid from having a happy, normal life.  And then she dies horribly too? I am heartbroken for this little girl. \nThe mother absolutely  deserves to be in prison. Don’t even get me started on the animal neglect.\n💜 Kyleigh 💐 🕊️",
                "Call me a POS for taking away from the girl's death or whatever but I find it disturbing that none of these articles comment on the outcome of all of the pets in the home.\n\nThey had **35** cats and dogs.  5 days prior to the fire, animal control took 18 of them.  How many of them were in crates or locked away while the adults of the house made their way to safety?",
                "I live a few miles from where this happened. The neighbors townhouse was also heavily damaged from the fire. There was a go fund me for her.",
                "There is absolutely no mention of a father being held responsible for this as well. Was this child immaculately conceived?",
                "*\"This is the exact definition of a difficult case. You have the tragic loss of a young person and there is zero intention for this to happen. It’s the nature of the charge.” (Judge Davis to the mother)*\n\nA terrible situation--35 pets in the house plus hoarding. But 6 years for involuntary manslaughter from a Judge that understands the mother's plight seems high.",
                "Ahh Elkton. I have fond childhood memories of the Blue Beacon Truck Wash."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 7087,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "Elections have consequences.",
                "28 Americans are dead because an elderly diaper-wearing reality TV show host and a racist nepo baby from Apartheid South Africa gutted government services including NOAA and the National Weather Service. Get ready for an extremely entertaining and deadly hurricane season."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 4327,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25138069404635.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/8Blca](https://archive.is/8Blca)\n- *Edit: Link and content below updated.*\n\n# Around 20 injured after Mexican Navy training ship strikes Brooklyn Bridge, officials say\n\n>Around 20 people were injured when a Mexican Navy training ship carrying 277 passengers struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\n>The ship lost power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel towards the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\n>Video shows the Cuauhtémoc’s mast hitting the underside of the bridge and breaking as the vessel passes through, with pieces falling down towards the deck. No visible damage could be seen on the bridge itself, which was open to traffic Saturday night after shuttering briefly.\n\n>There were sailors on the bridge’s mast who were injured, Aramboles said.\n\n>New York City Mayor Eric Adams said 19 people were injured, including four with serious injuries. The Mexican Navy noted 22 were hurt in a post in Spanish on X, with 19 receiving medical attention at local hospitals.\n\n>“The status of the personnel and material is under review by naval and local authorities, who are providing support,” the Mexican Navy said.\n\n>The ship was on a training cruise, which takes place every year, Mexican Navy spokesman Capt. Juan Caballero told CNN.\n\n>All lanes of the Brooklyn Bridge were briefly closed in both directions after the incident but had reopened as of 10:30 p.m., according to New York emergency officials.\n\n>“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge at this time,” according to Fabien Levy, a spokesperson for Adams.\n\n>NYPD told residents to avoid the area of Brooklyn Bridge, South Street Seaport in Manhattan, and Dumbo in Brooklyn.  “Expect heavy traffic and a large presence of emergency vehicles in the surrounding area,” police said on X.\n\n>This is a developing story and will be updated.\n>CNN’s Mark Morales contributed to this report.",
                "Wonder how long he'll have caps lock on this time",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "There were people on the masts...",
                "Omg 🤦‍♀️ we all know where this is going…",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "prez is going to call it an international conflict /smh",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration closing iconic NASA research center in New York",
            "external_url": "https://www.axios.com/2025/05/17/trump-nasa-goddard-office",
            "upvotes": 4012,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "While the scientists have to vacate by the end of the month, the US government still continues to hold the lease for the building from Columbia University. So this will likely not save any money for taxpayers. [https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html](https://www.nytimes.com/2025/05/16/nyregion/nasa-office-columbia-seinfeld-toms-restaurant.html)",
                "The reason is in the article.\n\n“Puts at risk the database of historical temperature readings going back to 1880”\n\nThe administration is angling climate research in a way that can be summarized with “There is no climate change if there is no data to say so.”\n\nHence the mass cuts to remote environmental sensing projects and related. He’ll they’ve even gone after DoD programs that do that for only the military",
                "Of course they are. They'll probably sell it to the trump org for $1.",
                "Someone needs to kepe track all the buildings sold to trump cronies for pennies so we can jail thrm",
                "This administration just wants to wreck everything. I find it hard to believe this is actually about saving money, but instead it’s about destroying history.",
                "I hope y’all know that these services are never coming back.",
                "Yep to sell off all our federal buildings to pay for their bullshit tax cut.",
                "It would be helpful if the journalist who wrote this article asked their White House sources where these scientists plan to work after they are vacated from the building. That’s the big issue- they now have nowhere office to work out of, which is insane.",
                "laying pathways towards idiocracy.",
                "Great work guys! Now take some brides from Qatar."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 36147,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Hopfully it was the idiot who planted it.",
                "Actual domestic terrorism.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Oh, we're doing this again...fuck these psychopaths.",
                "Caused by someone who is \"pro life\"",
                "Christian Domestic Terrorism.",
                "What the fuck? It looks like this place does IVF treatments. I don't even think it does abortions, which is what you'd think some lunatic would plant a bomb over. It legit just looks like they provide services to make MORE babies. [https://arcbabies.com/our-services/](https://arcbabies.com/our-services/)\n\nAre they mad about embryos being discarded potentially or something?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 16 dead after tornado-spawning storms move across central US",
            "external_url": "https://edition.cnn.com/2025/05/17/weather/tornadoes-severe-weather-deaths-climate-hnk",
            "upvotes": 14541,
            "date": "05/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21631520-3338-795-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Hank Green did a video yesterday that was passive aggressively about this. He said we don’t know when we don’t die, and how so much advancement and regulations have saved millions of lives without ever making a headline.",
                "The NWS station in Jackson that is responsible for some of these areas is so understaffed that they close at night. The tornado that hit London, KY was very obviously dangerous and known to be on the ground for almost an hour before it hit the town. But proper alerts were not sent out to all the people that were sleeping because there was no one to send them. This is what everyone against the cuts was warning about.\n\nI want to edit to add that the Jackson, KY NWS personnel did the best they could. There were some staff present, but according to them, it was 4-5 people short of being ideal, again because of the funding cuts. I imagine burnout on nights like this is unavoidable. It was a chaotic night weather wise, and the few thousand dollars saved by short staffing these sites cost what is now up to over 20 lives.",
                "The NOAA radio nearest to me got taken down and I sat through one of these tornadoes with NO WEATHER UPDATES  because of it. Thanks defunding. It definitely wouldn't have been helpful to know where the tornado was and which direction it was moving and how fast. Clearly government waste.",
                "If only there was a type of agency that tracks national oceanic and atmospheric anomalies to help that is government funded and warns people of these things... oh wait.",
                "Sirens didn't go off here until it was too late. People are dead directly because of the funding cuts to NWS and NOAA. It's only going to get worse.",
                "Good thing we got rid of that pesky **FEMA**.\n\n\n*.end simulation*      \n**.now**",
                "Is now the time for an \"I did that\" sticker?",
                "It's sad, but at least we have a robust system for helping in these situations. Oh, wait, rich assholes needed another tax cut. Oh well, we tried. Pray harder, I guess, because I don't pray, and this comment is the extent of my thoughts on the subject. ",
                "Always thought captain planet was the wildest show and totally unrealistic because I never understood the villain's motivations. I still don't understand, but seeing these villains become real has been a sobering experience",
                "Didn't DOGE cut the weather forecast services and one of the warnings of doing it would lead to people dying from the lack of hazardous weather warnings?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Swiss mountain avalanche buries several people, police say",
            "external_url": "https://www.bbc.com/news/articles/c8d14yyverro",
            "upvotes": 1562,
            "date": "05/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e5fd/live/4a9f25b0-3366-11f0-b738-f51320fcf8ba.jpg",
            "top_comments": [
                "Ack. I imagine avalanche would be a horrible way to die.",
                "From the article \n\n\n\"A rescue mission is under way to reach several people buried in an avalanche on the Eiger mountain in the Swiss Alps, local police say.\n\nThe avalanche took place shortly after midday on Saturday, Bern Cantonal police said in a statement on social media.\n\nThey said they had launched a large-scale operation involving several rescue teams who were looking for people.\n\nThe Eiger is a 3,967m (13,000 ft) peak near the tourist resorts of Grindelwald, Lauterbrunnen, and Wengen.\"",
                "Going to snowy area in mountains is going to be riskier and riskier as the global temps gets higher.",
                "This is sad. It is also sad that civilians are currently being buried under rubble on an almost daily basis in Gaza.",
                "Mountain is unnecessary in the headline. “Swiss avalanche” tells us it’s on a mountain."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Central U.S. and New England Face Elevated Risk of Summer Power Shortages",
            "external_url": "https://reliancetech.net/central-u-s-and-new-england-face-elevated-risk-of-summer-power-shortages/",
            "upvotes": 131,
            "date": "05/18/2025",
            "thumbnail": "https://reliancetech.net/wp-content/uploads/2025/05/2-1000x600.png",
            "top_comments": [
                "Prob wasn’t such a smart move to attack Canada, the only country on the continent that can help with the surging energy demand. The winning just keeps on winning.",
                "And add in the Chinese kill switches in solar farms, it’s gonna be one hell of a summer"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court rules against Trump administration in Alien Enemies Act case",
            "external_url": "https://www.cnbc.com/2025/05/16/supreme-court-alien-enemies-venezuela-deportation.html",
            "upvotes": 41912,
            "date": "05/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108134056-17452493572025-04-21t151622z_186722713_rc2e2ead2j68_rtrmadp_0_usa-court.jpeg?v=1745249556&w=1920&h=1080",
            "top_comments": [
                "7-2 decision. saying the administration was not giving them full due process and rights.",
                "Guess who the two dissenters were.\n\n\nJk you don't need to guess.",
                "> President Donald Trump raged against the ruling later Friday afternoon.\n“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a Truth Social\n post.\n\nThis man is going to get people who question him killed, all while he continues to erode the checks and balances vital to our government.",
                "Say what you will about Thomas and Alito, but once they are bought, they stay that way. \n\n7-2 ruling confirming fascism is bad.",
                "So what happens when Trump does it anyway.  The only remedy allowed in the Constitution is impeachment and conviction but we know that is toothless now.",
                "> “Sleepy Joe Biden allowed MILLIONS of Criminal Aliens to come into our Country without any ‘PROCESS’ but, in order to get them out of our Country, we have to go through a long and extended PROCESS,” Trump wrote. “This is a bad and dangerous day for America!”\n\nTrump continues to rage against the existence of the Constitution itself.\n\nThe Constitution does not bind the conduct of individuals. It's a non-exhaustive enumeration of individual rights, which proscribe *the government* from certain actions. Even if you, Dear Leader, really, really want to.\n\nObviously. Dumbass.",
                "Jesus….Alito and Thomas are human garbage",
                ">In a 7-2 decision, the court said the Trump administration had not given the detainees enough time or adequate resources to challenge their deportations.\n\n>“Under these circumstances, notice roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal, surely does not pass muster,” the ruling said.\n\n>The justices barred the removal of the men, who the Trump administration alleges are members of the Venezuelan gang Tren de Aragua, pending a new decision from a lower federal appellate court.\n\nIt should come as no surprise that when AOC worked to give her constituents the resources needed to deny and then contest these charges she was criticized by the Trump administration's border czar Tom Homan for \"educating illegal alien criminals how to evade law enforcement\".\n\nWhy? The fact detainees only receive notice \"roughly 24 hours before removal, devoid of information about how to exercise due process rights to contest that removal\" is an intended cruelty by this administration. They don't care if you're innocent or not, they will use every trick at their disposal to secure an express deportation so that once you're gone they can claim whatever they want about you. Even in the high profile case of Kilmar Abrego Garcia when everything points to the deportee's innocence, the Trump administration is confronted and even ordered to return him to the US yet all they have to say is he'll “never live in the United States of America again” and nothing is done.\n\nAs a citizen of the United States you might think you have nothing to worry about, but do you feel confident you could contest your deportation within 24 hours if they wrongfully claimed you were an illegal immigrant? Are you already familiar with the process or would you rely on Google and hope it all works out? Furthermore anyone familiar with federal offices know even the simplest of claims can be an excruciatingly slow process which begs the question, would your paperwork even reach anyone in time to contest your deportation?",
                "Me: Sees 7-2 ruling, wonders who dissented. <skims article> Alito and Thomas... Of course.",
                "*“THE SUPREME COURT WON’T ALLOW US TO GET CRIMINALS OUT OF OUR COUNTRY!” he wrote in a* [*post*](https://truthsocial.com/@realDonaldTrump/114519567610751944) *on Truth Social.*\n\nTrump trying to Intimidate the court.\n\n*Trump on Friday morning* [*vented frustration*](https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html) *toward the high court,* [*writing*](https://truthsocial.com/@realDonaldTrump/114517773720445162) *that it “IS BEING PLAYED BY THE RADICAL LEFT LOSERS” whose “ONLY HOPE IS THE INTIMIDATION OF THE COURT.”*\n\nTrump claiming the other side is trying to intimidate the court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Moody's downgrades US to 'Aa1' rating",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-us-aa1-rating-2025-05-16/",
            "upvotes": 17196,
            "date": "05/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This will cost the US orders of magnitude more money than anything DOGE is even trying to pretend they're saving in efficiency.",
                "Reminder:  The current administration is preparing to push for trillions of dollars in tax cuts for the wealthy.",
                "> \"Successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs,\" Moody's said in a statement.\n\nLet's pass another tax cut for the highest tax brackets shall we? Plus massively cut IRS funding to go after tax evasion. That will definitely help the issue. /S",
                "Next week, Moody's US offices raided by FBI, ICE, and IRS",
                "Donald Trump is doing to America what he did to his casinos.",
                "this is a huge deal. investment funds have minimum ratings they have to keep to to maintain their risk profile. pensions for example often have to keep to AAA rated bonds for say 85% of their investments. this will trigger a huge sell off and will result in less future investment, hence higher yields and higher borrowing costs. \n\n  \nthis is massive.",
                "We’ve been saying it for 10 years:\n\nSO MUCH WINNING!\n\nWe chant it all the way right into the pit.",
                "what?  planning to spend more and cut taxes on the rich again doesn't sound responsible?  doge (dipshits organizing governmental explosions) chaos doesn't probably help either.",
                "Well that $5,000,000,000,000 increase to the debt ceiling does kind of make the US seem like an infinite money printer, and I'm pretty sure our Debt/GDP ratio is well over 100 at this point (wiki says 121% officially).\n\nI mean, Greece's wasn't that much higher when it's debt crisis started...",
                "3 times in history our rating dropped, all in the past 30 years, and every single solitary time, the right was in control of the purse and the downgrade was specifically due to republicans actions. \n\nevery last  time.\n\nyou know the party that took clinons 300 billion a year surplus and turned it into 1.2 trillion a year deficit. and since we never really got rid of the bush deficit completely, our debt and debt servicing is insane. Our debt servicing costs more than the military.. FFS\n\nand the right are trying to add 2.5 trillion to our deficit"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S. (Gift Article)",
            "external_url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html?unlocked_article_code=1.H08.bFMm.X2xSukXMfb7A&smid=url-share",
            "upvotes": 1207,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has Bobby Kennedy (no relation) been near there lately?",
                "I just find it unnerving and disturbing that someone came upon this stranded dolphin and proceeded to do this",
                "RFK Jr. He 100% did it. He was there. Means, motive, and ability.",
                "Someone did this to clean up the skull and keep it. However if they know anything about anything they would know having that in their house is a felony, and actually removing it from the dolphin is way worse. And now they're also dealing with the CDC because this thing had an infectious bacteria. Boy this person really messed up.",
                "***RFK has entered the chat***",
                "Where’s ace ventura when you need him?",
                "Rfk Jr needs to give his whereabouts for the day this went down",
                "The most likely answer is that some drunken yahoos thought it would look great mounted next to their deer heads.",
                "They removed the head after it had been stranded. That doesn’t necessarily mean they killed it, right? I mean, pretty messed up regardless, but it takes a seriously fucked up individual to kill it and remove its head if that’s the case. Anyone who would get pleasure out of killing a dolphin is a deranged individual…",
                "I would check RFKs house 😉"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/18/2025 08:11:19 UTC"
}