{
    "posts": [
        {
            "category": "HOT",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 11788,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Another reminder that for ICE, an asylum hearing is a perfectly safe place to get their numbers up. No dangerous drug dealers with guns, no rapists, no murderers or thugs, just honest people trying to obey the law. Easy pickings.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "But but but....conservatives keep saying that *everyone* detained by ICE is automatically a criminal or gang member! /s\n\n🙄",
                "How many of these are we not hearing about? Because it seems like we're seeing multiple a day."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 28093,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Its not corruption if its out in the open, right?",
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "Can we collectively pay Trump to go fuck himself?",
                "Well, now you know how much a pardon costs.",
                "Before dessert, they all lined up and sat on his lap and told him what they wanted for Christmas",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years.",
                "Launch DOGE to find government fraud,  pardons a guy that committed actual tax fraud.  Makes sense",
                "Oh and of course he's a nursing home executive. Might as well own a payday loan business.\n\nEdit: *and he shorted the healthcare workers' paychecks to buy himself a fucking yacht.*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Aldi and Lidl fight price war in Germany",
            "external_url": "https://www.retaildetail.eu/news/food/aldi-and-lidl-fight-price-war-in-germany/",
            "upvotes": 751,
            "date": "05/28/2025",
            "thumbnail": "https://www.retaildetail.eu/wp-content/uploads/sites/2/2025/05/shutterstock_1092014636-aldi-lidl.jpg",
            "top_comments": [
                "Good for us consumers 👍🏼",
                "Meanwhile in Australia Coles and Woolies collude for higher prices and lower wages.\n\nDisappointed Lidl didn't break in to the Aussie market",
                "I don't even have either of those two nearby. I only have Edeka and Rewe, and both of them are stupidly expensive.",
                "Luckily here theyre fighting about who can increase prices the most ...",
                "So this is basically an ad.",
                "Why can’t we have this in America. They’re fighting over who gets to charge more and people are lining up to decide who gets to pay more. I hate it here.",
                "Luckily where I'm from we have an oligopoly so we never have to decide where to buy from, they all fist us equally hard! ",
                "In the UK Sainsburys and Tesco fight price war to see who can charge the most.",
                "Like stores should be doing, instead of collectively raising prices...",
                "Boxing match should be the way to go"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 23277,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "[removed]",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "Let's see the double blind data from the peer reviewed study.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "Wasn’t it a week ago he said we shouldn’t take medical advice from him?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Alcohol-related brain damage could affect thousands, warns expert",
            "external_url": "https://www.bbc.com/news/articles/c3e551eqpgdo",
            "upvotes": 4888,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ff06/live/2e61e3f0-3592-11f0-8f95-179a79186756.jpg",
            "top_comments": [
                "Thousands? Only thousands?",
                "I'd be very concerned if alcohol hadn't destroyed my ability to ready this ",
                "The article is referring to people who have had roughly 2-3 drinks a day on average for years if anyone is concerned by the title.",
                "Mike, from Breaking Bad, is looking pretty good.",
                "My father has this. Within a year he suddenly started losing his coordination and ability to walk. He is now wheelchair bound and can’t even go to the bathroom by himself. Hasn’t stopped drinking.",
                "Recently watched my father in law suffer from alcohol related brain problems. It was really hard. Wet brain is nothing to shake a stick at.",
                "“Well you see, Norm, it’s like this … A herd of buffalo can only move as fast as the slowest buffalo. And when the herd is hunted, it is the slowest and weakest ones at the back that are killed first. This natural selection is good for the herd as a whole, because the general speed and health of the whole group keeps improving by the regular killing of the weakest members. In much the same way, the human brain can only operate as fast as the slowest brain cells. Now, as we know, excessive intake of alcohol kills brain cells. But naturally, it attacks the slowest and weakest brain cells first. In this way, regular consumption of beer eliminates the weaker brain cells, making the brain a faster and more efficient machine. And that, Norm, is why you always feel smarter after a few beers.”",
                "Alcohol can make it difficult to uptake vitamins essential to the nervous system and brain.",
                "My dad has been drinking for like 50 years now, he is far from the man I knew when I was growing up…",
                "Please, get yourself help before it comes to this. I'm unfortunately one of those thousands. Developed WKS and Neuropathy at 31. Diseases typically found in older alcoholics. The brain fog has improved greatly over the last 2 years since I've been sober, but I'll never get back to the way I was before."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "SpaceX's Starship spins out of control after flying past points of previous failures",
            "external_url": "https://www.reuters.com/business/aerospace-defense/elon-musk-plans-mars-talk-ahead-first-starship-launch-since-test-failures-2025-05-27/",
            "upvotes": 991,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mars next year everybody!",
                "It failed better this time! Break out the champagne!",
                "Then Tesla stock price is gonna +10% tomorrow morning",
                "They added Tesla autopilot, didn't they?",
                "I thought Nazis were supposed to be good at making rockets?",
                "So are we not still on track to reach mars by 2020…?",
                "Musk said in 2016 he planned to have human landings on mars by 2024, flying in a modified dragon capsule.\n\nStill waiting on that one.\n\nRemember the robotaxi? There were supposed to be millions of those on the road.. in 2020. Have you seen ONE?\n\nAnd then neuralink got reallllll quiet after the single human trial we know about. Haven't heard from them in what, years?\n\nWhen will the government stop giving billions to this fraud? Mars is perpetually 6-8 years away. Wake the fuck up, he's scamming you. Starship can't even do suborbital flight nevermind interplanetary. They clap if they get to fucking SECO without exploding.",
                "[deleted]",
                "Musk planned a speech but was a no-show. What a maroon.",
                ">Federal regulators had granted SpaceX a license for Starship's latest flight attempt four days ago, capping a mishap investigation that had grounded Starship for nearly two months.\n\n>The last two test flights - in January and March - were cut short moments after liftoff as the vehicles blew to pieces on ascent, raining debris over parts of the Caribbean and disrupting scores of commercial airline flights in the region.\n\n>The previous back-to-back failures occurred in early test-flight phases that SpaceX had easily achieved before, in a striking setback to a program that Musk, the billionaire entrepreneur who founded the rocket company in 2002, had sought to accelerate this year.\n\nPutting aside the obvious comparison to Elon's future spinning out of control, why is he still in charge of any of this? He's bungled this project. He's helping to tank Tesla, and now he says he's stepping down from DOGE. Didn't this lying Nazi boy Musky [say this before?](https://www.theverge.com/news/653928/elon-musk-doge-step-back-tesla-earnings)  \n\nWhy is he still around as his company and projects, [and even legal issues](https://www.reuters.com/world/us/us-judge-allows-states-lawsuit-against-doge-proceed-2025-05-27/) crash down around him? Nobody is gonna want to deal with Trumpers , the Musk name is pure poison."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 5015,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Delete Facebook. Delete Instagram. Delete Twitter. Sell $META.",
                "Show us your memes before you show up to class. This country is becoming a parody of itself.",
                "Aka Taking away freedom of speech if it disagrees with them. This is against the constitution",
                "Remember folks, the slippery slope starts with student visas. \n\nWon't be long until YOUR social media is being \"vetted\"",
                "When the conservative loonies start cracking down on our civil rights, saying they are protecting us from international socialism, or the Chinese communist party, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start banning books and restricting the rights of queer people, saying they are protecting kids from pedophiles, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start cracking down on our students and protests, saying they are protecting us from antisemitism, the opposition… immediately takes this at face value and complains about how it’s really the Zionists who control the media and the world .\n\nisn’t that interesting",
                "Blatently fascist and against the first amendment. Fucking remove this clown already.",
                "Social media review?   This is what fascism looks like.  This is trying to eliminate free thought or differing opinions"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 20293,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "Hard to be a shittier American than a Trump supporter these days",
                "All the $ and time wasted on lawsuits.",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "This is what they should be mentioning during pledge drives, I’d happily donate to sue the trump admin."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 15572,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "This is the most corrupt presidency in modern history.  Trump is a criminal, scumbag and everyone that supports him.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "so much for fighting against fraud, waste and abuse!!!!",
                "White collar fraudster pardons blue collar fraudster.",
                "Fat fuck frees fat fuck.",
                "States should prosecute irrespective of what the feds do so that this kind of thing doesn't happen anymore - at least so long as the dual sovereignty doctrine is still a thing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The Supreme Court rejects a plea to block a copper mine on land in Arizona that's sacred to Apaches",
            "external_url": "https://apnews.com/article/supreme-court-arizona-oak-flat-copper-mining-apache-64bb0d7c2bbf544f707ce3a421b67209",
            "upvotes": 3201,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I couldn't find It in the article, but which Justice is choosing to not hear the case? With Both Gorsuch, and Thomas saying this is a terrible outcome, was Kagan who oversees the 9th circuit, or was it Robert's that refused?",
                "There's a certain irony to being blatantly disrespectful to a truly indigenous group while simultaneously touting deportation for those who came only relatively slightly after we did.",
                "Arizona had way to many giant holes in the ground from abandoned copper mines already",
                "They just want the world to look like Blade Runner 2049.",
                "So weird that Gorsuch is such a die hard protector of Native rights (I’m here for it) while simultaneously being a POS on 99% of issues negativity affecting us Americans. A broken clock and all that I suppose.",
                "The last few years have really illuminated to those that didn’t experience the past as to why there was always a distrust in the American “way” from others. \n\nI’m not an old fart but getting close enough to that tenure to see that my studies in history, policy and politics were quality, spot on, and, well, bleak. I just really hope the young ones are tough enough to force the bright future for themselves and can guide this country to the become the place of promise that they were promised their whole lives. \n\nBe safe, youngins. As someone who lived through a bit of the good days, it’s worth fighting for. Now we know more and maybe rebuild a better way.",
                "From a link embedded in the article:\n\n>The family is Chiricahua Apache and Oak Flat, or Chi’chil Bildagoteel, is a consecrated place used for prayer and ritual by them and many other Native Americans in the region. Elders say the land was blessed by Usen, their Creator, and inhabited by Ga’an, the mountain spirits or angels who provide spiritual succor and guidance to seekers.\n\n>It is also here that Resolution Copper Mining, a joint subsidiary of British and Australian mining giants, Rio Tinto and BHP, wants to remove layers of rock to extract copper from deep underground. The in-demand metal is used for electric vehicle and cell phone manufacturing. In the works for nearly a decade, the project has stalled amid a legal fight between U.S. agencies and those trying to protect Oak Flat on religious grounds.\n\n>Resolution Copper President Vicky Peacey said the mine will be a “massive investment in rural Arizona” — creating 3,700 jobs over the course of the project and boosting state and local tax revenues by $88 million to $113 million a year. The company continues to “seek dialogue, to come to a collaboration and partnership,” said Tyson Nansel, a company spokesperson. “We need the copper. The town and the tribe need jobs,” Nansel said.\n\n\nIn other words, “Fuck your religion, we want money.”",
                "Would they do this if it was on the Salt Lake Tabernacle land or on any christian church land..",
                "The primary function of government in a Capitalist society is to protect the interests of the bourgeoisie.",
                "This is a beautiful area used by many folks for recreation. A mine there will be awful. It’s a bad plan, and has been a bad plan for ages. I hope it never happens. It’ll be a loss that can’t be undone."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India's alarm over Chinese spying rocks the surveillance industry | Reuters",
            "external_url": "https://www.reuters.com/world/china/indias-alarm-over-chinese-spying-rocks-surveillance-industry-2025-05-28/",
            "upvotes": 11,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What the hell is that headline.",
                "Fr thought Chinese were spying rocks.",
                "Dammit Marie,  they're agents."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Violent break-in at Beanie Babies mogul Ty Warner's California home left woman in coma: DA",
            "external_url": "https://abcnews.go.com/US/beanie-babies-mogul-ty-warner-california-home-invasion/story?id=122249852",
            "upvotes": 117,
            "date": "05/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/04fa225b-8ba6-48c3-976e-32d88887436d/beanie-babies_1748391049310_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "A Nevada man now faces multiple charges, including attempted murder, in connection with the home invasion and assault, according to the Santa Barbara County District Attorney's Office.\n\nThe incident unfolded on May 21 at the Montecito home of Warner, according to court filings obtained by ABC News.",
                "Not lying here my first thoughts were oh great some guy who couldn't give up on beenie babie investment. However after reading the article umm it would have been funnier it was but dang the poor woman. hope she pulls through."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Aldi and Lidl fight price war in Germany",
            "external_url": "https://www.retaildetail.eu/news/food/aldi-and-lidl-fight-price-war-in-germany/",
            "upvotes": 755,
            "date": "05/28/2025",
            "thumbnail": "https://www.retaildetail.eu/wp-content/uploads/sites/2/2025/05/shutterstock_1092014636-aldi-lidl.jpg",
            "top_comments": [
                "Good for us consumers 👍🏼",
                "Meanwhile in Australia Coles and Woolies collude for higher prices and lower wages.\n\nDisappointed Lidl didn't break in to the Aussie market",
                "I don't even have either of those two nearby. I only have Edeka and Rewe, and both of them are stupidly expensive.",
                "Luckily here theyre fighting about who can increase prices the most ...",
                "So this is basically an ad.",
                "Why can’t we have this in America. They’re fighting over who gets to charge more and people are lining up to decide who gets to pay more. I hate it here.",
                "Luckily where I'm from we have an oligopoly so we never have to decide where to buy from, they all fist us equally hard! ",
                "In the UK Sainsburys and Tesco fight price war to see who can charge the most.",
                "Like stores should be doing, instead of collectively raising prices...",
                "Boxing match should be the way to go"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US halts student visa appointments and plans expanded social media vetting",
            "external_url": "https://www.bbc.com/news/articles/cy75eenl46eo",
            "upvotes": 267,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/878f/live/4866bca0-3b8f-11f0-91a0-abc9c23352d4.jpg",
            "top_comments": [
                "Expanded social media vetting is just a euphemism for „we don’t let critical voices in“, isn’t it?",
                "No international student can go to Harvard, if all international students are banned. This could seriously hurt the US in science and technology and bankrupt universities within months. I don't know what the orange man is thinking here.",
                "Give me a fucking break. Trump doesn’t care about antisemitism. He’s using it as a fucking tool to continue to inflict conservative right ideology on a country that should be a land of free speech. He should be a president of all Americans instead of only conservative right republicans. Fuck him! He is destroying the United States.",
                "The thing that gets me is how wild his wires are crossed\n\nLike do you think any students from *China* have any opinion on what's going on in Palestine?  They got their own whole set of adversities to deal with. The idea of \"we have to stop students from China they may be anti-Semitic\" feels like insane old man brain worm ramblings.",
                "Insane what trump is doing here ……all because Barron was not accepted into Harvard……trump is scum",
                "In before \"Liberty University Exemption\"",
                "I bet if you send in your application with a million dollar purchase of DJT, you will get admitted.",
                "The same social media vetting that now in the white house who were paid by Russia?",
                "Does that apply to ALL international students for all American universities ? \n\nIs Trump destroying the whole higher education system out of spite ? (no need to answer that, we all know it's the case)\n\nRemember, everything Trump touches dies.",
                "An official memo said social media vetting would be stepped up for student and foreign exchange visas, which would have \"significant implications\" for embassies and consulates.\n\nIt comes during a wide-ranging Trump crackdown on some of America's most elite universities. He sees these institutions as too left-wing - accusing them of failing to combat antisemitism when pro-Palestinian protests have unfolded on campuses.\n\nResponding to the move, China called on the US to protect international students."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hawaii's Kilauea volcano shoots lava 1,000 feet in the air in latest eruption",
            "external_url": "https://abcnews.go.com/US/latest-kilauea-eruption-shoots-lava-1000-feet-air/story?id=122230394",
            "upvotes": 182,
            "date": "05/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/7a1dc971-63c2-4998-86ac-d0701d563922/kilauea-eruption-ht-jt-250527_1748367334006_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The Hawaiian Volcano Observatory reported that the dramatic eruption produced large lava flows that covered approximately half of the Halema'uma'u crater floor. According to their measurements, the volcanic plume from the eruption reached heights of more than 14,000 feet into the sky.",
                "How often does this happen?",
                "This is episode 23 of this series that started in of 2024. We saw episode 9 in February which was spectacular but a fraction of this episode. Each episode last 24 hours or so ."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "High schoolers returning from prom hailed as heroes for helping save family from fire",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-returning-prom-hailed-heroes-helping-family-fire-rcna209372",
            "upvotes": 92,
            "date": "05/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250528-house-fire-prom-heroes-mn-0800-af3649.jpg",
            "top_comments": [
                "“Your house is on fire! Your house is on fire,” Aiden Kane, 17, is heard in cellphone video yelling to alert the occupants of the house in Marcy — a town of around 8,700 — on May 17.\n\nKane, his girlfriend, Morgan Randall, and their friends Donato Jellenich and Tyler Sojda were driving back from the junior prom at Whitesboro High School when they saw the garage engulfed in flames.",
                "One day I hope to be rescued by people in tuxedos.",
                "After prom I ran over a possum."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "SpaceX's Starship spins out of control after flying past points of previous failures",
            "external_url": "https://www.reuters.com/business/aerospace-defense/elon-musk-plans-mars-talk-ahead-first-starship-launch-since-test-failures-2025-05-27/",
            "upvotes": 984,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mars next year everybody!",
                "It failed better this time! Break out the champagne!",
                "Then Tesla stock price is gonna +10% tomorrow morning",
                "They added Tesla autopilot, didn't they?",
                "I thought Nazis were supposed to be good at making rockets?",
                "So are we not still on track to reach mars by 2020…?",
                "Musk said in 2016 he planned to have human landings on mars by 2024, flying in a modified dragon capsule.\n\nStill waiting on that one.\n\nRemember the robotaxi? There were supposed to be millions of those on the road.. in 2020. Have you seen ONE?\n\nAnd then neuralink got reallllll quiet after the single human trial we know about. Haven't heard from them in what, years?\n\nWhen will the government stop giving billions to this fraud? Mars is perpetually 6-8 years away. Wake the fuck up, he's scamming you. Starship can't even do suborbital flight nevermind interplanetary. They clap if they get to fucking SECO without exploding.",
                "[deleted]",
                "Musk planned a speech but was a no-show. What a maroon.",
                ">Federal regulators had granted SpaceX a license for Starship's latest flight attempt four days ago, capping a mishap investigation that had grounded Starship for nearly two months.\n\n>The last two test flights - in January and March - were cut short moments after liftoff as the vehicles blew to pieces on ascent, raining debris over parts of the Caribbean and disrupting scores of commercial airline flights in the region.\n\n>The previous back-to-back failures occurred in early test-flight phases that SpaceX had easily achieved before, in a striking setback to a program that Musk, the billionaire entrepreneur who founded the rocket company in 2002, had sought to accelerate this year.\n\nPutting aside the obvious comparison to Elon's future spinning out of control, why is he still in charge of any of this? He's bungled this project. He's helping to tank Tesla, and now he says he's stepping down from DOGE. Didn't this lying Nazi boy Musky [say this before?](https://www.theverge.com/news/653928/elon-musk-doge-step-back-tesla-earnings)  \n\nWhy is he still around as his company and projects, [and even legal issues](https://www.reuters.com/world/us/us-judge-allows-states-lawsuit-against-doge-proceed-2025-05-27/) crash down around him? Nobody is gonna want to deal with Trumpers , the Musk name is pure poison."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 5 dead, 6 missing after China chemical plant blast",
            "external_url": "https://www.reuters.com/markets/emerging/large-blast-hits-chemical-plant-chinas-shandong-2025-05-27/",
            "upvotes": 489,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only? The video I saw looked like it was huge and in the middle of a densely populated city. Given the size and the fact it made a giant, suffocating cloud of nuerotoxins. I would have expected this number to be much higher.",
                "Really hope we don't see \"boo yeah\" comments here. This is tragic, regardless of where it happens",
                "Fuck, that’s awful.",
                "Wow that's horrible",
                "So at least eleven dead.",
                "[removed]",
                "China has low standards. Of course"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Grapevine Lake jet ski hit-and-run crash suspects arrested",
            "external_url": "https://www.fox4news.com/news/grapevine-lake-jet-ski-crash-suspect-arrested",
            "upvotes": 657,
            "date": "05/28/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/05/1280/720/jet-ski-suspects-and-victim.jpg?ve=1&tl=1",
            "top_comments": [
                "I have a JetSki and one day read up on safety stuff regarding them and just how to be safe on the water. I was surprised that a lot of water way fatalities it’s not the initial crash that kills you it’s you being rendered unconscious and drowning. I don’t know anything about this incident but I wonder if they would have stopped and helped her would she have survived. Such a tragedy.",
                "Glad they got em. Poor girl.\n\nNow Paxton and crew are gonna exploit the illegal immigrant part of the story and overshadow the tragedy. Ugh",
                "I’m glad they got them. Heard about this earlier today. Hope they go to prison for a long time.",
                "As someone who does kayak fishing, jet skis are one of the biggest things I worry about. People driving them don’t pay attention to their surroundings or care how fast they are going. Even if they don’t hit you, their wake can be enough to flip you over if they pass close enough. It’s like people driving them just don’t give a fuck",
                "Haven't heard about it? How would I find out? ",
                "Ok look, Im latino and Ive got a long government name that has both of my parents' last name. This suspect, her last name is Gonzalez Gonzalez? You're telling me you literally go by that instead of just using one Gonzalez??",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 11798,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Another reminder that for ICE, an asylum hearing is a perfectly safe place to get their numbers up. No dangerous drug dealers with guns, no rapists, no murderers or thugs, just honest people trying to obey the law. Easy pickings.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "But but but....conservatives keep saying that *everyone* detained by ICE is automatically a criminal or gang member! /s\n\n🙄",
                "How many of these are we not hearing about? Because it seems like we're seeing multiple a day."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US halts student visa appointments and plans expanded social media vetting",
            "external_url": "https://www.bbc.com/news/articles/cy75eenl46eo",
            "upvotes": 264,
            "date": "05/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/878f/live/4866bca0-3b8f-11f0-91a0-abc9c23352d4.jpg",
            "top_comments": [
                "Expanded social media vetting is just a euphemism for „we don’t let critical voices in“, isn’t it?",
                "No international student can go to Harvard, if all international students are banned. This could seriously hurt the US in science and technology and bankrupt universities within months. I don't know what the orange man is thinking here.",
                "Give me a fucking break. Trump doesn’t care about antisemitism. He’s using it as a fucking tool to continue to inflict conservative right ideology on a country that should be a land of free speech. He should be a president of all Americans instead of only conservative right republicans. Fuck him! He is destroying the United States.",
                "The thing that gets me is how wild his wires are crossed\n\nLike do you think any students from *China* have any opinion on what's going on in Palestine?  They got their own whole set of adversities to deal with. The idea of \"we have to stop students from China they may be anti-Semitic\" feels like insane old man brain worm ramblings.",
                "Insane what trump is doing here ……all because Barron was not accepted into Harvard……trump is scum",
                "In before \"Liberty University Exemption\"",
                "I bet if you send in your application with a million dollar purchase of DJT, you will get admitted.",
                "The same social media vetting that now in the white house who were paid by Russia?",
                "Does that apply to ALL international students for all American universities ? \n\nIs Trump destroying the whole higher education system out of spite ? (no need to answer that, we all know it's the case)\n\nRemember, everything Trump touches dies.",
                "An official memo said social media vetting would be stepped up for student and foreign exchange visas, which would have \"significant implications\" for embassies and consulates.\n\nIt comes during a wide-ranging Trump crackdown on some of America's most elite universities. He sees these institutions as too left-wing - accusing them of failing to combat antisemitism when pro-Palestinian protests have unfolded on campuses.\n\nResponding to the move, China called on the US to protect international students."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Aldi and Lidl fight price war in Germany",
            "external_url": "https://www.retaildetail.eu/news/food/aldi-and-lidl-fight-price-war-in-germany/",
            "upvotes": 754,
            "date": "05/28/2025",
            "thumbnail": "https://www.retaildetail.eu/wp-content/uploads/sites/2/2025/05/shutterstock_1092014636-aldi-lidl.jpg",
            "top_comments": [
                "Good for us consumers 👍🏼",
                "Meanwhile in Australia Coles and Woolies collude for higher prices and lower wages.\n\nDisappointed Lidl didn't break in to the Aussie market",
                "I don't even have either of those two nearby. I only have Edeka and Rewe, and both of them are stupidly expensive.",
                "Luckily here theyre fighting about who can increase prices the most ...",
                "So this is basically an ad.",
                "Why can’t we have this in America. They’re fighting over who gets to charge more and people are lining up to decide who gets to pay more. I hate it here.",
                "Luckily where I'm from we have an oligopoly so we never have to decide where to buy from, they all fist us equally hard! ",
                "In the UK Sainsburys and Tesco fight price war to see who can charge the most.",
                "Like stores should be doing, instead of collectively raising prices...",
                "Boxing match should be the way to go"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "SpaceX's Starship spins out of control after flying past points of previous failures",
            "external_url": "https://www.reuters.com/business/aerospace-defense/elon-musk-plans-mars-talk-ahead-first-starship-launch-since-test-failures-2025-05-27/",
            "upvotes": 982,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mars next year everybody!",
                "It failed better this time! Break out the champagne!",
                "Then Tesla stock price is gonna +10% tomorrow morning",
                "They added Tesla autopilot, didn't they?",
                "I thought Nazis were supposed to be good at making rockets?",
                "So are we not still on track to reach mars by 2020…?",
                "Musk said in 2016 he planned to have human landings on mars by 2024, flying in a modified dragon capsule.\n\nStill waiting on that one.\n\nRemember the robotaxi? There were supposed to be millions of those on the road.. in 2020. Have you seen ONE?\n\nAnd then neuralink got reallllll quiet after the single human trial we know about. Haven't heard from them in what, years?\n\nWhen will the government stop giving billions to this fraud? Mars is perpetually 6-8 years away. Wake the fuck up, he's scamming you. Starship can't even do suborbital flight nevermind interplanetary. They clap if they get to fucking SECO without exploding.",
                "[deleted]",
                "Musk planned a speech but was a no-show. What a maroon.",
                ">Federal regulators had granted SpaceX a license for Starship's latest flight attempt four days ago, capping a mishap investigation that had grounded Starship for nearly two months.\n\n>The last two test flights - in January and March - were cut short moments after liftoff as the vehicles blew to pieces on ascent, raining debris over parts of the Caribbean and disrupting scores of commercial airline flights in the region.\n\n>The previous back-to-back failures occurred in early test-flight phases that SpaceX had easily achieved before, in a striking setback to a program that Musk, the billionaire entrepreneur who founded the rocket company in 2002, had sought to accelerate this year.\n\nPutting aside the obvious comparison to Elon's future spinning out of control, why is he still in charge of any of this? He's bungled this project. He's helping to tank Tesla, and now he says he's stepping down from DOGE. Didn't this lying Nazi boy Musky [say this before?](https://www.theverge.com/news/653928/elon-musk-doge-step-back-tesla-earnings)  \n\nWhy is he still around as his company and projects, [and even legal issues](https://www.reuters.com/world/us/us-judge-allows-states-lawsuit-against-doge-proceed-2025-05-27/) crash down around him? Nobody is gonna want to deal with Trumpers , the Musk name is pure poison."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New York City public school student detained by ICE at asylum hearing",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-high-school-student-immigrant-detained-ice/",
            "upvotes": 11788,
            "date": "05/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/6c62fb36-a1b9-4cba-83e0-2b4af5d016e3/thumbnail/1200x630/56dc298d4997782ad86249c4d3b08e66/kramer-6p-pkg-hs-studen-wcbse07o-hi-res-still.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">Mayor Eric Adams is declining to get involved in Dylan's case.\n\nAnd we all know why. Christ, what an asshole.",
                "Fun fact everyone! \n\nApplying for asylum at the border is *not illegal*",
                "Tracking down violent criminals and gang members is difficult. And confronting them is dangerous. \n\nYou know what’s easy? And safe? Tracking down and confronting people who are productive members of society and tried to engage with the archaic system of legal immigration of the United States.",
                "Trying to get asylum by going to his legally mandated court date and the brown shirts can’t help themselves but detain him.",
                "Its like these people get up in the morning look in the mirror and say \"Yesterday I was 95% of an asshole....today I am going to break that record I believe in myself\"",
                "Another reminder that for ICE, an asylum hearing is a perfectly safe place to get their numbers up. No dangerous drug dealers with guns, no rapists, no murderers or thugs, just honest people trying to obey the law. Easy pickings.",
                "Of course Mayor Adams declines to get involved, he’s now owned by Trump.",
                "Wouldn’t want due process getting in the way of kidnapping and trafficking.",
                "But but but....conservatives keep saying that *everyone* detained by ICE is automatically a criminal or gang member! /s\n\n🙄",
                "How many of these are we not hearing about? Because it seems like we're seeing multiple a day."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 5 dead, 6 missing after China chemical plant blast",
            "external_url": "https://www.reuters.com/markets/emerging/large-blast-hits-chemical-plant-chinas-shandong-2025-05-27/",
            "upvotes": 485,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only? The video I saw looked like it was huge and in the middle of a densely populated city. Given the size and the fact it made a giant, suffocating cloud of nuerotoxins. I would have expected this number to be much higher.",
                "Really hope we don't see \"boo yeah\" comments here. This is tragic, regardless of where it happens",
                "Fuck, that’s awful.",
                "Wow that's horrible",
                "So at least eleven dead.",
                "[removed]",
                "China has low standards. Of course"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Grapevine Lake jet ski hit-and-run crash suspects arrested",
            "external_url": "https://www.fox4news.com/news/grapevine-lake-jet-ski-crash-suspect-arrested",
            "upvotes": 651,
            "date": "05/28/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/05/1280/720/jet-ski-suspects-and-victim.jpg?ve=1&tl=1",
            "top_comments": [
                "I have a JetSki and one day read up on safety stuff regarding them and just how to be safe on the water. I was surprised that a lot of water way fatalities it’s not the initial crash that kills you it’s you being rendered unconscious and drowning. I don’t know anything about this incident but I wonder if they would have stopped and helped her would she have survived. Such a tragedy.",
                "Glad they got em. Poor girl.\n\nNow Paxton and crew are gonna exploit the illegal immigrant part of the story and overshadow the tragedy. Ugh",
                "I’m glad they got them. Heard about this earlier today. Hope they go to prison for a long time.",
                "As someone who does kayak fishing, jet skis are one of the biggest things I worry about. People driving them don’t pay attention to their surroundings or care how fast they are going. Even if they don’t hit you, their wake can be enough to flip you over if they pass close enough. It’s like people driving them just don’t give a fuck",
                "Haven't heard about it? How would I find out? ",
                "Ok look, Im latino and Ive got a long government name that has both of my parents' last name. This suspect, her last name is Gonzalez Gonzalez? You're telling me you literally go by that instead of just using one Gonzalez??",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 28099,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Its not corruption if its out in the open, right?",
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "Can we collectively pay Trump to go fuck himself?",
                "Well, now you know how much a pardon costs.",
                "Before dessert, they all lined up and sat on his lap and told him what they wanted for Christmas",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years.",
                "Launch DOGE to find government fraud,  pardons a guy that committed actual tax fraud.  Makes sense",
                "Oh and of course he's a nursing home executive. Might as well own a payday loan business.\n\nEdit: *and he shorted the healthcare workers' paychecks to buy himself a fucking yacht.*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 23266,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "[removed]",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "Let's see the double blind data from the peer reviewed study.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/",
                "Wasn’t it a week ago he said we shouldn’t take medical advice from him?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Alcohol-related brain damage could affect thousands, warns expert",
            "external_url": "https://www.bbc.com/news/articles/c3e551eqpgdo",
            "upvotes": 4884,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ff06/live/2e61e3f0-3592-11f0-8f95-179a79186756.jpg",
            "top_comments": [
                "Thousands? Only thousands?",
                "I'd be very concerned if alcohol hadn't destroyed my ability to ready this ",
                "The article is referring to people who have had roughly 2-3 drinks a day on average for years if anyone is concerned by the title.",
                "Mike, from Breaking Bad, is looking pretty good.",
                "My father has this. Within a year he suddenly started losing his coordination and ability to walk. He is now wheelchair bound and can’t even go to the bathroom by himself. Hasn’t stopped drinking.",
                "Recently watched my father in law suffer from alcohol related brain problems. It was really hard. Wet brain is nothing to shake a stick at.",
                "“Well you see, Norm, it’s like this … A herd of buffalo can only move as fast as the slowest buffalo. And when the herd is hunted, it is the slowest and weakest ones at the back that are killed first. This natural selection is good for the herd as a whole, because the general speed and health of the whole group keeps improving by the regular killing of the weakest members. In much the same way, the human brain can only operate as fast as the slowest brain cells. Now, as we know, excessive intake of alcohol kills brain cells. But naturally, it attacks the slowest and weakest brain cells first. In this way, regular consumption of beer eliminates the weaker brain cells, making the brain a faster and more efficient machine. And that, Norm, is why you always feel smarter after a few beers.”",
                "Alcohol can make it difficult to uptake vitamins essential to the nervous system and brain.",
                "My dad has been drinking for like 50 years now, he is far from the man I knew when I was growing up…",
                "Please, get yourself help before it comes to this. I'm unfortunately one of those thousands. Developed WKS and Neuropathy at 31. Diseases typically found in older alcoholics. The brain fog has improved greatly over the last 2 years since I've been sober, but I'll never get back to the way I was before."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 5008,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Delete Facebook. Delete Instagram. Delete Twitter. Sell $META.",
                "Show us your memes before you show up to class. This country is becoming a parody of itself.",
                "Aka Taking away freedom of speech if it disagrees with them. This is against the constitution",
                "Remember folks, the slippery slope starts with student visas. \n\nWon't be long until YOUR social media is being \"vetted\"",
                "When the conservative loonies start cracking down on our civil rights, saying they are protecting us from international socialism, or the Chinese communist party, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start banning books and restricting the rights of queer people, saying they are protecting kids from pedophiles, the opposition (rightfully) refuse this obvious excuse to further their agenda and restrict  our freedom\n\nWhen the conservative loonies start cracking down on our students and protests, saying they are protecting us from antisemitism, the opposition… immediately takes this at face value and complains about how it’s really the Zionists who control the media and the world .\n\nisn’t that interesting",
                "Blatently fascist and against the first amendment. Fucking remove this clown already.",
                "Social media review?   This is what fascism looks like.  This is trying to eliminate free thought or differing opinions"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/28/2025 12:17:08 UTC"
}