{
    "posts": [
        {
            "category": "HOT",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 20230,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Maybe they should not have bent over for one group and their king?",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "Did they think that we would buy from them after the shit they pulled? Like, did they not see Starbucks?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "I haven’t shopped there since they did their reversal on DEI policy.  F. Target, you get what you deserve, hope more people follow suit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 2847,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "Always wear your seatbelt",
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "In separate crashes, what are the odds of that? Poor kid.",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH.",
                "Neither was wearing a seatbelt and the man was a truck driver. You would think someone who drives for a living would follow basic safety rules…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 18034,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "Six House Democrats have died in office in the past 13 months. Donald Payne Jr., Sheila Jackson Lee, Bill Pascrell, Sylvester Turner, Rayl Grijalva,  and now Gerry Connolly.",
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "[removed]",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 5919,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is too big to land at most airports? That one?",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Obligatory if Obama or Biden had done this……",
                "I fucking hate this timeline",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers",
            "external_url": "https://www.theguardian.com/us-news/2025/may/21/unitedhealth-nursing-homes-payments-hospital-transfers?CMP=oth_b-aplnews_d-1",
            "upvotes": 35452,
            "date": "05/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6cfea175f2c210fdf7f1b2e96df3618135210fa1/0_0_3000_2400/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=477cefc705ba471cf3c3e308933a0cbd",
            "top_comments": [
                "Not shocking the UNH is actively trying to reduce quality of care because they are a company whose sole motivation is to optimize for profit.",
                "That CEO killed a lot more than one person.",
                "Prison. This act had to result in deaths.",
                "To those united nurse employees who spoke out and brought light to this: thank you. Your bravery could have helped save hundreds of lives.\n\nETA: from the article…\nIf you are a current or former UnitedHealth or nursing home employee and have information you’d like to share securely with the Guardian about nursing home care, please use a non-work device to call or text investigative reporter George Joseph via the Signal messaging app at 929-486-4865.",
                "Every day is one day closer to this shit stain of a company going down in flames. Hopefully.",
                "This is just downright evil:\n\n> Two current and three former UnitedHealth nurse practitioners told the Guardian that UnitedHealth managers pressed nurse practitioners to persuade Medicare Advantage members to change their “code status” to DNR even when patients had clearly expressed a desire that all available treatments be used to keep them alive.\n\nDNR and DNI are great and everyone should be given the opportunity to register that preference. But it is critical that people choose freely and without pressure or bias from medical staff and that their true wishes are what is reflected in their chart. Otherwise it invites murder via withdrawal of lifesaving medical care.",
                "But he’s a father! They were surprised by the public’s reaction to the CEOs death but this will unlikely get the same coverage despite being way worse than the murder of one man. Torture and suffering orchestrated for share holders is the real crime here.",
                "The fine they are going to pay will surely be a deterrent in the future. Surely.\n\n/s",
                "Is anyone going to do anything about it? Of course not. Punishment is for the poors.",
                "Healthcare for profit should be illegal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Nike will raise prices on a wide range of products as soon as this week",
            "external_url": "https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html",
            "upvotes": 2000,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126111-17437060642025-04-03t182948z_1680382369_rc2iqdauinqb_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743706095&w=1920&h=1080",
            "top_comments": [
                "Their quality has gone way down and the price keeps going up.",
                "“The footwear giant said it regularly evaluates pricing, and did not say the changes were related to tariffs.”\n\n*insert “sure Jan” gif here*",
                "I was a huge Nike guy until a couple of years ago when I ventured into other brands like Asics, Saucony and New Balance. Not looking back, especially since the quality has gone to shite!",
                "Shit looks like I will have to continue not buying nike now!",
                "These prices are never coming back down. Even if tariffs are lifted, if consumers keep buying these products, Nike will keep the prices elevated.",
                "Guys it's only until we get the sweat shops built at home then prices will come back down. Don't worry. This isn't exactly what everyone said would happen.",
                "right when my need to buy things for no reason ends. cool!",
                "of course...they are all made everywhere but here",
                "They charge the highest prices for shoes that are lower quality and not keeping up with competitor improvements with their shoes. Now they want to raise prices aGAIN? Good luck",
                "Anyone got a master list of companies/brands that have raised prices recently?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 5038,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Microbiologist here: OH GOD",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "✅ Get vaccinated\n\n✅ Vaccinate your kids\n\n✅ Don't take medical advice from RFK Jr.",
                "What backward country was this in?\n\nOh.",
                "These selfish antivax parents are just cowards who can’t deal with their kids crying at the doctor. Now anyone with an infant needs to think twice about taking them in public."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 3494,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "A trans man recently killed himself at our base after being told he was being kicked out.  He already had transitioned years ago and served honorably for many years.\n\nI can’t imagine what he went through.  Giving your life for this country and then being kicked out for being who you are.  Being told you are getting kicked out of your home, career ended and everything you’ve worked for taken away ended in this result.\n\nThis is not an isolated incident at all.  It’s despicable.  The depression the other sailors, his coworkers etc are all experiencing as a result of the death of one of their own.  Nobody wanted him out or thought he shouldn’t be here.  Except this fascist dictator we are living under.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                " Why?  I thought discharges were in order?  Why the extra steps?",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                "Why bother, yall already banned them from the military.",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Conservatives are weirdly obsessed with genitals and what people do in private.\n\nBunch of fucking sickos."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 3695,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                ">Jim Pasco, the longtime Executive Director of the Fraternal Order of Police, said that consent decrees ... exacerbates the problem because it validates thinking in urban areas that the police are their enemy,” he said.\n\nYeah, well, not to be dramatic, but maybe there is some validity to the thinking.",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "Firehose of fascist evil. Every fucking day.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "what is the breaking point for the american people",
                "The American people said they wanted corrupt cops and no body cameras. \n\nit's super weird like if you were to poll people they wouldn't say that. but on election Day when it actually matters people have ever excuse in the book to not show up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Hundreds of rural hospitals are at risk of closing, threatening critical care",
            "external_url": "https://www.cbsnews.com/news/rural-hospitals-closing-reimbursements/",
            "upvotes": 1278,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/19/b7876bca-14e8-4562-8a64-913cf72d88e6/thumbnail/1200x630/12e3219795938931a95e64a4953c7bbe/b5-shamlian-rural-hospitals-051925-en-copy-02-frame-163.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "One of the things I also wonder about with these cuts is how many of these rural families have elderly family members in nursing homes that are about to lose coverage that pays for their care?",
                "We the people who voted against this shit storm are stuck fighting to protect the opther people from the people they voted in.  I am pretty sure we are not going to be able to apply any brakes until november 2026",
                "Rural communities voted for this.",
                "*The Center for Healthcare Quality and Payment Reform's report* *found that 742 rural hospitals are at risk of closing, with over 300 of those being classified as being at \"immediate risk.*\n\nMedicare and Medicaid payments decrease every year, and with the Medicaid cuts about to hit, this will cut the number of paying patients which will be another heavy load on these hospitals.",
                "Rural hospitals are being squeezed from both directions. Revenue is low because they see especially high numbers of Medicaid/Medicare patients. These programs which pay significantly less than private insurance for the same care -- a [review of the literature](https://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/) found private insurance pays, on average, almost double the Medicare rate for comparable procedures. In some cases, the Medicare/Medicaid payment falls below the actual cost of delivering care. Rural hospitals are also more often located in states that refused Medicaid expansion through Obamacare, which means patients who carry no insurance whatsoever.\n\nAt the same time, these hospitals have higher expenses. Rural hospitals struggle to recruit and retain staff, leading to higher labor costs per-patient. Increasingly, they rely on travel nurses or contract physicians to fill the gaps, both of which are more expensive than their traditional staffing counterparts. They also suffer from higher debt loads, costs from deferred maintenance, and antiquated equipment, all of which raise costs.\n\nNaturally, the planned cuts to government healthcare will exacerbate these problems. But the system was crumbling long before Trump came into office, and will eventually collapse completely without major structural reforms.",
                "It saddens me that non-maga people are getting hurt by this. The cynical part of me feels that rural communities brought this on themselves, and that nothing will change until the situation affects them. My only solace is the hope that through all of this, maybe, just maybe, they'll wake the f up. It's an awful part of human nature. My intuition says things will change as a result, but will go right back to \"own the libs\" as soon as it's over.",
                "“Somehow Biden is responsible for this”",
                "Low reimbursement rates while Unitedhealth alone made a $90 billion gross profit last year. Single payer is the only fix.",
                "if only there was some way to prevent this type of stuff",
                "Trump doesn't care, he just got a new airplane."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli troops fire 'warning shots' at diplomats in West Bank",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250522_N02/",
            "upvotes": 129,
            "date": "05/22/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250522_N02_1528191_L.jpg",
            "top_comments": [
                ">Israeli troops fired what they say were \"warning shots\" at a group of diplomats in the city of Jenin in the West Bank on Wednesday. The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\n\nSo the IDF has to make sure that roving gangs of *<checks notes>* diplomats don't start going to sensitive areas and chatting up the locals. So they fire some warning shots to show those diplomats who the tough guys are.",
                "Every day I wake up, something makes me hate Israel more and more. \n\nAbsolutely FUCK Israel.",
                "\"The Israeli Defense Forces claimed the group had entered a restricted area without authorization. No injuries were reported.\"\n\nSo their solution to address who they knew were unarmed diplomats was to fire live rounds at them?\n\nThat's their preferred approach and there's no better alternatives?",
                "I have never seen a country try so hard to be hated",
                "Israel is just intent on isolating itself, isn't it?",
                "This could all stop today if Hamas would just release the hostages. -- r/worldnews probably",
                "Everytime that I thought that this country’s brand can’t go any lower, I get surprised",
                "After all that money spent on Eurovision? What a waste.",
                "Sure. And the bomb that gets dropped on those soldiers from half a mile away is just a warning shot too. What is wrong with people the last few years?",
                "Call it what you want, but shooting near a delegation from 20 countries is a guaranteed way to damage international credibility"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Colts owner Jim Irsay dead at 65",
            "external_url": "https://www.wishtv.com/sports/indianapolis-colts/colts-owner-jim-irsay-dead-at-65/",
            "upvotes": 424,
            "date": "05/21/2025",
            "thumbnail": "https://www.wishtv.com/wp-content/uploads/2024/01/09/Jim-Irsay_AP22312064831966-scaled.jpg",
            "top_comments": [
                "There was a rumor he OD’d in Miami and was flown back to Indy and he wasn’t doing good.",
                "Man, y'all may not know this but he was an absolute amazing person in my interactions\n\nI used to work at the local humane society out of HS.  We had a dog there that had somehow ended up there all the way from SC.  Because no one adopted the dog, it ended up on the news and the family from SC saw the dog and said it was there's.  They didn't have the money to come get the dog, and Irsay heard about it and flew the dog down himself on his private jet.  He sent a picture to us of the dog eating steak on the jet\n\nNothing but good things to say about Mr Irsay\n\nRIP",
                "65?? Thought the dude was in his 80s....",
                "Addiction is a disease, not a moral failure and I wish our society made that distinction.",
                "He was here for a good time not a long time",
                "Jesus I hope I don’t look like that when I’m 65. \n\nAlso, condolences to his family.",
                "Dibs on the Black Strat",
                "Dude was a party animal and it eventually caught up with him.",
                "Curious what happens with his insane guitar collection and other oddities.",
                "How the hell did he go from GM to owner in 13 years?  Did he already have family money?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 2844,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "Always wear your seatbelt",
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "In separate crashes, what are the odds of that? Poor kid.",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH.",
                "Neither was wearing a seatbelt and the man was a truck driver. You would think someone who drives for a living would follow basic safety rules…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Nike will raise prices on a wide range of products as soon as this week",
            "external_url": "https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html",
            "upvotes": 1998,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126111-17437060642025-04-03t182948z_1680382369_rc2iqdauinqb_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743706095&w=1920&h=1080",
            "top_comments": [
                "Their quality has gone way down and the price keeps going up.",
                "“The footwear giant said it regularly evaluates pricing, and did not say the changes were related to tariffs.”\n\n*insert “sure Jan” gif here*",
                "I was a huge Nike guy until a couple of years ago when I ventured into other brands like Asics, Saucony and New Balance. Not looking back, especially since the quality has gone to shite!",
                "Shit looks like I will have to continue not buying nike now!",
                "These prices are never coming back down. Even if tariffs are lifted, if consumers keep buying these products, Nike will keep the prices elevated.",
                "Guys it's only until we get the sweat shops built at home then prices will come back down. Don't worry. This isn't exactly what everyone said would happen.",
                "right when my need to buy things for no reason ends. cool!",
                "of course...they are all made everywhere but here",
                "They charge the highest prices for shoes that are lower quality and not keeping up with competitor improvements with their shoes. Now they want to raise prices aGAIN? Good luck",
                "Anyone got a master list of companies/brands that have raised prices recently?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former New York state trooper pleads guilty to faking his own shooting",
            "external_url": "https://apnews.com/article/new-york-trooper-shot-guilty-plea-5b822d3e3da0d51978637fff6eb6e2ff",
            "upvotes": 433,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Donnelly said the ruse was an apparent bid to gain sympathy from a former girlfriend\n\nWell she dodged a bullet.",
                ">Instead, prosecutors say, he staged the scene of the alleged shooting by scattering shell casings, then shot himself at a park, stashed the .22-caliber rifle, drove back to the highway and called for backup.\n\n>Nassau County District Attorney Anne Donnelly said after Wednesday’s hearing that “one of the most disturbing parts” of the case was that he intentionally set in motion a potentially dangerous search.\n\n>Mascia described the fictitious driver as a “dark-skinned” man wearing a balaclava that exposed only his eyes. He also claimed the suspect fled in a car bearing temporary New Jersey plates heading toward New York City.\n\n\nDisturbing is putting it mildly. He used the familiar “dark-skinned man” trope to shift blame, and risked the lives of anyone in the area fitting the description. The cops would be far more trigger-happy if they thought another cop had been shot.",
                "> “If someone had been stopped that fit the description? Who knows what would have happened?” the district attorney said. “It’s just a frightening thought.”\n\nYeah, maybe if cops were actually held to standards it would be less terrifying.",
                "The best nickname i can come up with is Justice Smollett, but I think we can do better.",
                "Could have at least paid Bobby Baccala to do the deed",
                "NOPE....The community needs to remember he is a liar"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hundreds of rural hospitals are at risk of closing, threatening critical care",
            "external_url": "https://www.cbsnews.com/news/rural-hospitals-closing-reimbursements/",
            "upvotes": 1275,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/19/b7876bca-14e8-4562-8a64-913cf72d88e6/thumbnail/1200x630/12e3219795938931a95e64a4953c7bbe/b5-shamlian-rural-hospitals-051925-en-copy-02-frame-163.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "One of the things I also wonder about with these cuts is how many of these rural families have elderly family members in nursing homes that are about to lose coverage that pays for their care?",
                "We the people who voted against this shit storm are stuck fighting to protect the opther people from the people they voted in.  I am pretty sure we are not going to be able to apply any brakes until november 2026",
                "Rural communities voted for this.",
                "*The Center for Healthcare Quality and Payment Reform's report* *found that 742 rural hospitals are at risk of closing, with over 300 of those being classified as being at \"immediate risk.*\n\nMedicare and Medicaid payments decrease every year, and with the Medicaid cuts about to hit, this will cut the number of paying patients which will be another heavy load on these hospitals.",
                "Rural hospitals are being squeezed from both directions. Revenue is low because they see especially high numbers of Medicaid/Medicare patients. These programs which pay significantly less than private insurance for the same care -- a [review of the literature](https://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/) found private insurance pays, on average, almost double the Medicare rate for comparable procedures. In some cases, the Medicare/Medicaid payment falls below the actual cost of delivering care. Rural hospitals are also more often located in states that refused Medicaid expansion through Obamacare, which means patients who carry no insurance whatsoever.\n\nAt the same time, these hospitals have higher expenses. Rural hospitals struggle to recruit and retain staff, leading to higher labor costs per-patient. Increasingly, they rely on travel nurses or contract physicians to fill the gaps, both of which are more expensive than their traditional staffing counterparts. They also suffer from higher debt loads, costs from deferred maintenance, and antiquated equipment, all of which raise costs.\n\nNaturally, the planned cuts to government healthcare will exacerbate these problems. But the system was crumbling long before Trump came into office, and will eventually collapse completely without major structural reforms.",
                "It saddens me that non-maga people are getting hurt by this. The cynical part of me feels that rural communities brought this on themselves, and that nothing will change until the situation affects them. My only solace is the hope that through all of this, maybe, just maybe, they'll wake the f up. It's an awful part of human nature. My intuition says things will change as a result, but will go right back to \"own the libs\" as soon as it's over.",
                "“Somehow Biden is responsible for this”",
                "Low reimbursement rates while Unitedhealth alone made a $90 billion gross profit last year. Single payer is the only fix.",
                "if only there was some way to prevent this type of stuff",
                "Trump doesn't care, he just got a new airplane."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 20219,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Maybe they should not have bent over for one group and their king?",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "Did they think that we would buy from them after the shit they pulled? Like, did they not see Starbucks?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "I haven’t shopped there since they did their reversal on DEI policy.  F. Target, you get what you deserve, hope more people follow suit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas Renaissance Festival founder ‘King George’ dies at Todd Mission home",
            "external_url": "https://www.fox26houston.com/news/todd-mission-death-investigation-texas-renaissance-festival-king-george-home",
            "upvotes": 438,
            "date": "05/21/2025",
            "thumbnail": "https://images.foxtv.com/c107833-mcdn.mp.lura.live/expiretime=2082787200/94754bd1f864af7901752ef3644159c091fbd6e825ae9b2e5fe3a0856ff585e4/iupl/BD1/1A6/1280/720/BD11A6ADA02FA9B5EBD0A07B9AED8071.jpg?ve=1&tl=1",
            "top_comments": [
                "The Ren Faire doc was great - I think it’s easy to mistake it as reality tv but it really does a great job displaying the relationships that all these people had with King George. The greed and betrayal that occurs in a ‘small’ family business, and how far passion actually gets some of them (not far) is really captivating. I was mistaken to think that King George was just a crazy old bat, which he was, but when it came to the financials and operations he was very sharp. Many of the people striving to be his successor weren’t really aware of that fact, and thought once they got in they’d be steering the ship, but were in over their heads. \n\nI’d recommend people give the documentary a chance as it really takes some crazy turns.",
                "Obligatory King of the Hill: \n\nKing Philip: [in British accent] \"Department of Labor, OSHA\"\n[British accent slowly becoming Texan drawl]\n\nKing Philip: \"Texas Workforce Commission\"?\n[full American accent]\n\nKing Philip: Crap! I'm gonna lose my Faire. I don't want to go back to selling real estate!",
                "He's up in heaven, paying for escort Angels.",
                "Rest in piss, creepy greedy old narcissist",
                "the king is dead? now the lords of the realm will fight for succession.",
                "weird coincidence, I just watched a documentary on this guy on Monday. RIP",
                "“No suspected danger to the public” 😂",
                "Real curious who his will puts in charge.....  \nDude was a legit lunatic, that will could be WILD.",
                "Damn RIP. Just did my first ren fest there last November it was awesome... The after hours shit is crazy 💀",
                "I am absolutely shocked Texas allows Renaissance Festivals. Seems like the kind of fun Ol’ Popeye Paxton and the other cartoon characters in Texas politics would outlaw."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Roof of historic Ming Dynasty tower collapses in China - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c1w33xnnjdzo.amp",
            "upvotes": 163,
            "date": "05/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2f59/live/2324b8c0-3653-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "That is really unfortunate. Hopefully it was due to just being an old building and not foul play. Wonder if it was cased by the rebuild in 1995.",
                "*The Drum Tower - reportedly the largest in China - was built in 1375 during the Ming Dynasty but had undergone an extensive rebuild in 1995.*\n\nNot a very \"extensive\" rebuild it seems, esp when you pit it next to original construction in 1375.",
                "I mean the original structure is really old isn't it?",
                "So it was fine for 600 years and then they tried to fix it?",
                "Nothing happened in China! Can you find it on the Internet in China?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 5923,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is too big to land at most airports? That one?",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Obligatory if Obama or Biden had done this……",
                "I fucking hate this timeline",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Engaged couple dies in separate crashes; leave behind young son",
            "external_url": "https://www.wafb.com/2025/05/21/engaged-couple-dies-separate-crashes-leave-behind-young-son/",
            "upvotes": 2847,
            "date": "05/21/2025",
            "thumbnail": "https://gray-wafb-prod.gtv-cdn.com/resizer/v2/TKGAE2UZ7VEQDJHSK73RZEPQ3E.png?auth=18978f579f5a6de11ee41610ba6944d3b5754e07783e78e28f6ff2609789a13d&width=1200&height=600&smart=true",
            "top_comments": [
                "Always wear your seatbelt",
                "\"neither one of them was wearing a seatbelt\"\n\nThis always blows my mind. Are there any cars from like the last 20 years that doesn't scream at you to put on your seatbelt?",
                "In separate crashes, what are the odds of that? Poor kid.",
                "Thanks, that's the saddest shittiest thing I've read all week.",
                "I just saw a video of dashcams with several crashes, some people belted and some not. Very shocking, the amount of movement in the unbelted passengers is absolutely shocking. I have been in accidents and I was still amazed at how effective seatbelts are. Not wearing a belt, it's YOU that can injure the belted passengers.\n\n(Non graphic but the first one includes a child) [https://www.youtube.com/watch?v=9tPzALVSSvs](https://www.youtube.com/watch?v=9tPzALVSSvs)",
                "“Troopers said neither one of them was wearing a seatbelt.”",
                "From the article - he died rushing to the scene of her accident after the cops called him to tell him about it. Isn't it policy to break the news in person for something like this to avoid this type of further tragedy?",
                "In separate crashes, and neither of them were wearing a seatbelt. \n\nWhy, in 2025, do people still refuse to wear seat belts? Do we need more deaths? More tragedies to occur first? What a reckless and stupid choice. And now that child is an orphan.",
                "Why are people not wearing their seat belts????!!!! WTF? . SMDH.",
                "Neither was wearing a seatbelt and the man was a truck driver. You would think someone who drives for a living would follow basic safety rules…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Nike will raise prices on a wide range of products as soon as this week",
            "external_url": "https://www.cnbc.com/2025/05/21/nike-price-increases-tariffs.html",
            "upvotes": 1997,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126111-17437060642025-04-03t182948z_1680382369_rc2iqdauinqb_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743706095&w=1920&h=1080",
            "top_comments": [
                "Their quality has gone way down and the price keeps going up.",
                "“The footwear giant said it regularly evaluates pricing, and did not say the changes were related to tariffs.”\n\n*insert “sure Jan” gif here*",
                "I was a huge Nike guy until a couple of years ago when I ventured into other brands like Asics, Saucony and New Balance. Not looking back, especially since the quality has gone to shite!",
                "Shit looks like I will have to continue not buying nike now!",
                "These prices are never coming back down. Even if tariffs are lifted, if consumers keep buying these products, Nike will keep the prices elevated.",
                "Guys it's only until we get the sweat shops built at home then prices will come back down. Don't worry. This isn't exactly what everyone said would happen.",
                "right when my need to buy things for no reason ends. cool!",
                "of course...they are all made everywhere but here",
                "They charge the highest prices for shoes that are lower quality and not keeping up with competitor improvements with their shoes. Now they want to raise prices aGAIN? Good luck",
                "Anyone got a master list of companies/brands that have raised prices recently?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Colts owner Jim Irsay dead at 65",
            "external_url": "https://www.wishtv.com/sports/indianapolis-colts/colts-owner-jim-irsay-dead-at-65/",
            "upvotes": 417,
            "date": "05/21/2025",
            "thumbnail": "https://www.wishtv.com/wp-content/uploads/2024/01/09/Jim-Irsay_AP22312064831966-scaled.jpg",
            "top_comments": [
                "There was a rumor he OD’d in Miami and was flown back to Indy and he wasn’t doing good.",
                "Man, y'all may not know this but he was an absolute amazing person in my interactions\n\nI used to work at the local humane society out of HS.  We had a dog there that had somehow ended up there all the way from SC.  Because no one adopted the dog, it ended up on the news and the family from SC saw the dog and said it was there's.  They didn't have the money to come get the dog, and Irsay heard about it and flew the dog down himself on his private jet.  He sent a picture to us of the dog eating steak on the jet\n\nNothing but good things to say about Mr Irsay\n\nRIP",
                "65?? Thought the dude was in his 80s....",
                "Addiction is a disease, not a moral failure and I wish our society made that distinction.",
                "He was here for a good time not a long time",
                "Jesus I hope I don’t look like that when I’m 65. \n\nAlso, condolences to his family.",
                "Dibs on the Black Strat",
                "Dude was a party animal and it eventually caught up with him.",
                "Curious what happens with his insane guitar collection and other oddities.",
                "How the hell did he go from GM to owner in 13 years?  Did he already have family money?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hundreds of rural hospitals are at risk of closing, threatening critical care",
            "external_url": "https://www.cbsnews.com/news/rural-hospitals-closing-reimbursements/",
            "upvotes": 1283,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/19/b7876bca-14e8-4562-8a64-913cf72d88e6/thumbnail/1200x630/12e3219795938931a95e64a4953c7bbe/b5-shamlian-rural-hospitals-051925-en-copy-02-frame-163.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "One of the things I also wonder about with these cuts is how many of these rural families have elderly family members in nursing homes that are about to lose coverage that pays for their care?",
                "We the people who voted against this shit storm are stuck fighting to protect the opther people from the people they voted in.  I am pretty sure we are not going to be able to apply any brakes until november 2026",
                "Rural communities voted for this.",
                "*The Center for Healthcare Quality and Payment Reform's report* *found that 742 rural hospitals are at risk of closing, with over 300 of those being classified as being at \"immediate risk.*\n\nMedicare and Medicaid payments decrease every year, and with the Medicaid cuts about to hit, this will cut the number of paying patients which will be another heavy load on these hospitals.",
                "Rural hospitals are being squeezed from both directions. Revenue is low because they see especially high numbers of Medicaid/Medicare patients. These programs which pay significantly less than private insurance for the same care -- a [review of the literature](https://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/) found private insurance pays, on average, almost double the Medicare rate for comparable procedures. In some cases, the Medicare/Medicaid payment falls below the actual cost of delivering care. Rural hospitals are also more often located in states that refused Medicaid expansion through Obamacare, which means patients who carry no insurance whatsoever.\n\nAt the same time, these hospitals have higher expenses. Rural hospitals struggle to recruit and retain staff, leading to higher labor costs per-patient. Increasingly, they rely on travel nurses or contract physicians to fill the gaps, both of which are more expensive than their traditional staffing counterparts. They also suffer from higher debt loads, costs from deferred maintenance, and antiquated equipment, all of which raise costs.\n\nNaturally, the planned cuts to government healthcare will exacerbate these problems. But the system was crumbling long before Trump came into office, and will eventually collapse completely without major structural reforms.",
                "It saddens me that non-maga people are getting hurt by this. The cynical part of me feels that rural communities brought this on themselves, and that nothing will change until the situation affects them. My only solace is the hope that through all of this, maybe, just maybe, they'll wake the f up. It's an awful part of human nature. My intuition says things will change as a result, but will go right back to \"own the libs\" as soon as it's over.",
                "“Somehow Biden is responsible for this”",
                "Low reimbursement rates while Unitedhealth alone made a $90 billion gross profit last year. Single payer is the only fix.",
                "if only there was some way to prevent this type of stuff",
                "Trump doesn't care, he just got a new airplane."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Former New York state trooper pleads guilty to faking his own shooting",
            "external_url": "https://apnews.com/article/new-york-trooper-shot-guilty-plea-5b822d3e3da0d51978637fff6eb6e2ff",
            "upvotes": 433,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Donnelly said the ruse was an apparent bid to gain sympathy from a former girlfriend\n\nWell she dodged a bullet.",
                ">Instead, prosecutors say, he staged the scene of the alleged shooting by scattering shell casings, then shot himself at a park, stashed the .22-caliber rifle, drove back to the highway and called for backup.\n\n>Nassau County District Attorney Anne Donnelly said after Wednesday’s hearing that “one of the most disturbing parts” of the case was that he intentionally set in motion a potentially dangerous search.\n\n>Mascia described the fictitious driver as a “dark-skinned” man wearing a balaclava that exposed only his eyes. He also claimed the suspect fled in a car bearing temporary New Jersey plates heading toward New York City.\n\n\nDisturbing is putting it mildly. He used the familiar “dark-skinned man” trope to shift blame, and risked the lives of anyone in the area fitting the description. The cops would be far more trigger-happy if they thought another cop had been shot.",
                "> “If someone had been stopped that fit the description? Who knows what would have happened?” the district attorney said. “It’s just a frightening thought.”\n\nYeah, maybe if cops were actually held to standards it would be less terrifying.",
                "The best nickname i can come up with is Justice Smollett, but I think we can do better.",
                "Could have at least paid Bobby Baccala to do the deed",
                "NOPE....The community needs to remember he is a liar"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 3693,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                ">Jim Pasco, the longtime Executive Director of the Fraternal Order of Police, said that consent decrees ... exacerbates the problem because it validates thinking in urban areas that the police are their enemy,” he said.\n\nYeah, well, not to be dramatic, but maybe there is some validity to the thinking.",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "Firehose of fascist evil. Every fucking day.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "what is the breaking point for the american people",
                "The American people said they wanted corrupt cops and no body cameras. \n\nit's super weird like if you were to poll people they wouldn't say that. but on election Day when it actually matters people have ever excuse in the book to not show up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 20214,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "It was so stupid. People ignored the cheaper prices at Walmart simply for everything they now threw under the bus. Good luck.",
                ">  Target also said customer boycotts did some damage during the latest quarter. The company, long a fierce corporate advocate for the rights of Black and LGBTQ+ people, scaled back many diversity, equity and inclusion initiatives in January after they came under attack by conservative activists and the White House. \n\nSeems like they chose to offend the people that shop at their stores to placate the people who don't shop at their stores.  I can see why the CEO makes the big bucks.",
                "Maybe they should not have bent over for one group and their king?",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "That's kind of what you get for slobbering all over the balls of the guy who was the inspiration for Biff from Back to the Future.",
                "Did they think that we would buy from them after the shit they pulled? Like, did they not see Starbucks?",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "I haven’t shopped there since they did their reversal on DEI policy.  F. Target, you get what you deserve, hope more people follow suit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 5043,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Microbiologist here: OH GOD",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "✅ Get vaccinated\n\n✅ Vaccinate your kids\n\n✅ Don't take medical advice from RFK Jr.",
                "What backward country was this in?\n\nOh.",
                "These selfish antivax parents are just cowards who can’t deal with their kids crying at the doctor. Now anyone with an infant needs to think twice about taking them in public."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 5928,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is too big to land at most airports? That one?",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Obligatory if Obama or Biden had done this……",
                "I fucking hate this timeline",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 3489,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "A trans man recently killed himself at our base after being told he was being kicked out.  He already had transitioned years ago and served honorably for many years.\n\nI can’t imagine what he went through.  Giving your life for this country and then being kicked out for being who you are.  Being told you are getting kicked out of your home, career ended and everything you’ve worked for taken away ended in this result.\n\nThis is not an isolated incident at all.  It’s despicable.  The depression the other sailors, his coworkers etc are all experiencing as a result of the death of one of their own.  Nobody wanted him out or thought he shouldn’t be here.  Except this fascist dictator we are living under.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                " Why?  I thought discharges were in order?  Why the extra steps?",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                "Why bother, yall already banned them from the military.",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Conservatives are weirdly obsessed with genitals and what people do in private.\n\nBunch of fucking sickos."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/22/2025 00:43:37 UTC"
}