{
    "posts": [
        {
            "category": "HOT",
            "title": "US fires Greenland military base chief for 'undermining' JD Vance",
            "external_url": "https://bbc.com/news/articles/creq99l218do",
            "upvotes": 27715,
            "date": "04/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bfc8/live/a395f500-16b9-11f0-a455-cf1d5f751d2f.jpg",
            "top_comments": [
                "This is the statement she was fired for: \"I do not presume to understand current politics, but what I do know is the concerns of the US administration discussed by Vice-President Vance on Friday are not reflective of Pituffik Space Base.\"\"",
                "Is this the same JD Vance who likes to lecture Europe on freedom of speech?",
                "Slapped arse VP basically says that having an opinion that differs from the party line is misconduct. Welcome to the 'land of the free'.",
                "They know she wouldn't obey the order if they ask them to take over the island.",
                "It’s funny that they say it is because she was undermining the chain of command by insulting Vance, when Vance isn’t in her chain of command.",
                "Integrity will not be tolerated.",
                "There has never been a worse administration in the history of our country.",
                "I’m not sure how one would Undermine Vance more than Vance.\n\nMotherfucker dragged a whole camera crew to show off how he doesn’t know how to order donuts and then released that video.\n\nGuy stands next to his Indian wife talking about how immigrants are destroying the nation.\n\nThe whole Admin’s a clown show, but JD’s the smaller, even stupider clown that can’t get out of the car without falling head first into an open sewer.",
                "Oh for fuck's sake.\n\nHello Americans. I am from Turkey. Everything that has been happening so far feels so familiar it is painful. It is almost like you lot just elected Erdoğan. The only difference is that your idiots are pretty much speedrunning this bullshit instead of spreading it over 20 or so years.\n\nAlmost like they are sharing notes. Fucking hell...",
                "It’s traditional for a fascist regime to purge any members of the military who don’t show 100% loyalty to that regime"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Australian with working visa detained and deported on returning to US from sister’s memorial",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/11/australian-with-us-working-visa-detained-insulted-deported",
            "upvotes": 3588,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dfacc465ba70e74361c230b86c4a98b4172337c6/0_0_2500_1500/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=18eb35833620d4bb4642ca8225a920dd",
            "top_comments": [
                "I mean there's no better advertisement to never go to the US or work with them anymore. \nAs time passes, extreme behavior by US borders agents will be normalised and even encouraged. The few non cultist members will leave the job and all that will remain is horrible people banning people from the US for whatever reason they wish.",
                "> Guardian Australia asked “what grounds would be reasonable for someone to be denied entry to the US when they have a valid work visa” and whether it was “considered acceptable for any traveller to be called a ‘r-t--d’ by US border officials”.\n\n> A Department of Homeland Security media representative replied that the department “cannot answer questions on something we cannot verify the veracity of”.\n\n> “Just like I cannot confirm the existence of big foot.”\n\nWhat a horrible official response.\n\nJoking around while they're actively tearing apart the lives of innocent people. And they're living off of a salary paid for by my tax dollars.\n\nMakes me ashamed to be American.",
                "What surprises me (although I don't know why it should) is just how quickly all of these TSA, Border Patrol, ICE,  Homeland Security, etc. people turned into TOTAL FUCKING ASSHOLES the minute they got given the green light.\n\nIt's like they were all just biding their time, then BAM!, Nazis.",
                "U.S. ICE agents are fancying themselves to be paramilitarians who just do whatever they want now.\n\nThese deportees are undoubtedly forced to leave behind valuables in the U.S. so I also have to wonder if there will be (or already is) a transition to a theft racket by ICE agents or those connected with them.",
                "Yeah don't go to the US...",
                "Vote for a clown and you get a circus.",
                "visit the US?….straight to jail\n\nLeave the US and come back? Also straight to jail",
                "A family friend of mine has a similar experience. He has a green card and has lived in the US for 20 years. His wife is American, his kids are American. The family went to the US Virgin Islands for vacation, and on the way back he was detained in Miami for having a green card. Then he was sent to Peurto Rico to be held for a few days. Then he was flown back to Miami. Then he was given a choice of being sent to jail to await his court date, or be flown to Canada.",
                "The USA has a *lot* of cool shit that I will now probably never get to see.",
                "Way to lose friends and isolate  people."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "China strikes back with 125% tariffs on U.S. goods, starting April 12",
            "external_url": "https://www.cnbc.com/2025/04/11/china-strikes-back-with-125percent-tariffs-on-us-goods-starting-april-12.html",
            "upvotes": 4447,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130446-17443187092025-04-10t205242z_1564031578_rc28vdaqwvty_rtrmadp_0_usa-trump-tariffs.jpeg?v=1744318760&w=1920&h=1080",
            "top_comments": [
                "> “Even if the U.S. continues to impose higher tariffs, it will no longer make economic sense and will become a joke in the history of world economy,” the statement said, according to a CNBC translation.\n\n\nThat statement is going to cause a major tantrum in the administration.",
                ">“With tariff rates at the current level, there is no longer a market for U.S. goods imported into China,” the statement noted, adding that “if the U.S. government continues to increase tariffs on China, Beijing will ignore.”\n\nThey preemptively boxed Trump into a corner, lol.",
                "It doesn't even matter what the tariff % raises to, they're already high enough that trade has ceased. They're always going to stay just lower than the US tariffs to make clear they are not the aggressor here. But Trump will keep raising them as long as he doesn't have the last word. Someone needs to call his bluff, and I'm glad China has the balls and poker hand to do it. It's not even a matter of who blinks first, because it's 100% going to be Trump, it's just a matter of how much damage he does for how long.",
                "Well, congratulations are in order, US.\n\n\nYou made China, South Korea and Japan sit at the table and start to negotiate a trade deal between them.\n\n\nNot bad. 😁🫢",
                "It's an effective trade halt between China and the US. \n\nIn 2024, the US exported $143.5 billion in goods to China and imported $438 billion from China.\n\nRecession is basically guaranteed at this point. We'll be lucky if it's not a depression.",
                "The America led clownshow continues.\n\nGood job, idiots.",
                "Future comedians will use 21th century history as research material.",
                "That fucking clown in the whitehouse is going to bankrupt us like one of his casinos.",
                "Yay, can't wait to pay $100 for something that costs $1 to produce. Proud to be American.",
                "You know who I actually feel sorry for, the low level trade officials that have to communicate and enforce these changing by the hour rules, must be absolute chaos."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "HOT",
            "title": "US egg prices increase to record high, dashing hopes of cheap eggs by Easter",
            "external_url": "https://apnews.com/article/egg-prices-bird-flu-cpi-b0ded420e9f7c0a707277c9c63396a76",
            "upvotes": 3593,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Time to dye those potatoes 🥔.",
                "Honestly this is what you get for electing a fucking moron. You wanted cheap egg prices - you should have elected the decent human instead of the fascist.",
                "Wait, I thought fuckface said egg prices went down, even though I grocery shop and see egg prices every day? Fuckin liars.",
                "I mean eggs went down $5 per 3 dozen for me, but they were probably the highest in cali.  $23.99 -> $18.99 for 36 eggs....",
                "This just gave me a flashback to 2020 when covid would be over by Easter lmao I forgot about that",
                "Upon whose face doth the egg lie?",
                "Trump and his cabinet in 4K just straight up lying about the price of eggs yesterday.",
                "The prices are not going to come back down, not as low as they were anyway. Profits are going to be higher than ever this year.",
                "Yeah they thought they’d guy who said ‘they’re eating the dogs’ could fix that issue.\n\nOne country with a staggering proportion of idiots in the population.\n\nAmericans, the rest of the world already thought ‘ya’ll’ were mostly as smart as a bag of hammers, now we know we’re right.",
                "Time to change our traditions. No more Easter eggs, cue THE EASTER POTATO 🥔!\n\nEdit: of course the potatoes will be imported from Russia"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Montana farmers see Canadian trade dry up due to tariffs",
            "external_url": "https://nbcmontana.com/news/local/montana-farmers-see-canadian-trade-dry-up-due-to-tariffs",
            "upvotes": 2915,
            "date": "04/11/2025",
            "thumbnail": "https://nbcmontana.com/resources/media2/16x9/414/986/0x5/90/e9768de1-abd5-433a-85d3-ba6b88681cde-farmer.JPG",
            "top_comments": [
                "Well they can just pull themselves up by their bootstraps/find a new job/move somewhere else/pray to Jesus about it.",
                "Promises Made, Promises kept ❤️. Getting exactly what they voted for! Not many presidents follow through! Trump went above and beyond right MAGA farmers? 🙌🙏🦅",
                "Montana had the best representation in the Senate with John Tester, who was ACTUALLY a Montana Farmer, but they voted in a Minnesota Trust Fund Baby who has rubber stamped the destruction of the State.  This was a decent purple state before MAGA.",
                "There's a loooot of assholes in this world that really think you can just do what you want and be a massive prick and its fine because you're American",
                "Maybe Montana farmers shouldn’t have overwhelmingly voted for an orange fascist..? 🤷 \n\nUs Canadians don’t look kindly on that. 🇨🇦✊",
                "The find out stage better humble these fuckers.",
                "Cue the corporate agriculture companies ready to swoop in when the farms go bankrupt. Not so sure Trump will be in the mood for subsidies this time around.",
                "Hey Montana, you voted for this! Enjoy the consequences of your actions.  Even if tariffs are removed, please understand that Canada has no interest whatsoever in doing business with you anymore.",
                "Oh no, the leopards are eating MY face after I voted for the leopards eating faces party",
                "Oh well... Enjoy your winning and being Great Again Montana."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "Carnegie Mellon student with one semester left learns his visa was revoked with no explanation",
            "external_url": "https://www.cbsnews.com/pittsburgh/news/carnegie-mellon-student-visa-revoked-interview/",
            "upvotes": 17290,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/09/d2d0d1ef-58b8-44eb-a94c-1adcf57c1d2b/thumbnail/1200x630/6294363d99a43018d8f43abee72b6adc/snapshot-2025-04-09t180915-561.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "I wonder if these universities will let them finish their degrees online. That would definitely be the move.",
                "How to create a generation of smart potential immigrants who despise America.",
                "Didn't Marco Rubio say he had cancelled more than 300 student visas by then?",
                "Similar cases with some Indian students - [https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09](https://www.indiatoday.in/world/us-news/story/us-cancelling-student-visas-of-indians-found-not-guilty-of-crime-by-courts-f-1-green-card-trump-policy-2706343-2025-04-09)",
                "At the very least since he is three weeks away from graduating, couldn't CMU just award him the degree anyway if he get's deported or forced out of school?",
                "I hate this so much.  Since they absolutely do not care about the person that is affected. People pay a lot of money and time to get a degree, for it all to be snatched away for no reason but cruelty.",
                "What happened is a racist asshole got into the White House.",
                "It hasn’t been noted in the media I don’t think, but this is another way Trump is attacking higher education. A lot of schools rely on international students since they usually pay a lot more for tuition.",
                "The U.S. is radicalizing a whole new generation agaisnt it. It’s a bizarre self-fulfilling prophecy.",
                "Strange that none of these kids getting their visas revoked are European or Aussie... hmm... \n\n(Obviously not strange, it's racism)"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US Supreme Court upholds order to facilitate return of deportee sent to El Salvador in error",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/",
            "upvotes": 49039,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I can't believe it takes an order from the Supreme Court when it was in error. That is so mind-bendingly fucked up.",
                "The fact that a sitting president said NO to an innocent man returning home from an another countries shitty prison after being forcefully detained and sent there for no reason is fucking disgusting.",
                "The fact that this had to go to the SC instead of the administration just doing what was obviously the correct and just thing to do (ignoring the premise of these deportations entirely) is a travesty and really shows the true colors of these motherfuckers.\n\n\"We know what we did is wrong, but like...why are you trying to make us correct it!? So unfair!\"",
                "This should have been common sense, the fact that the administration fought this - the fact they were not willing to bring back this person - this is not American, any individual who supports this administration needs a bit of a reality check. We have come so far off the course of any human decency.",
                "I think anyone that was part of sending this man down there without due process should be shipped to the same prison for the same amount of time.",
                "Now we see what happens if the executive branch says “nah”",
                "Can’t wait for Trump Admin people to start talking about abolishing the SC for going against their idol.",
                "Finally some good fucking news. At least the Trump admin can’t send people to El Salvador and lose the key. ",
                "It's not a win, yet: \"However, the court said that the additional requirement to \"effectuate\" his return was unclear and may exceed the judge's authority. The justices directed Xinis to clarify the directive \"with due regard for the deference owed to the executive branch in the conduct of foreign affairs.\"\" \n\n\nThey want the judge to explain how the government should bring him back, which isn't the judge's job. They're still giving the government a lot of wiggle room.",
                "[Leah Litman](https://bsky.app/profile/leahlitman.bsky.social/post/3lmiljosr5s2u) (very smart source) is concerned the wording gives the government wiggle room to just say “Sorry, we can’t convince El Salvador to bring him back”\n\n(Horrific nonsense of course but that will be the next move)"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Rep. Marjorie Taylor Greene bought stocks hit hard by Trump tariffs during the market meltdown",
            "external_url": "https://apnews.com/article/greene-stocks-conflicts-interest-restoration-hardware-tariffs-trump-f9922a970c837cb76dd8ddc01f20f51d",
            "upvotes": 1103,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's amusing her defense for buying the stocks hit hard by tariffs is ... \"tariffs are good\".",
                "Would any sane person just decide to purchase hundreds of thousands of dollars in stocks in the deep red during historic market uncertainty?  No, not unless they knew it was going to pay off 30 minutes later.  It’s so fucking blatant. ",
                "It’s called insider trading.",
                "Maybe her son's GoFundMe got her in the mood to fleece people?",
                "That's about what I'd expect from the Majorly Traitorous Goblin",
                "Jon Ossoff should be loud and clear if he was part of the insider trading. MTG is vying for his senator seat and he needs to be clear.",
                "Of course she did. She’s as crooked as all the rest of the GQP creepers.",
                "The plan for project 2025 is literally insider trading. This is how it works;\n\n* Trump announces tariffs and the economy crashes. \n* Stocks are devalued.\n* Trump tells his cronies to buy.\n* People buy up stocks.\n* Trump announces the tariffs are off and the stock value goes up. \n\nThey will do this until regular citizens start cluing in to the pattern. THIS is where the actual grift happens. The last three bullet points? They aren't guaranteed to happen. The last time Trump does this, he will tell his cronies NOT to buy. American citizens and middle class investors will buy instead, but they will lose every red cent in a national rug pull.\n\nThe last step is where Donald Trump's cronies buy up the corporate holdings of every major American company that bankrupted during the last manufactured crisis, with the money they made during the repetitive cycle of the first step.",
                "Of course she did. She has the ethics and spine of a slug.",
                "What did you expect from this guy?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Attorney believes student visa for man living in Minnesota may have been revoked due to his political views",
            "external_url": "https://www.cbsnews.com/minnesota/news/marshall-minnesota-aditya-harsono-student-visa-revoked/",
            "upvotes": 1265,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/11/be362094-af08-4a81-a14e-15dde32f972d/thumbnail/1200x630/cea1b98c99842a2414c2f3c0260e362b/10p-pkg-student-detained-wcco7j42.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "Now they're targeting visiting students with differing political views. U.S. citizens are next.\n\nI fully expect Trump to declare the DNC a terrorist organization once he finishes seizing power.",
                "Political views and country of origin",
                "Land of the free..\n\n..Terms and conditions apply",
                "Harsono’s protest history shouldn’t justify a visa revocation—sounds like political targeting if the misdemeanor was the only issue",
                "That is what they said they’d do, yeah.",
                "Fascism has come to America. Already The Felon’s fascist regime is firing Federal employees for their political opinions, in particular for fidelity to the Constitution!",
                "Hah.\nYou think?\n MAGAmerica at its finest.\n What do you expect from an administration that revels in trying to dis-mantle all that right and good in the United States?\n We not only have to fight the administration, but, all the idiotic MAGA-sycophants fearing the loss of white authority to the encroaching mud peoples.\n We shall overcome.",
                "Ok they explain the dismissed charges, what were the others",
                ">Gad says the revocation was reported based on a misdemeanor conviction for damage to property from 2022. She believes his political views made him a target.\n\n>Harsono protested the murder of George Floyd and was arrested for unlawful assembly. Ultimately, that case was dismissed by the prosecuting attorney in the \"interest of justice.\"\n\nWait. Isn't that a violation of double jeopardy?",
                "America is no longer the land of the free. Now it is are the land of the free, but only if you think, act, and look like “us”. You can be free only if you are rich, and willing to sign away your integrity with your money."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Donald Trump signs order to 'make America's showers great again'",
            "external_url": "https://www.bbc.com/news/articles/cm2eeggyppzo",
            "upvotes": 11554,
            "date": "04/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/eb76/live/947e6d90-1600-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "What about America's growers?",
                "Another thing to try to distract us from the Dow losing over 1,000 points today. \n\nI’m exhausted",
                "He's ignoring due process. He's defying court orders. He's destroying the executive branch. Oh, and he's a twice impeached convicted felon. But, water pressure. Let's drop everything and talk about water pressure for rest of the day.",
                "> This served “a radical green agenda that made life worse for Americans”, the White House said, as Trump criticised the “ridiculous” amount of time he says it takes to wet his hair in the shower.\n\nOh c’mon, assuming he’s referring to the hair on his head, he has like…11 strands at most there, all hanging on for dear life. The aerosolized mist from a flushing toilet could render that wisp of straw sopping wet.",
                "He's always hated low-flow shower heads.  He made a similar executive order in his first term, which Biden cancelled.  So he's doing it again.\n\nWho cares that fresh water is getting more scarce with the progression of climate change.  Trump wants a powerful shower!",
                "I wonder where he had that idea?",
                "There’s this great onion article from about 25 years ago heralding passage of the “Universal Lawn Care Act” and it feels like Trump is just recycling this stuff now.",
                "My shower is fine bro can you focus more on not destroying our economy? Thanks",
                "Make showers golden again",
                "The most pathetically embarrassing president I've ever seen.\n\nThe cabinet meeting he had today was nothing short of North Korea vibes. Every single person was praising how amazing he was and how wonderful job he's doing. \n\nHe can do no wrong. Everything he does is perfect. He will no doubt run for a 3rd term because the republicans have no spine and don't believe the constitution applies to him."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Small plane crashes in Boca Raton, Florida; 3 people on board",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-boca-raton-florida-police/story?id=120717334",
            "upvotes": 5,
            "date": "04/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/46462407-f82b-4f1d-99ea-d056dd43a30d/boca-plane-3-ht-gmh-250411_1744384573305_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Wtf is happening with aviation recently",
                ">The Cessna 310R took off from Boca Raton Airport and was heading to Tallahassee International Airport, the FAA said. It was in the air for a little less than 20 minutes before it crashed, according to Flightradar24.\n\nNot a lot of details at the moment."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "US consumer sentiment, inflation expectations deteriorate sharply in April",
            "external_url": "https://www.reuters.com/markets/us/us-consumer-sentiment-inflation-expectations-deteriorate-sharply-april-2025-04-11/",
            "upvotes": 133,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "People can see the way Trump+cronies are utterly destroying, embezzling, manipulating the government and market right now. The uncertainties over tariffs are as bad as the tariffs themselves. We sense something is fake, scammy, a cheat.\n\nPeople do lose faith in systems.",
                "wdym mass government layoffs and a stock market crash might make people uncertain about the economy?\n\nAs someone who relies on government funding for his job in medical research, all of my non-essential expenditures are on hold indefinitely. Lots of money not going into my local economy hiring people to do things like remodeling my bathroom or doing landscaping projects.",
                "To the surprise of absolutely nobody",
                "Is this what MAGA looks like?",
                "The only good part of this will be rubbing it in the faces of my friends and family members who supported this nonsense administration that they are, in fact, fucking clueless and horrible judges of character.",
                "It's only going to be a lot worse next month. ",
                "The country is being looted by the wealthy and conservatives are cheering for it.",
                "From the \"envy of the world\" to the \"collapse of empire\" in 3 months",
                "It’s almost like the president put blanket tariffs on everyone and more than doubled the price of importing goods from one of our biggest trade partners or something.",
                "What do all you Maga minions say about this? Happy now?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Oklahoma woman stole $1.5 million from elderly women in romance scams, officials say",
            "external_url": "https://www.cbsnews.com/news/romance-scam-oklahoma-women-christine-joan-echohawk/",
            "upvotes": 69,
            "date": "04/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/977d6a49-93d7-44b9-b69e-cb4be2c3829b/thumbnail/1200x630/ce56598c74ec0d63b46410210d6602d4/gettyimages-1340975078.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "The most depressing part is the scammer seems to maybe have just been sending the money they made to yet another scammer.",
                "As someone who is getting older, though not elderly (yet), I think about this stuff. There is an army of people who make their living taking advantage of the elderly. I cringe at the stories my mother tells me about scam services she has purchased. People are constantly coming to her door to pressure her to let them do something to her house.\n\nAnd that is just in person. Don't get me started with online stuff she does. I told her if there is ANY doubt, assume it is a scam. Or check with one of us 'kids' first. Companies like Amazon and Microsoft don't give a shit about you and will not proactively contact you about any problem. And anytime you hear 'gift card', it is automatically a scam. Why would one of your friends want you to purchase a dozen gift cards, reveal the codes, take a picture and send it to them? It makes no sense. She was about 10 minutes away from doing it before her friend called her to say her email account was hacked.",
                "* calling herself \"Edward Lotts\" and saying the money was needed to pay off a debt that would allow \"Lotts\" to receive a $2 million payment... the victim sold her paid-off home to send Echohawk $600,000.\n* \"Jason Morris,\" ...needed money to buy supplies and fuel for an oil tanker in Turkey, the affidavit said. That victim allegedly sent over $100,000 in Apple gift cards, cash and money wires. \n* \"Glenn Goddard\" ...had known each other since college... The victim was convinced to pay $250,000 \"for expenses related to a financial portfolio he was sending her from Syria,\" ... The funds were sent via gift cards, cash and a cashier's check. \n* \"Jason Morris\" ...told the victim that the money would pay for an alleged oil vessel in Alaska that needed fuel to return to shore ...they could move in together once the payment was received and the ship was docked. That victim sent $40,000 in Apple gift cards and $170,000 in two wire transfers. "
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Israeli military organises tourist tours of newly occupied Syrian territory",
            "external_url": "https://www.theguardian.com/world/2025/apr/11/israeli-military-organises-tourist-tours-of-newly-occupied-syrian-territory",
            "upvotes": 58,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e4f6302824bc1c9f72d2eecba91d7b5858529f3/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=debc208a7e25cdd0d0e95622faeaa7bc",
            "top_comments": [
                "You would think if there was any country in the world that might be a bit sensitive to using the Nazi playbook, it'd be Israel, but obviously you'd be wrong.",
                "Imagine the reaction in r/worldnews if Russia did this.",
                "They really need a Disney over there or something else to do, yeah?",
                "\"We were invited! Punch was served!\"",
                "Yay, Safari! Do we get to shoot those \"wild beasts\" like them?\n\nPOS country being POS country.",
                "There might be method behind it. They send civilians into disputed territory in hopes of them getting killed, thus constructing a raison d'être to attack Syria even more.",
                "The headline doesn't match the text of the article.\n\nThey seem to be trying to conflate the Golan Heights with the territory occupied since the fall of the Assad regime.\n\nThe Golan Heights are contested, but even this article is saying that it's in the areas Israel Annexed in 1967 after Syria used the Golan Heights to bomb Israel.",
                "Did I miss something? When did Israel invade Syria?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "6 Nara students hospitalized after lightning hits schoolyard",
            "external_url": "https://japantruly.com/nara-students-hospitalized-after-lightning-hits-schoolyard/",
            "upvotes": 57,
            "date": "04/11/2025",
            "thumbnail": "https://japantruly.com/wp-content/uploads/2025/04/6-Nara-students-hospitalized-after-lightning-hits-schoolyard.jpg",
            "top_comments": [
                ">On the evening of April 10, a serious lightning strike incident occurred during soccer practice at Tezukayama Junior and Senior High School in[ Nara](https://en.wikipedia.org/wiki/Nara_(city)).\n\n\n\n>For instance, a similar occurrence last April in Miyazaki Prefecture resulted in 18 individuals being treated for lightning injuries during a soccer practice.\n\nWTF is going on with Japanese school soccer fields?",
                "Same happened at my old highschool.\n\nLiterally a bolt out of the blue struck the u/16 hockey team - one kid died, 5 were injured.\n\nSuch a freak accident, the kid was the kindest guy, he deserved so much more.",
                "Does any of them turn into the Flash?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Prada agrees to buy rival fashion house Versace in a deal valued at $1.4 billion",
            "external_url": "https://www.denver7.com/business/company-news/prada-agrees-to-buy-rival-fashion-house-versace-in-a-deal-valued-at-1-4-billion",
            "upvotes": 101,
            "date": "04/11/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/98fad85/2147483647/strip/true/crop/2953x1550+0+234/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F28%2F8a%2Fa94721514112925b38916edd6398%2Fap25100469233457.jpg",
            "top_comments": [
                "Just yet another example of market consolidation...",
                "Only rich people give a shit about this",
                "How is Versace only worth 1.4billion?",
                "does anyone actually care about these luxury brands? i couldn't give a fuck",
                "Imagine spending 30k+ on a handbag to carry the same thing a $15-30 handbag can. \n\nI love idiots who tote luxury brands.",
                "there is a massive following of luxury brands on tiktok and instagram. i typically see vuitton and chanel, and gucci sometimes. i wonder if that played a part in all of this. ",
                "Lol I can’t imagine who on earth would give a fuck about this",
                "How are you wine drunk soccer moms handling this? "
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Australia turns down China's offer to 'join hands' to fight US tariffs",
            "external_url": "https://www.reuters.com/business/australia-turns-down-chinas-offer-join-hands-fight-us-tariffs-2025-04-10/",
            "upvotes": 21,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Turns out, the enemy of my enemy is not necessarily my friend."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "British man's tattoo wrongly linked to Venezuelan gang in US government document",
            "external_url": "https://www.bbc.co.uk/news/articles/cly22xm8kx1o",
            "upvotes": 56,
            "date": "04/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50f1/live/108aaf50-16a3-11f0-b1b3-7358f8d35a35.png",
            "top_comments": [
                "They are deporting people for the same star tattoo like every emo punk kid i knew in high-school got? These people are morons. ",
                "Intentional idiocy and cruelty on full display"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Justice Department prosecutors dropping charges against man they accused of being MS-13’s ‘leader for the East Coast’ | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/09/politics/doj-dropping-charges-alleged-ms-13-leader-east-coast/index.html",
            "upvotes": 72,
            "date": "04/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25086486331704.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Villatoro Santos’ lawyer quickly moved to temporarily keep the federal charges pending against his client, saying that if the case were dropped, Villatoro Santos would be “immediately transferred to ICE custody.”\n\nHoly shit. That is one hell of a wrinkle to this story.",
                ">Now, just two weeks later, Trump’s Justice Department, without explanation, moved to dismiss the single federal charge he faced for unlawfully possessing a firearm. In a court filing, prosecutors said only that “the government no longer wishes to pursue the instant prosecution at this time.”\n\nThese aren't serious people. They're not governing with the intent to \"Make America Great Again\". Shower pressure. Greenland. Dropping all charges against (in their words) the “horrible, violent, worst of the worst criminals.” This isn't how serious people act when they're in power.",
                "Imagine selling your soul, neighbors, and county for this shit fuckery and some silver."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "NEW",
            "title": "Rep. Marjorie Taylor Greene bought stocks hit hard by Trump tariffs during the market meltdown",
            "external_url": "https://apnews.com/article/greene-stocks-conflicts-interest-restoration-hardware-tariffs-trump-f9922a970c837cb76dd8ddc01f20f51d",
            "upvotes": 1106,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's amusing her defense for buying the stocks hit hard by tariffs is ... \"tariffs are good\".",
                "Would any sane person just decide to purchase hundreds of thousands of dollars in stocks in the deep red during historic market uncertainty?  No, not unless they knew it was going to pay off 30 minutes later.  It’s so fucking blatant. ",
                "It’s called insider trading.",
                "Maybe her son's GoFundMe got her in the mood to fleece people?",
                "That's about what I'd expect from the Majorly Traitorous Goblin",
                "Jon Ossoff should be loud and clear if he was part of the insider trading. MTG is vying for his senator seat and he needs to be clear.",
                "Of course she did. She’s as crooked as all the rest of the GQP creepers.",
                "The plan for project 2025 is literally insider trading. This is how it works;\n\n* Trump announces tariffs and the economy crashes. \n* Stocks are devalued.\n* Trump tells his cronies to buy.\n* People buy up stocks.\n* Trump announces the tariffs are off and the stock value goes up. \n\nThey will do this until regular citizens start cluing in to the pattern. THIS is where the actual grift happens. The last three bullet points? They aren't guaranteed to happen. The last time Trump does this, he will tell his cronies NOT to buy. American citizens and middle class investors will buy instead, but they will lose every red cent in a national rug pull.\n\nThe last step is where Donald Trump's cronies buy up the corporate holdings of every major American company that bankrupted during the last manufactured crisis, with the money they made during the repetitive cycle of the first step.",
                "Of course she did. She has the ethics and spine of a slug.",
                "What did you expect from this guy?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pressed for evidence against Mahmoud Khalil, government cites its power to deport people for beliefs",
            "external_url": "https://apnews.com/article/mahmoud-khalil-columbia-university-trump-c60738368171289ae43177660def8d34?utm_source=Rantt+Newsletter&utm_campaign=2441672fca-EMAIL_CAMPAIGN_2025_04_10_11_05&utm_medium=email&utm_term=0_-2441672fca-572095729",
            "upvotes": 236,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Keep in mind the Whitehouse has openly stated they are looking into being able to deport US citizens. Attach this to their \"supposed\" ability to deport people for their beliefs, and I'm sure you can do the math.",
                "If the White House is so concerned about anti-Semitism, they certainly would immediately deport any foreign national who made a Nazi salute at a very large public gathering, correct?",
                "So freedom of speech, but not thought",
                "Really wish people would stop crying \"antisemitism\" any time someone speaks out against Israel. Calling out a country for their blatant war crimes is not antisemitism 🤦🏿‍♂️ nor is advocating for the safety and rights of innocent people being victimized",
                ">Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\n\nWhat power? There is no lawful means by which they may \"abridge the freedom of speech.\"",
                "Their evidence amounts to Rubio saying this guy is bad; this should be thrown out of court with prejudice",
                "Holy shit!  Thought crimes now?!  Minority Report has finally become reality.",
                "Is this the party of small government ?",
                "GOP is the party of higher taxes and anti-constitution."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Rep. Marjorie Taylor Greene bought stocks hit hard by Trump tariffs during the market meltdown",
            "external_url": "https://apnews.com/article/greene-stocks-conflicts-interest-restoration-hardware-tariffs-trump-f9922a970c837cb76dd8ddc01f20f51d",
            "upvotes": 1099,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's amusing her defense for buying the stocks hit hard by tariffs is ... \"tariffs are good\".",
                "Would any sane person just decide to purchase hundreds of thousands of dollars in stocks in the deep red during historic market uncertainty?  No, not unless they knew it was going to pay off 30 minutes later.  It’s so fucking blatant. ",
                "It’s called insider trading.",
                "Maybe her son's GoFundMe got her in the mood to fleece people?",
                "That's about what I'd expect from the Majorly Traitorous Goblin",
                "Jon Ossoff should be loud and clear if he was part of the insider trading. MTG is vying for his senator seat and he needs to be clear.",
                "Of course she did. She’s as crooked as all the rest of the GQP creepers.",
                "The plan for project 2025 is literally insider trading. This is how it works;\n\n* Trump announces tariffs and the economy crashes. \n* Stocks are devalued.\n* Trump tells his cronies to buy.\n* People buy up stocks.\n* Trump announces the tariffs are off and the stock value goes up. \n\nThey will do this until regular citizens start cluing in to the pattern. THIS is where the actual grift happens. The last three bullet points? They aren't guaranteed to happen. The last time Trump does this, he will tell his cronies NOT to buy. American citizens and middle class investors will buy instead, but they will lose every red cent in a national rug pull.\n\nThe last step is where Donald Trump's cronies buy up the corporate holdings of every major American company that bankrupted during the last manufactured crisis, with the money they made during the repetitive cycle of the first step.",
                "Of course she did. She has the ethics and spine of a slug.",
                "What did you expect from this guy?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Australian with working visa detained and deported on returning to US from sister’s memorial",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/11/australian-with-us-working-visa-detained-insulted-deported",
            "upvotes": 3606,
            "date": "04/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dfacc465ba70e74361c230b86c4a98b4172337c6/0_0_2500_1500/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=18eb35833620d4bb4642ca8225a920dd",
            "top_comments": [
                "I mean there's no better advertisement to never go to the US or work with them anymore. \nAs time passes, extreme behavior by US borders agents will be normalised and even encouraged. The few non cultist members will leave the job and all that will remain is horrible people banning people from the US for whatever reason they wish.",
                "> Guardian Australia asked “what grounds would be reasonable for someone to be denied entry to the US when they have a valid work visa” and whether it was “considered acceptable for any traveller to be called a ‘r-t--d’ by US border officials”.\n\n> A Department of Homeland Security media representative replied that the department “cannot answer questions on something we cannot verify the veracity of”.\n\n> “Just like I cannot confirm the existence of big foot.”\n\nWhat a horrible official response.\n\nJoking around while they're actively tearing apart the lives of innocent people. And they're living off of a salary paid for by my tax dollars.\n\nMakes me ashamed to be American.",
                "What surprises me (although I don't know why it should) is just how quickly all of these TSA, Border Patrol, ICE,  Homeland Security, etc. people turned into TOTAL FUCKING ASSHOLES the minute they got given the green light.\n\nIt's like they were all just biding their time, then BAM!, Nazis.",
                "U.S. ICE agents are fancying themselves to be paramilitarians who just do whatever they want now.\n\nThese deportees are undoubtedly forced to leave behind valuables in the U.S. so I also have to wonder if there will be (or already is) a transition to a theft racket by ICE agents or those connected with them.",
                "Yeah don't go to the US...",
                "Vote for a clown and you get a circus.",
                "visit the US?….straight to jail\n\nLeave the US and come back? Also straight to jail",
                "A family friend of mine has a similar experience. He has a green card and has lived in the US for 20 years. His wife is American, his kids are American. The family went to the US Virgin Islands for vacation, and on the way back he was detained in Miami for having a green card. Then he was sent to Peurto Rico to be held for a few days. Then he was flown back to Miami. Then he was given a choice of being sent to jail to await his court date, or be flown to Canada.",
                "The USA has a *lot* of cool shit that I will now probably never get to see.",
                "Way to lose friends and isolate  people."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "US egg prices increase to record high, dashing hopes of cheap eggs by Easter",
            "external_url": "https://apnews.com/article/egg-prices-bird-flu-cpi-b0ded420e9f7c0a707277c9c63396a76",
            "upvotes": 3591,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Time to dye those potatoes 🥔.",
                "Honestly this is what you get for electing a fucking moron. You wanted cheap egg prices - you should have elected the decent human instead of the fascist.",
                "Wait, I thought fuckface said egg prices went down, even though I grocery shop and see egg prices every day? Fuckin liars.",
                "I mean eggs went down $5 per 3 dozen for me, but they were probably the highest in cali.  $23.99 -> $18.99 for 36 eggs....",
                "This just gave me a flashback to 2020 when covid would be over by Easter lmao I forgot about that",
                "Upon whose face doth the egg lie?",
                "Trump and his cabinet in 4K just straight up lying about the price of eggs yesterday.",
                "The prices are not going to come back down, not as low as they were anyway. Profits are going to be higher than ever this year.",
                "Yeah they thought they’d guy who said ‘they’re eating the dogs’ could fix that issue.\n\nOne country with a staggering proportion of idiots in the population.\n\nAmericans, the rest of the world already thought ‘ya’ll’ were mostly as smart as a bag of hammers, now we know we’re right.",
                "Time to change our traditions. No more Easter eggs, cue THE EASTER POTATO 🥔!\n\nEdit: of course the potatoes will be imported from Russia"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Social Security lists thousands of living immigrants as dead to prompt them to leave, AP sources say",
            "external_url": "https://apnews.com/article/living-immigrants-dead-social-security-numbers-trump-c10737cbe36e3108fb244a555777d880",
            "upvotes": 416,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "isn't this falsifying govt records....  which used to be a crime.",
                "So the plan is to declare them dead then accuse social security of having dead people listed.\n\nGuess that conspiracy has finally completed it full circle of conservatives making it reality",
                "The government listing people it doesn't like as dead, that surely won't lead to any bureaucratic catastrophes",
                "except all these \"illegals\" were Paying into Social Security that they will never recieve effectively helping prop up a failing system. Now without them paying there is no way the current Working class can keep paying Social security for the current Generation currently withdrawing. \n\nIt's all in an effort to say SS is a Failed experiment and scrap it. But do you think I'll get a Refund for the last 25 years I've put into it and Never get to file because they'll destroy it before i retire.",
                "This is like in the movie \"Office Space\" instead of firing a guy they just stop paying him, hoping he'll leave",
                "This happened to my parents even though they’ve been in America for 30 years at this point. Was odd to see the entire family listed as dead lmao.",
                "Yet more used-*The-Handmaiden's-Tale*\\-as-a-guide-not-a-warning, moves from the administration.",
                "When they say “immigrants” please understand that they can say the ssn showed them as dead but who is deciding what is an immigrant especially if they can also decide who has an active ssn",
                "This is bone-chilling. Cause if someone's legally dead anyway, forcibly ending their lives isn't murder, is it?",
                "Ok, so why can I stop paying my federal taxes? We should only be paying to the state we live in anyway. If our government isn't going to work for us, why should we pay them taxes for them to just turn around and give it to their rich asshole buddies? I want to pay for veteran health care, not give psychopaths a handout."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Montana farmers see Canadian trade dry up due to tariffs",
            "external_url": "https://nbcmontana.com/news/local/montana-farmers-see-canadian-trade-dry-up-due-to-tariffs",
            "upvotes": 2914,
            "date": "04/11/2025",
            "thumbnail": "https://nbcmontana.com/resources/media2/16x9/414/986/0x5/90/e9768de1-abd5-433a-85d3-ba6b88681cde-farmer.JPG",
            "top_comments": [
                "Well they can just pull themselves up by their bootstraps/find a new job/move somewhere else/pray to Jesus about it.",
                "Promises Made, Promises kept ❤️. Getting exactly what they voted for! Not many presidents follow through! Trump went above and beyond right MAGA farmers? 🙌🙏🦅",
                "Montana had the best representation in the Senate with John Tester, who was ACTUALLY a Montana Farmer, but they voted in a Minnesota Trust Fund Baby who has rubber stamped the destruction of the State.  This was a decent purple state before MAGA.",
                "There's a loooot of assholes in this world that really think you can just do what you want and be a massive prick and its fine because you're American",
                "Maybe Montana farmers shouldn’t have overwhelmingly voted for an orange fascist..? 🤷 \n\nUs Canadians don’t look kindly on that. 🇨🇦✊",
                "The find out stage better humble these fuckers.",
                "Cue the corporate agriculture companies ready to swoop in when the farms go bankrupt. Not so sure Trump will be in the mood for subsidies this time around.",
                "Hey Montana, you voted for this! Enjoy the consequences of your actions.  Even if tariffs are removed, please understand that Canada has no interest whatsoever in doing business with you anymore.",
                "Oh no, the leopards are eating MY face after I voted for the leopards eating faces party",
                "Oh well... Enjoy your winning and being Great Again Montana."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "US fires Greenland military base chief for 'undermining' JD Vance",
            "external_url": "https://bbc.com/news/articles/creq99l218do",
            "upvotes": 27702,
            "date": "04/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bfc8/live/a395f500-16b9-11f0-a455-cf1d5f751d2f.jpg",
            "top_comments": [
                "This is the statement she was fired for: \"I do not presume to understand current politics, but what I do know is the concerns of the US administration discussed by Vice-President Vance on Friday are not reflective of Pituffik Space Base.\"\"",
                "Is this the same JD Vance who likes to lecture Europe on freedom of speech?",
                "Slapped arse VP basically says that having an opinion that differs from the party line is misconduct. Welcome to the 'land of the free'.",
                "They know she wouldn't obey the order if they ask them to take over the island.",
                "It’s funny that they say it is because she was undermining the chain of command by insulting Vance, when Vance isn’t in her chain of command.",
                "Integrity will not be tolerated.",
                "There has never been a worse administration in the history of our country.",
                "I’m not sure how one would Undermine Vance more than Vance.\n\nMotherfucker dragged a whole camera crew to show off how he doesn’t know how to order donuts and then released that video.\n\nGuy stands next to his Indian wife talking about how immigrants are destroying the nation.\n\nThe whole Admin’s a clown show, but JD’s the smaller, even stupider clown that can’t get out of the car without falling head first into an open sewer.",
                "Oh for fuck's sake.\n\nHello Americans. I am from Turkey. Everything that has been happening so far feels so familiar it is painful. It is almost like you lot just elected Erdoğan. The only difference is that your idiots are pretty much speedrunning this bullshit instead of spreading it over 20 or so years.\n\nAlmost like they are sharing notes. Fucking hell...",
                "It’s traditional for a fascist regime to purge any members of the military who don’t show 100% loyalty to that regime"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Attorney believes student visa for man living in Minnesota may have been revoked due to his political views",
            "external_url": "https://www.cbsnews.com/minnesota/news/marshall-minnesota-aditya-harsono-student-visa-revoked/",
            "upvotes": 1265,
            "date": "04/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/11/be362094-af08-4a81-a14e-15dde32f972d/thumbnail/1200x630/cea1b98c99842a2414c2f3c0260e362b/10p-pkg-student-detained-wcco7j42.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "Now they're targeting visiting students with differing political views. U.S. citizens are next.\n\nI fully expect Trump to declare the DNC a terrorist organization once he finishes seizing power.",
                "Political views and country of origin",
                "Land of the free..\n\n..Terms and conditions apply",
                "Harsono’s protest history shouldn’t justify a visa revocation—sounds like political targeting if the misdemeanor was the only issue",
                "That is what they said they’d do, yeah.",
                "Fascism has come to America. Already The Felon’s fascist regime is firing Federal employees for their political opinions, in particular for fidelity to the Constitution!",
                "Hah.\nYou think?\n MAGAmerica at its finest.\n What do you expect from an administration that revels in trying to dis-mantle all that right and good in the United States?\n We not only have to fight the administration, but, all the idiotic MAGA-sycophants fearing the loss of white authority to the encroaching mud peoples.\n We shall overcome.",
                "Ok they explain the dismissed charges, what were the others",
                ">Gad says the revocation was reported based on a misdemeanor conviction for damage to property from 2022. She believes his political views made him a target.\n\n>Harsono protested the murder of George Floyd and was arrested for unlawful assembly. Ultimately, that case was dismissed by the prosecuting attorney in the \"interest of justice.\"\n\nWait. Isn't that a violation of double jeopardy?",
                "America is no longer the land of the free. Now it is are the land of the free, but only if you think, act, and look like “us”. You can be free only if you are rich, and willing to sign away your integrity with your money."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "China strikes back with 125% tariffs on U.S. goods, starting April 12",
            "external_url": "https://www.cnbc.com/2025/04/11/china-strikes-back-with-125percent-tariffs-on-us-goods-starting-april-12.html",
            "upvotes": 4441,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130446-17443187092025-04-10t205242z_1564031578_rc28vdaqwvty_rtrmadp_0_usa-trump-tariffs.jpeg?v=1744318760&w=1920&h=1080",
            "top_comments": [
                "> “Even if the U.S. continues to impose higher tariffs, it will no longer make economic sense and will become a joke in the history of world economy,” the statement said, according to a CNBC translation.\n\n\nThat statement is going to cause a major tantrum in the administration.",
                ">“With tariff rates at the current level, there is no longer a market for U.S. goods imported into China,” the statement noted, adding that “if the U.S. government continues to increase tariffs on China, Beijing will ignore.”\n\nThey preemptively boxed Trump into a corner, lol.",
                "It doesn't even matter what the tariff % raises to, they're already high enough that trade has ceased. They're always going to stay just lower than the US tariffs to make clear they are not the aggressor here. But Trump will keep raising them as long as he doesn't have the last word. Someone needs to call his bluff, and I'm glad China has the balls and poker hand to do it. It's not even a matter of who blinks first, because it's 100% going to be Trump, it's just a matter of how much damage he does for how long.",
                "Well, congratulations are in order, US.\n\n\nYou made China, South Korea and Japan sit at the table and start to negotiate a trade deal between them.\n\n\nNot bad. 😁🫢",
                "It's an effective trade halt between China and the US. \n\nIn 2024, the US exported $143.5 billion in goods to China and imported $438 billion from China.\n\nRecession is basically guaranteed at this point. We'll be lucky if it's not a depression.",
                "The America led clownshow continues.\n\nGood job, idiots.",
                "Future comedians will use 21th century history as research material.",
                "That fucking clown in the whitehouse is going to bankrupt us like one of his casinos.",
                "Yay, can't wait to pay $100 for something that costs $1 to produce. Proud to be American.",
                "You know who I actually feel sorry for, the low level trade officials that have to communicate and enforce these changing by the hour rules, must be absolute chaos."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Fast fashion items overwhelm Sweden’s recycling centres",
            "external_url": "https://www.rte.ie/news/world/2025/0411/1507059-sweden-fast-fashion/",
            "upvotes": 192,
            "date": "04/11/2025",
            "thumbnail": "https://img.rasset.ie/0022422d-1600.jpg",
            "top_comments": [
                "We need to rethink our continued purchase of utter junk from SHEIN to Temu, and of course Sweden’s great gift to the world H&M - which was a main starter of this trend",
                "> Swedes throw away 90,000 tonnes of textiles per year, or 10kg per person, according to the Swedish Society for the Conservation of Nature.\n\n> The EU average is 19kg\n\nI'm maybe at 1Kg max, considering year where I don't even throw any clothes are common, I'm not even sure it's worth for me to talk in year. \n\nWTF is wrong with people.",
                "Pretty much every time I walked pass clothing shops and just wondering who the fuck is buying all these clothes.",
                "Fast fashion should be banned.  Producing clothes is agriculturally intensive, industrially intensive, and labour intensive.  \n\nClothes should be made to last.  Fashion should not be something so ugly it has to be changed every 6 months.",
                "Ban fashion dictators",
                "> 2,500 litres of water and one kilogramme of chemicals are needed to make a T-shirt that weighs 135 grammes\n\nFuck me, humans are a cancer on Planet Earth.\n\nI don't even want to think about how much resources was just wasted by me submitting this comment.",
                "Nobody needs fast fashion. Let's stop wasting precious resources on bullshit.",
                "I worked at H&M for a while, half of the stuff I saw coming in had button with one stitch keeping them on. I bought clothing there with my employee discount pretty often, my pants buttons always needed the button re-sewn after about a week or two. \n\nI don’t know why anyone bought it. The employee discount made sense for me, but I never bought there again after I left (no bad blood with the company either, their product just sucks)\n\nThey got great benefits though",
                "So, what is \"Fast Fashion\"? I have heard the term and understand its trendy clothing produced in mass quantities and then generally doesn't get purchased so its just destroyed, but what is an example?"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/11/2025 16:10:36 UTC"
}