{
    "posts": [
        {
            "category": "HOT",
            "title": "Judge to order DHS and State Department to not make any changes to Harvard's student visa program indefinitely",
            "external_url": "https://www.cnn.com/us/live-news/harvard-graduation-international-student-ban-hearing-05-29-25#cmb9hkpgk00053b60yqd9fea4",
            "upvotes": 9672,
            "date": "05/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2217503072.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These rulings and how they are enforced will define the future of the country\n\nEdit: just because trump is president does not change the law or the intent of the law. It is not thrown out the window because the current admin doesn't like it. Yall need a high school government class.",
                "It’s wild watching the right scream JUDICIAL COUP  when it’s literally just the constitution’s system of checks and balances working in real time.",
                "Trump is just mad his kid was rejected by Harvard.",
                "Gotta love how the conservative position to \"no, you can't just make orders and declarations like a king, there are laws you need to follow to get what you want to achieve\" is screeching about a Judicial Coup and demanding that every action immediately be referred to SCOTUS regardless of whether or not there's a question of constitutionality in place like they're the backstop pet court for any of the dumb shit a judge stops Trump from doing.",
                "Judges provide the ultimate law when they agree and are politically charged suggestions when they don't. \n\nThey're merely a tool for control for this admin, not a guide on what they can/can't do.",
                "Why limit it to Harvard? No changes to ANY student visas programs.",
                "You know picking a fight with a school most resposible for driving the US justice system, politics, and in general the laws of the country. A school that also has a VERY high allumni pride associated with it on par with religion/nationality....not a great idea.",
                "Baron wasn’t smart enough to get in to Harvard so now the whole university has to suffer.",
                "Fucking waste of everyone's time and money.",
                "Huh, it's almost like you can't rule by executive order, who knew?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 5493,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                "“I need you to be activist judges to stop the activist judges”",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court.",
                "Supreme Court care more about their money than pleasing Trump. I could see them upholding the ruling."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 5764,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                "This literally made my stomach turn. Wtaf?!",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "I found out one of my childhood friends got all fucked up on meth & got caught trying to sell his kid.\n\nWho knew Northern MN and S. Africa had so much in common.",
                "As a South African I’m disgusted by this woman’s actions and how she played to courts and society in the beginning. \n\nKarma will not be kind to her. \n\nThe community needs to find the muti doctors and do kangaroo court with them as the police are not effective."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 2002,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108125272-17436250942025-04-02t201501z_1742951148_rc2wpda86pvu_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743709206&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "This ruling won't last long, but the damage sure will",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines.",
                "Trade will still be negatively impacted\n\nAllies will look elsewhere for guidance\n\nConsumers will not invest in the economy\n\nOutlooks for the stock market looks dim",
                "Our country is a fucking joke",
                "Absolutely fucking insane. The tariffs violate the constitution as congress has the authority, not the traitor in chief"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 1306,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!",
                "I thought this was an /r/brandnewsentance post.",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 2250,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Boy who cried wolf, eaten by wolves.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "If this goes to the Supreme Court, will they favor Trump again?",
                "It's pretty telling how poor of a decision it was to impose tariffs when markets rise back up after that decision is rolled back. Again, for those who thought Trump was fit for office because he's a businessman - just because you do business, does not mean you are good at it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israel announces major expansion of settlements in occupied West Bank",
            "external_url": "https://www.bbc.com/news/articles/c1j5954edlno",
            "upvotes": 1761,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/321e/live/0cfc3ea0-3c85-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Apparently you can rename ethnic cleansing \"settlement\" and get away with it scot-free",
                "When Russia does it it's an invasion. When Israel does it it's a \"settlement\".",
                "[If I don't steal it, someone else is gonna steal it](https://youtu.be/KNqozQ8uaV8?si)",
                "More illegal expansion, if only people knew this was coming for years.  Oh, wait…",
                "to the surprise of absolutely no one.",
                "I'm sure this will make Israel safer and will result in no action taken by Palestinians and their sympathizers. Fortunately we know that Israel is an incredibly moral country whose one and only concern is counter-terrorism and keeping the population safe from the inherently evil Palestinians in a completely reasonable manner where every casualty taken by Palestinians is their fault.\n\nThat's what the WorldNews sub tells me anyway!",
                "They're really trying to eliminate any pathways towards peace.",
                "Let's not sanitize the facts, shall we?\n\n\"Isreal announces major expansion to invasion of West Bank and theft of Palestinian homes and belongings\" is much more accurate.",
                "Anyone else hearing Echoes of Lebensraum in this policy?",
                "They never wanted peace.  They always wanted the land.. I’ve been there and they treat Palestinians like third classes center or prisoners. If you go back over the history of it, Israeli always treated the Palestine’s like shit in order to force them out from day one. All the political theater has just been a trick to have you look one way as they steal the land from them another way."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russian troops massing in north, says Ukraine after drone offensive",
            "external_url": "https://www.thetimes.com/world/russia-ukraine-war/article/drone-attack-strike-news-rfjqt2f67?utm_source=substack&utm_medium=email",
            "upvotes": 998,
            "date": "05/29/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2Fcf08e2b2-90d2-419a-aced-156e6ca03d44.gif?crop=800%2C450%2C0%2C0&resize=1200",
            "top_comments": [
                "Good time for some HIMARS hors d’oevres",
                "Actual Russian troops, or more north Koreans?  I'd say prisoners and dissidents but I'm sure they have all been sent to the meat grinder already.",
                "Ukraine attacking weapons and weapon parts facilities. \"No deaths or injuries were reported.\"\n\nMeanwhile Russia attacking population centers, power plants, civil infrastructure and shelters.",
                "Sounds like it's summer offensive time.\n\nHopefully HIMARS do a great job of converting these invaders to red mist.",
                "I expected this to happen earlier. Russia needs to break the stalemate for political reasons and the longer the war progresses the less likely such an offensive is likely to succeed so I expect them to do a summer offensive which will very likely fail and cost the Russians huge losses in return for tiny amounts of gained ground.\n\nOn the other hand Ukraine cannot attack either without significantly more western aid.",
                "They want to invade the balitc countries?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US cancels more than $700 million funding for Moderna bird flu vaccine",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cancels-more-700-million-funding-moderna-bird-flu-vaccine-2025-05-28/",
            "upvotes": 30532,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How does the Executive Branch keep cancelling Congressionally-appropriated funds with no consequences?",
                "Really don’t get how they can just decide to not pay things already contracted",
                "> Moderna in January was awarded $590 million by the Biden administration to advance the development of its bird flu vaccine, and support the expansion of clinical studies for up to five additional subtypes of pandemic influenza\n\nCancelled by the Trump administration just 4 months later.",
                "The pharmaceutical industry will respond with - checks notes - massive donations to current and future Republicans, including Trump.",
                "Dumb bastards.  An ounce of prevention is worth a pound of cure.",
                "Is this going to bring down the price of chicken?",
                "Why is the Trump administration so pro-bird flu?",
                "in other news, the next pandemic is highly predicted to be the bird flu.",
                "Known pandemic mass murderer makes it so he can kill again. More at 11.",
                "Then when there's another bird flu epidemic Maga is going to be scratching their heads and bend over backwards not to blame trump"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Elon Musk bids farewell to White House but says Doge will continue",
            "external_url": "https://www.bbc.com/news/articles/cz9y4exj822o",
            "upvotes": 7215,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4149/live/bb4c3ee0-3c28-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Is this why he disabled community notes?",
                "To whatever extent \"leaving\" counts when you still have your aides appointed to the highest levels of government agencies",
                "The amount of times I’ve seen rich people come into an organization, fuck things completely up, fire the people who were trying to save them, ruin lives and walk away like they just won the superbowl is too damn high.",
                "Yeah but only because he has to, his status as a “special government employee” grants him only 130 days before he needs to leave and his time is up. This has to happen, it’s not voluntary.\n\nI would be surprised if this is the last Elon has to do with this administration. It’s a presidency he bought and paid for, after all.\n\nIn the meantime, fuck Tesla, fuck SpaceX, fuck X, and fuck Donald Trump.",
                "Does that mean Big Balls is in charge now?",
                "[removed]",
                "Look at this clown trying to save face:\n\n*The BBC understands that the White House will begin \"offboarding\" Musk as a special government employee on Wednesday night.\nMusk's exit comes after he said he was \"disappointed\" with Trump's budget, which proposes multi-trillion dollar tax breaks and a boost to defence spending.\nThe SpaceX and Tesla boss said in an interview with BBC's US partner CBS that the bill would increase the federal deficit, adding that he thought it \"undermines the work\" being done at Doge.*",
                "Timescale on Trump claiming he didn't know him?",
                "This fuckin schmuck will be back for midterms writing checks and pressuring people, fuck these stories about him leaving, theyre cover for his damaging actions that help weaken our country and our social safety net. Fuck billionaires, take their money now.",
                "Don’t let up on his businesses, he stole our information, got his government contracts, he got what he needed and is trying to walk away. Don’t let up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man who blamed exposure to far-right content gets 3 years for threatening election officials",
            "external_url": "https://apnews.com/article/election-officials-threat-colorado-years-prison-a50f82a9fbad6ebf72eafef189a06f38",
            "upvotes": 65,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“It wasn’t my fault - I listened to people who claimed they’re the party of personal responsibility- how can *I* be blamed for my actions?”",
                ">A judge sentenced a man who blamed exposure to far-right extremist content for motivating his online threats to kill Democratic election officials in Colorado and Arizona to three years in prison Thursday, saying the penalty for such “keyboard terrorism” needed to be serious enough to deter others from doing the same.\n\n>U.S. District Judge S. Kato Crews said that threats against election and other government officials are on the rise and people need to remember that differences need to be worked out through the democratic process, not violence.\n\n>“The public must not accept this as the norm,” he said in handing down the sentence for Teak Ty Brockbank.\n\n>Brockbank pleaded guilty in October to making threats between September 2021 and August 2022 against Colorado Secretary of State Jena Griswold and former Arizona Secretary of State Katie Hobbs, who is now governor. He also threatened a Colorado judge and federal agents.\n\n>Brockbank apologized in court for his “ugly posts” and said he has turned away from the fear, hate and anger that he found online that derailed his life.\n\n>Federal prosecutors sought three years in prison for Brockbank. He asked for leniency, saying he made the posts when he was drinking heavily, socially isolated and spending his evenings consuming conspiracy theories online. Jonathan Jacobson, a Washington-based trial attorney for the Justice Department’s public integrity section, pointed out that the threats continued during a period when Brockbank wasn’t drinking.\n\n>Brockbank posted online that Colorado’s top election official should “Hang by the neck” and her former counterpart in Arizona should also be put to death.\n\nKeyboard warrior or not, the nutcase deserves what he got, and then some.",
                "Trump will pardon him.  As long as he broke the law to protect the fascist state trump will pardon him."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Smokey Robinson sues former housekeepers for defamation over rape allegations",
            "external_url": "https://www.ctvnews.ca/entertainment/article/smokey-robinson-sues-former-housekeepers-for-defamation-over-rape-allegations/",
            "upvotes": 17,
            "date": "05/29/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/WKGO26AOXMPIW4HIRBJRW3OYNA.jpg?smart=true&auth=e6ee7c1bacdd81a6670d168464ff64a19645d3b9717d5d495509a7cec1675a68&width=1200&height=630",
            "top_comments": [
                "A*ttorneys for the former housekeepers, said in a statement that the defamation suit “is nothing more than an attempt to silence and intimidate the survivors of Mr. Robinson’s sexual battery and assault. It is a baseless and vindictive legal maneuver designed to re-victimize, shift blame and discourage others from coming forward*.”\n\nThe Robinsons counter-suit is just a way to silence people who sue. Robinson's spending money on these housekeepers has zero to do with proving himself innocent of sexual assaults,  That's just more bull.",
                ">The filing says the women “stayed with the Robinsons year after year,” vacationed with them, celebrated holidays with them, exchanged gifts with them, asked for tickets to his concerts, and sought and received help from them including money for dental surgery, financial support for a disabled family member, and “even a car.”\n\nYeah because an alleged predator never, ever had duplicitous behavior or acted generously toward one of their victims."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The Last Five-Speed Manual Is Dead",
            "external_url": "https://www.motor1.com/news/761124/last-five-speed-manual-dead-us/",
            "upvotes": 74,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I beg to differ. My ‘93 Nissan is still plugging along",
                "Plus there are still 6-speed manuals around…",
                "EVs were going to kill manuals no matter what. It just happened before EVs finished the job",
                "Customers are speaking with their wallets. As much as enthusiasts love the manual, it would appear the average customer doesn't care. Sucks",
                "Oh no the new manuals have overdrive. Um six speeds still plugging along ",
                "Id rather learn to drive a stick than be stuck with one of Nissans automatic transmissions.",
                "Terrible news, manuals are so much more fun but offered in so few vehicles in the U.S. Sometimes you just have to have fun with the stick, especially when it has a nice comfortable protective cover over the knob to get full control as driving was intended, nobody likes a premature gear shift",
                "This is the last Nissan manual.  VW still offers it.",
                "That sucks. I recently bought a 2017 Civic Si with a 6 speed manual and I love it. Kinda annoying in traffic, but so fun to drive. I don’t want to go back.",
                "I mean, is there any advantage of a 5 speed over a 6 speed besides lower production cost anyways?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 111,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 and he remarried two years later to someone 30 years younger. \n\nLyon then had 6 kids with two different women. His first wife died in 1921 and he remarried nine years later to someone 35 years younger. \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 1993,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108125272-17436250942025-04-02t201501z_1742951148_rc2wpda86pvu_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743709206&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "This ruling won't last long, but the damage sure will",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines.",
                "Trade will still be negatively impacted\n\nAllies will look elsewhere for guidance\n\nConsumers will not invest in the economy\n\nOutlooks for the stock market looks dim",
                "Our country is a fucking joke",
                "Absolutely fucking insane. The tariffs violate the constitution as congress has the authority, not the traitor in chief"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Haribo recalls bags of sweets in Netherlands after cannabis found",
            "external_url": "https://www.bbc.com/news/articles/c5yx2lynznpo",
            "upvotes": 361,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/02af/live/3944f7e0-3c8a-11f0-bd8d-df41784e9c1e.jpg",
            "top_comments": [
                ">It is not clear whether the contaminated products are genuine Haribo bags or fake.\n\nKinda important",
                ">Several people, including multiple members of one family, reported feeling unwell after eating from a 1kg pack of Haribo Happy Cola F!ZZ.\n\nHappy Cola F!ZZ is the only gummy I really like.",
                "Oh no! Where have these bags been delivered to? Gotta know how to avoid them at any cost. \n\nI really gotta know.",
                "Before reading the article: “is this only in the Netherlands?”\n\nAfter reading article: “Damn it…”",
                "I know everyone is gonna make jokes but even if you smoke weed accidentally taking a large edible dose when you don't expect to will easily ruin a day. If you are not used to canabis it can def be traumatic to be dosed like that.",
                "This is crazy depending on dosage it will really fuck unknowing people up.\n\nFor reference I used to smoke a LOT but not anymore due to smoking giving me anxiety when the high hits.\n\nSo now I use edibles so I can gradually get high to not get the all at once rush like smoking does. I have 0 tolerance because I don't do it that much.\n\n1 gummie bear I buy usually contains 50mg THC this is a fuckload for someone who doesn't have a tolerance it will put you on your ass. I was a mess the first time I ordered them thinking I could handle it, I could not it was intense but I was familiar with what was going on.\n\nI now cut the gummies into quarters and it's nice and relaxing.\n\nImagine if you were an unsuspecting person whos never known the effects of THC and now you are doing said 50mg. You would be fucked and think you are dying. This is a crazy fuck up.\n\n\nTldr: if you've never tried thc and think damn I wish I got some, that would be cool, no you'd probably be comatose or worse have a panic attack and end up in the emergency room.",
                "Astoundingly, not the worst thing ever found in a bag of Haribo gummies / colon cleansing sugar free spawn of Satan bears.",
                "I just assumed that they were the secret prize, just like the ones that used to be in cereal boxes.",
                "How to sell Haribo (fast)",
                "I wish Haribo made cannabis gummies I could get! The edible market is really hit and miss in the Midwest."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 1307,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!",
                "I thought this was an /r/brandnewsentance post.",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 5495,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                "“I need you to be activist judges to stop the activist judges”",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court.",
                "Supreme Court care more about their money than pleasing Trump. I could see them upholding the ruling."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man charged over Liverpool parade incident",
            "external_url": "https://news.sky.com/story/man-charged-over-liverpool-parade-incident-13375642",
            "upvotes": 234,
            "date": "05/29/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-paul-doyle-liverpool_6930591.jpg?20250529173146",
            "top_comments": [
                "\"With causing grievous bodily harm with intent, wounding with intent to cause grevious bodily harm, attempting to cause grevious bodily harm, and dangerous driving.\"\n\nWhat a total knob.",
                "The court case will all come down to whether he can convince a jury he genuinely felt in fear. He shouldn't have been there and he was reckless enough to injure so many innocent people that I'd like to think some, if not all, the charges will lead to convictions.",
                "What a cunt. And the reporting should be about what a massive loser with road rage he is, not which holidays he's been on recently...",
                "Why the fuck do I care where he’s been on holiday? Get him in the dock.",
                "Why does where he has travelled to lately have any impact whatsoever on what happened? Can anyone explain?",
                "Just a cheeky little line or two never hurt anyone ....",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge to order DHS and State Department to not make any changes to Harvard's student visa program indefinitely",
            "external_url": "https://www.cnn.com/us/live-news/harvard-graduation-international-student-ban-hearing-05-29-25#cmb9hkpgk00053b60yqd9fea4",
            "upvotes": 9685,
            "date": "05/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2217503072.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These rulings and how they are enforced will define the future of the country\n\nEdit: just because trump is president does not change the law or the intent of the law. It is not thrown out the window because the current admin doesn't like it. Yall need a high school government class.",
                "It’s wild watching the right scream JUDICIAL COUP  when it’s literally just the constitution’s system of checks and balances working in real time.",
                "Trump is just mad his kid was rejected by Harvard.",
                "Gotta love how the conservative position to \"no, you can't just make orders and declarations like a king, there are laws you need to follow to get what you want to achieve\" is screeching about a Judicial Coup and demanding that every action immediately be referred to SCOTUS regardless of whether or not there's a question of constitutionality in place like they're the backstop pet court for any of the dumb shit a judge stops Trump from doing.",
                "Judges provide the ultimate law when they agree and are politically charged suggestions when they don't. \n\nThey're merely a tool for control for this admin, not a guide on what they can/can't do.",
                "Why limit it to Harvard? No changes to ANY student visas programs.",
                "You know picking a fight with a school most resposible for driving the US justice system, politics, and in general the laws of the country. A school that also has a VERY high allumni pride associated with it on par with religion/nationality....not a great idea.",
                "Baron wasn’t smart enough to get in to Harvard so now the whole university has to suffer.",
                "Fucking waste of everyone's time and money.",
                "Huh, it's almost like you can't rule by executive order, who knew?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 2006,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108125272-17436250942025-04-02t201501z_1742951148_rc2wpda86pvu_rtrmadp_0_usa-trump-tariffs.jpeg?v=1743709206&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "This ruling won't last long, but the damage sure will",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines.",
                "Trade will still be negatively impacted\n\nAllies will look elsewhere for guidance\n\nConsumers will not invest in the economy\n\nOutlooks for the stock market looks dim",
                "Our country is a fucking joke",
                "Absolutely fucking insane. The tariffs violate the constitution as congress has the authority, not the traitor in chief"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge: Harvard researcher charged with smuggling frog embryos was unlawfully detained by ICE",
            "external_url": "https://apnews.com/article/immigration-russia-frog-embryo-harvard-0a409edae29bd98ce4fd4cdb6c6a0685?utm_source=copy&utm_medium=share",
            "upvotes": 1307,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is amazingly stupid and cruel.  \n  \nShe brought back non-living embryo sections from France for her groundbreaking research in embryo development.\n\nShe's currently in detention in Louisiana.",
                "Were the embryos hidden in a fake shaving cream can?",
                "I feel incredibly sorry for this woman.  \n\nImagine that you are one of the greatest minds on the planet, and then for a month or two, you are made to deal with and be around complete and utter morons.  People that have difficulty tying their shoe laces in the morning.  ICE workers.  \n\nIt must be incredibly difficult to deal with.",
                "I'm sure she will be enthusiastic about remaining in the United States after being unlawfully detained at the border for bullshit reasons.",
                "Frog embryos, obviously a hardened criminal",
                "It's almost like ICE is a criminal organization...",
                "All of ICE is unlawful",
                "Do you guys want Jurassic Park? Because this is how you get Jurassic Park.  \n\nJokes aside - Abolish ICE!",
                "I thought this was an /r/brandnewsentance post.",
                "Methinks this has everything to do with her being female, foreign-born, and working for a university which the administration is currently harassing for not being sufficiently submissive to its demands, and very little to do with the research she is doing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge to order DHS and State Department to not make any changes to Harvard's student visa program indefinitely",
            "external_url": "https://www.cnn.com/us/live-news/harvard-graduation-international-student-ban-hearing-05-29-25#cmb9hkpgk00053b60yqd9fea4",
            "upvotes": 9680,
            "date": "05/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2217503072.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These rulings and how they are enforced will define the future of the country\n\nEdit: just because trump is president does not change the law or the intent of the law. It is not thrown out the window because the current admin doesn't like it. Yall need a high school government class.",
                "It’s wild watching the right scream JUDICIAL COUP  when it’s literally just the constitution’s system of checks and balances working in real time.",
                "Trump is just mad his kid was rejected by Harvard.",
                "Gotta love how the conservative position to \"no, you can't just make orders and declarations like a king, there are laws you need to follow to get what you want to achieve\" is screeching about a Judicial Coup and demanding that every action immediately be referred to SCOTUS regardless of whether or not there's a question of constitutionality in place like they're the backstop pet court for any of the dumb shit a judge stops Trump from doing.",
                "Judges provide the ultimate law when they agree and are politically charged suggestions when they don't. \n\nThey're merely a tool for control for this admin, not a guide on what they can/can't do.",
                "Why limit it to Harvard? No changes to ANY student visas programs.",
                "You know picking a fight with a school most resposible for driving the US justice system, politics, and in general the laws of the country. A school that also has a VERY high allumni pride associated with it on par with religion/nationality....not a great idea.",
                "Baron wasn’t smart enough to get in to Harvard so now the whole university has to suffer.",
                "Fucking waste of everyone's time and money.",
                "Huh, it's almost like you can't rule by executive order, who knew?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 5490,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                "“I need you to be activist judges to stop the activist judges”",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court.",
                "Supreme Court care more about their money than pleasing Trump. I could see them upholding the ruling."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 2252,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Boy who cried wolf, eaten by wolves.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "If this goes to the Supreme Court, will they favor Trump again?",
                "It's pretty telling how poor of a decision it was to impose tariffs when markets rise back up after that decision is rolled back. Again, for those who thought Trump was fit for office because he's a businessman - just because you do business, does not mean you are good at it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russian troops massing in north, says Ukraine after drone offensive",
            "external_url": "https://www.thetimes.com/world/russia-ukraine-war/article/drone-attack-strike-news-rfjqt2f67?utm_source=substack&utm_medium=email",
            "upvotes": 995,
            "date": "05/29/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2Fcf08e2b2-90d2-419a-aced-156e6ca03d44.gif?crop=800%2C450%2C0%2C0&resize=1200",
            "top_comments": [
                "Good time for some HIMARS hors d’oevres",
                "Actual Russian troops, or more north Koreans?  I'd say prisoners and dissidents but I'm sure they have all been sent to the meat grinder already.",
                "Ukraine attacking weapons and weapon parts facilities. \"No deaths or injuries were reported.\"\n\nMeanwhile Russia attacking population centers, power plants, civil infrastructure and shelters.",
                "Sounds like it's summer offensive time.\n\nHopefully HIMARS do a great job of converting these invaders to red mist.",
                "I expected this to happen earlier. Russia needs to break the stalemate for political reasons and the longer the war progresses the less likely such an offensive is likely to succeed so I expect them to do a summer offensive which will very likely fail and cost the Russians huge losses in return for tiny amounts of gained ground.\n\nOn the other hand Ukraine cannot attack either without significantly more western aid.",
                "They want to invade the balitc countries?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Haribo recalls bags of sweets in Netherlands after cannabis found",
            "external_url": "https://www.bbc.com/news/articles/c5yx2lynznpo",
            "upvotes": 362,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/02af/live/3944f7e0-3c8a-11f0-bd8d-df41784e9c1e.jpg",
            "top_comments": [
                ">It is not clear whether the contaminated products are genuine Haribo bags or fake.\n\nKinda important",
                ">Several people, including multiple members of one family, reported feeling unwell after eating from a 1kg pack of Haribo Happy Cola F!ZZ.\n\nHappy Cola F!ZZ is the only gummy I really like.",
                "Oh no! Where have these bags been delivered to? Gotta know how to avoid them at any cost. \n\nI really gotta know.",
                "Before reading the article: “is this only in the Netherlands?”\n\nAfter reading article: “Damn it…”",
                "I know everyone is gonna make jokes but even if you smoke weed accidentally taking a large edible dose when you don't expect to will easily ruin a day. If you are not used to canabis it can def be traumatic to be dosed like that.",
                "This is crazy depending on dosage it will really fuck unknowing people up.\n\nFor reference I used to smoke a LOT but not anymore due to smoking giving me anxiety when the high hits.\n\nSo now I use edibles so I can gradually get high to not get the all at once rush like smoking does. I have 0 tolerance because I don't do it that much.\n\n1 gummie bear I buy usually contains 50mg THC this is a fuckload for someone who doesn't have a tolerance it will put you on your ass. I was a mess the first time I ordered them thinking I could handle it, I could not it was intense but I was familiar with what was going on.\n\nI now cut the gummies into quarters and it's nice and relaxing.\n\nImagine if you were an unsuspecting person whos never known the effects of THC and now you are doing said 50mg. You would be fucked and think you are dying. This is a crazy fuck up.\n\n\nTldr: if you've never tried thc and think damn I wish I got some, that would be cool, no you'd probably be comatose or worse have a panic attack and end up in the emergency room.",
                "Astoundingly, not the worst thing ever found in a bag of Haribo gummies / colon cleansing sugar free spawn of Satan bears.",
                "I just assumed that they were the secret prize, just like the ones that used to be in cereal boxes.",
                "How to sell Haribo (fast)",
                "I wish Haribo made cannabis gummies I could get! The edible market is really hit and miss in the Midwest."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US weekly jobless claims rise more than expected as labor market eases",
            "external_url": "https://www.reuters.com/world/us/us-weekly-jobless-claims-rise-more-than-expected-labor-market-eases-2025-05-29/",
            "upvotes": 568,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "President Deals will fix it soon im sure. Lol",
                "'Eases' is a funny way to say 'declines'.",
                "Capitalism is devouring what is left of society. It requires infinite growth, and when it runs out of things to own, it starts absorbing public goods like the post office. We have a society that works for capitalism instead of capitalism working for society, which is the inevitable late stage of capitalism. There is a reason that the left in the US has been systematically attacked for the last 50 years - so that when capitalism devours all, they can swing the country hard right and keep us all fighting amongst ourselves.",
                "It's happening. \n\n[https://theeconomiccollapseblog.com/the-middle-class-is-collapsing-nearly-1-out-of-every-4-americans-is-now-functionally-unemployed/](https://theeconomiccollapseblog.com/the-middle-class-is-collapsing-nearly-1-out-of-every-4-americans-is-now-functionally-unemployed/)",
                "I'd expect jobless claims to only increase given that generally, people can't file for unemployment benefits until severance is paid. People laid off in April are likely still receiving severance, for example. There's always a lag.",
                "President Taco strikes again.",
                "And with medicaid work requirements on the horizon, all those jobless people will be without healthcare too.",
                "As reliable as the sun rising in the east.  Republicans break the economy and enrich the few, democrats have to spend their capital putting it back together.  As long as people keep electing republicans we'll never address 21st century problems.",
                "Thank muskRat for that",
                "I guess this is good news for farmers needing seasonal workers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 5779,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                "This literally made my stomach turn. Wtaf?!",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "I found out one of my childhood friends got all fucked up on meth & got caught trying to sell his kid.\n\nWho knew Northern MN and S. Africa had so much in common.",
                "As a South African I’m disgusted by this woman’s actions and how she played to courts and society in the beginning. \n\nKarma will not be kind to her. \n\nThe community needs to find the muti doctors and do kangaroo court with them as the police are not effective."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israel announces major expansion of settlements in occupied West Bank",
            "external_url": "https://www.bbc.com/news/articles/c1j5954edlno",
            "upvotes": 1755,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/321e/live/0cfc3ea0-3c85-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Apparently you can rename ethnic cleansing \"settlement\" and get away with it scot-free",
                "When Russia does it it's an invasion. When Israel does it it's a \"settlement\".",
                "[If I don't steal it, someone else is gonna steal it](https://youtu.be/KNqozQ8uaV8?si)",
                "More illegal expansion, if only people knew this was coming for years.  Oh, wait…",
                "to the surprise of absolutely no one.",
                "I'm sure this will make Israel safer and will result in no action taken by Palestinians and their sympathizers. Fortunately we know that Israel is an incredibly moral country whose one and only concern is counter-terrorism and keeping the population safe from the inherently evil Palestinians in a completely reasonable manner where every casualty taken by Palestinians is their fault.\n\nThat's what the WorldNews sub tells me anyway!",
                "They're really trying to eliminate any pathways towards peace.",
                "Let's not sanitize the facts, shall we?\n\n\"Isreal announces major expansion to invasion of West Bank and theft of Palestinian homes and belongings\" is much more accurate.",
                "Anyone else hearing Echoes of Lebensraum in this policy?",
                "They never wanted peace.  They always wanted the land.. I’ve been there and they treat Palestinians like third classes center or prisoners. If you go back over the history of it, Israeli always treated the Palestine’s like shit in order to force them out from day one. All the political theater has just been a trick to have you look one way as they steal the land from them another way."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/29/2025 20:10:43 UTC"
}