{
    "posts": [
        {
            "category": "HOT",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 9273,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "He should be fired and charged.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "He might as well add Fox news to the chat.",
                "Any other administration and he’d have been fired weeks ago",
                "I hope he gets fired via a Signal message in a group chat.",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "> President Donald Trump tapped Hegseth, a former Fox News personality, for a job for which Democrats and even some Republicans worried he was not qualified. Now, in the wake of the revelation of the second Signal chat that included his wife and his brother, which The New York Times first reported Sunday afternoon, he faces calls for his dismissal even as Trump stands behind him.\n\nClearly he's not qualified and he just keeps flipping off the Federal Records Act they were adamant about a few years ago. He's also surprisingly bad with technology if he keeps adding the wrong people to his communications."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Mexican Cartels Are Using Casinos, to Launder Fentanyl Proceedings In the U.S.",
            "external_url": "https://www.latintimes.com/mexican-cartels-are-using-casinos-o-launder-fentanyl-proceedings-us-581335",
            "upvotes": 3867,
            "date": "04/22/2025",
            "thumbnail": "https://d.latintimes.com/en/full/574915/casino-representational-image.png",
            "top_comments": [
                "Rebooting Ozark so soon?",
                "Casinos have always been used to launder money. It's not exactly a new development",
                "*Proceeds*, not *proceedings*.",
                "Breaking: organized crime guys doing what all the other organized crime guys do all over the world.",
                "Makes me wonder if this is a small reason why so many rich people in Texas and a few politicians are pushing so hard to get gambling made legal in Texas. \n\nGet a cut of that laundering money because you know these casinos will be lightly regulated by the state if regulated at all.",
                "Maybe a casino boat on the Lake of the Ozarks?  Jason Bateman knows what's up.  \n\nSeriously, this is not new.  I guess the Trump casinos in Atlantic city missed the boat on this.",
                "The inappropriate comma in the headline makes this super hard to read.",
                "One more reason not to let the Dumont/Adelsons get their casino in Texas.",
                "Somebody call Sheriff Longmire. I’m sure that Nighthorse guy is involved.",
                "Venture capitalists getting in on the action."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 2861,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "At what point does it stop being capitalism?",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. Meanwhile you guys are financing the same system using a 30yr loan. For clarification that's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "Five bazillion percent!",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 16325,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "This will not end well.",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "We have reached the eugenics part of the plot.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "They're going after autistic folks. Folks on the left are more likely to seek a medical diagnosis for their kids experiencing behavioral issues. Folks on the right are more likely to try to discipline or beat it out of their kids. They're hunting our kids.."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Francis changed church policy on the death penalty and nuclear weapons but upheld it on abortion",
            "external_url": "https://apnews.com/article/pope-francis-career-highlights-589cbd4ffd574d6c9c2674add1b564c9",
            "upvotes": 724,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I dont expect the catholic church to change their stance on abortion. I just expect my secular government not to take it into account.",
                "eh I doubt the Church will ever change its stance on abortion. You're still not even allowed to use contraceptives or have sex before marriage",
                "CHANGED it's position on nuclear weapons?",
                "I hate their stance on abortion, but the Catholic Church is at least consistent across Lal stage of life for their pro-life views. They run hospice care for people in vegetative states, they have orphanages and schools. Which sure theyre not always great but they are there. They have food programs and poor programs. Never enough but they're there. \n\n\nCompared to most American anti-choicers fascists the Catholic Church is almost progressive. ",
                "He was a progressive Pope in many areas, but it's not surprising he towed the party line on abortion. The church has not budged on that one and it's unlikely we'll get a change anytime soon.",
                "Pope Francis changed the Catholic Church’s teaching in areas such as the death penalty and nuclear weapons, upheld it in others such as abortion, and made inroads with Muslims and believers who long felt marginalized.",
                "They will never change that position.  Let's be real.",
                "People can disparage Francis for holding consistent views that has been part of the Catholic Church like abortion, child abuse, and women in the clergy but outside of the norm, he has been the most progressive and humanistic pope where so called Catholics called him too liberal for their taste, you know the Pope, the head of the church.",
                "I honestly don't expect a pope to ever change catholic church's stance on abortion. Don't they still not even like contraception?  My one cousin branch is 16 siblings as proof.",
                "Too bad we’re probably gonna get a right wing MVGA pope if the trend holds."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 430,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "I wonder if the fall of Rome was this stupid.",
                "Guess this is how we kill people.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "According to the article, the cuts were already planned.\n\nBut, of course, I don't believe and single God damn thing this administration says.",
                "Idiocracy is on the way",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "Don’t drink milk, got it.",
                "Next new peice of business from this admin is calling Canada and the EU evil for not wanting to buy US dairy products. I can't imagine why!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Walgreens to pay up to $350 million in US opioid settlement",
            "external_url": "https://edition.cnn.com/2025/04/22/business/walgreens-opioid-settlement-hnk/index.html",
            "upvotes": 1541,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25072097339624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Up next: Walgreens files for bankruptcy",
                "I feel like with how much they profited off of opioids, this is a very low number",
                "Pharmacist here. It’s amazing to see so many people out here with pitch forks but the moment a pharmacist refuses to fill an opioid they are met with “WHAT DO YOU MEAN? JUST FILL IT?” “YOU ARENT A DOCTOR” “YOU ARE DISCRIMINATING AGAINST PAIN PATIENTS”.\n\nCan’t have it both ways folks.",
                "Paying who exactly? Who is now benefiting from Walgreens paying $350 million? Does every family of an overdosed and dead relative get $10? If so, I can’t wait to get my $10. Makes it all worthwhile.",
                "\"Walgreens to pay its way out of scandalous misconduct and avoid real-world consequences\"\n\nWhat's the sentence for a dealer on the streets slinging heroin? Should be the same for these fuckin guys.",
                "Seems like it was the pharmaceutical companies and pill mill doctors that created the epidemic, not the brick and mortar store filling prescriptions. They are not doctors so how should they know they are hurting people?\n\n(I didn’t read the article.)",
                "That's like $1 per store almost.",
                "As someone who works in pharmacy, these comments are funny for a bunch of reasons. And there’s not enough space to write how “Walgreens bad” isn’t close to the whole story and how reductive it actually is.",
                "So… pennies on pennies on the dollar of profit they made.\n\nThe failed American state will be studied for a long time if we survive this.",
                "They can ignore it and just move on at if nothing happened."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 17309,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[removed]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "Oh no! There goes the home I was never going to get.",
                "I'll bet he wants to bring back debtor's prison."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Trans pilot falsely blamed in Potomac plane crash sues conservative influencer",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474",
            "upvotes": 49382,
            "date": "04/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-Jo-Ellis-ew-344p-dc3afb.jpg",
            "top_comments": [
                "> On Jan. 30, less than 24 hours after the crash, conservative influencer Matt Wallace, who has 2.2 million followers on the social media platform X, shared a post from another account he operates stating that the helicopter pilot was transgender, according to the lawsuit. Wallace included a photo of Ellis, and the post went viral, the lawsuit states.  \nWallace deleted that original post, according to the lawsuit, and then shared two others linking Ellis to the crash. One referred to an interview that Ellis did with The Smerconish Podcast, in which she said President Donald Trump’s executive order barring trans people from serving and enlisting in the military made her nervous. \nThe second post included photos of Ellis and said she might have participated in “another trans terror attack,” according to the lawsuit. That post received 4.8 million views on X, the suit states.\n\n\nSlandering someone for a non-existent terrorist attack absolutely deserves a lawsuit. I hope they end up having to pay a massive amount of money. That's a great way to have her be targeted by death threats and possibly physical attacks. Imagine joining the National Guard for almost 20 years, then some ass does this to you.",
                "Here’s to her winning the lawsuit. It’s high time these conservative influencers need to be held accountable for their words.",
                "Matt Wallace is such a low-life. I feel terrible for this pilot. She didn’t do shit to deserve this and now has to deal with the burden of clearing her name after being dragged into something she never asked for.",
                "Even if she wins (which I hope she does), they never pay out. Look at the Alex Jones and Rudy Guilliano verdicts.\n\nEDIT - Giuliani did pay up, but after some teeth pulling. But my point still stands. Winning a verdict is only the start of the battle.",
                "I scream this into the void whenever this topic comes up, and I will continue doing so:\n\nI was a flight instructor for nearly a decade. I taught hundreds of students from recreational private pilots, up through commercial pilots and flight instructors. I taught many women, people of color, and even one trans person (that I knew of). And of course, mostly white dudes. \n\nThere is *absolutely zero* correlation between a person's gender or race and their ability to fly an airplane, make critical decisions during a flight, or manage resources.\n\nActually, I take that back. Women were generally better at studying and were less likely to take risks. The worst students were usually rich old men. \n\nAirlines **do not** hire under-performing candidates to meet \"DEI quotas.\" Everyone has to perform to the same standard. Sure, there may be initiatives to help those who have been subjected to an industry with a deeply ingrained \"good ol' boy\" tradition, but not at the expense of safety, performance, and quality. You either meet the standards, or you don't.\n\nThese cowards hide behind DEI and say stuff like \"Ohh I just don't like these woke hiring practices that allow under-qualified people in, women can be perfectly fine pilots too!\" But that's *bullshit.* They are cowards who refuse to say it with their chest. They think women can't be pilots. They think black people can't be pilots. They think trans people can't be pilots. It's fucking horseshit and they are sad little pussies who are too afraid to be openly sexist and racist.\n\nTake it from me, an *actual professional* with years of experience in the industry. Not some dipshit podcaster or brainless news personality.",
                "Unfortunately, america no longer has a justice system.",
                "Trans people are such terrors that the GOP has to constantly make up complete bullshit to paint them in a bad light...\n\nIf you have to lie, and lie to such an insane degree, to justify your beliefs, maybe your beliefs are shit?  Just a thought, which I know the GOP does not allow.",
                "I hope she can retire and live comfortably off the judgement awarded while the piece of shit is bankrupted.",
                "Matt Wallace is a little piece of shit. If only our \"justice system\" actually helped people rather than ya know... Protect the rich",
                "Hope she wins and wins big"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Dow tumbles more than 1,000 points and dollar hits three-year low",
            "external_url": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
            "upvotes": 28283,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210074746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Funny, I used to get little quips from my retired parents anytime the stock market went down under Biden (“he just cost me $xxxxx”). Haven’t heard a single comment about their portfolio since trump took office",
                "Long term gain, though, right?\n\n...you guys?",
                "He's running the country like he does all of his businesses. Imagine being this incompetent, but also so unaware.",
                "Reminder that Trump enjoys a 90% approval rating from Republicans right now",
                "I’m confused, is America great again yet or not?",
                "Bond yields are spiking again, too.  \nFaith is being lost in not just the dollar and U.S. equities, but Treasuries, too.  \nYikes.",
                "Every time a Republican is in office my life gets harder.",
                "MAGA: This is good. We shouldn't be involved in any foreign exchanges anyway. It costs nothing to lose money.",
                "The value of a dollar is rapidly approaching its lowest low since the last time this skidmark was in office",
                "I think a corky laugh and a stable 401k would’ve been better than this."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 433,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "I wonder if the fall of Rome was this stupid.",
                "Guess this is how we kill people.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "According to the article, the cuts were already planned.\n\nBut, of course, I don't believe and single God damn thing this administration says.",
                "Idiocracy is on the way",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "Don’t drink milk, got it.",
                "Next new peice of business from this admin is calling Canada and the EU evil for not wanting to buy US dairy products. I can't imagine why!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Films made with AI can win Oscars, Academy says",
            "external_url": "https://www.bbc.co.uk/news/articles/cqx4y1lrz2vo",
            "upvotes": 235,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bb0/live/c35e9800-1f70-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "SAG/AFTRA gonna love this one....   And so it begins....",
                "Didn’t Hollywood strike specifically because of this wth",
                "So one of the main reasons behind the combined strike couple years ago simply just fell flat and the guilds won’t do anything about it?",
                "Courts have already ruled AI-generated works can't be copyrighted - should open up a whole new can of worms when someone pirates an AI movie.",
                "Why does anyone bother watching the Oscars? Awards only have meaning if they come from people who care about the craft. The academy obviously doesn't.",
                "Let the theatres close and the Hollywood Machine collapse, then.",
                "alternative headline: \"'We have been greased with AI money, so yeah we're gonna let it do whatever.' Academy says.\"",
                "Now we can have winners as soulless as the judges. ",
                "Awesome, my opinion of the Academy Awards remains  at 0 as it always shall",
                "[They won't be protected by copyright though](https://constitutioncenter.org/blog/federal-court-rules-artificial-intelligence-machines-cant-claim-copyright-authorship)"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 9283,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "He should be fired and charged.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "He might as well add Fox news to the chat.",
                "Any other administration and he’d have been fired weeks ago",
                "I hope he gets fired via a Signal message in a group chat.",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "> President Donald Trump tapped Hegseth, a former Fox News personality, for a job for which Democrats and even some Republicans worried he was not qualified. Now, in the wake of the revelation of the second Signal chat that included his wife and his brother, which The New York Times first reported Sunday afternoon, he faces calls for his dismissal even as Trump stands behind him.\n\nClearly he's not qualified and he just keeps flipping off the Federal Records Act they were adamant about a few years ago. He's also surprisingly bad with technology if he keeps adding the wrong people to his communications."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Francis changed church policy on the death penalty and nuclear weapons but upheld it on abortion",
            "external_url": "https://apnews.com/article/pope-francis-career-highlights-589cbd4ffd574d6c9c2674add1b564c9",
            "upvotes": 725,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I dont expect the catholic church to change their stance on abortion. I just expect my secular government not to take it into account.",
                "eh I doubt the Church will ever change its stance on abortion. You're still not even allowed to use contraceptives or have sex before marriage",
                "CHANGED it's position on nuclear weapons?",
                "I hate their stance on abortion, but the Catholic Church is at least consistent across Lal stage of life for their pro-life views. They run hospice care for people in vegetative states, they have orphanages and schools. Which sure theyre not always great but they are there. They have food programs and poor programs. Never enough but they're there. \n\n\nCompared to most American anti-choicers fascists the Catholic Church is almost progressive. ",
                "He was a progressive Pope in many areas, but it's not surprising he towed the party line on abortion. The church has not budged on that one and it's unlikely we'll get a change anytime soon.",
                "Pope Francis changed the Catholic Church’s teaching in areas such as the death penalty and nuclear weapons, upheld it in others such as abortion, and made inroads with Muslims and believers who long felt marginalized.",
                "They will never change that position.  Let's be real.",
                "People can disparage Francis for holding consistent views that has been part of the Catholic Church like abortion, child abuse, and women in the clergy but outside of the norm, he has been the most progressive and humanistic pope where so called Catholics called him too liberal for their taste, you know the Pope, the head of the church.",
                "I honestly don't expect a pope to ever change catholic church's stance on abortion. Don't they still not even like contraception?  My one cousin branch is 16 siblings as proof.",
                "Too bad we’re probably gonna get a right wing MVGA pope if the trend holds."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Mexican Cartels Are Using Casinos, to Launder Fentanyl Proceedings In the U.S.",
            "external_url": "https://www.latintimes.com/mexican-cartels-are-using-casinos-o-launder-fentanyl-proceedings-us-581335",
            "upvotes": 3871,
            "date": "04/22/2025",
            "thumbnail": "https://d.latintimes.com/en/full/574915/casino-representational-image.png",
            "top_comments": [
                "Rebooting Ozark so soon?",
                "Casinos have always been used to launder money. It's not exactly a new development",
                "*Proceeds*, not *proceedings*.",
                "Breaking: organized crime guys doing what all the other organized crime guys do all over the world.",
                "Makes me wonder if this is a small reason why so many rich people in Texas and a few politicians are pushing so hard to get gambling made legal in Texas. \n\nGet a cut of that laundering money because you know these casinos will be lightly regulated by the state if regulated at all.",
                "Maybe a casino boat on the Lake of the Ozarks?  Jason Bateman knows what's up.  \n\nSeriously, this is not new.  I guess the Trump casinos in Atlantic city missed the boat on this.",
                "The inappropriate comma in the headline makes this super hard to read.",
                "One more reason not to let the Dumont/Adelsons get their casino in Texas.",
                "Somebody call Sheriff Longmire. I’m sure that Nighthorse guy is involved.",
                "Venture capitalists getting in on the action."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 2864,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "At what point does it stop being capitalism?",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. Meanwhile you guys are financing the same system using a 30yr loan. For clarification that's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "Five bazillion percent!",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Walgreens to pay up to $350 million in US opioid settlement",
            "external_url": "https://edition.cnn.com/2025/04/22/business/walgreens-opioid-settlement-hnk/index.html",
            "upvotes": 1538,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25072097339624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Up next: Walgreens files for bankruptcy",
                "I feel like with how much they profited off of opioids, this is a very low number",
                "Pharmacist here. It’s amazing to see so many people out here with pitch forks but the moment a pharmacist refuses to fill an opioid they are met with “WHAT DO YOU MEAN? JUST FILL IT?” “YOU ARENT A DOCTOR” “YOU ARE DISCRIMINATING AGAINST PAIN PATIENTS”.\n\nCan’t have it both ways folks.",
                "Paying who exactly? Who is now benefiting from Walgreens paying $350 million? Does every family of an overdosed and dead relative get $10? If so, I can’t wait to get my $10. Makes it all worthwhile.",
                "\"Walgreens to pay its way out of scandalous misconduct and avoid real-world consequences\"\n\nWhat's the sentence for a dealer on the streets slinging heroin? Should be the same for these fuckin guys.",
                "Seems like it was the pharmaceutical companies and pill mill doctors that created the epidemic, not the brick and mortar store filling prescriptions. They are not doctors so how should they know they are hurting people?\n\n(I didn’t read the article.)",
                "That's like $1 per store almost.",
                "As someone who works in pharmacy, these comments are funny for a bunch of reasons. And there’s not enough space to write how “Walgreens bad” isn’t close to the whole story and how reductive it actually is.",
                "So… pennies on pennies on the dollar of profit they made.\n\nThe failed American state will be studied for a long time if we survive this.",
                "They can ignore it and just move on at if nothing happened."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Trial to boldly grow food in space labs blasts off",
            "external_url": "https://www.bbc.co.uk/news/articles/cp34wzql2xvo",
            "upvotes": 194,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ae0f/live/ccf0e300-1f57-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "How does one grow food boldly",
                "To boldly grow where no man has grown before.",
                "Good news but groan over the headline."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "US FTC sues Uber, alleging deceptive subscription practices",
            "external_url": "https://www.bbc.com/news/articles/c1drkq0dy07o",
            "upvotes": 1039,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/542a/live/0456b050-1f20-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "> In its complaint filed on Monday, the FTC said that Uber has made suspending subscriptions \"extremely difficult\" for consumers, who can be subjected to navigating as many as 23 screens and taking up to 32 actions if they try to cancel.\n\n\nI wonder how many people just gave up and reported their card as lost to their bank.",
                "tomorrow: Uber buys 10k Teslas",
                "Good. Go after ticket master next.",
                "Something tells me the majority of those affected will be compensated with a code for 30 days with no delivery fees to Uber Eats courtesy of Uber. Only applied to orders with a minimum purchase of $30 and with agreement that you will continue a 12 month subscription after your 30 days. You know, for your troubles.",
                "Musk must be mad at them.",
                "someone's grandma at FTC must have realized they paid for Uber One the last 5 years. I just don't see the current gov going after uber.",
                "I hope they get shafted hard.  Wolves in sheep's clothing.  ",
                "Looks like Uber forgot to pay their bribe to daddy Trump.",
                "The real deception was getting the government to let them classify their employees as contractors.",
                "While I have no pity for Uber, you just know Musk has influence in this. He wants his cybercab to take off and of course needs to minimize competition first."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 16324,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "This will not end well.",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "We have reached the eugenics part of the plot.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "They're going after autistic folks. Folks on the left are more likely to seek a medical diagnosis for their kids experiencing behavioral issues. Folks on the right are more likely to try to discipline or beat it out of their kids. They're hunting our kids.."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends milk quality tests amid workforce cuts",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/",
            "upvotes": 431,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Listeria for everyone!",
                "I wonder if the fall of Rome was this stupid.",
                "Guess this is how we kill people.",
                "Bird flu is transferring to cows, did you see the 60 Minutes piece on that?\n\nAccording to this article, milk will no longer be tested for bird flu.",
                "According to the article, the cuts were already planned.\n\nBut, of course, I don't believe and single God damn thing this administration says.",
                "Idiocracy is on the way",
                "So I guess the attitude on listeria is similar to the attitude on pandemics:\n\n# \"If we stopped testing right now, we’d have very few cases, if any’‘",
                "What could possibly go wrong? We’re going to be so fucking great, just you wait..",
                "Don’t drink milk, got it.",
                "Next new peice of business from this admin is calling Canada and the EU evil for not wanting to buy US dairy products. I can't imagine why!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Info Pete Hegseth shared with wife, brother came from top general's secure messages",
            "external_url": "https://www.nbcnews.com/politics/national-security/info-hegseths-yemen-signal-texts-came-generals-secure-messages-rcna198838",
            "upvotes": 9312,
            "date": "04/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250403-pete-hegseth-se-231p-3a286f.jpg",
            "top_comments": [
                "From a fox news host that spent years screaming about Hillary's emails... The only thing worse than the overt corruption and incompetence is the hypocrisy.\n\nAt least Hilary never hit an active duty member with an axe.",
                "And.... Where is the outrage?   Still on about that email server huh?",
                "He should be fired and charged.",
                "Trump, as usual, really knows how to pick the best, doesn't he? Just imagine the people he's gonna choose once his first round of hires goes bust. He already started at the bottom.",
                "Chrisrlt sake, when does it start counting as treason?! This dude is like one step away from a modern Benedict Arnold!",
                "He might as well add Fox news to the chat.",
                "Any other administration and he’d have been fired weeks ago",
                "I hope he gets fired via a Signal message in a group chat.",
                "Turns out being drunk at work will lead to some very stupid decisions.",
                "> President Donald Trump tapped Hegseth, a former Fox News personality, for a job for which Democrats and even some Republicans worried he was not qualified. Now, in the wake of the revelation of the second Signal chat that included his wife and his brother, which The New York Times first reported Sunday afternoon, he faces calls for his dismissal even as Trump stands behind him.\n\nClearly he's not qualified and he just keeps flipping off the Federal Records Act they were adamant about a few years ago. He's also surprisingly bad with technology if he keeps adding the wrong people to his communications."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Mexican Cartels Are Using Casinos, to Launder Fentanyl Proceedings In the U.S.",
            "external_url": "https://www.latintimes.com/mexican-cartels-are-using-casinos-o-launder-fentanyl-proceedings-us-581335",
            "upvotes": 3872,
            "date": "04/22/2025",
            "thumbnail": "https://d.latintimes.com/en/full/574915/casino-representational-image.png",
            "top_comments": [
                "Rebooting Ozark so soon?",
                "Casinos have always been used to launder money. It's not exactly a new development",
                "*Proceeds*, not *proceedings*.",
                "Breaking: organized crime guys doing what all the other organized crime guys do all over the world.",
                "Makes me wonder if this is a small reason why so many rich people in Texas and a few politicians are pushing so hard to get gambling made legal in Texas. \n\nGet a cut of that laundering money because you know these casinos will be lightly regulated by the state if regulated at all.",
                "Maybe a casino boat on the Lake of the Ozarks?  Jason Bateman knows what's up.  \n\nSeriously, this is not new.  I guess the Trump casinos in Atlantic city missed the boat on this.",
                "The inappropriate comma in the headline makes this super hard to read.",
                "One more reason not to let the Dumont/Adelsons get their casino in Texas.",
                "Somebody call Sheriff Longmire. I’m sure that Nighthorse guy is involved.",
                "Venture capitalists getting in on the action."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Francis changed church policy on the death penalty and nuclear weapons but upheld it on abortion",
            "external_url": "https://apnews.com/article/pope-francis-career-highlights-589cbd4ffd574d6c9c2674add1b564c9",
            "upvotes": 726,
            "date": "04/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I dont expect the catholic church to change their stance on abortion. I just expect my secular government not to take it into account.",
                "eh I doubt the Church will ever change its stance on abortion. You're still not even allowed to use contraceptives or have sex before marriage",
                "CHANGED it's position on nuclear weapons?",
                "I hate their stance on abortion, but the Catholic Church is at least consistent across Lal stage of life for their pro-life views. They run hospice care for people in vegetative states, they have orphanages and schools. Which sure theyre not always great but they are there. They have food programs and poor programs. Never enough but they're there. \n\n\nCompared to most American anti-choicers fascists the Catholic Church is almost progressive. ",
                "He was a progressive Pope in many areas, but it's not surprising he towed the party line on abortion. The church has not budged on that one and it's unlikely we'll get a change anytime soon.",
                "Pope Francis changed the Catholic Church’s teaching in areas such as the death penalty and nuclear weapons, upheld it in others such as abortion, and made inroads with Muslims and believers who long felt marginalized.",
                "They will never change that position.  Let's be real.",
                "People can disparage Francis for holding consistent views that has been part of the Catholic Church like abortion, child abuse, and women in the clergy but outside of the norm, he has been the most progressive and humanistic pope where so called Catholics called him too liberal for their taste, you know the Pope, the head of the church.",
                "I honestly don't expect a pope to ever change catholic church's stance on abortion. Don't they still not even like contraception?  My one cousin branch is 16 siblings as proof.",
                "Too bad we’re probably gonna get a right wing MVGA pope if the trend holds."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Films made with AI can win Oscars, Academy says",
            "external_url": "https://www.bbc.co.uk/news/articles/cqx4y1lrz2vo",
            "upvotes": 232,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bb0/live/c35e9800-1f70-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "SAG/AFTRA gonna love this one....   And so it begins....",
                "Didn’t Hollywood strike specifically because of this wth",
                "So one of the main reasons behind the combined strike couple years ago simply just fell flat and the guilds won’t do anything about it?",
                "Courts have already ruled AI-generated works can't be copyrighted - should open up a whole new can of worms when someone pirates an AI movie.",
                "Why does anyone bother watching the Oscars? Awards only have meaning if they come from people who care about the craft. The academy obviously doesn't.",
                "Let the theatres close and the Hollywood Machine collapse, then.",
                "alternative headline: \"'We have been greased with AI money, so yeah we're gonna let it do whatever.' Academy says.\"",
                "Now we can have winners as soulless as the judges. ",
                "Awesome, my opinion of the Academy Awards remains  at 0 as it always shall",
                "[They won't be protected by copyright though](https://constitutioncenter.org/blog/federal-court-rules-artificial-intelligence-machines-cant-claim-copyright-authorship)"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US sets tariffs of up to 3,521% on South East Asia solar panels",
            "external_url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
            "upvotes": 2863,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/82d0/live/314934c0-1f3e-11f0-9f49-43f86d9a4eb9.jpg",
            "top_comments": [
                "RIP solar panel market. Everything Trumps touches dies.",
                "I sure would like to know what genius formula was used to come up with that number.",
                "He doesn't want solar. This is how he kills it.",
                "At what point does it stop being capitalism?",
                "Why only 3,521%? I thought we could at least do 5,000% or 10,000% to keep it easy to figure out...no?",
                "I always thought solar panels were inherently expensive. I moved to Brazil recently and was shocked at how common they are. Turns out they aren't expensive. Solar panels aren't produced domestically here either and even though Brazil has high taxation they still end up being around 5x cheaper.\n\nEdit: For less than 3k USD I can buy all the materials needed to generate 1000kwh a month. Meanwhile you guys are financing the same system using a 30yr loan. For clarification that's about 75% of my monthly usage in the US and i was consistently paying over 300 dollars a month. Y'all should be OUTRAGED.",
                "USA will build their own solar panel factory. With blackjack, and hookers.",
                "Five bazillion percent!",
                "These numbers are getting so high that even the people in charge of coming up with new terms to describe how many guns are in a Borderlands game are starting to take notes.",
                "Anyone know if Tesla solar is going to benefit from this?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Walgreens to pay up to $350 million in US opioid settlement",
            "external_url": "https://edition.cnn.com/2025/04/22/business/walgreens-opioid-settlement-hnk/index.html",
            "upvotes": 1540,
            "date": "04/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25072097339624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Up next: Walgreens files for bankruptcy",
                "I feel like with how much they profited off of opioids, this is a very low number",
                "Pharmacist here. It’s amazing to see so many people out here with pitch forks but the moment a pharmacist refuses to fill an opioid they are met with “WHAT DO YOU MEAN? JUST FILL IT?” “YOU ARENT A DOCTOR” “YOU ARE DISCRIMINATING AGAINST PAIN PATIENTS”.\n\nCan’t have it both ways folks.",
                "Paying who exactly? Who is now benefiting from Walgreens paying $350 million? Does every family of an overdosed and dead relative get $10? If so, I can’t wait to get my $10. Makes it all worthwhile.",
                "\"Walgreens to pay its way out of scandalous misconduct and avoid real-world consequences\"\n\nWhat's the sentence for a dealer on the streets slinging heroin? Should be the same for these fuckin guys.",
                "Seems like it was the pharmaceutical companies and pill mill doctors that created the epidemic, not the brick and mortar store filling prescriptions. They are not doctors so how should they know they are hurting people?\n\n(I didn’t read the article.)",
                "That's like $1 per store almost.",
                "As someone who works in pharmacy, these comments are funny for a bunch of reasons. And there’s not enough space to write how “Walgreens bad” isn’t close to the whole story and how reductive it actually is.",
                "So… pennies on pennies on the dollar of profit they made.\n\nThe failed American state will be studied for a long time if we survive this.",
                "They can ignore it and just move on at if nothing happened."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Trial to boldly grow food in space labs blasts off",
            "external_url": "https://www.bbc.co.uk/news/articles/cp34wzql2xvo",
            "upvotes": 197,
            "date": "04/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ae0f/live/ccf0e300-1f57-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "How does one grow food boldly",
                "To boldly grow where no man has grown before.",
                "Good news but groan over the headline."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr.'s autism study to amass medical records of many Americans",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-autism-study-medical-records/",
            "upvotes": 16322,
            "date": "04/22/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/21/6a2ce3c6-4704-4c5b-ad81-a0f35f664484/thumbnail/1200x630g1/157b347426b41f1024adb38dff209953/gettyimages-2210597011.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Jfc that is scary. This article says they're making a \"registry\" of people with autism and everything from prescriptions filled at chain pharmacies, smartwatch fitness app  data, and insurance claims will be tracked on all autistic people in the US  - wtaf!?",
                "This will not end well.",
                "As if special needs parents didn't already have enough reasons to worry about our kids 24/7.",
                "It's super cool that all of our private data is the hands of unelected morons.",
                "We have reached the eugenics part of the plot.",
                "I think I'd just prefer universal healthcare instead of this Nazi shit.",
                "They think they are entitled to everything.  Musk believes he's entitled to our data.  RFK to our medical records.  Trump to our taxes.\n\nEverything is theirs to do whatever weird shit they want with, no consideration for us.  They don't represent us, they don't fucking care about us.  They want to further their weird Moms for Liberty meets White Supremacy identity shit.\n\nThey have no ethics, all the guard rails have been removed.  They feel entitled to everything we've built and paid for.  Fuck every one of these Nazi Fuckers.",
                ">While the selected researchers will be able to access and study the private medical data, Bhattacharya said they will not be able to download it. He promised \"state of the art protections\" to protect confidentiality.\n\nProtections such as: lavender oil, vitamin A, and identity-theft parties...",
                "Autistic folks who don’t have a diagnosis- consider not getting one. They are creating a national registry and that will not end well.",
                "They're going after autistic folks. Folks on the left are more likely to seek a medical diagnosis for their kids experiencing behavioral issues. Folks on the right are more likely to try to discipline or beat it out of their kids. They're hunting our kids.."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "Student loans in default to be referred to debt collection, Education Department says",
            "external_url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a",
            "upvotes": 17312,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, does that mean we can start buying student debt for cents on the dollar and then just forgive it?",
                "So they can be discharged through bankruptcy now, right? RIGHT?!",
                "Wild how PPP loans were just bare minimum no strings attached and no follow-up whatsoever.",
                "> The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers, officials said Monday.\nCurrently, roughly 5.3 million borrowers are in default on their federal student loans.\n\nGarnishing wages for millions of Americans already struggling to survive will have a painful impact. Most people signed up for this debt as teenagers with little financial literacy, and student loan debt can be shockingly predatory. I don't think many of these people anticipated it becoming a millstone around their neck for decades. College enrollment is going to decrease as newer generations fear the impact of education debt. It's a deeply flawed system that needs fixed.",
                "Funny that the courts could block the student loan initiatives but can’t block Tramp from destroying the entire country. What a joke",
                "[removed]",
                "The civil court system is about to get shut down. I think I read it’s like 9-10 million people behind on payments… that’s going to take a while to clear all those dockets. Someone do the math on that many cases to go ln front of a judge, get processed, how long would that take with the number of judges available to do that?",
                "Already have been. My credit dropped about 50 points overnight last week.",
                "Oh no! There goes the home I was never going to get.",
                "I'll bet he wants to bring back debtor's prison."
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "04/22/2025 16:11:02 UTC"
}